{
    "id": "Uvh3v1BkJ-A",
    "title": "Smartphone DURABILITY Awards 2017!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-01-04T18:30:42Z",
    "video_url": "https://www.youtube.com/watch?v=Uvh3v1BkJ-A",
    "category": "Howto & Style",
    "tags": [
        "SmartPhone awards",
        "smartphone durability awards",
        "best smartphone of the year",
        "most durable smartphone",
        "2017 smart phone awards",
        "2017 durable smartphone",
        "MKBHD",
        "best smartphones",
        "best phones",
        "phone of the year",
        "pixel 2",
        "galaxy note 8",
        "iphone x",
        "iphone 8",
        "iphone 8 plus",
        "essential phone",
        "HTC Sapphire edition",
        "razer phone",
        "smartphone",
        "awards"
    ],
    "views": 1768511,
    "likes": 70856,
    "comments_count": 5440,
    "description": "Its time for the smartphone durability awards for 2017. SO MANY AMAZING phones were released this year, it was fun to durability test and tear down every single one of them. Click *SEE MORE* for spoilers, and all of the individual phone videos linked right below this description.   Most Repairable Smartphone of 2017 Google Pixel 2 Teardown:  Google Pixel 2 Durability:   Least Repairable Smartphone of 2017 iPhone X Teardown:  iPhone X Durability:   Most Durable Phone of 2017: Nokia 6 Teardown:  Nokia 6 Durability:   Least Durable Smartphone of 2017 HTC U11 Durability test:  HTC U11 Teardown:   Most improved smartphone of 2017: BlackBerry Key One:   Most Innovative Smartphone of 2017: HTC U Ultra Sapphire edition:   Best Budget Phone durability of 2017: OnePlus 5t Durability test:  OnePlus 5t Teardown:   MKBHD's Smartphone Awards video:   Awesome iPhone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/Zq7nyzldgr4",
        "https://youtu.be/BVKnt7H4zVc",
        "https://youtu.be/c97ILI7Tsk4",
        "https://youtu.be/twY6zUj-t20",
        "https://youtu.be/0M3Budnl3aI",
        "https://youtu.be/_5aXkW0EFRI",
        "https://youtu.be/DdRxmu2jcMs",
        "https://youtu.be/pWqPd6W7pNg",
        "https://youtu.be/2J1UgMAPNtw",
        "https://youtu.be/yvlYOOLmxgw",
        "https://youtu.be/qv9Gt38LOKQ",
        "https://youtu.be/Y1usMCRo108",
        "https://youtu.be/aMQbRpxgFvs",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "2017 just ended, and it's time to recap all of the phones that were released last year and pick the most durable and the most repairable. I don't have any awards to hand out like MKBHD did. He made a fantastic video about the 2017 smartphone awards. I'll link his video down in the description. My video is going to focus on durability and repair-ability. Let's get started. [Intro] Let's start with the most repairable smartphone of 2017. While the vast majority of smartphone manufacturers are gluing their phones shut, which makes it pretty hard to repair, with the right YouTube video to follow, pretty much anything is possible. I would say that the most repairable smartphone screen-wise for 2017, has to be the Google Pixel 2. Because when you're replacing the screen of this phone, A) it's the first thing that comes off, and B) there's a metal plate underneath the screen, making the repair pretty fool-proof. You can't damage any of the fragile electronic components underneath the screen as you're pulling it off. Now, the screen does not usually survive this process, but if you're replacing the screen anyway, it doesn't really matter. There are replacement parts available for the Google Pixel 2 and they usually cost less than the insurance deductible. So the Google Pixel wins the most repairable smartphone for 2017. Now, phones break. Accidents happen. Cellphones are some of the most abused pieces of technology on the planet. And that brings us to all 3 of the iPhones that were released this year from Apple. Not only are each of these phones made from glass, but the back panels are not replaceable by consumers or by Apple themselves. It's an incredibly poor design choice. For a quick example, if I took this LG V30 and popped the glass back off, I could replace it for about 15 dollars right now. The glass on the iPhone 8 is not replaceable A) the adhesive is permanent, and B) the camera lens is welded onto the metal frame beneath the glass, sandwiching the glass together. Without AppleCare, the glass replacement for the iPhone 8 is $350. For the 8 Plus it's $399. And for the iPhone 10, it's $549 to replace the back glass panel. Glass breaks, and so these broken back glass panels are going to be pretty common with iPhones. And if you're out of warranty, or you didn't buy AppleCare, it's going to be cheaper just to buy a new phone, which is exactly what Apple wants you to do. With Apple throttling all of their older phones and making their new phones impossible to repair, it's their way of motivating you to buy new products. Pretty annoying in my opinion, but if you're into that kind of thing, that's what makes the iPhones of this year the least repairable phones of 2017. Like I mentioned earlier, most of the smartphone manufacturers this year have released glass backed phones, which makes my choice for most durable smartphone for 2017 pretty difficult since glass is glass. Glass is fragile. And as any drop test on YouTube can testify - glass breaks, sometimes from very short drops. My choice for the most durable smartphone of 2017 is a metal phone coming from Nokia. The Nokia 6. This was the most rigid phone I probably have ever tested on my channel, and I've tested a lot of phones. A metal phone is much less likely to crack in general than a glass phone. Some of you might be asking, but wait, Jerry, the Pixel 2 was not a glass phone. Why isn't is the most durable smartphone of the year? For two reasons: 1) the Pixel 2 did have a crack right next to that power button. And the Pixel 2XL is still made out of the same material that the Pixel 2 is. It has that soft, thick exterior coating on the surface that can scrape away or discolor from the jeans that you're wearing. Definitely not a durable material. The runners up for the most durable smartphone of the year though, are glass phones. The LG V30, the Galaxy Note 8, and the Galaxy S8 basically all have the same style of construction, very rigid, but have that glass panel on the back. Each of these glass panels...$15 for the LG V30, and about $20 for the Note 8...are replaceable fairly easily, in about 15 minutes. So while they might not be extremely durable to start off with, at least they can be repaired, and repaired for pretty cheap, making that back glass panel pretty much a nonissue. Apple could have done the same, but they want you to buy more phones. I have this place called a Shelf of Shame where phones go that couldn't pass my durability test. There were only a few phones this year. I think manufacturers are getting better with time. I hope my videos have something to do with that. The Honor 6X was one of the few phones that did not pass my durability tests this year, along with the BlackBerry KeyOne. During the bend test, the screen on the BlackBerry KeyOne popped off, which isn't a characteristic that most of you are looking for in a smartphone. I'll talk more about the BlackBerry KeyOne in a second and why it didn't win the least durable smartphone of this year. The HTC U11 is the weakest smartphone of 2017. For one, it's glass on both sides and during the bend test the screen was obliterated. And this happened for two reasons: 1) HTC added that new squeeze feature to this phone, where the frame of the phone is a button basically when you squeeze it. This also makes the frame of the phone more flexible. The second problem is the glass of the screen is in direct contact with the flexible metal of the phone. So any flex or drop transfers the impact directly into the glass. And as we learned earlier, glass is glass, and glass is fragile. It's a little disappointing because on some of HTC's other phones, they put a plastic layer in-between the glass and the metal, which kind of absorbs any impacts, drops or bends, and keeps the energy from transferring from the metal layer to the glass. It's a much better design, HTC just didn't do that with the U11, making it the weakest smartphone of 2017. But it's not bad news if you own one of these phones, a simple case would solve all of those issues. It's just something to look out for. The more you know, the more you can protect against it. That brings us to the most improved smartphone of 2017. And that is the BlackBerry KeyOne. Now, I was pretty excited when this phone came out, but during my durability test, the screen of this phone popped completely out of the frame. I've never seen that happen before. It's definitely not normal. It turns out many other people were having the same issue with their BlackBerry KeyOnes, but BlackBerry, after my video, was very quick in rectifying the situation, going as far as to modify their design, actually gluing the screen in, and fixing it for all of their customers. Huge thumbs up to BlackBerry for acknowledging and rectifying the situation, and taking care of the people who had purchased these phones. After BlackBerry fixed their design flaw, I can 100% recommend the KeyOne as a durable phone in 2017. The most innovative phone of 2017 was hard to decide. It was kind of a toss up between the Razer Phone 120 hertz display, or the Essential Phone using ceramic back panels and titanium sides in their build, that's impressive, or HTC with their sapphire display U Ultra. None of which have headphone jacks, but you win some and you lose some. I had to go with the HTC U Ultra creating a sapphire panel as big as the screen on this phone is incredibly impressive. Not many companies can do that, in fact, some companies claiming to use sapphire are using a version not as pure as the one HTC used on their screen. I have a set of Mohs hardness picks that differentiate between the different materials. We have plastic screens like the one on this Moto Z2 Force, that usually scratches around a level 3. And the vast majority of all of these phones are using tempered glass on their screens, which scratch at a level 6, with a deeper groove at a level 7. But this HTC U Ultra sapphire edition has a much harder material, completely different than glass, that scratches at a level 8 on Mohs scale of hardness, making the screen resistant to scratches from pretty much anything but diamonds. Sapphire is incredibly hard to create. Apple hasn't even gotten it right yet. So I'm very impressed with HTC. If you're looking for a durable phone on the cheaper end of the spectrum, I would recommend the OnePlus 5T. It has that same bezel-less aesthetic display that we've been seeing in 2017 with most of the flagships, but the price point is way lower. If you want something even cheaper than the OnePlus 5T, go with anything in the Nokia lineup. Even the cheapest phone in Nokia's lineup, the Nokia 2, passed my durability test. It'll be interesting to see what Nokia comes up with this year. When I'm picking a smartphone for my personal use, I want something that's functional that has features. I don't need a headphone jack every day, but when I do need a headphone jack, I want a headphone jack. So I pick a phone that has one. I found myself using the Galaxy S8 Plus more than any other phone this year. Yeah, it's glass on both sides, but I always have a case on my phone, so the durability is much less of an issue. A case is pretty important. It will protect your phone against the vast majority of damage that can happen. We've definitely covered a lot of information in this video, and I appreciate you hanging around till the end, and watching art class with Jerry, and taking a look at all of the clear phones that I've been making throughout the year. 2017 has been a blast and I'm super excited for what 2018 has to offer. There are plenty of new phones to get inside of. Give me a thumbs up if you're glad that my phones have been tested so that your phone can be protected. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "glass",
        "phone",
        "phones",
        "smartphone",
        "HTC",
        "screen",
        "Google Pixel",
        "glass phone",
        "year",
        "Pixel",
        "durable smartphone",
        "pretty",
        "durable",
        "Nokia",
        "back glass",
        "glass panel",
        "Apple",
        "durable phone",
        "back glass panel",
        "BlackBerry"
    ],
    "transcript_entity_values": [
        "HTC",
        "about $20",
        "the Galaxy S8",
        "OnePlus 5",
        "the 8",
        "AppleCare",
        "399",
        "BlackBerry KeyOnes",
        "8",
        "about 15 dollars",
        "the year",
        "2017",
        "100%",
        "two",
        "YouTube",
        "Glass",
        "about 15 minutes",
        "Jerry",
        "jack",
        "the Galaxy S8 Plus",
        "6",
        "V30",
        "1",
        "the BlackBerry KeyOne",
        "U11",
        "120 hertz",
        "the BlackBerry KeyOne",
        "this year",
        "iPhones",
        "Apple",
        "Razer Phone",
        "2018",
        "first",
        "last year",
        "second",
        "Sapphire",
        "U Ultra",
        "3",
        "BlackBerry",
        "549",
        "YouTube",
        "Moto Z2 Force",
        "KeyOne",
        "Nokia",
        "one",
        "every day",
        "2",
        "350",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG"
    ],
    "vector": [
        -0.14459270238876343,
        0.06073736399412155,
        0.12256278097629547,
        -0.05887028947472572,
        0.028181258589029312,
        -0.055029530078172684,
        0.0125952223315835,
        0.0574522502720356,
        -0.10728102177381516,
        0.017856985330581665,
        0.036464378237724304,
        0.031502123922109604,
        -0.01904800347983837,
        0.03999897465109825,
        -0.013576067984104156,
        0.014069899916648865,
        0.07192100584506989,
        -0.030378712341189384,
        -0.016493087634444237,
        0.011288067325949669,
        0.020579876378178596,
        -0.033804066479206085,
        0.0034638484939932823,
        0.012153591960668564,
        0.04015732556581497,
        0.012956022284924984,
        -0.07822856307029724,
        -0.030741039663553238,
        -0.04681391641497612,
        -0.07099152356386185,
        -0.0012758420780301094,
        0.08947746455669403,
        -0.021973632276058197,
        0.045104652643203735,
        -0.0425083190202713,
        -0.050092779099941254,
        -0.0038728993386030197,
        -0.042981985956430435,
        -0.07528696954250336,
        -0.024111879989504814,
        -0.056179486215114594,
        -0.03920522332191467,
        -0.04271010309457779,
        0.023724600672721863,
        0.08269061893224716,
        -0.0766509547829628,
        0.0681818425655365,
        -0.035811830312013626,
        -0.0012998240999877453,
        -0.005772237665951252,
        0.007955608889460564,
        0.027708828449249268,
        0.048946529626846313,
        0.0005544249434024096,
        -0.07163084298372269,
        0.04419917240738869,
        -0.06277599930763245,
        0.013986979611217976,
        0.08998853713274002,
        -0.026330329477787018,
        0.04689674824476242,
        0.00816029217094183,
        0.020648185163736343,
        0.049776412546634674,
        0.0412636324763298,
        0.035371728241443634,
        0.008173958398401737,
        -0.11119740456342697,
        0.0003187703841831535,
        0.03040717914700508,
        -0.009350679814815521,
        -0.01355788204818964,
        -0.022218620404601097,
        -0.037202004343271255,
        0.018888304010033607,
        0.09836211055517197,
        0.013537791557610035,
        -0.01678149774670601,
        -0.09088098257780075,
        0.018325824290513992,
        0.06676038354635239,
        -0.06588497757911682,
        -0.006769359577447176,
        0.013772363774478436,
        0.05740926414728165,
        -0.015948552638292313,
        -0.01380107831209898,
        0.06522081047296524,
        -0.07282239943742752,
        -0.09337645024061203,
        -0.0057931626215577126,
        0.18122915923595428,
        -0.038190800696611404,
        0.04982063174247742,
        0.009999560192227364,
        -0.04248474910855293,
        -0.04765535518527031,
        -0.06649744510650635,
        -0.0495757982134819,
        0.009645618498325348,
        -0.00620739720761776,
        0.0011118013644590974,
        0.02882937341928482,
        0.03077263943850994,
        0.0025479907635599375,
        -0.07553022354841232,
        -0.043179720640182495,
        -0.034359294921159744,
        0.03510129079222679,
        0.04947632923722267,
        -0.03592659905552864,
        0.02316473238170147,
        -0.07094284892082214,
        -0.026796717196702957,
        -0.03385711833834648,
        -0.014761064201593399,
        -0.07035375386476517,
        0.07084278762340546,
        0.145939901471138,
        0.01271976437419653,
        0.026163887232542038,
        0.012277370318770409,
        -0.08055684715509415,
        -0.09548915922641754,
        0.022383935749530792,
        -0.04607407748699188,
        -0.04777706786990166,
        8.716084165151899e-33,
        0.04122067987918854,
        0.09821294248104095,
        -0.0011108735343441367,
        0.04078631475567818,
        -0.09049389511346817,
        0.004765189718455076,
        0.0029060393571853638,
        0.010280651040375233,
        -0.0599067322909832,
        -0.045100901275873184,
        -0.031947556883096695,
        0.0011115447850897908,
        -0.07398666441440582,
        0.00043705583084374666,
        0.07393664121627808,
        -0.03591301664710045,
        -0.029124397784471512,
        -0.028004905208945274,
        -0.042421258985996246,
        0.04607037454843521,
        -0.04525581747293472,
        -0.02381844073534012,
        -0.02227352187037468,
        0.008567365817725658,
        0.060180194675922394,
        0.03568742796778679,
        0.09954126179218292,
        -0.023824647068977356,
        0.040503162890672684,
        0.02141478843986988,
        -0.06488107889890671,
        -0.032075874507427216,
        0.05643081292510033,
        -0.013380412943661213,
        -0.04664492607116699,
        0.046634674072265625,
        -0.02403029426932335,
        -0.012470304034650326,
        0.02317042462527752,
        -0.04809669405221939,
        -0.11721223592758179,
        0.05410914123058319,
        -0.0286767166107893,
        -0.014607329852879047,
        0.08106525242328644,
        0.0023016559425741434,
        -0.038881126791238785,
        0.030472569167613983,
        -0.006534564774483442,
        -0.026812652125954628,
        -0.03091219998896122,
        -0.05425133556127548,
        -0.06880329549312592,
        -0.04615152254700661,
        -0.0663566067814827,
        -0.0018417902756482363,
        0.024511970579624176,
        -0.024391265586018562,
        0.03567754849791527,
        0.08998297899961472,
        0.008551612496376038,
        -0.027028966695070267,
        -0.08123629540205002,
        0.031700003892183304,
        -0.05405477434396744,
        0.021725518628954887,
        0.02517472580075264,
        -0.030812740325927734,
        -0.08059417456388474,
        0.056540217250585556,
        -0.007041760254651308,
        -0.044656094163656235,
        0.03891637548804283,
        0.01104103121906519,
        0.05873821675777435,
        -0.0012947064824402332,
        0.023622600361704826,
        -0.03752215951681137,
        0.022080371156334877,
        -0.0033974265679717064,
        -0.06687044352293015,
        -0.0028943547513335943,
        0.08367650955915451,
        -0.021765075623989105,
        0.012464981526136398,
        -0.0022694782819598913,
        -0.0229773111641407,
        -0.13259153068065643,
        0.00878011155873537,
        0.06753583252429962,
        -0.008651193231344223,
        -0.04659977927803993,
        0.03550974652171135,
        -0.03242604061961174,
        0.030648257583379745,
        -9.195356721869162e-33,
        -0.024068431928753853,
        -0.015506654977798462,
        0.03197692707180977,
        0.07006628811359406,
        0.005037121940404177,
        -0.009908064268529415,
        0.018031686544418335,
        0.13003438711166382,
        0.03439691290259361,
        -0.016331393271684647,
        0.06298471987247467,
        0.02452337183058262,
        -0.05155446007847786,
        -0.010503385215997696,
        -0.03019878827035427,
        0.013134182430803776,
        -0.006016768980771303,
        -0.10544970631599426,
        0.004872938152402639,
        0.026457734405994415,
        0.11257417500019073,
        0.054199427366256714,
        0.00447987113147974,
        0.04353075474500656,
        -0.021611660718917847,
        0.015356533229351044,
        -0.005567086394876242,
        -0.07482749223709106,
        0.07018625736236572,
        -0.056764498353004456,
        -0.037667181342840195,
        -0.062384232878685,
        -0.0295975673943758,
        0.08913090825080872,
        0.11010170727968216,
        0.06430790573358536,
        0.007483221124857664,
        -0.017977803945541382,
        0.03153064846992493,
        -0.013432977721095085,
        0.017372600734233856,
        0.000989061314612627,
        0.03154313564300537,
        -0.023658253252506256,
        0.055669259279966354,
        -0.0673408955335617,
        -0.028871741145849228,
        0.02536158449947834,
        0.02771233208477497,
        0.07187416404485703,
        0.01718813367187977,
        0.02947983704507351,
        -0.08044569194316864,
        0.01789615862071514,
        -0.03754653036594391,
        -0.04044317081570625,
        0.03631580248475075,
        -0.046421002596616745,
        -0.04839272052049637,
        0.00882972963154316,
        0.056705743074417114,
        0.026962684467434883,
        -0.031563062220811844,
        0.014358233660459518,
        -0.06407766789197922,
        -0.026885690167546272,
        0.08080194145441055,
        -0.02057773619890213,
        -0.04785086587071419,
        0.018068591132760048,
        -0.07557384669780731,
        -0.02794574946165085,
        -0.006265680771321058,
        -0.08922804892063141,
        0.026983723044395447,
        0.04647143930196762,
        -0.10755093395709991,
        0.01788347400724888,
        0.006607308052480221,
        -0.044343359768390656,
        0.046546272933483124,
        0.03604685887694359,
        -0.008413284085690975,
        0.0448639951646328,
        0.11382881551980972,
        -0.015502125956118107,
        0.05221586674451828,
        0.04283873364329338,
        -0.0032628022599965334,
        0.058583617210388184,
        -0.03457408398389816,
        0.01568591594696045,
        -0.07220093160867691,
        0.03410319238901138,
        -0.03252128139138222,
        -5.293965799069156e-08,
        0.06136234849691391,
        0.06284457445144653,
        -0.03743576258420944,
        -0.05220462381839752,
        -0.014018682762980461,
        -0.08209589123725891,
        -0.003912649117410183,
        -0.00033444471773691475,
        0.1356835663318634,
        -0.03434181213378906,
        0.013946788385510445,
        -0.06508082896471024,
        -0.08672010898590088,
        0.049927812069654465,
        -0.0463796928524971,
        0.003469401504844427,
        -0.03215443342924118,
        0.09024686366319656,
        0.02018955908715725,
        0.022886045277118683,
        -0.03190673887729645,
        0.00817103125154972,
        0.05622662231326103,
        -0.06953612715005875,
        -0.011163251474499702,
        -0.024258814752101898,
        -0.08279556035995483,
        -0.03766593337059021,
        0.05944859981536865,
        -0.02453599125146866,
        0.024516306817531586,
        -0.034899190068244934,
        0.04155634716153145,
        -0.06790461391210556,
        -0.013012436218559742,
        0.0005860542878508568,
        0.03878604620695114,
        -0.007170912344008684,
        0.10467562079429626,
        0.011972734704613686,
        0.018172137439250946,
        -0.053934600204229355,
        0.0421828031539917,
        0.03666168823838234,
        0.05140395835042,
        -0.08736579865217209,
        0.033704724162817,
        -0.1056741401553154,
        -0.0673055499792099,
        0.00038219254929572344,
        -0.057152047753334045,
        -0.05063614994287491,
        -0.05091346055269241,
        -0.07228270918130875,
        0.0503532811999321,
        0.019992705434560776,
        0.08826050907373428,
        0.019774580374360085,
        0.02088456228375435,
        0.006659110076725483,
        0.066358782351017,
        -0.10241678357124329,
        0.01867254450917244,
        0.13294586539268494
    ]
}