{
    "id": "Ux1l9GsXhSw",
    "title": "Bikenda Snow Melter (BIG SCAM!) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2023-12-15T15:59:43Z",
    "video_url": "https://www.youtube.com/watch?v=Ux1l9GsXhSw",
    "category": "Science & Technology",
    "tags": [
        "Bikenda Snow Melter (BIG SCAM!) - Krazy Ken's Tech Talk",
        "Bikenda",
        "Electromagnetic",
        "Molecular",
        "Interference",
        "Antifreeze",
        "Internet Scam",
        "Microwaves",
        "Physics",
        "Car",
        "ChrisFix",
        "Big Clive",
        "Absolute Zero",
        "Automobile",
        "Winter",
        "Snow",
        "Ice",
        "Jaguar",
        "Ads",
        "Facebook",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Comedy",
        "Humor",
        "Tech",
        "Funny",
        "Computer Clan",
        "Air Freshener"
    ],
    "views": 307976,
    "likes": 10564,
    "comments_count": 977,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below This Bikenda scam (and other \"snow melting\" products) have been FLOODING the internet, so today I'm gonna destroy themliterally and metaphorically  Watch my EliteTac scam-buster!   Watch my heater scam-buster!   BINGE MY SCAM EPISODES!   Buy my Wallpaper Mega-Pack!    Follow me on Twitter   Facebook   Shop for cool stuff on my store    Support the Computer Clan on Patreon   Patrons got early ad-free access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.  Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear I use   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program and the Computer Clan may receive a commission. Artlist and Artgrid links are also affiliate links.  00:00 Introduction 00:44 Video Ads Overview 02:32 Video Ads Breakdown 04:55 Web Presence 08:18 Purchase 09:26 In the Box / Physical Product Overview 12:38 Explaining This Products Name / Microwaves 13:47 Testing the Bikenda! 15:22 Testing the REAL Product (Which Bikenda Borrowed) 16:24 Important Safety PSA!  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/DpQ4YXKkExY",
        "https://youtu.be/ot1JsRyjLcg",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://thecomputerclan.com/megapack",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- This $30 magical snow melting device claims to use NASA aerospace technology, and it also uses electromagnetic molecular interference to melt snow. What the **** is that supposed to mean? Let's find out. Sponsored by Linode. Cloud computing from Akamai. (upbeat music) Hey everyone, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and this is some real science here. And by real, I mean fake. And by science, I mean ignorance. These ads have been spreading all over the internet lately, and the Bikenda and other similar products are popping up all over Amazon and Facebook and they're spreading like some nasty disease. So let's break down what this whole scam is about, and of course, I will buy one and try it out for myself. I found four video ads, three of which are short with no narration, and one is longer with a terrible text to speech voiceover. - [Robotic Female Voiceover] Electromagnetic molecular interference antifreeze. - [Ken] The first ad shows a snowblower and a person holding the Bikenda spinning in their hand. Then they show a bunch of snowy cars, and an exploded view of the product. Then suddenly, in the next shot, the snow is melted off the car... uh-huh. Next, they blast you with various quick cuts of cheesy visual effects and miscellaneous footage, and the ad suddenly ends. Okay? No call to action, nothing enticing me to buy the product? Okay, whatever. Next! The second ad is similar. Quick cuts with no narration, and again, poor visual effects and animation, but maybe slightly better than the last one. None of these shots actually show the Bikenda truly melting ice and snow. That's a problem. The third ad shows some different shots, including clips from Thomas and Friends? For some reason. Then we see someone spraying snow off their car with a hose. Then we see the Bikenda again, and suddenly the ad abruptly ends. And that brings us to the fourth ad, which so far is the only one I can find that has a voiceover. Let's enjoy. The ad shows someone holding the product's box in a car, but it doesn't say the name Bikenda. Although the product looks similar, the narrator claims this device causes the air molecules to move violently, and generate a large amount of energy, thereby achieving the remarkable phenomenon of no ice inside and outside your car. While the narrator talks, they show the consumer assembling the device. But then they suddenly show this turbo acceleration slide, which talks about aromatherapy? Aromatherapy? I thought this was a snow and ice melter! You're sending mixed signals. Then they say a call to action, and end. So let's just start breaking this thing down before I break down and cry. For starters, none of these ads actually show the product melting the snow and ice. So that's a huge red flag. The closest thing we see is this hose scene, but we can see the water spraying from behind the snow. That's what's clearing the ice, not this magical Bikenda BS. And realistically, we could stop it there and say, \"Don't buy this thing!\" but that would be no fun. The next thing that concerns me is this exploded view. I'm just hypothesizing here, but I somehow doubt that's what the actual inside of the product looks like. I will buy one soon and disassemble it and see for myself. But my bigger concern is, all of these things, these components, don't look like they contain any snow or ice melting capabilities. We see a solar panel, a tiny PCB, a motor, a circular piece of wood, and the outer case. Oh yeah, those components will definitely melt snow. Have fun! Another problem is, these advertisers just stole footage from ChrisFix, and to the best of my knowledge, Chris is not a spokesperson for Bikenda. So that's another red flag. Which leads us to the fourth and final ad. And this is where the investigation took an interesting turn. Up until now, I wasn't sure what this product was actually supposed to be in real life. It really just looked like some sort of spinning fidget toy. But then I see this box that says \"Dancing car perfume.\" Oh, so it's an air freshener? That explains why later in the ad, we see this weird slide which talks about aromatherapy, which has nothing to do with melting snow and ice. They're having a bit of an identity crisis. And judging by the Chinese writing on the box, there's likely some language barrier issues, which are making this product hard to advertise consistently. So yeah, this Bikenda device is just a repurposed car air freshener. But I wonder how good it smells. I also love how this ad says, \"This device can cause water molecules to vibrate, even at the freezing point!\" - [Robotic Female Voice] Causing them to actively vibrate even at the freezing point. - Quick physics lesson for all of the scam advertisers out there, but ALL water molecules vibrate at the freezing point of water! You can't cease the vibration of atoms and molecules. You can greatly reduce their vibration through cooling, but you can't reach absolute zero, minus 273.15 degrees Celsius, in practice. So now let's check out the web presence of Bih-kenda, Bye-kenda. However the heck you pronounce it, before I stir up a quantum physics argument. The landing page linked in the ad is warmfcare.com, or it's warm-F-care. I have no idea how you want to pronounce this thing. Just do whatever. And in case you forget the website's name, you can look at the various annoying watermarks scattered throughout the ads. And for the love of Jobs, where do I even begin with dissecting this monstrosity? Do I start with the NASA technology claims? Or do I talk about the 100% natural ingredients for a plastic disc? Or do I start with the returnable within 30 days claim? But then below it, it says 90 day money back guarantee. It's gonna be a long day. Apparently the full name for this product is Bikenda Electromagnetic Molecular Interference Antifreeze Snow Removal Instrument. We'll just call it Bikenda. Hey, it's got my name in it! That's not good. The Bikenda webpage shows other images claiming this product eliminates manual snow removal tools, and it's a technological revolution. Okay, I'll hold you to that. They claim it's solar driven, and it will detect a temperature and start automatically, and it emits pixie dust, apparently. Okay, great. Out of curiosity, let's just check the Warmfcare homepage and see what else these guys are about. So they sell bracelets? Just bracelets. Which, according to them, is considered a wide selection of products to improve your wellbeing. Apparently this magnetic bracelet was made in the United States, but originated from mainland China. Not sure how that works, but ultimately, I'm losing a lot of faith in this brand. Not that I had much in the first place. Oh look! They have a \"Made in USA\" stamp on their homepage! Which has now been removed. But the good news is, all their products are not tested on animal. Animal. Like just one particular animal? Oh! Maybe they meant Animal from the Muppet Show. Aside from the Warmfcare website, I've seen the Bikenda pop up on my newsfeed on Facebook from multiple different pages, via sponsored ads, including Chocoladna, RespiNature, and MAX Visual Art. All these pages appear to exist only for the sake of selling product. Not necessarily Bikenda, but products in general. They're not actually reputable companies or influencers. And none of these pages have any organic posts relating to snow, ice, or other Bikenda-type products. And RespiNature has four different pages with the same name and profile pic, but with different categories? I guess they're just trying to get attention. I also went to the UnicPuffin website, which was in the ad with voiceover, and their website doesn't mention anything about a snow melting device. Weird. And this caught me off guard. I was searching alternatives to regular ice scrapers, you know? And the top sponsored result on a Google search was a similar product to Bikenda. It looked the same, but it had a different name. I'm not sure if it's just one company setting all this stuff up and pulling all the strings, or if it's multiple companies. But regardless, multiple channels are being abused to try to sell this product to consumers. At least this result links to a $9 unit as opposed to the $30 unit from Warmfcare, but that still doesn't result in happy customers, judging by these reviews. And the scammers forgot to exclude some of the air freshener details in the description. The lies are right under your nose. Overall, Bikenda's web presence is very fishy, but maybe, just maybe, by some miracle, it will actually work. I have to test it myself and give it a fair shot. So you know what I did next, right? I went ahead and bought one. For consistency, I decided to purchase the Bikenda directly from Warmfcare, but I saw many similar products under different names on Amazon. I can't believe I'm about to spend $47 on this two pack. The purchase process was mostly straightforward, and they asked for a tip. Yeah, absolutely not. And boom! Order complete. And whoa, hey, shocker! Post transaction upsell, for a product that's not available. Okay, we'll skip that. Oh! Another special offer for prostate pills! Yeah, that's a hard pass. And it just brought me back to the homepage. Glitch or feature? You decide. But here's the good news. We don't have to wait for long because they deliver typically within three to five days. (jazzy music) These things took a month to arrive, not three to five days. And when I went to check the USPS tracking, it said tracking info will not be displayed because this package was shipped with counterfeit postage. Has that ever happened to you? 'Cause that's a first for me. But, at least they're here now! And yeah, I bought two just because I may have to violently disassemble one of 'em. So, let's take a look. The box shows the brand and product name, and it claims this device does not generate heat. Doesn't generate heat? Like, I don't know how that's possible. Like, I'm not ready to understand this complex physics lesson. Oh, good news! It's made in the USA! Wait a minute. Hang on a sec. The package says it's from Guangdong. That's a Chinese province. So what did they do? Did they make 'em in the USA and then just ship 'em to China to store 'em in a warehouse somewhere? Probably not. Yeah, this thing was made in China. Don't lie to me, box! So inside, we have the Bikenda unit itself, and what looks like some sort of sticky pad, probably to just mount it somewhere in your car. And that's it. No instructions or anything. So hopefully it's easy to use. Oh, and it spins! That's kinda nice. It's like a little fidget toy. Whee! Okay, it comes apart for some reason. Not sure why, but I'm looking at this, and it looks like everything is pretty solid. Like it's all sealed together. I don't see any screws, I don't see any clips. Ultimately, I don't see a simple way to open this up, so we're probably gonna have to get a little smashy. So Krazy Karl is on a vacation in Tahiti, and I couldn't find my hammer, but I could find this very nice piece of machined aluminum. So I used that. And here's the insides. I was actually surprised there were electronics in here. I thought the scammers would be extra cheap and just sell you a disc that you have to spin manually with your fingers. But no, there's actually a PCB, two wires, and a motor. There's no battery inside this thing. So if the solar panel is real, which looking at this little PCB, it actually might be, that's gotta be our power source for the motor. So, let's try it out with a working unit. And funny enough, I'm gonna use my other scam tech product to power this scam tech product. My EliteTac. That was a good episode. Okay, here we go. Three, two, one! Hey, check it out! It's spinning when I shine the light at the solar panel, so we can conclude, this is a real solar panel. But does it actually melt snow on ice like the ads claim? We'll find that out soon. But, I wanna mention this. Out of all the pieces in here, you know, I didn't see that wooden disc. I'm actually a little surprised. The exploded view looked mostly accurate in the ads we saw, but that wooden disc is not there. And there's a reason for that. Brainiac Brent helped me with some digging, and we discovered the wooden disc is used to hold the scented oils for the air freshener. And since the scammers are trying to repackage this as a snow ice melter, they likely just simply chose to exclude that component to try to disguise the product better. For fun, I bought one of those air freshener products that looks similar to the Bikenda, and we'll see how it works when it arrives. I can't wait to smell it! While we wait for the air freshener to arrive, let's go out and actually test this thing. There's two tests that I want to try. My hypo-thesis is this is not gonna melt snow or ice, because I don't see any components in here that would lead me to believe that it's possible with something this small. But we gotta give it a fair shot. Let's try. (upbeat music) Oh yeah, we need snow first. ****. While we wait for the snow, let's dissect this product's insane name. The name just sounds like techno babble, but some buzzwords like \"electromagnetic\" and \"vibrate\", which we hear in the ad, could be hinting at the possibility that this device emits microwaves, like what a magnetron does in a microwave oven. And to some consumers, they may think, \"Oh! That's what melts the snow.\" Perhaps these buzzwords are enough to fool consumers into buying these antifreeze scams. It happens more often than you might think. For some extra context, here's how microwave ovens really work. Water molecules in food are electric dipoles. The microwaves realign the water molecules many times per second, causing them to oscillate, or in a way, vibrate, very rapidly, which generates heat. But this tiny low power Bikenda is not emitting microwaves. And if it was, that would make this device potentially harmful to humans. But thankfully, we don't have to worry about that. Okay, let's check on the weather. Oh! The snow is coming! And I can tell because the iPhone shows an annoying blank paper icon in the weather widget, which is supposed to mean snow, I guess? And I'm happy to report that I can recreate my first test, a real world test, very similar to the video ads. Why? Well, because I happen to have the exact same car they show in the commercials! How lucky am I? No seriously, tell me. I placed the Bikenda on a cup holder in my car, and I let it sit outside overnight. It got covered in snow, and I checked on it 12 hours later. Good morning, world. It is a beautiful below freezing outside. I'm just inside this car surrounded in snow. So yeah, come on! Come on, little device. Do something! Melt the snow! I'm gonna freeze to death! If I freeze to death, I'm gonna get really hungry, and that's not gonna be good! Ooh! SunChip. Nevermind! I'll be fine. Well, as you can see, it worked freaking perfectly! Happy opposite day! This thing makes no **** sense! Even the fake claims are flawed! Let's just make pretend that this thing could actually melt snow and ice. It still says it needs solar power to automatically activate itself, but if your car is covered in snow and ice, you're not gonna get adequate sunlight to even activate the thing in the first place! It makes no sense! Okay, time for test number two. And this will be a much easier test than the first one. Certainly you'll be able to handle that, right Bikenda? I went back into the snow and placed the Bikenda on a tiny box in direct sunlight, and it began to spin. I observed it for five minutes straight, and not a single flake of snow melted. So the Bikenda doesn't work at all. What a shock. But there is one more thing. (doorbell rings) Hey! Thanks, mysterious delivery man who lives under my desk for inexplicable reasons. Behold, the true form of this product. An air freshener. Let's take this out. Ooh, the enclosed instruction book! And hey, we actually get the wood disc this time. Thanks for including that! And we'll take out our essential oils. Put a couple drops in there. Pop it in. All right, let's see. Oh my gosh! That is the worst ****ing air freshener I've ever smelled! Holy cow, dude. Hang on. Lemon orange? Whoever made this has never smelled a lemon or orange in their life. Oh gosh! It's like nail polish, like a really strong chemical, just like, injected right into your nostrils. Fricking Goo Gone smells better than this crap! Yeah, everyone, don't buy the Bikenda. If you wanna get the snow and ice off of your car, use the tried and true ice scraper. But, I do wanna talk about something important super quick, since we're all here. Since it's getting cold out there, you're probably gonna be using space heaters, but do not plug them into extension cords or power strips. And I only bring this up because it's come up in a past episode, and I want everyone to stay warm, but also safe out there. And another tip to make your life better, use Linode! If you have an application or website that needs to be scaled and deployed, Linode has the infrastructure and the 24/7 support you need. Linode offers out of box apps for game servers like TF2, CS:GO, and even Minecraft! You can run your own virtual private network with Open VPN, build an online application with Joomla's content management system, or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. Visit linode.com/computerclan and click one of the signup buttons, and we'll give you a 60-day $100 credit just for watching this episode. And when you do that, you're also supporting the Computer Clan. So thank you very much. Catch the crazy, and pass it on. (upbeat music) Mm! Goo Gone smoke! Don't breathe this.",
    "transcript_keywords": [
        "Bikenda",
        "snow",
        "product",
        "ice",
        "melt snow",
        "car",
        "thing",
        "products",
        "air freshener",
        "snow melting device",
        "device",
        "show",
        "yeah",
        "air",
        "shows",
        "Bikenda Electromagnetic Molecular",
        "snow and ice",
        "ads",
        "good",
        "freshener"
    ],
    "transcript_entity_values": [
        "Warmfcare",
        "three to five days",
        "a month",
        "zero",
        "Tahiti",
        "five minutes",
        "Fricking Goo",
        "third",
        "RespiNature",
        "USPS",
        "Melt",
        "VPN",
        "Facebook",
        "Three",
        "overnight",
        "Bikenda BS",
        "a minute",
        "Bye-kenda",
        "two",
        "ChrisFix",
        "Guangdong",
        "Chinese",
        "China",
        "47",
        "Linux",
        "24/7",
        "100",
        "minus 273.15 degrees Celsius",
        "Bikenda",
        "12 hours",
        "Brent",
        "30 days",
        "sec",
        "60-day",
        "TF2",
        "Thomas",
        "PCB",
        "Krazy Ken",
        "Chris",
        "100%",
        "fourth",
        "90 day",
        "Google",
        "Mm",
        "Akamai",
        "Joomla",
        "four",
        "first",
        "one",
        "Bikenda Electromagnetic Molecular Interference Antifreeze Snow Removal Instrument",
        "30",
        "USA",
        "Amazon",
        "9",
        "Warmfcare",
        "Chocoladna",
        "NASA",
        "Krazy Karl",
        "the United States",
        "iPhone",
        "Jobs",
        "Minecraft",
        "UnicPuffin",
        "second",
        "Linode",
        "the Computer Clan",
        "Linode",
        "Bikenda",
        "three",
        "Bih-kenda"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "TIME",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "NORP",
        "GPE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERCENT",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "GPE",
        "ORG",
        "MONEY",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "LOC"
    ],
    "vector": [
        -0.17940856516361237,
        -0.04331455007195473,
        0.010366952046751976,
        -0.10890635848045349,
        0.07274650037288666,
        0.027241872623562813,
        0.01901690848171711,
        -0.027070913463830948,
        -0.018882356584072113,
        -0.027465732768177986,
        -0.00172917649615556,
        -0.013642887584865093,
        0.03978600353002548,
        -0.08439193665981293,
        0.0014328198740258813,
        -0.005261537153273821,
        0.04309419170022011,
        -0.028932834044098854,
        -0.057184990495443344,
        -0.044993024319410324,
        -0.012264508754014969,
        -0.09502307325601578,
        -0.013190067373216152,
        0.0287556704133749,
        0.053681381046772,
        0.021923715248703957,
        -0.053931910544633865,
        0.053340207785367966,
        -0.03280385211110115,
        -0.00928999949246645,
        0.034368738532066345,
        0.03825858235359192,
        0.03846007212996483,
        0.020063472911715508,
        0.021979305893182755,
        -0.02906886488199234,
        -0.043487612158060074,
        -0.016687210649251938,
        -0.12288999557495117,
        0.014583212323486805,
        0.03817569091916084,
        -0.039217136800289154,
        -0.06867961585521698,
        -0.05179283767938614,
        0.0019722972065210342,
        -0.026121964678168297,
        0.054319653660058975,
        -0.025785889476537704,
        0.054030969738960266,
        0.012143013067543507,
        -0.025359442457556725,
        -0.05882079899311066,
        0.037399016320705414,
        -0.014352063648402691,
        -0.1010657250881195,
        -0.01575733907520771,
        0.025683334097266197,
        -0.07394342124462128,
        0.09463755786418915,
        9.162014612229541e-05,
        0.0677100345492363,
        -0.02619190886616707,
        -0.048295848071575165,
        0.026052940636873245,
        0.028149999678134918,
        -0.017448097467422485,
        -0.004216587170958519,
        0.07927277684211731,
        -0.02503408119082451,
        -0.05587996169924736,
        -0.014243127778172493,
        0.01174057088792324,
        0.018931759521365166,
        0.05814972519874573,
        0.0044423118233680725,
        0.0039547826163470745,
        -0.0015462812734767795,
        -0.09309336543083191,
        0.004584521055221558,
        -0.07699864357709885,
        0.009156846441328526,
        -0.06978113204240799,
        0.017096303403377533,
        -0.040713660418987274,
        0.00411094119772315,
        -0.00509552052244544,
        0.018742486834526062,
        -0.014518079347908497,
        0.06487853825092316,
        -0.02555546723306179,
        -0.028168080374598503,
        0.07068740576505661,
        0.0865677073597908,
        0.041491299867630005,
        -0.0393117293715477,
        -0.00353809492662549,
        0.06734482944011688,
        -0.053736548870801926,
        -0.07479285448789597,
        0.07913973182439804,
        -0.021334296092391014,
        0.008025748655200005,
        -0.009193291887640953,
        -0.11243975162506104,
        -0.0034304617438465357,
        -0.058840882033109665,
        0.02259925566613674,
        0.12163376063108444,
        0.03731847554445267,
        0.05452197417616844,
        -0.023160023614764214,
        0.02984609827399254,
        -0.02402600832283497,
        -0.04831758514046669,
        0.04425983875989914,
        0.036104198545217514,
        -0.10682660341262817,
        0.05631798505783081,
        0.05764706805348396,
        -0.05261889472603798,
        0.054412320256233215,
        0.07459710538387299,
        -0.006612477358430624,
        0.014976434409618378,
        0.09377945959568024,
        -0.043906066566705704,
        -0.021438105031847954,
        5.8710109432857305e-33,
        0.007822563871741295,
        0.14587469398975372,
        -0.028500324115157127,
        0.029690947383642197,
        0.08047962933778763,
        -0.03463742136955261,
        -0.014881125651299953,
        0.06509672850370407,
        -0.09068816155195236,
        0.021223466843366623,
        0.022956233471632004,
        0.059143323451280594,
        -0.06907140463590622,
        -0.010828116908669472,
        -0.04217729717493057,
        -0.03805918246507645,
        -0.05094470456242561,
        -0.07836610823869705,
        0.026823705062270164,
        0.03718196228146553,
        0.036219339817762375,
        -0.004524097312241793,
        0.038618795573711395,
        0.0534108467400074,
        -0.005375924054533243,
        -0.0633661299943924,
        -0.028414402157068253,
        0.00604737875983119,
        0.09627325087785721,
        0.03954746946692467,
        -0.05834538862109184,
        -0.03375948220491409,
        0.04977969080209732,
        -0.008182423189282417,
        0.027163952589035034,
        -0.03244667500257492,
        -0.06472201645374298,
        -0.13333140313625336,
        -0.010388979688286781,
        -0.027281371876597404,
        -0.04429744929075241,
        -0.0350845605134964,
        -0.06266683340072632,
        -0.01980113424360752,
        -0.07807613909244537,
        0.057321906089782715,
        0.0576525442302227,
        0.06869673728942871,
        0.04660959169268608,
        0.03319978713989258,
        -0.01611723005771637,
        0.06046495586633682,
        -0.04167427867650986,
        0.021081531420350075,
        -0.03667109087109566,
        -0.009256917983293533,
        0.01719326339662075,
        -0.05463695898652077,
        0.07719041407108307,
        -0.02018594928085804,
        0.05783090740442276,
        0.06071874126791954,
        0.0736347883939743,
        -0.021312648430466652,
        -0.129004567861557,
        -0.030596066266298294,
        0.04374665766954422,
        0.03915996477007866,
        -0.0492430217564106,
        0.035955652594566345,
        -0.012300468049943447,
        0.027586080133914948,
        0.08063378185033798,
        -0.00919308140873909,
        0.041573844850063324,
        -0.021143456920981407,
        -0.0653391182422638,
        -0.0020881614182144403,
        -0.08494015038013458,
        0.02748650498688221,
        -0.007804442197084427,
        -0.0603436641395092,
        0.05158881098031998,
        0.021755695343017578,
        0.0020326750818639994,
        0.0025237693917006254,
        0.06660795956850052,
        -0.00296762608923018,
        -0.04022708162665367,
        -0.03080814704298973,
        -0.029127778485417366,
        -0.05017911270260811,
        0.048126086592674255,
        0.05676984786987305,
        -0.0004251549835316837,
        -5.8184839782192366e-33,
        0.014775577001273632,
        -0.025064662098884583,
        0.018360408022999763,
        -0.039576224982738495,
        0.08004195988178253,
        0.021405940875411034,
        0.020265372470021248,
        0.0034281346015632153,
        0.038781166076660156,
        0.002042843494564295,
        0.04016116261482239,
        0.02461911551654339,
        -0.04459268972277641,
        -0.09850995987653732,
        0.02892957627773285,
        -0.05988142639398575,
        0.06609714776277542,
        0.007949926890432835,
        -0.02958867698907852,
        -0.07055257260799408,
        0.02085377648472786,
        0.021213941276073456,
        -0.11511041969060898,
        0.03620940446853638,
        0.009186266921460629,
        0.0008090002229437232,
        0.057134613394737244,
        0.11588020622730255,
        0.031408973038196564,
        0.0602119117975235,
        0.046801596879959106,
        0.029308585450053215,
        -0.06949327141046524,
        -0.05537029355764389,
        -0.009268654510378838,
        0.05241059139370918,
        0.0750916600227356,
        -0.028915144503116608,
        -0.10256146639585495,
        -0.070297472178936,
        0.048244960606098175,
        -0.040275752544403076,
        -0.0787830501794815,
        0.04932762682437897,
        -0.02935636416077614,
        -0.05031244829297066,
        -0.04764840379357338,
        0.0270475335419178,
        0.01943041756749153,
        0.05283624306321144,
        0.054344628006219864,
        -0.023437581956386566,
        0.06912674754858017,
        -0.03243015334010124,
        -0.00261295516975224,
        0.029437648132443428,
        0.04686064273118973,
        0.06579059362411499,
        0.010311135090887547,
        -0.03579007834196091,
        -0.0047006732784211636,
        -0.04515235126018524,
        -0.058352451771497726,
        0.005376191809773445,
        0.013248935341835022,
        -0.06797729432582855,
        0.08833478391170502,
        0.034371811896562576,
        0.004365499597042799,
        0.016947345808148384,
        0.049306418746709824,
        0.04079512134194374,
        -0.03582913056015968,
        -0.07819117605686188,
        -0.03213108703494072,
        0.06372933089733124,
        0.07559392601251602,
        0.0171186700463295,
        0.010294354520738125,
        -0.03169308975338936,
        0.0006868820055387914,
        0.010574454441666603,
        0.09702720493078232,
        0.028966521844267845,
        0.11044680327177048,
        0.01477369386702776,
        0.056835852563381195,
        0.003271266585215926,
        -0.0378674641251564,
        0.008690040558576584,
        0.03344160318374634,
        -0.034706320613622665,
        0.06328162550926208,
        0.07133651524782181,
        0.022252002730965614,
        -6.180878386885524e-08,
        0.02977844513952732,
        0.024923214688897133,
        -0.041779085993766785,
        -0.06296263635158539,
        0.07364674657583237,
        -0.05410316586494446,
        -0.007346116937696934,
        0.008610168471932411,
        -0.04122819006443024,
        -0.0031320536509156227,
        0.10938481241464615,
        -0.024742932990193367,
        -0.011931982822716236,
        0.023168085142970085,
        0.010593305341899395,
        -0.015112404711544514,
        -0.028593717142939568,
        0.06708528846502304,
        -0.04849806800484657,
        -0.10864006727933884,
        -0.026919133961200714,
        -0.03281589597463608,
        0.04284921661019325,
        -0.06935132294893265,
        -0.0035203262232244015,
        0.018666699528694153,
        0.06146220117807388,
        0.059853315353393555,
        0.07024022936820984,
        0.005279453471302986,
        -0.109327033162117,
        -0.08354022353887558,
        -0.005617933347821236,
        -0.0706903412938118,
        0.07688035070896149,
        0.0005649409722536802,
        -0.0840611532330513,
        0.026961345225572586,
        0.012117743492126465,
        0.06234901025891304,
        0.0022427006624639034,
        -0.03195616230368614,
        0.04819359630346298,
        -0.004419298376888037,
        -0.03649137169122696,
        0.030541211366653442,
        -0.11638552695512772,
        -0.05980445072054863,
        0.11592063307762146,
        -0.020162591710686684,
        0.003747610840946436,
        -0.050357431173324585,
        -0.019670404493808746,
        0.05599537119269371,
        0.03525295853614807,
        -0.006318304222077131,
        -0.028865624219179153,
        0.020681502297520638,
        0.03102092258632183,
        0.11202288419008255,
        0.01335011888295412,
        -0.048385798931121826,
        -0.083673857152462,
        0.008435575291514397
    ]
}