{
    "id": "uXbGQiXsRes",
    "title": "Hacking Power Plants and Industrial Control Systems (Scada)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-04-17T14:00:31Z",
    "video_url": "https://www.youtube.com/watch?v=uXbGQiXsRes",
    "category": "Science & Technology",
    "tags": [
        "osint",
        "osint yacht",
        "ukraine",
        "ukraine russia news",
        "ukraine vs russia news",
        "ukraine latest news",
        "scada",
        "hacking scada",
        "russian hacking",
        "russian hacking ukraine",
        "cyber security",
        "industrial control systems",
        "cyber attack",
        "cyber security course",
        "shodan hacking tutorial",
        "hacking",
        "cyber warfare",
        "cyberwar russia",
        "cyber warrior",
        "cyber war ukraine",
        "ukraine war",
        "ukraine invasion",
        "cyberwar",
        "info sec",
        "russia ukraine",
        "hacker",
        "hacked",
        "hacktivisim",
        "cybersec",
        "infosec",
        "hack russia",
        "tor",
        "ics"
    ],
    "views": 211204,
    "likes": 7669,
    "comments_count": 538,
    "description": "This is my second interview with the professional hacker Occupy The Web. In this video we discuss OSINT and hacking industrial control systems (ICS) using SCADA (supervisory control and data acquisition).   Jump to 33:40 for scada discussions.  Disclaimer: The opinions expressed by Occupy The Web in this interview are his own.   // MENU // 00:00  Introduction 00:41  Disclaimer 00:46  Intro With OccupyTheWeb 01:30  Ukraine Web Cam Hacking 03:55  Finding Russian Superyachts With OSINT 05:47  Why Track Russian Superyachts? 09:10  Russian Oligarchs 10:54  The YouTube Comments/OccupyTheWeb is Not CIA/NSA 12:37  It's Not About the US 13:09  Getting Started with OSINT and OSINT Tools 14:51  OSINT As a Career  15:22  Other Uses For OSINT 16:38  OSINT Can Find Anything About Anybody 18:21  Phones/How To Avoid Being Tracked 19:22  Turning Off Your GPS Doesn't Stop Tracking 20:35  Use a Burner Phone 23:30  Tips To Stay Anonymous Online 26:36  Different Physical Machine vs Virtual Machine for Privacy 28:08  Cellphone Networks - IP Addresses 29:36  Before We Talk About SCADA 33:49  SCADA Hacking As The Nuclear Option 38:25  Why Would It Be The Nuclear Option? 40:11  SCADA Hacking Example/The Colonial Pipeline 42:13  The Difference Between a Traditional IT System and a SCADA System 44:07  SCADA Protocols 46:03  SCADA Hacking Example/Stuxnet 49:06  Why Are These Systems Connected To The Internet In The First Place? 51:52  Almost All SCADA Systems Are Online 52:24  How To Find SCADA Systems Online 56:51  Why SCADA Attacks Aren't Simple 57:57  But There Is Still A Huge Risk For SCADA Attacks 01:01:39  How Companies Can Secure Their SCADA Systems 01:03:07  People Don't Do What They're Supposed To Do 01:05:00  Final Thoughts/Teaser For The Next Video With OccupyTheWeb 01:05:30  Closing/Leave a Comment!   // OTW Discount // Use the code BOMBAL to get a 20% discount off anything from OTW's website:   // Previous video // OTW video 1:   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // Occupy The Web social // Twitter:   // Occupy The Web books // Linux Basics for Hackers:  Getting Started Becoming a Master Hacker:   Using OSINT to find Yachts:   Can the CIA or other Intelligence Agencies Track My Every Move:   SCADA Hacking: The Key Differences between Security of SCADA and Traditional IT systems   Using Shodan to Find Vulnerable Sites:   SCADA Hacking: The Most Important Attacks:   Lots of Scada content:   // In the News // Feds Uncover a Swiss Army Knife:   Ukrainian power grid 'lucky' to withstand Russian cyber-attack:   An Unprecedented Look at Stuxnet:   // Other books // The Linux Command Line:  How Linux Works:   // MY STUFF //   ukraine russa scada modbus ics industrial control systems occupytheweb occupy the web hackers arise hackersarise ddos ukraine war cybersecurity ukraine cyber attack russia ukraine news russia vs ukraine cyberwar russian invasion russia ukraine crisis ukraine crisis cyber security cyberwarfare cyber attack cyber war russia cyberwar russia cyber attack cyberwar against russia cyber security news ukraine war ukraine cyber attack today cybernews ukraine 2022 ukraine news russia ukraine conflict anonymous hack hacker hacking cyberattacks russia vs ukraine russia ukraine war russian cyber attack russian ukraine news russia ukraine cyber  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #ukraine #russia #scada",
    "description_links": [
        "https://davidbombal.wiki/otw",
        "https://youtu.be/GudY7XYouRk",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://twitter.com/three_cube",
        "https://amzn.to/3JlAQXe",
        "https://amzn.to/3qCQbvh",
        "https://davidbombal.wiki/osintyachts",
        "https://davidbombal.wiki/ciaphonestracking",
        "https://davidbombal.wiki/scada1",
        "https://davidbombal.wiki/shodan",
        "https://www.hackers-arise.com/post/scada-hacking-the-most-important-scada-ics-attacks-in-history",
        "https://www.hackers-arise.com/scada-hacking",
        "https://www.wired.com/story/pipedream-ics-malware/",
        "https://www.bbc.co.uk/news/technology-61085480",
        "https://www.wired.com/2014/11/countdown-to-zero-day-stuxnet/",
        "https://amzn.to/3ihGP3j",
        "https://amzn.to/3qeCHoY",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- [OccupytheWeb] You can find just about anything, about anybody, okay, through OSINT techniques, okay? - Except yourself. Except you. (laughs) - [OccupytheWeb] Well, hopefully that's true. (laughs) They can track everything you do by your phone. You can track the location of the yachts, the airplanes, cars, anything that's giving off a radio signal. - You are actually doing a lot of the technical stuff that people wanna learn. Not everyone watching is gonna agree, which is normal. - I firmly believe in what we're doing. I think it's the right thing. And we will continue. (exciting music) - Everyone, David Bombal back with OccupytheWeb. Had a lot of comments on our previous video, a lot of great feedback and some negative feedback, obviously. Just to remind you OccupytheWeb is the author of this book, and I also got his other book this time. So this is another book that he wrote and he's working on a book about network hacking. So I have to ask you, OccupytheWeb, because a lot of people say, David, \"You're giving away the name of the author. So how can you do that?\" So, I mean, on the book, it says OccupytheWeb. (OccupytheWeb laughs) So I don't think I'm giving away much. - [OccupytheWeb] I saw those comments too. I was like, oh, David knows his identity. Yeah, he knows his identity as OccupytheWeb. - I know nothing about you. Never met you. Dunno what look like or anything. So welcome again. It's good to have you back. - [OccupytheWeb] Thanks a lot. It's good to be back. I got a request yesterday from inside of Ukraine. - Okay. - [OccupytheWeb] From associates inside of Ukraine. And what they are asking us to do is they've identified about 500 IP addresses of webcams, okay, within the occupied territories of Ukraine. And they're asking us to basically break their passwords so that we can watch what's taking place in those occupied territories. A lot of these webcams are security cams. They are, you know, in parking lots on buildings, what have you? And so this is a way for us to hold the Russians responsible for the atrocities that they have been committing in Ukraine. Now there are some limitations to this, obvious limitations, and one are you gotta have electricity to have those cameras online, (laughs) right? - Yeah. - [OccupytheWeb] And many of these parts of Ukraine don't have electricity right now. And almost all these parts of Ukraine don't have internet access. So we're gonna do our best and try to get as many as we can and be able to see as what we can, but we're trying to be an eyeball inside of these occupied territories to be able to record what's actually taking place. - Now that's great, I mean, some of the things we have we say in these interviews are controversial, and I'll just say that I on all my interviews and OccupytheWeb, you can confirm this. I don't edit what you say. It's raw from you. And it's the same from everyone else who gets interviewed. It's the raw opinion of the person that I'm interviewing. And I don't like to try and edit it all out. So you can say what you want. (OccupytheWeb laughs) Not everyone watching is gonna agree, which is normal. - And I agree, is that not everybody's gonna agree with me, but I'm gonna give it to you. It's my opinion. - Yeah. - Okay. And it's hard to hear some of the comments, and read some of the comments. - Yeah. - But I firmly believe in what we're doing. I think it's the right thing. And we will continue on this effort, so. - From my point of view, what is really interesting is you are actually doing a lot of the technical stuff that people wanna learn. Like we gonna talk about a bit about OSINT we've spoken about the cameras. I want to talk about SCADA and you've kind of communicated some of the risks with like power grids, stuff like that in our previous interview. So I'd like to get like, sort of some technical information about what OSINT is and how you managed to find those shots. - [OccupytheWeb] Almost all modern vehicles give off a radio signal, which I'm gonna put in a little plug for. I have a new course called Software Defined Radio for Hackers, which I think is really, really important. And so anyways, that's out there and this is part of it is that these radio signals, you can track the location of the yachts, the airplanes, cars, anything that's giving off a radio signal. So that's how the yachts are tracked. There's basically, there's two different ways for the big yachts. They actually communicate their location via GPS. The big ones do, like these super yachts, and there's also a AIS, which is a signal that's only available near the shore. So as they're traveling along the shoreline, these signals can be picked up and they can also obviously be picked up in a marina. So these all can be tracked. So you can track these super yachts where they travel anywhere in the world. There's several sites that do this for you. And we use marinetraffic.com. If you go ahead and put the name of the vehicle in there, it'll track it, show you its route. The issue, really in being able to effectively track these oligarchs' yachts is to find the name, okay, of their yacht. - I was gonna ask you, how do you, how do you know the name? Yeah. - Yeah. That's the hard part. Most of them don't put the yachts in their name. They put the yachts in a shell company, so you have to trace through these shell companies to find who owns the yachts. And then once you have the name of the yacht, you can put it into MarineTraffic or some of these other sites and track its location. As soon as the war broke out on February 24th, we began to go after the yachts. We didn't go after yachts with the idea of getting them seized. We went after to try to get people to go out to the marinas and basically protest and refuse to fuel them and refuse to service them. That ended up playing a key role in seizing about a half a dozen of those yachts. So we were able to get quite a few of the yachts seized, and we're still working on that project. As a matter of fact, I just now tweeted out the location of a new, another yacht. That's at Ensenada, Mexico. It's owned by what's its Oleg Tinkov. His yacht is La Dacha and he just moved it in the last couple days from Cabo, Las Cabos in Mexico to Ensenada, which is pretty close to the United States. It's getting risky for him, but there's a lot of Americans and Mexicans in Ensenada. Ensenada is just south of the border on the Pacific coast of Mexico, and so I just kind of was encouraging people, even though Mexico is not gonna seize it, that they should, you know, they could go out and make him feel uncomfortable, make him feel unwelcome in Mexico, maybe refuse to give 'em fuel or food. What have you. So that's what we're encouraging people to do. If Mexico is willing to seize it, then that's even better. But Mexico right now is pretty much staying neutral and probably for good reason. I mean, Mexico doesn't want to get themselves involved in this kind of conflict. They're not, they're not a player, you know, that wants to... They can only lose by getting involved in this conflict. Apparently Tinkov believes that by keeping his yacht in Mexico, he's safe, but doesn't mean we can't make him feel uncomfortable. The others, we've probably gotten six or seven yachts seized since the war began. And so we're just trying to put pressure on the oligarchs, you know, to say, hey, you know, you gotta go talk to Putin and do something about this. And I'm hoping that the people who listen to this, if it's still an Ensenada, when you hear this go out there and you know, maybe just carry a little sign and tell 'em to, you know, go away or they're not welcome. Make sure that these people know that you don't approve of what Russia is doing in Ukraine. And Mexico, if you guys, you know, wanna go ahead and seize it, then that's all the better. (laughs) - You had an article on your website or a few of them. Didn't you, were you talking about using OSINT to find the yachts, is that right? - [OccupytheWeb] Exactly. We started that on the day that the war began and we can take some credit for having played a role in probably a half a dozen of them being seized. - I saw that someone sunk or did something to one of the yachts and yeah, I know a lot of European governments have seized yachts. I just read today that the Netherlands has seized yachts that are, are in, are getting involved or something. - [OccupytheWeb] That's part of the anti-war effort, you know, is to... Who knows what's gonna happen if the war were to end tomorrow, but it puts pressure on oligarchs. And these, by the way, I don't know how much your listeners understand how these people made their money. I mean, when you make billions of dollars, (laughs) there's usually something, a little nefarious in there, but in these cases, there's particularly nefarious because almost all of these oligarchs have made their money by essentially taking assets of the old Soviet Union. In the old Soviet days, all of the assets, the mining companies, the gold mining, the oil, the gas were all owned by the state. When the Soviet union disintegrated in the '90s, these assets were basically distributed to people who were close to the Kremlin. So these people were basically given the assets of the people of Russia, and that's where their billions comes from. It's not 'cause they worked hard, (laughs) worked their way up the ladder. They basically leveraged their contacts within the Kremlin and the Kremlin gave them these assets of which they have made their billions of dollars. They're basically thieves from the Russian people. Okay, the Russian people are just as much victims as the Ukrainian people are. So that's why I wanna start off by talking about that, (laughs) you know. - That's okay. I actually wanted to talk about SCADA or SCADA but we can talk some OSINT first and then talk about SCADA because, you know, seems to be a big risk- - We can talk about SCADA. - Sorry, go on. Let's just talk about OSINT a bit, and then we can come back to SCADA. - [OccupytheWeb] Well, so I'm done with my little bit about the oligarchs, (David laughs) but I also want to start off with another caveat before we go on. - Yep. - [OccupytheWeb] Because I get a lot of comments and I read a lot of the comments from the last interview and I dunno how well you go through 'em, but there's a number of disparaging remarks in there. - Yep, there are. - [OccupytheWeb] And I a number of disparaging remarks in Twitter, what have you. And commonly what people will say is, you know, you, you are CIA, NSA. And I wanna say right now, clearly I am neither NSA or CIA, okay? And the other comment that I get is that, well, the United States has done all these horrible things in Afghanistan, in Iraq, what have you. And I agree, (laughs) I am an American and I cannot agree with you more that the US foreign policy has had a horrendous record over, well, the last 100 years, (laughs) right? I mean, you can go back. Well, probably longer that, the Mexican-American War in 1848 was a horrible war where the United States just basically stole half of Mexico, invaded Mexico and stole half of Mexico. But you know, we can go on and on about its record in Central and South America. - You can say the same about the UK. I mean, how far back do you wanna go? - You can say same about Spain. You know? - I mean, we I'm originally from South Africa and I mean, we can talk about the Boer War and how England locked up people in concentration camps. I mean, how far back do you wanna go? Yeah. - [OccupytheWeb] I can agree that UK has a horrendous record (laughs) and Spain has a horrendous record. The US has a horrendous record, but this isn't about the US. This isn't about Spain. This isn't about the UK. This is about Ukraine. And we need to focus on that. We cannot let this break down into a US-versus-Putin war. Ukraine is an innocent victim here and we need to focus on that. So don't send me all your comments about the horrors of American foreign policy. I know, I agree. Okay? But this isn't about American foreign policy. This is about Ukraine. So I wanna start off by putting that out there. - Do you have like content about OSINT or recommendations about like, how do you go about this? If you knew and you just wanna try and like either for curiosity or to try and help. How would someone stop this? - [OccupytheWeb] There's a whole section on OSINT. If you go to the far left tabs, there's an OSINT tab and you click on that and there's a whole bunch of OSINT articles. There are various ways of using OSINT. I also teach a course on OSINT. OSINT is one of those things that you don't have to be all that technically capable. There's a lot of websites that'll help you, but there's also some tools that you need, some Linux skills. So some of the tools that we use are Linux-only, and you gotta be able to install them and use them in Linux to be able to do good OSINT. But there's, you know, there's tools like MarineTraffic that anybody can use. It's a simple tool. I also use RadarBox, a tool for tracking aircraft. And of course you can also set up your own software defined radio and track aircraft and ships in your local area. So if you are in a town that has a marina, you can track what ships are in your marina. You don't need those websites. If you have software defined radio and a simple receiver, like a $30 receiver, you can track all the comings and goings of all the aircraft in your area as well. - So on the OSINT portion of your website, that's a great place to start and that can lead like to other roads and other places that people can learn more about you. - [OccupytheWeb] Yes. Yeah. That has about, I don't know, 20 or 30 tutorials that people can get started in OSINT. OSINT is a huge field and it's a really rapidly growing field and it's becoming a profession, okay? I recently taught the class and we had people who were professional OSINT people who work for governments just doing OSINT. And so this is a field that people have overlooked in, I think have overlooked, as a career choice. This is a new field that governments and companies are hiring people just to do OSINT. So for instance, there's the obvious ones that we have talked about in tracking assets, but what's overlooked, I think, is there's a financial aspect of OSINT, too, there's an environmental aspect of OSINT. So economic, you can track, say, what's going on in different businesses by, say, viewing satellite photographs, okay, of that particular business. You know, one of the things I put a tutorial on of looking at a particular, I don't think it's cataloged in that page yet, but basically we were looking at a Walmart and just looking at counting the cars in the parking lot. So say my task is to determine how this particular store is doing. I can use photographs over time, okay, of a particular location, store, what have you. In this case, we were looking at what was, you know, the effect of the pandemic on this particular store's sales based upon counting the number of vehicles in its parking lot? OSINT has been used for a long time for hacking purposes, penetration testing. You can get people's email addresses, you can get your physical address. You can find out who owns what car. There's almost unlimited number of things that you can learn in OSINT. The OSINT is really techniques of the modern private detective. (laughs) - Yeah. Yeah. - [OccupytheWeb] I mean, you can find just about anything about anybody, okay, through OSINT techniques. - Except yourself, except you. (laughs) - [OccupytheWeb] Well, hopefully that's true. (laughs) - I dunno if you saw the comments where they were saying you're giving too much information about yourself. - [OccupytheWeb] Yes. And I'll link to your Twitter reply to that below, or you can say it now if you want. - [OccupytheWeb] Well, what I said is that I've been doing this for a while. - Quite a while. Yeah. - [OccupytheWeb] I've been doing this for a while, and I tend to give out false information to take people on false trails, because I know I'm an OS ints guy, right? (laughs) You know, I know how to trace people, okay? That's what I do, all right? And so I give out false information to take you in the wrong direction. So if you think I'm giving out too much information, that's fine. Go trace it, okay? (laughs) It's not gonna take you any place or it'll take you to somebody else, okay? And that's what I want. - You've got a Twitter account, but it's all in OccupytheWeb name. So I just think, you know, we had a lot of comments on the previous video about stuff like that. Yeah, try and do OSINT on OccupytheWeb, you're probably not gonna get very far. - I welcome people to try. I mean, a lot of people have. - I'm sure. - [OccupytheWeb] I will tell you that I'm not entirely anonymous. One national intelligence agency who came to me a couple years ago and said, we know who you are. And I said, okay. But they also said, and we won't tell anybody. And that was, that was nice of them. And they haven't, so. - What do you think about phones? If someone wants to be private, do you recommend having a phone or not using a phone or like what kind of phone, like a flip phone? How would you like kind of hide your stuff if you like? - Well, you know, I have an article on Hackers-Arise about, you know, somebody had asked the question, can the CIA track my every movement by my phone? And my answer is yes. (laughs) Yes, they can track everything you do by your phone. Which kind of brings me to just before we went on on air, one of my colleagues sent me some information about a Russian officer that he is tracking in Russia, his movements via WhatsApp. I may put that online here a little bit, but we're watching him because he seems to be moving towards the border of Ukraine. He's not in Ukraine, he's in Russia. And we're tracing him as he is moving towards Russia, which may be a prelude to more troops moving to the Ukraine. But in any case, yes. I mean intelligence agencies or anybody with your IMSI number can trace every place that you move. Some people say, well, we're gonna turn off my GPS. That's great. You could turn off your GPS, but you still have to connect to a cell tower. You have to turn the phone off entirely to not be traced. Because as soon as your phone is turned on, it connects to a cell tower. That cell tower is giving away your location. If you're in a really crowded say urban area, those cell towers can be triangulated to down to about your location, to about 500 feet. If you're in a rural area, it can be as much as, oh, I was just working with a government agency the other day that they had somebody they were tracing and it was in a very rural area and they could only get his location down to about 2000 square feet, which wasn't enough. But yeah, that gives you some ideas. If you're an urban area, they can get you down within about 500 feet. If your GPS is on, they can nail your position within a couple feet. (laughs) - Yeah, it's crazy. - [OccupytheWeb] So it's, if you want your location to be anonymous, you know, one of the things that's an option in the US are what people refer to as burner phones, okay, burner phones. I know that, I think I know in Germany and much of the EU burner phones are illegal. You probably have better idea than I do. - Yeah. I think they've kind of restricted it. And I know in South Africa as well, it's like, you have to get a SIM card, you have to be, you have to go through a whole... And South Africa's even more crazy about it. You have to go through process to get a SIM card. - [OccupytheWeb] Right. And so that way they know who has the SIM card, right? - Yeah. Yeah. - [OccupytheWeb] But in the US, you can just go in and buy a little flip phone or what have, even a smartphone for less than a hundred dollars. Some of 'em are 30, 40 dollars, and then you can pay cash for it. No identification required, yeah? - [OccupytheWeb] No identification required. - Okay, yeah, no, you need that over here. - [OccupytheWeb] And so that kind of phone makes you anonymous if you want to use that. And people do use that. I use one, okay. I have my regular personal phone. If I'm doing business, you know, in this business, I use my burner phone, which is untraceable. - So do you change your SIM card on a regular basis? And I wouldn't say what would you recommend? Let's put it that way. Or do you just because you paid cash, you got a SIM card. There's no record, you're okay with that? - [OccupytheWeb] Yeah, that works. That works fine. It's pretty hard. It's not impossible. Nothing's impossible. (laughs) - No. - No. (laughs) But it's pretty hard to trace, okay? So once you've purchased essentially a SIM card with cash, there's no connection, okay, to be able to trace that phone to the individual. - And you use a burner phone, that's not like an iPhone or fancy Android. It's like a basic, basic phone, is that right? - [OccupytheWeb] Yeah, it's a basic, and that's basically what's for sale, these burner phones. So it has to be off the main carriers, right? 'Cause the main carriers in the US, at least, they require that you register a person, you have to pay for it on an account with a credit card or bank account, what have you. So it's all linked to you. These smaller carriers, you know, will allow you to pay cash for everything. So there's no way to trace it back to the individual. Well, I'll just give you an example, is that in the US, we had this insurrection that took place on January 6th of last year. And we're now finding that many of the people who participated were using burner phones, which makes it very difficult to be traced. And it may include the former president. (laughs) He may have been using a burner phone as well. There's a big seven hour gap in his phone logs. So in any case. - Yeah, we'll avoid that. We won't even mention the name because it'll 'cause problems for on YouTube. But, but yeah, no, I know what you're saying, yeah. Do you wanna say anything else about like, how do you stay private, 'cause I mean, if you have a fancy iPhone or a fancy Samsung or whatever, you're really worried that you can be tracked. Like I think we spoke about it last time about using Tor, using something else, proxy chains. - Well, I have a class. After, as a kind of a little pitch, is after our last interview, it occurred to me that, you know, I've been doing this for a long time. - You have, yeah. - [OccupytheWeb] Maintaining my anonymity, and I take it for granted the things that I do to stay anonymous. So I created a class. (laughs) - Great. - [OccupytheWeb] And I created a class in May on how to stay anonymous. And we're gonna talk about all the techniques, even to the point where when you're online, you need to use like different, ideally, different machines for your business purposes and personal purposes, okay? Different browsers at the very minimal, okay? Because the cookies in your browser are going to identify you. So if you're using your, you know, say Mozilla Firefox on your personal account, okay, whether it be Facebook or your bank, and then you come back and you're using that same browser in doing hacking stuff, you know, you can be traced by the cookies in that browser to your identity. So you have to be careful not to use the same browser. So those are the kind of things we're gonna be working with in this class. I think it's in late May we're gonna do a two- or three-day class on how to stay anonymous. - Give us some teases. Sorry, go on. - These are the things that we're gonna be talking about. I mean, the NSA now uses a technique where they actually can identify you by your writing style. So what they've done is they've cataloged all of the writing on the internet, (laughs) right? And all the writing on the internet, everybody has a slightly different style. If they cannot identify somebody, they begin to look to match that writing style with their, they have a catalog of all the writing styles, with all the particular characteristics of that style, and try to match those together. It's one of the many techniques that NSA uses when they can't identify somebody, and they don't like when they can't identify somebody. As a matter of fact, I would say all of the intelligence agencies, okay, not just the NSA, okay, but all of the intelligence agencies, they don't like somebody in their playground that they don't know who they are, okay? They work really hard to identify everybody in the playground because they feel like this is, you know, the internet is, that's where they work. It's where they try to control. And they don't like to have anybody in there that they cannot go knocking on their door, okay? They wanna know who these people are and where they live. Okay, 'cause that gives them a lot of power. So they use, they have multiple techniques to try to identify everybody who's on the internet. - So I mean like what you could do, like would you recommend like having a whole separate physical machine or will a virtual machine running like (indistinct) or something be good enough? - I would recommend that you have an entirely different system, but you know, a virtual machine, some people that's not an option. - Yeah. - All right, but if you have the resources, I would recommend an entirely different system for personal versus professional. You know, the other thing of course is that your IP address can always be tracked, right? So whenever you're on the internet, your IP address can be tracked. Unless for instance, you're using Tor or a proxy, okay? Elon Musk's new service, the Starlink, which is what I'm using now, all of the IP addresses link to the central office. So normally when your IP address can be linked to the city, okay, to where you live. In Starlink, they only have, they have two offices and all the IP addresses linked to those central offices. So somebody would have to get into Starlink's log file to be able to trace the location. So right now they have two locations. So all the IP addresses either go back to California, where their main office is at, or to Colorado, where they have a regional office there. But that just gives another level of anonymity. Even if somebody gets, you know, can trace the IP address, they're not even gonna get to the proper state and city of where you're at. I've seen that with the cell phone networks as well in the UK. I dunno if it's the same over there. - [OccupytheWeb] The cell network in the UK, it's it only goes to the regional office? - No, I've just seen that like sometimes when you are on your phone and you do a search for an IP address, it'll come up in a different city totally. It won't be where you are. - [OccupytheWeb] That's true of all the IP addresses, even in, you know, on landlines or cable, because what happens is that they have these blocks of IP addresses, right? And they'll say, okay, this block of IP addresses is for this, for Birmingham, England, right? But if they have a need in another community, they'll just transfer for someone 'em over to theirs. But usually it's close, okay? It's not necessarily precise. - I've seen landlines are much closer than cell phones, but yeah. I mean, it's, I like what you're saying about Starlink. Sorry, go on. - [OccupytheWeb] But Starlink, yeah. Starlink is different. Starlink doesn't publish where the IP addresses are at. When you trace the IP address, it goes to the central office, so. - So someone who would have to it into their system to know where you are kind of thing? - [OccupytheWeb] Exactly. To know even, you know, the state that you're in much less the city, but yeah. I've traced them and they go to two different, two different locations. They go to the main office and a regional office. - Any other quick tips? I mean, I don't wanna take the whole course away 'cause I mean, obviously there you're gonna go in a lot of detail, (laughs) but like any other tips? I want to talk about SCADA, but any last tip about like how does try like hide your identity online? - I think that's probably all I wanna talk about for right now, but there's one other thing that I did wanna mention before we get in the SCADA. - Yep. - And that you have noticed that last week that the Russian government put out a threat against all the people who who've been working against them on the cyber war and they've threatened us. - Yeah. - Okay, so I want people to know that they that's out there. You know, Russia is threatening us. Now that can be scary, okay? One of the reasons you want to try to stay anonymous, but also that means that we're having an impact, okay? They wouldn't be threatening us and starting to come after us if we weren't actually having an impact on them. So I see it as a good thing that they're threatening us. (laughs) That means that we are actually having an impact on this war effort or anti-war efforts, okay? But yeah, be careful, all right? Because they have said they've identified 17,000 IP addresses. There's a lot more than that that have been participating in this, but they are now threatening. I have detected some anomalous traffic, okay, on my network in the last week, but I've been able to deflect it. They're not Russian IP addresses, but I don't expect Russian to be attacking me from Russian IP addresses, right? The fact that we're be able to do this interview is actually a good thing. You know, this is telling me that I still can function, but I was getting some traffic that was worrisome last week, and I don't know where that was coming from, but I was able to deflect it and get back online. - It is a worry. And I mean, my advice to anyone is you have to be really careful what you decide to do with the information that we're sharing. - Yes. - Yeah. - You have to be very careful. - Yeah. - And I commend everybody who has the courage to do the right thing, and that is to try to stop Russia from basically flattening Ukraine. And we saw all this past what Russia has done, where they, you know, they've left these towns and they've just executed, you know, hundreds of people and throwing them in mass graves. This is the greatest threat to peace and stability in the world in our lifetimes. I get all these comments about, you know, people know that I'm in the US, I'm an American citizen. - Yeah. - [OccupytheWeb] I don't necessarily agree with US foreign policy, okay? But one of the thing I want to say is that I've been a student of Russian history for a long time and I understand Russia's need for a buffer, okay? That's always been important to them, okay? Throughout the last 300 years, they've always wanted a buffer of states around them because they've been attacked by the west multiple times. All right? So let's, let's be clear on this, okay, Russia has been attacked by the west many, many times, okay? 1917, 1943, '44, '45. And you can go all the way back to Catherine the Great's time. So I understand that need for a buffer, but that doesn't give Russia the right to basically turn Ukraine into rubble, okay? That doesn't give them the right. I understand it, but you can't, that's not acceptable. Maybe there is an acceptable way to give them the security guarantees they need without basically flattening Ukraine. And I would be in favor of that. I understand their concern. So that having been said, we can move on to SCADA. (laughs) - No, that's fine. I mean, just, I think it's important that, and this is why I want you to say your piece, if you like, or say the reason why you do this, because everyone has a reason for why they do things. It's important that you, you know, share why you're doing this and why you believe in what you're doing. And I wanna give you that opportunity to do that. - [OccupytheWeb] Thank you. - On the last video or interview, we discussed the nuclear option, as you put it, about attacking industrial systems. If I understand correctly, that's about SCADA and like the systems controlled by SCADA, is that, right? - [OccupytheWeb] Yeah, what I've been saying is that SCADA industrial control systems, okay, SCADA is supervisory control and data access, and ICS is industrial control systems. These are the systems that run everything in our industrial lives, whether it be water systems, manufacturing systems, electrical systems, all these things that were so dependent upon are all digital, and they are targets in a cyber war. I consider that the nuclear option. Now we should point out Russia has used that nuclear option against Ukraine in multiple occasions in the last few years. We need to step back a little bit and understand that although this ground war started on February 24th, there has been an ongoing war against Ukraine for almost 10 years by Russia. It has included the occupation of some territory in the east and Crimea, but it also has involved a cyber war that they have been constantly, incessantly harassing the Ukrainians with attacks against their infrastructure. They knocked out the lights, the electrical system in Kiev in 2014, okay? In 2015, all right, they've done the nuclear option against Ukraine. Okay, they used BlackEnergy 3. It was a piece of malware that they developed. It was fairly sophisticated, okay? But the way that they got into the system was not sophisticated. It was a social engineering attack where they got into the corporate network. So in the SCADA world, the ICS world, companies are encouraged for best practice is to keep the corporate network and the SCADA network separate, okay? So that if your corporate network gets attacked, the attacker can't access the industrial part of your network. The Russians, in this case, got into the corporate network through social engineering, and then we're able to get into the SCADA network of the electrical grid and turned off the lights in Kiev. They have already implemented SCADA attacks. They've also used another piece of malware called Crash Override to attack the electrical grid in Ukraine. Gosh, there's been a number of attacks that they have used, but so they have already begun using SCADA ICS attacks against Ukraine. Right now we have not seen, okay, since February 24th, we have not seen a successful attack against Ukraine's infrastructure, nor have we seen a successful attack against the west in SCADA ICS. I think that that is because Russia knows that if they do, that literally will be the nuclear option. Even though Russia has gone to great links to secure their industrial systems, they know that they're not totally secure. And that hackers around the world could turn off their lights, turn off their industrial systems, turn off their water systems, and they could be plunged into darkness and crush their economy. Their economy is already in difficult straits, but so far we haven't seen that kind of attack from Russia. I'm worried that if the war continues to go badly for Russia, that they will trigger that nuclear option. There have been warnings, but they should also understand, and I think they do understand that if they do that, the west will respond in kind and it will not, it'll be very ugly, okay? And I think those in the west should be prepared, okay, and should be vigilant for these types of attacks coming from Russia. And on our side, we are preparing, okay, for the day when those are attacks are unleashed and we will unleash attacks against them. - And that's why you call it the nuclear option, because it becomes like this thing where I'll destroy your economy, you'll destroy my economy and no one wins. Is that kind of the idea? - Exactly. Yep. And right now it's kind of the idea, the old nuclear mutually assured destruction, right? Remember the MAD doctrine? - Yeah. - [OccupytheWeb] So that if I use a nuclear weapon, you'll use a nuclear weapon and we both are dead, right? And that's why I refer to this as the nuclear option. If one side uses a nuclear option, the other side knows that the other team, the other side has the option as well. And then everybody's in the dark, right? And the economies, in our modern economies, nothing can run without digital systems, right? - Yeah. - [OccupytheWeb] Everything has digital systems. For those of you who aren't familiar with SCADA ICS probably say in the industrialized world that every industrial system, okay, no matter what it is, no matter what you're making, you're making chemicals, you're making widgets, you're have an oil refinery, a chemical plant. You have what are called programmable logic controllers. These are small, simple, relatively simple computers, okay, that control the process. And these small, simple computers are vulnerable to attack. And by getting inside these systems, okay, say an oil refinery, and you can access these PLCs of which there may be hundreds of them, thousands of them in a big plant, you can control the switches. You can control the valves. You can control everything that goes on inside that plant. If you can do that, then you can shut the plant down or even worse, make the plant into a weapon. - The one of the famous ones was the Colonial Pipeline, wasn't it recently in the US, what was it 2021, yeah? May, 2021. - [OccupytheWeb] What happened in may 2021 was that, you know, we don't know that it was Russian state hackers. Sometimes it's hard to distinguish between Russian state hackers and then the freelancers in Russia. But you know, that's the same true of the west too. The NSA, for instance, contracts a lot of their hacking out to private companies and everybody does this in the west. Russia does it too, right? There is the state hackers, and then there are the contractors, (laughs) and the contractors sometimes are just as efficient and effective as the state hackers. So in Russia, there's number of different hacker groups. Some of 'em are state sponsored. Some of 'em are kind of contractors to the state, but somebody hit the Colonial Pipeline with ransomware in May, 2021. So that's not even a year ago. And they hit with ransomware and eventually Colonial Pipeline paid the ransom. And it was able to get the line back on, get the major pipeline between the refineries in the Gulf Coast of the United States and the population centers and the east coast. And so what happened, it became major shortages of gasoline in the major population centers. The price spiked. It only lasted for a few days, but you can imagine a case where, you know, say a nation state actor hit all of your pipelines in a country and there was no gas and no gasoline, no natural gas, no oil. You could bring an economy to a screeching halt. - I like the analogy that you use that it's kind of like nuclear because if people start doing this, people can die. I think you've got this great article where you say that \"The key differences between security of SCADA and traditional IT systems,\" And the audience that watches us are mainly IT people, I would say, have more experience with computer networks. So perhaps you can give us like a quick overview of like, from an IT person's point of view, like what's the difference difference between a SCADA system and like a traditional IT system? - There's a number of things that make it distinctively different than our traditional TCP/IP based systems. Probably the most important is that in a SCADA system, you are protecting the process. You're not necessarily protecting the data. So we're used to this idea of, you know, confidentiality, of protecting our data. Okay, but in a SCADA system, you're protecting a process because if the process goes awry, then the whole plant could blow up, for instance, if it's a refinery, if one switch, one valve isn't open properly for a proper amount of time, the whole plant could blow up. A good example of that was we had a situation in Texas where an entire $2 billion refinery blew up a few years back because of malfunction of a single valve. It wasn't a cyber attack. It was just a malfunction of a single valve. The whole plant blew up, killed 50 people, but it could have been much worse if it had been near a large population center. That's when I was talking about, in that a SCADA attack can turn an industrial process into a weapon, literally where people lose their lives, right? So we're not protecting data. We're not protecting social security numbers and identities, right? Or IP, intellectual property, we're protecting a process. And that's really different. The other thing that makes it really distinctly different is that we're used to the whole TCP/IP suite. - Yeah. - [OccupytheWeb] In SCADA systems, we have over 200 different protocols. - Wow. - Okay? That are running these systems. The most common of those is Modbus. And it was the first protocol. These are serial protocols, so these are protocols that were developed, you know, before we really had proliferation of the TCP/IP suite in the '80s, '90s. So these were serial protocols. They're meant to communicate serially, kinda like the old connection between the old serial ports on old PCs that would communicate between your printer and your PC that had limitations on speed and limitations on how many devices could be on it. This is what these protocols run. They run under a serial protocol. Modbus is the most common, but you also have things like PROFINET, which is used by Siemens. You have OPC, which is, OPC is kind of like a universal protocol. Crash Override, the attack against the electrical grid in Ukraine, one of the things that was interesting about that attack is that they actually used OPC. OPC is kind of a universal protocol that allows different protocols to speak to each other. So the Russian-made malware used OPC so that it could communicate to the different elements within that particular industrial plant. But it's one of the challenges of being able to write malware for SCADA is that you have all these protocols. You can't just use TCP/IP to be able to launch an attack. You have to first understand who the manufacturer is, what PLCs they're in there, what protocols they're using, okay, and then map out actually the commands that are being used within the plant. And that's a big job. It's not easy to do. I'll give you an example is probably the really first SCADA attack we ever saw was Stuxnet. - Yeah. The famous one, yeah. Just for the everyone who's young, can you give us a quick overview of it? - [OccupytheWeb] Of Stuxnet? Okay. Stuxnet, you know, was an attack developed by NSA, okay, and I'm not gonna make any apologies for them. I mean, they attacked the Iranian nuclear facility, the enrichment facility, what they did is they took actually took years to develop a very sophisticated piece of malware. And what they did is they tracked the Siemens, PLC Siemens, the German company, who makes many things, including programmable logic controllers, they tracked those programmable logic controllers to Iran. And then they began to develop malware that would control those programmable logic controllers within the Natanz facility. Natanz is a city in Iran where they enrich uranium. So they have a big centrifuges to enrich uranium, which then can be used for either weapon purposes or peaceful purposes. Depends upon how much you enrich it. In any case, what they did is they built this malware that it got into an air-gapped system. It got into an air-gapped system, right? That's, that's one of the big mysteries about that whole piece of malware is how did it get into the facility that was air-gapped? The speculation that it might have been brought in on a thumb drive, or there may have been a, you know, a double agent inside of the facility, what have you, but in any case, once it got into the facility, it then rewrote the code that controlled the centrifuges. So it made the centrifuge spin at RPMs that either destroyed the centrifuges or just weren't able, weren't capable of upgrading uranium to a level that would be useful to the Iranians. So that's a really, really sophisticated. We've never seen anything quite that sophisticated. We've seen a number of different SCADA malware coming out of Russia that is pretty sophisticated. Okay, we've seen the Triton came out a couple years ago, and that came out of Russia. And it targets the safety systems on refineries and other petrochemical plants. So Schneider Electric is a French-based company. They almost all of their PLCs run on Modbus. One of the things that they build are systems that are kind of like fail safe systems so that if something goes wrong, it automatically will shut the plant down, make sure that the plant doesn't blow up. So TritonX, called goes by different names, known by different names, actually basically disables those safety systems. Okay? Yeah, so essentially then the refinery becomes a weapon. - Is it wise that companies, whatever are connecting these SCADA systems to the internet? I mean, why on earth, are they doing that if it's such a high risk? 'Cause I believe, I mean, you can correct me if I'm wrong, but Modbus is not encrypted, is it? - No. Almost none of these are encrypted. That's one of the problems because you have serial connections inside the plant, right? And the media can't handle a lot of data. So these are really lightweight protocols. And so you have these systems that one, don't have the processing power to encrypt and they don't have the media to carry encrypted data. Almost all of them don't use encryption. So that's, you know, that's a big problem right there is that you've got all these communication in your systems, that's all unencrypted. Now some modern systems that have been built in the last few years do have encryption. They're basically been added into the system now, but most of these plants have been built in the last 50 years, right? - Exactly. Yeah. - [OccupytheWeb] And you can't take a 50-year-old refinery and go ahead and take out all the PLCs (laughs) and go ahead and put in new systems. I mean, you could, but it's very expensive and people don't. We've got these systems around from the '70s and the '80s that, you know, they are very vulnerable to attack. Modbus in its native form is not encrypted. Now Schneider Electric does sell a version of Modbus that is encrypted. Okay, so that is out there, but most of the Modbus is not encrypted. So you were asking why do they connect them to the internet? Well, that's a really good question. (David laughs) I mean, the answer is for convenience, right? - Yep. - [OccupytheWeb] Is that they need to monitor these systems, right? They can't, or they don't want to, or choose not to having somebody 24/7 inside the facility managing and monitoring them. I should tell you that I've worked with a group who manages some major dams, those types of facilities. And they have chosen not to put them online, right? - That goodness for that, yes. - [OccupytheWeb] Yeah, 'cause I mean that, those, when we talk about industrial control systems, a dam, okay, a lock. Those are all industrial control systems and they all have these PLCs in 'em. And so in this one group that I was working with, they've chosen to not put them online because there's no way that they could make them safe. So they manage everything internally. Okay, onsite 24/7. These plants all over the world could do the same, but it's an inconvenient. It's expensive, right? So almost all of these facilities are online. So there's serial connections inside the plant. And then there's TCP/IP at the gateway. You can actually communicate via TCP/IP into the plant, okay, through whatever port they're communicating on. In case of Modbus, it's port 502. In the case of, it depends upon what protocol they're using. There's a whole range. I said, there's about 200 protocols. There's probably about 10 that are widely used. - On your website. You, use a specific tool. You are using Google Dorks and then this application to identify SCADA systems online, and you could actually view it, is that right? So could you talk about that? - [OccupytheWeb] Yeah, I mean, you could use Google Dorks or you could use Shodan. I mean, I use Shodan. Shodan works really well, or Census, and there's a number of others. It used to be one of my favorite tools was one called Spice. That's also an OSN tool, but Spice just went down yesterday. It's located in Ukraine. - Oh, wow. - So they're offline, but they had a really good tool. Hopefully they'll come back after the war. But these are tools that basically scan the entire internet looking for various characteristics that they then put into a database that you can search. Shodan is probably simplest to use. So for Shodan, you could just simply go into Shodan and say, hey, I wanna find all the systems in the world that have used port 502. Port 502 is Modbus. It'll show you all those systems. There's a lot of 'em. There's thousands and thousands. I think in Russia, we found 366, okay, and I published those IP addresses on Hackers-Arise, and you can download the list of all the IP addresses that use Modbus in Russia. And they're all vulnerable. You can communicate through port 502 to those systems, dependent upon, you know, how secure the system is. It wasn't, just a few years ago you could go in there and actually send commands into these systems. - Crazy. - From anywhere in the world. Yeah. It was crazy. Okay? If you really look hard on Hackers-Arise, you'll see a tutorial I did in 2016, where I went into a SCADA plant and took root access, took control of the whole plant, okay, in 2016. Yeah, and then when I did that, it was a Schneider Electric plant, I published it online and Schneider got very upset with me. - I can imagine. (laughs) - [OccupytheWeb] (laughs) Yeah, I got lots of nasty emails from Schneider, but the good part about that is that after I published it, they immediately fixed the problem, right? So I was able to get inside, get root access on their system. I was capable also of putting myself in as a user. Of course I have root access, right, so I can do anything. - Yeah. - [OccupytheWeb] But I was able to put myself in as a user on that system in that plant. And if I wanted to, I could still have a user access probably there today, but I didn't, I just went in to do it to show the world how susceptible these plants are to this type of attack. And thank goodness that Schneider was alerted to it. What happened is that The Voice of America did an article right after I published it, Voice of America did an article on how susceptible SCADA plants are, and they used my article as an example of how easy it is to take over a SCADA facility. That's what got Schneider very upset with me. And they eventually sent out a patch, but they had known about this. They had known about the vulnerability before I exploited it. They didn't do anything about out it. So it took me showing the world that I could take over an entire plant in just a couple of minutes, okay, and have root access and control over everything for them to do anything about it. So some people might condemn me for having done that, but quite frankly, I believe it's a safer world because I did. - It sounds like the days of bug bounty before bug bounty was a thing. I mean, they should be thanking you for doing that. - [OccupytheWeb] They should be paying me for that. Yeah. (laughs) - Exactly. Yeah, exactly. - [OccupytheWeb] And all those facilities who are safer now should send me at least a thank you card. (laughs) - Exactly. I mean, if you hadn't done that and we, in today's world, I mean, anyone could do that, then. - [OccupytheWeb] Yes. Anybody could do it. And it's pretty simple. It was a pretty simple attack. And there's a number of other attacks that are pretty simple against these facilities. I mean, you can get into really sophisticated attacks against these facilities, but there's also some really simple attacks that work against many of these facilities, not all of 'em. 'Cause one of the things that SCADA ICS is marked by is so much different. They're all different. So you have to, the attack has to be pretty much targeted to that facility or facilities similar to it. And with 200 different protocols and at least 50 companies making PLCs, you kind of gotta know, you gotta do your research to be able to understand what is involved in attacking that particular facility, but in a SCADA, you know, ICS cyber war, you've got some really talented people on both sides who are willing to invest the time and money into doing it, just like the US did against Iran. I mean, that was a really, they invested millions of dollars, many millions of dollars of research into developing that Stuxnet. In some cases like in the one that I demonstrated in 2016, that was pretty simple, right? As security's gotten, as these systems gotten more secure, the attacks are gonna have to be more sophisticated, and they are. - But there's still this huge risk, is that right? - [OccupytheWeb] I think there's a huge risk. I will not be surprised if we don't see facilities being knocked out in this war. I would be surprised if we do not see facilities knocked out in this war, both in the west and in Russia. I hope we don't. I think that Putin is not willing to lose this war. Okay, and you know, as he has threatened to use, literally, literally use nuclear weapons, he may very well choose first to use this nuclear option against these industrial facilities. If he went ahead, and for instance, you know, turned out the lights in Poland right now, that would make it pretty hard on the Polish people. Would that trigger article five of NATO? We don't know the answer to that question. Those who aren't familiar, NATO has an agreement. All the nations, you know, agree that attack against one is attack against all, and it's article five. So is a cyber attack against a NATO country, you know, is that gonna trigger article five where it brings in all of NATO? I don't know. Okay, I will tell you that I'm really worried about Poland because I know that the Polish systems are very vulnerable. I scan the systems of the world all the time and you know, I've watched Russia get more and more secure in their SCADA systems. I've watched the west get more secure, not quite as secure as those in Russia, mostly because you know, the Russians mandate security. In the west, almost all the SCADA systems are owned by private companies and the private companies choose to either, you know, spend the money to be more secure or not, right? And that creates a problem, right? It's hard in the west to say everybody must do this, okay, to make your systems more secure. In Russia, they can do that. They say, everybody must do this. And so their SCADA systems have gotten very secure in recent years. I'm worried about Poland because Poland is not secure. Okay? There's a lot of vulnerable systems in Poland. And so if I were the Russians and I'm not, (laughs) and I'm not advising it, but that's where I see the greatest weakness and vulnerability in NATO, okay, is Poland. Poland still hasn't brought up their security up to what it should be on these systems. And I'm sure that Russia already knows this. I'm not telling anybody, telling them anything they don't know already, so. - You know, it's one thing to steal someone's credit card data. It's a different story to blow up a oil refinery or something. - [OccupytheWeb] Exactly. It's quite a big difference in scale. You blow up an oil refinery, you not only kill thousands of people, but you also disable the economy and you don't build an oil refinery overnight. If you steal somebody's credit card information, you know, you can disable the credit card, get a new credit card. Somebody steals your password, you change your password. Use two-factor authentication. You blow up a oil refinery, we're talking about a five-year project to rebuild it. Europe is already very dependent and may be in a deficit in energy because of the war. So that might very well be the target that Russia chooses if they decide to use SCADA ICS attacks. - So what's a recommendation for companies? Disconnect their systems from the internet, or what can they do? - [OccupytheWeb] Ideally they disconnect from the internet, but that's not always an option for them. - Yeah. - [OccupytheWeb] I mean, I've gone into systems where there there should, at the very minimum, be some sort of authentication. There's no authentication. - Wow. - [OccupytheWeb] So I've been able to go inside a system that don't have any authentication. You could whitelist IP addresses, okay, so these are simple things that you could do, right? You can just say only these IP addresses are allowed in. And most of these systems have a whitelist that you can enable, but nobody's enabled them. Like for instance, the system that I went into in 2016 built into that system is a whitelist. They could have enacted a whitelist, but they didn't. (laughs) So any IP address could come in. So there's no authentication, there's no whitelisting. I mean, there's a are minimal things that they need to do. Very minimal things that can help a lot, right? So if some actor out there somewhere in the planet comes in with an IP address that's trying to enter into this system, you know, you basically block their IP address. It's very simple. - You've experienced a bunch of the comments on all those video. I get these comments all the time. \"I would never do that. That's dumb.\" Like when you demonstrate some bad security, but I mean, I'm pretty sure, well, you can say it and tell me if I'm wrong, but a lot of systems people don't do what they're supposed to do. - [OccupytheWeb] Yes, that's exactly right. People don't do what they're supposed to. I had a comment from a guy the other day who I published the default passwords on all these systems. He goes, \"Nobody would ever leave the default password in place.\" - (laughs) Exactly. - [OccupytheWeb] And I said, go watch my SCADA ICS, so I did, I taught the class just recently and I was able to get into several systems on basically default passwords and have root privileges on them. And I did it in-class, (laughs) and there's video of it. So, and this is just randomly chosen. I didn't scout out these systems ahead of time. We said, okay, let's try this one out with default passwords. Let's try this one out with default. And I was able to get into several with default passwords. So the answer is that all of us are short of time. All of us meaning all the IT professionals, all of us who were involved in security, we're all wearing multiple hats. We all have a million things to do every day. And in particularly in smaller companies that are short-staffed, the person who's in the seat today, okay, may not have been the same person who installed that system 10 years ago, probably is not the same person, right? So they may not even know what was installed and how it was installed 10 years ago. So yes, you may not install it that way, but somebody might have 10 years ago or 20 years, or maybe even 50 years ago in this case of SCADA systems, and you may not even be aware that there are still hard-coded default passwords in that system. And they are still out there. - That's a good point. OccupytheWeb, do you have anything else you'd like to say, or before we wrap it up? - [OccupytheWeb] One of the things that I was hoping to do, maybe we can do it another time is to talk about the variety of attacks that have taken place against Ukraine over time and how they took place. But you know, this is a long, maybe we can do it another time and we can talk more about some of these and some of the mechanisms that the attacks have taken to get into the Ukrainian systems. - Yeah, I think that'd be good because you know, (gentle music) this is real world and it's nice to hear are real-world stories and actually get your opinion on them. So that'd be great. So that'll be our teaser for our next video. Anyone who wants to put comments, please put below. (OccupytheWeb laughs) Try and keep it civil. - [OccupytheWeb] Keep in mind, I'm not CIA, I'm not NSA, and I'm not going to justify what America has done in foreign policy. This is not about the US. I just wanna keep that close with that thought, okay? This is not about the US. It's about Ukraine. Keep that in mind. - Thank you. - Thanks. (exciting music)",
    "transcript_keywords": [
        "SCADA",
        "systems",
        "SCADA systems",
        "Yeah",
        "people",
        "Russia",
        "OSINT",
        "Ukraine",
        "SCADA ICS",
        "SCADA ICS attacks",
        "system",
        "lot",
        "things",
        "attack",
        "Mexico",
        "war",
        "phone",
        "kind",
        "yachts",
        "plant"
    ],
    "transcript_entity_values": [
        "1917, 1943",
        "Americans",
        "30",
        "Central and South America",
        "Crimea",
        "50-year-old",
        "20 years",
        "the east coast",
        "Samsung",
        "Iran",
        "German",
        "ICS cyber war",
        "over 200",
        "NATO",
        "overnight",
        "May,",
        "the Boer War",
        "two",
        "Natanz",
        "Europe",
        "about 2000 square feet",
        "tomorrow",
        "OPC",
        "OSINT",
        "YouTube",
        "five-year",
        "the last week",
        "Cabo",
        "Ukraine",
        "2015",
        "Spain",
        "three-day",
        "Software",
        "Linux",
        "Port 502",
        "Iraq",
        "2016",
        "almost 10 years",
        "Elon Musk's",
        "Russian",
        "thousands",
        "Mozilla Firefox",
        "Iranian",
        "Netherlands",
        "Spice",
        "a year ago",
        "David Bombal",
        "the last 50 years",
        "20",
        "article five",
        "Starlink",
        "America",
        "Facebook",
        "about 500 feet",
        "366",
        "Android",
        "a couple feet",
        "TCP/IP",
        "an entire $2 billion",
        "California",
        "Schneider",
        "the last few years",
        "Google Dorks",
        "30",
        "24/7",
        "50 years ago",
        "MarineTraffic",
        "Starlink",
        "Siemens, PLC Siemens",
        "Ukrainian",
        "today",
        "Las Cabos",
        "Texas",
        "Polish",
        "a couple years ago",
        "last week",
        "billions of dollars",
        "Tor",
        "Russians",
        "SIM",
        "IMSI",
        "Kremlin",
        "one",
        "the last 300 years",
        "The Voice of America",
        "Birmingham",
        "Stuxnet",
        "La Dacha",
        "Schneider Electric",
        "Oleg Tinkov",
        "a couple of minutes",
        "England",
        "Siemens",
        "May, 2021",
        "OccupytheWeb",
        "Kiev",
        "January 6th of last year",
        "Voice of America",
        "the Pacific coast",
        "a half a dozen",
        "first",
        "UK",
        "PROFINET",
        "the '80s, '90s",
        "the day",
        "Russia",
        "European",
        "the United States",
        "Ukrainians",
        "a few years",
        "the '90s",
        "Stuxnet",
        "the last couple days",
        "1848",
        "Modbus",
        "years",
        "may 2021",
        "South Africa",
        "Soviet",
        "Catherine the Great's",
        "iPhone",
        "David",
        "2021",
        "IP",
        "NSA",
        "Walmart",
        "40 dollars",
        "Triton",
        "the old Soviet days",
        "2014",
        "South Africa's",
        "Mexicans",
        "thousands and thousands",
        "seven hour",
        "SCADA ICS",
        "the west multiple times",
        "SCADA",
        "Colorado",
        "Putin",
        "'70s",
        "Starlink",
        "US",
        "Afghanistan",
        "a few days",
        "BlackEnergy 3",
        "WhatsApp",
        "AIS",
        "six",
        "millions of dollars",
        "hundreds",
        "Iranians",
        "February 24th",
        "Ensenada",
        "the other day",
        "half",
        "less than a hundred dollars",
        "the Gulf Coast",
        "CIA",
        "Colonial Pipeline",
        "200",
        "seven",
        "American",
        "Census",
        "May",
        "five",
        "One",
        "10 years ago",
        "Mexico",
        "recent years",
        "EU",
        "Tinkov",
        "the '80s",
        "RadarBox",
        "ICS",
        "the Colonial Pipeline",
        "about 200",
        "about 10",
        "a million",
        "French",
        "502",
        "at least 50",
        "OccupytheWeb",
        "Schneider",
        "about a half a dozen",
        "17,000 IP",
        "Twitter",
        "Poland",
        "Soviet Union",
        "the last 100 years",
        "just a few years ago",
        "yesterday",
        "billions",
        "Shodan",
        "Mexican",
        "'44, '45",
        "Germany",
        "50"
    ],
    "transcript_entity_types": [
        "DATE",
        "NORP",
        "MONEY",
        "LOC",
        "GPE",
        "DATE",
        "DATE",
        "LOC",
        "ORG",
        "GPE",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "EVENT",
        "CARDINAL",
        "ORG",
        "LOC",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "GPE",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "GPE",
        "FAC",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "NORP",
        "GPE",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "LAW",
        "GPE",
        "GPE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "GPE",
        "GPE",
        "NORP",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "LOC",
        "ORG",
        "PERSON",
        "TIME",
        "GPE",
        "ORG",
        "DATE",
        "GPE",
        "GPE",
        "DATE",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "NORP",
        "GPE",
        "NORP",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "NORP",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "NORP",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "GPE",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "NORP",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "GPE",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "NORP",
        "DATE",
        "GPE",
        "CARDINAL"
    ],
    "vector": [
        -0.10484164953231812,
        0.007155552040785551,
        -0.055479880422353745,
        -0.0014188826316967607,
        0.05927887558937073,
        -0.0023034957703202963,
        0.04996198043227196,
        -0.003489706665277481,
        -0.07535237818956375,
        -0.019162550568580627,
        0.04280896112322807,
        0.045587148517370224,
        0.058444198220968246,
        -0.03471241146326065,
        -0.04876132309436798,
        -0.023513127118349075,
        0.00980118103325367,
        -0.07048691064119339,
        -0.031486235558986664,
        -0.052404843270778656,
        0.03593353182077408,
        -0.028062883764505386,
        0.05248090997338295,
        0.008819125592708588,
        -0.005332439672201872,
        0.08335493505001068,
        -0.01881466805934906,
        -0.043005798012018204,
        -0.07524661719799042,
        0.03107454627752304,
        -0.03479207307100296,
        0.05989222601056099,
        0.03817484527826309,
        0.005877154879271984,
        0.030780663713812828,
        -0.07086730748414993,
        0.0927196741104126,
        0.04057146981358528,
        0.02367519401013851,
        -0.045733243227005005,
        -0.05383368954062462,
        -0.07802760601043701,
        0.018057025969028473,
        0.01756911352276802,
        -0.08203569054603577,
        -0.041752882301807404,
        0.02045411430299282,
        -0.05982507765293121,
        -0.03043352998793125,
        -0.025672992691397667,
        -0.0826014056801796,
        -0.07020264863967896,
        0.10730896890163422,
        0.031187281012535095,
        0.06060519069433212,
        -0.07271406799554825,
        0.014383763074874878,
        0.005075044464319944,
        0.052094876766204834,
        -0.011485598981380463,
        -0.002751253079622984,
        -0.0223959069699049,
        -0.055573780089616776,
        0.009994877502322197,
        -0.027539722621440887,
        0.020276322960853577,
        -0.05272620543837547,
        -0.004706138279289007,
        -0.010232536122202873,
        -0.03157205507159233,
        -0.034980062395334244,
        -0.038122884929180145,
        0.0011219598818570375,
        0.06674070656299591,
        0.02480214647948742,
        -0.06616769731044769,
        -0.0046430486254394054,
        -0.039926815778017044,
        0.013781581073999405,
        -0.07484572380781174,
        0.11071639508008957,
        -0.021751824766397476,
        -0.05794510990381241,
        0.03508475422859192,
        0.01614263467490673,
        0.0053580524399876595,
        -0.009575098752975464,
        0.019438277930021286,
        0.13779698312282562,
        0.03162253275513649,
        0.023564938455820084,
        0.0331539586186409,
        0.05908879637718201,
        -0.042947281152009964,
        0.09188410639762878,
        -0.032335102558135986,
        0.04634913429617882,
        0.04678313806653023,
        -0.05958512797951698,
        0.023988621309399605,
        0.025278240442276,
        -0.04030203819274902,
        -0.030737169086933136,
        -0.022710060700774193,
        -0.05188601091504097,
        0.032268572598695755,
        -0.031231386587023735,
        0.025800921022892,
        -0.04271680489182472,
        -0.020259283483028412,
        0.030488476157188416,
        0.0110829072073102,
        -0.036131925880908966,
        -0.061510588973760605,
        0.05727269500494003,
        -0.007392843719571829,
        -0.02543199248611927,
        0.04924356937408447,
        -0.07585491985082626,
        -0.02905566804111004,
        0.01858176477253437,
        0.020824965089559555,
        -0.01322047971189022,
        0.034764163196086884,
        0.08469274640083313,
        0.09244576841592789,
        -0.023304440081119537,
        8.029540362973988e-33,
        0.007830782793462276,
        0.07303301244974136,
        -0.11654859781265259,
        -0.002856570528820157,
        -0.030534181743860245,
        0.00019746384350582957,
        -0.07292491942644119,
        0.052499424666166306,
        0.02053917571902275,
        0.11844716966152191,
        -0.032153546810150146,
        0.015857113525271416,
        -0.016937511041760445,
        -0.018066585063934326,
        0.12723839282989502,
        0.010647201910614967,
        0.04905237630009651,
        -0.03141869232058525,
        0.03450891375541687,
        0.05308784544467926,
        0.11688421666622162,
        -0.04025966301560402,
        -0.005030045751482248,
        -0.010691499337553978,
        0.1334638148546219,
        0.01837628148496151,
        -0.026726072654128075,
        -0.0443546287715435,
        0.13194070756435394,
        0.04217587411403656,
        -0.0361655093729496,
        0.002868918003514409,
        -0.059959687292575836,
        0.03570472076535225,
        0.024652404710650444,
        0.03266645222902298,
        -0.030004965141415596,
        -0.12222199887037277,
        -0.060049742460250854,
        -0.017832448706030846,
        -0.033367931842803955,
        0.04110254719853401,
        -0.009593537077307701,
        -0.03897366300225258,
        0.060677919536828995,
        0.010313211940228939,
        -0.012446532025933266,
        0.009033415466547012,
        0.005892097484320402,
        0.03238236904144287,
        -0.09208682179450989,
        0.11238927394151688,
        0.022977711632847786,
        0.004384159110486507,
        0.0038637781981378794,
        0.02118101343512535,
        0.04720208793878555,
        -0.027080994099378586,
        0.0478845052421093,
        0.12178085744380951,
        -0.014254347421228886,
        0.037097133696079254,
        0.010695114731788635,
        0.031230198219418526,
        0.012660369277000427,
        -0.03224574029445648,
        0.02666916884481907,
        0.05512768775224686,
        -0.008173264563083649,
        0.10295356810092926,
        -0.07766985893249512,
        -0.022932488471269608,
        -0.02360859513282776,
        0.07329291105270386,
        -0.05513705313205719,
        -0.014186774380505085,
        0.0007774420082569122,
        0.09015976637601852,
        -0.07586191594600677,
        -0.024468330666422844,
        -0.016372915357351303,
        -0.029234621673822403,
        0.09481261670589447,
        0.051441386342048645,
        0.005069558043032885,
        -0.03552328422665596,
        -0.01024474948644638,
        -0.00827453937381506,
        -0.05901017412543297,
        0.03309924155473709,
        -0.06890817731618881,
        -0.04825970530509949,
        -0.015770412981510162,
        0.07944333553314209,
        -0.09163112938404083,
        -9.670088196972404e-33,
        -0.030073650181293488,
        -0.05085241049528122,
        0.022522786632180214,
        -0.03724684938788414,
        -0.07398815453052521,
        -0.004984757862985134,
        -0.018502382561564445,
        -0.03236055746674538,
        0.004142275080084801,
        0.054780542850494385,
        -0.002831563353538513,
        -0.05606415867805481,
        0.01541528757661581,
        -0.0757954865694046,
        0.06651180982589722,
        -0.05475601926445961,
        0.030582547187805176,
        -0.0473516546189785,
        -0.0741335079073906,
        -0.03749646991491318,
        0.007508476264774799,
        0.10056199878454208,
        -0.01916220784187317,
        -0.01925770193338394,
        -0.002726129489019513,
        0.009388125501573086,
        0.07761958986520767,
        0.04421570152044296,
        0.0018252681475132704,
        0.07940312474966049,
        0.0026834767777472734,
        -0.051737334579229355,
        -0.027580099180340767,
        0.02591850236058235,
        -0.0325339213013649,
        0.055977486073970795,
        0.04699946194887161,
        -0.011045858263969421,
        -0.06400112062692642,
        -0.012051358819007874,
        0.045981500297784805,
        0.05720566213130951,
        -0.07558754831552505,
        0.06532678753137589,
        -0.12817446887493134,
        -0.04332937300205231,
        -0.1332051306962967,
        0.10637903213500977,
        -0.04785577207803726,
        -0.08378928899765015,
        0.03293987363576889,
        0.019110171124339104,
        0.013846865855157375,
        -0.07519710063934326,
        0.003173986217007041,
        -0.023506291210651398,
        0.057892173528671265,
        -0.05878181383013725,
        0.020315879955887794,
        -0.08174261450767517,
        0.02670697495341301,
        -0.030396079644560814,
        -0.017309041693806648,
        0.05028105527162552,
        7.996807107701898e-05,
        -0.053588852286338806,
        0.06184297800064087,
        0.0334370918571949,
        0.016053851693868637,
        -0.02508442848920822,
        0.04009697958827019,
        -0.06483582407236099,
        -0.042397379875183105,
        -0.002110049594193697,
        0.00015153316780924797,
        0.0416182316839695,
        -0.06978094577789307,
        -0.005403502378612757,
        -0.07212959975004196,
        -0.016105754300951958,
        0.06064540892839432,
        -0.08522678911685944,
        0.007013717666268349,
        0.006268161348998547,
        0.06874429434537888,
        0.05118116736412048,
        0.01968795619904995,
        0.02774294838309288,
        0.0433177575469017,
        -0.0314675010740757,
        -0.12966494262218475,
        -0.08519003540277481,
        -0.09796442836523056,
        0.10507337003946304,
        -0.025934835895895958,
        -5.997068086571744e-08,
        -0.0179337989538908,
        0.015958147123456,
        0.02143140882253647,
        0.03110034018754959,
        0.024943850934505463,
        -0.012169178575277328,
        -0.001958176027983427,
        -0.023866064846515656,
        -0.040608443319797516,
        -0.010018665343523026,
        0.05181020125746727,
        -0.03611791506409645,
        -0.051049984991550446,
        0.03896370902657509,
        0.018345681950449944,
        -0.023991664871573448,
        -0.013166354037821293,
        0.015249650925397873,
        -0.028857529163360596,
        0.022395042702555656,
        0.041993726044893265,
        -0.05938011035323143,
        -0.048615965992212296,
        -0.000946881074924022,
        0.0007921418291516602,
        0.020156938582658768,
        -0.047744859009981155,
        0.030979959294199944,
        0.029267972335219383,
        0.05676262453198433,
        -0.03934762626886368,
        -0.08107734471559525,
        -0.008115451782941818,
        0.04774288088083267,
        -0.011757801286876202,
        -0.0018154085846617818,
        -0.03757128491997719,
        -0.07203425467014313,
        0.008042791858315468,
        -0.03275391086935997,
        -0.0814700797200203,
        -0.0738285705447197,
        -0.0033119311556220055,
        0.06054598093032837,
        -0.07286982983350754,
        -0.026613198220729828,
        -0.07853799313306808,
        -0.06902287900447845,
        0.074252650141716,
        0.0009249446447938681,
        0.024454979225993156,
        -0.08313976973295212,
        0.08102613687515259,
        0.0971798375248909,
        0.05657871440052986,
        0.052885524928569794,
        0.05361757054924965,
        -0.061529628932476044,
        -0.04221640154719353,
        0.04341214895248413,
        0.05274348333477974,
        -0.038924407213926315,
        -0.08082624524831772,
        -0.01666373386979103
    ]
}