{
    "id": "UxcXmCwQHWg",
    "title": "My Streaming Setup!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-06-26T22:19:24Z",
    "video_url": "https://www.youtube.com/watch?v=UxcXmCwQHWg",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "lastpass",
        "lastpass login",
        "password",
        "password generator",
        "lastpass chrome",
        "lastpass download",
        "lastpass premium",
        "random password generator",
        "generate password",
        "password manager",
        "recover",
        "lastpas",
        "laspass",
        "lastpass premium features",
        "delete account mobogram",
        "lastpass.com",
        "how secure is my password",
        "last password"
    ],
    "views": 817882,
    "likes": 23175,
    "comments_count": 1290,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today I'm going to take you through my streaming gaming setup. (hip hop music) But first, a huge thank you to LastPass for sponsoring a portion of this video. They've been such a huge part of my digital life for the past several years and a huge supporter of my channel, so thank you guys so much. LastPpass is an app that you can get on your phone, on your computer, on iOS, on Android. It'll remember all of your passwords, all of your usernames. And it's also really incredible because it will auto fill them. But if you need to come up with a new password, it'll auto generate you a complex password, and it'll remember it for you. You'll have unlimited password storage, free cross device sync and password sharing. I'll put a link in the description if you want to check out LastPass and thank you again for sponsoring a portion of this video. Some of you might not know that I've actually been streaming on Twitch for the past couple of weeks, and it's been so much fun. So I thought that I would show you what I'm streaming with and get some of your suggestions on things that I need for the future. But this year is version one of my stream setup. I tried to keep it as simple as possible, but every time I think, \"I'm just going to do something simple. I'm just going to do a little stream.\" It, of course, gets out of hand. What started out as just a simple Twitch stream to talk to you guys and play Animal Crossing has turned into a whole nother thing. It's Tammy, is it Tammy? It's freaking Tammy. Oh, if there's a villager that I could dig and put into a hole, it would be Tammy. I've now been doing morning streams. I started Discord Server. We brought the entire Justin TV crew back from 13 years ago. All of my original moderators, everybody's back hanging out, and we were having so much fun. But I wanted to show you guys what I've been streaming with and my entire set up here, because I've been getting a lot of questions in the chat. So the centerpiece of this entire setup is this monitor. This is a 27-inch Razer Raptor monitor. And what's kind of interesting is I have three different things connected to this at the same time. I have my PC, which is using the DVI input, my 18 core iMac Pro, which I'm actually using to stream off of. I know, shocking. And HDMI port is connected to either my Xbox or my Nintendo Switch. What's interesting about this is I really don't like using dual monitors for things. I like everything to be very central, especially when I'm trying to chat and game at the same time. So what's great about this monitor is I can use picture-in-picture. But this actually has another option. So if I wanted to have my PC on this side and then my Mac over here, I could be using my PC and the Mac at the same time. I know. This is kind of what my screen usually looks like when I'm streaming. I'll have Animal Crossing over here. I have my chat very close nearby, and then also my activity feed, so I can see when anybody subscribes or sends some vits. And then over here is Streamlabs OBS. That's what I am using to stream on from my Mac and the Nintendo Switch. And then under that is my Discord server. So if you guys want to join the Discord, I will also put a link in the description. So make sure you guys go check that out. The camera that I'm using is actually just a webcam. This is the Logitech Brio. It's a 4K camera, so the quality is actually pretty good. I do plan on upgrading this to one of my Sony cameras, but I just haven't yet because it looks good and it's serving its purpose. So I can't really complain. I also have really incredible lighting, so that really does help make this camera look so much better. I'm using three different Elgato key lights. These are amazing because they connect to an app so I can turn these lights on and off at the press of a button. I can control the color temperature. I also have it connected to my stream deck. I have this set up for a few different actions so with the press of a button, I can change from my live setting, which is what you're looking at here, to just chatting. And then I can go to a be right back screen if I have to go to the potty. I keep talking in this microphone like this is the microphone that I'm using. It's not. I can mute the microphone. I have set up all of these different actions. I can mute Discord if I'm chatting with my sister or any other friends when we're playing other games. The microphone that I'm using is the Hypemic by Apogee. You guys have seen me talk about this before, and what's really great is you can also use this and plug it directly into your iPhone, to your iPad. It also has a built in compressor, so it has three different settings. I definitely recommend that if you do get this microphone, you test them out before you just kind of go live. I kind of just keep it at one and call it a day. It's also great because this has a headphone out. I don't have to have an extra long cord. I just put these on, and these are the, oh my gosh, there is a balloon, please hold. I have to shoot that down. Okay, got that. And these are the Razer headphones. I love these. These are really great. They also have a microphone, so you can connect these to Xbox. So I use this when I'm doing gameplay or chatting with my friends when I'm playing Xbox. You can just plug it right into the controller. So these are multi-use headphones, not only for streaming, monitoring audio, but also for Xbox chat and editing. These are, I love these so much. Even though I'm only playing Animal Crossing right now, the controller that I use is the newest version of the Xbox Pro controller, which is amazing. Just, just feels great. And then of course I use a pro controller for playing Animal Crossing. So I have two different keyboards here. This is connected to my PC and this is Razer's, it's their special edition Storm Trooper one, and it also has a mouse to match. The second keyboard I have is connected to my iMac. This is just the Magic Keyboard. And then over here I have a Nomad wireless charging pad. So I throw my AirPods on there. I usually use AirPods but I'm doing Zoom calls because the headphones look a little aggressive when I'm just doing like a conference call or something. So I'll connect these, do my Zoom calls. And let me tell you how incredible. I'm just gonna, I'm just gonna toot my own Zoom horn here. That sounds weird, but my Zoom calls look incredible. I've got a green screen in the back. I can put myself anywhere. My lighting is so on point and the green screen we have is also an Elgato green screen. This thing is amazing because I can either choose to have a green screen or choose not to. (screen snapping) Yeah, so freaking cool. I like this because it gives me kind of just a natural blank background. And I have just one of these NanLites tube lights behind me. And these things are really great because they are RGB. So I could change the color to anything that I want. But I've just kinda been leaving it this simple daylight color. And I think it looks pretty good. Let's put that green screen back up. So I have my PC over here in the corner, and then under here I have my Xbox and my Nintendo Switch. And both the Xbox and Nintendo Switch are HDMI. So I just kind of switch out the HDMI cables between the Nintendo Switch and the Xbox. I feel like I should probably get a switcher. I'm going to add that to my version two list. But for right now, it works pretty well. Got a nice tray of Amiibo here too. I use these when I'm playing Animal Crossing. Have I told you guys that I play Animal Crossing? I'm not sure if you know or not, but I play Animal Crossing. They're my friends, right? Yes, I have a problem. This desk might look good on camera, but it is an absolute nightmare. It's a mirrored desk. It gets so smudgy, especially when you're a gamer and you're snacking, and you're just smudging stuff up being a smudgy person that you are. Maybe you're not, I am. I have to clean it like three times a day. After every stream, every time I sit down. It's such a nightmare, but this again is something that is a work in progress. I love these desks, but I think, I think it might almost be time for them to be retired. I also bought these off Etsy because I would want to place things down, but I didn't want the microphone to hear. And I use them when I have my yerba mate for my drinks. So just act like I have one right there. Or a cup of water, whatever it is that I'm drinking. That's nice because it'll dampen the sound and you won't hear it through the microphone. I do need to get a microphone arm. That's also on my to do list. There's a big list. It's not that big, it's like five things. I want a new gaming chair. This chair is really amazing. It's from Restoration Hardware. But it's not really a practical gaming chair. I do like it though, because I can't spin around. Like, I'm stuck. I have to stay in one position. And just imagine a nice pink gaming chairs. Anyway, I've been enjoying streaming. It's been so much fun. I'm sure some of you guys might remember back in the day, about like 13 years ago when I was on Justin TV and then that later became Twitch. It's really crazy coming back to this community because a lot of the same people are still there. And since then, I've built a very, very amazing audience of really kind, incredible people. And honestly, you guys are so amazing, like just chatting in the Discord server and just hanging out on Twitter and in the chat. It's been really, really fun. So hopefully you guys can come hang out, watch a stream, and meet some of the other incredible people that we have in the IJ Army. My sister and I also started a podcast recently. So all of this stuff can also be found in the Discord Server. So you guys can ask us questions, you can chat with us. And it's really fun because we even have, we have a music station where you can request songs from DJ Mini Matt. Oh gosh, it's so fun. I love it. It's like my new hobby, Discord. Well, I think that's all I have to say. I'll put links in the description to a bunch of the things that I've talked about in this video. The only thing is a lot of this stuff is on back order, or it's going to take a while to ship due to the nature of the availability for things. I mean, who would have thought that there would have been a high demand for webcams in 2020? I don't know, but there was, and they're all sold out. Let me know if you guys have any suggestions for anything else that you think that my streaming setup needs. And I will see you guys in my next video. I look forward to making version two of my streaming setup, hopefully sometime soon. See ya. (mellow hip hop music) (screaming) Give me that, that's mine. You evil witch! You're an idiot, get your own snowball, you pig! Oh my God. I just added K.K. Slider. And he's naked. Amazing, this is amazing. Are you gonna move on to the great unknown, perhaps to Pro Max? You don't know where you're headed? You should go to my island! I've got a little place for you. You were secretly hoping, you'd say that, turbuturr!",
    "transcript_keywords": [
        "Animal Crossing",
        "playing Animal Crossing",
        "guys",
        "Nintendo Switch",
        "play Animal Crossing",
        "Xbox",
        "Discord Server",
        "Discord",
        "Animal",
        "Crossing",
        "streaming",
        "microphone",
        "stream",
        "things",
        "Switch",
        "kind",
        "amazing",
        "playing Animal",
        "back",
        "Nintendo"
    ],
    "transcript_entity_values": [
        "27-inch",
        "Restoration Hardware",
        "AirPods",
        "second",
        "one",
        "iPad",
        "iMac",
        "about like 13 years ago",
        "Nomad",
        "RGB",
        "Justine",
        "Animal Crossing",
        "iMac Pro",
        "the IJ Army",
        "Sony",
        "K.K. Slider",
        "Mac",
        "4",
        "iPhone",
        "three",
        "the Nintendo Switch",
        "Justin TV",
        "2020",
        "Elgato",
        "the day",
        "Pro Max",
        "LastPpass",
        "Razer Raptor",
        "DVI",
        "Xbox",
        "Razer",
        "Twitter",
        "Xbox",
        "18",
        "Twitch",
        "Discord",
        "Storm Trooper",
        "five",
        "13 years ago",
        "Tammy",
        "Xbox Pro",
        "Nintendo Switch",
        "NanLites",
        "today",
        "this year",
        "two",
        "the past couple of weeks",
        "Android",
        "the past several years",
        "Xbox",
        "HDMI",
        "first",
        "Etsy",
        "LastPass",
        "Amiibo",
        "the Logitech Brio"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG"
    ],
    "vector": [
        0.004916382022202015,
        -0.10115700960159302,
        -0.06940480321645737,
        -0.12172935158014297,
        0.030553366988897324,
        0.036122877150774,
        0.041736673563718796,
        0.03661121800541878,
        0.0022289406042546034,
        0.06132660433650017,
        -0.004280102904886007,
        -0.01576203666627407,
        -0.027811450883746147,
        0.0270142313092947,
        -0.016866758465766907,
        0.03362283110618591,
        0.003767932765185833,
        -0.03145844489336014,
        -0.02887693978846073,
        0.01768161542713642,
        -0.022795185446739197,
        -0.10031554102897644,
        0.02365931309759617,
        -0.018259746953845024,
        -0.020677680149674416,
        0.0726199522614479,
        0.02852693945169449,
        0.0496053472161293,
        -0.0667894184589386,
        -0.06888771057128906,
        -0.006514658685773611,
        0.004308765754103661,
        0.08900579810142517,
        -0.023462707176804543,
        -0.004553576000034809,
        -0.0495036244392395,
        0.03572480008006096,
        -0.013760030269622803,
        -0.050174448639154434,
        -0.016007201746106148,
        0.045438047498464584,
        -0.04296133294701576,
        0.01811453141272068,
        -0.049694038927555084,
        -0.07993270456790924,
        -0.07459621131420135,
        0.0008868743316270411,
        -0.03543119505047798,
        0.055056679993867874,
        0.04611390084028244,
        -0.10173846036195755,
        -0.010401388630270958,
        0.005326505750417709,
        0.04059803485870361,
        -0.10904011130332947,
        0.0051650432869791985,
        -0.07142073661088943,
        0.020428940653800964,
        0.05243033170700073,
        -0.09429352730512619,
        0.014282588846981525,
        -0.046770960092544556,
        0.020112648606300354,
        0.05051340162754059,
        -0.06373858451843262,
        -0.06941278278827667,
        0.01988290436565876,
        0.05508992448449135,
        0.005319518968462944,
        0.02070637233555317,
        -0.10669203102588654,
        0.08611045032739639,
        -0.04474277421832085,
        0.02456429786980152,
        -0.009347125887870789,
        0.040386948734521866,
        0.05546404793858528,
        -0.027125760912895203,
        -0.019364364445209503,
        0.06257884949445724,
        0.03892369940876961,
        -0.04005836695432663,
        -0.08165270835161209,
        -0.02562754414975643,
        0.014084100723266602,
        0.035054296255111694,
        0.020878976210951805,
        -0.021943312138319016,
        -0.05771828815340996,
        -0.05439845472574234,
        -0.09647881239652634,
        0.022320527583360672,
        0.014743591658771038,
        -0.012690705247223377,
        -0.014087919145822525,
        -0.011810557916760445,
        -0.02199396677315235,
        -0.06730178743600845,
        -0.03505929559469223,
        0.06593282520771027,
        0.04360734671354294,
        -0.062017589807510376,
        0.015084936283528805,
        -0.01758829690515995,
        -0.0058868881314992905,
        -0.13444210588932037,
        -0.04623449593782425,
        0.0692962259054184,
        0.020617011934518814,
        -0.0073996945284307,
        -0.03602376952767372,
        0.05935807153582573,
        -0.05476841703057289,
        -0.04099339246749878,
        0.025484396144747734,
        0.15327949821949005,
        -0.03924449905753136,
        0.06831405311822891,
        0.0065299938432872295,
        0.03189048543572426,
        -0.025594571605324745,
        -0.09131049364805222,
        -0.016509616747498512,
        0.049568746238946915,
        0.04374086484313011,
        0.0285361148416996,
        -0.04888676479458809,
        1.3027518998743698e-32,
        -0.007195457816123962,
        0.03903823345899582,
        -0.006590716075152159,
        0.0762142613530159,
        -0.01697162538766861,
        -0.03428278863430023,
        -0.0070408303290605545,
        0.1030174046754837,
        -0.05646039545536041,
        0.0013837788719683886,
        0.02652977965772152,
        0.014603935182094574,
        -0.04201135039329529,
        0.06416628509759903,
        0.008668799884617329,
        -0.051944561302661896,
        -0.007751403842121363,
        -0.06352105736732483,
        -0.06842909753322601,
        -0.008493435569107533,
        0.025900045409798622,
        -0.05336703360080719,
        0.019439753144979477,
        0.05063459649682045,
        0.08765697479248047,
        0.08091367036104202,
        0.05604284629225731,
        -0.0058442698791623116,
        0.07747790217399597,
        0.009453496895730495,
        -0.030163444578647614,
        -0.06185373291373253,
        -0.005427428055554628,
        -0.0887347012758255,
        0.02446899563074112,
        -0.011599861085414886,
        -0.06070840358734131,
        0.010786493308842182,
        -0.030431019142270088,
        -0.04174685850739479,
        -0.015856631100177765,
        -0.0032295892015099525,
        -0.08320321887731552,
        -0.07245799154043198,
        0.04410693421959877,
        0.03635203093290329,
        0.06875438243150711,
        0.07325159758329391,
        -0.07324912399053574,
        0.0139165623113513,
        -0.0075142718851566315,
        0.008537914603948593,
        -0.03688928857445717,
        0.043517231941223145,
        -0.0008510012412443757,
        -0.07199378311634064,
        -0.028322527185082436,
        0.0734405443072319,
        0.041567832231521606,
        0.037193458527326584,
        0.02587278187274933,
        -0.015007438138127327,
        -0.02387532964348793,
        -0.02491041272878647,
        -0.05407628417015076,
        0.08115880936384201,
        0.08066583424806595,
        -0.02905253693461418,
        0.07303370535373688,
        0.01975300908088684,
        0.0015871392097324133,
        -0.00691636698320508,
        0.06536489725112915,
        0.05174023658037186,
        0.042943332344293594,
        0.0693713128566742,
        -0.0842234343290329,
        -0.04630057513713837,
        0.02447168529033661,
        0.0016510062851011753,
        -0.09184566885232925,
        0.07485350221395493,
        -0.01455137599259615,
        0.10360858589410782,
        -0.03545766323804855,
        -0.039438750594854355,
        0.027974123135209084,
        -0.031090641394257545,
        -0.05045268312096596,
        0.02017941325902939,
        -0.01472961064428091,
        0.11034109443426132,
        -0.04404042288661003,
        -0.0409669429063797,
        -0.028317632153630257,
        -1.199195108733948e-32,
        -0.005892933811992407,
        0.038682904094457626,
        -0.01174151711165905,
        -0.03937724605202675,
        0.0683278888463974,
        -0.04595283046364784,
        0.03842732310295105,
        0.07195380330085754,
        0.10182829201221466,
        -0.07825491577386856,
        0.04536795988678932,
        -0.09846744686365128,
        -0.1583615392446518,
        0.014904718846082687,
        -0.04790344089269638,
        -0.06265976279973984,
        -0.030476132407784462,
        -0.06945276260375977,
        0.07982191443443298,
        -0.03728179261088371,
        0.04009387269616127,
        0.12713368237018585,
        0.0896066278219223,
        0.012469043955206871,
        0.03875818848609924,
        0.020357469096779823,
        0.033032383769750595,
        0.07787033915519714,
        0.04396023601293564,
        0.03016715683043003,
        0.03128288313746452,
        -0.03270789980888367,
        -0.05911721661686897,
        -0.0295586958527565,
        0.034455809742212296,
        0.03149474039673805,
        0.04166532680392265,
        0.07767467200756073,
        0.011850235983729362,
        -0.04824524000287056,
        0.033499639481306076,
        0.0034802742302417755,
        -0.015052977949380875,
        -0.023039313033223152,
        0.03780796378850937,
        -0.10397567600011826,
        -0.04497835040092468,
        0.014329491183161736,
        -0.0109360720962286,
        0.005323417484760284,
        -0.06337094306945801,
        -0.04938122257590294,
        -0.008242805488407612,
        -0.020989317446947098,
        0.01044886652380228,
        -0.028827019035816193,
        -0.021739201620221138,
        -0.0013998186914250255,
        0.021568259224295616,
        -0.0022798737045377493,
        0.044267263263463974,
        -0.056508228182792664,
        -0.08620534092187881,
        -0.07770243287086487,
        0.016473107039928436,
        -0.05410119518637657,
        0.0996822863817215,
        0.03611581027507782,
        -0.0009129918180406094,
        0.006958325393497944,
        -0.041118647903203964,
        0.01167215034365654,
        0.05922861769795418,
        0.014818277209997177,
        0.05985826626420021,
        0.0010677571408450603,
        -0.09110868722200394,
        0.01054428145289421,
        0.08645616471767426,
        -0.01566486991941929,
        -0.07304398715496063,
        0.0018440561834722757,
        -0.005258816760033369,
        0.044911909848451614,
        0.08656968176364899,
        0.091436468064785,
        0.12827807664871216,
        -0.03718247264623642,
        -0.006712712347507477,
        0.018445003777742386,
        0.03009071946144104,
        0.05038369446992874,
        0.03645606338977814,
        0.1011955738067627,
        -0.09512893110513687,
        -6.087351067662894e-08,
        0.030063455924391747,
        -0.0009263187530450523,
        -0.05657351389527321,
        0.030782245099544525,
        0.0020082162227481604,
        -0.05270634591579437,
        -0.035390760749578476,
        -0.009155575186014175,
        0.06254999339580536,
        -0.09349317103624344,
        0.07821399718523026,
        -0.011928501538932323,
        0.012433478608727455,
        0.10551279038190842,
        0.022450899705290794,
        -0.016921618953347206,
        -0.08313256502151489,
        0.03372255712747574,
        -0.03904183954000473,
        -0.05532845854759216,
        -0.04507668688893318,
        0.07444946467876434,
        0.012551865540444851,
        -0.0017023240216076374,
        0.0490204393863678,
        0.005099741276353598,
        0.050419487059116364,
        -0.04148946329951286,
        0.019890468567609787,
        -0.008218382485210896,
        -0.06812969595193863,
        0.007997863925993443,
        0.003191770287230611,
        -0.0034608698915690184,
        -0.05419519171118736,
        -0.029687045142054558,
        -0.04412069171667099,
        -0.006281269248574972,
        0.005550541914999485,
        0.03341532126069069,
        0.022327052429318428,
        -0.09532355517148972,
        -0.01764822006225586,
        -0.014294556342065334,
        0.023019058629870415,
        -0.03485884889960289,
        0.03847281262278557,
        -0.027023011818528175,
        -0.022927116602659225,
        -0.052486952394247055,
        -0.04242204874753952,
        0.05065019056200981,
        0.04672824591398239,
        -0.04677310585975647,
        0.10505776107311249,
        -0.05176910012960434,
        0.05344027653336525,
        0.05037407577037811,
        -0.018473709002137184,
        -0.023732637986540794,
        0.0339261032640934,
        0.031728021800518036,
        -0.06070984527468681,
        0.022970890626311302
    ]
}