{
    "id": "UxJYU2h86YE",
    "title": "Trying As Seen on TV Tech",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-10-24T16:11:39Z",
    "video_url": "https://www.youtube.com/watch?v=UxJYU2h86YE",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "as seen on tv",
        "mypillow",
        "chia pet",
        "lizardcam",
        "lizard cam",
        "chia",
        "my pillow",
        "wine condom",
        "clapper",
        "clap on clap off",
        "sonic ear",
        "mighty sight",
        "as seen on tv products",
        "as seen on tv commercials",
        "infomercial",
        "commercials",
        "weird tech",
        "tech",
        "technology",
        "gadgets",
        "review",
        "worst gadgets",
        "worst tech",
        "best tech"
    ],
    "views": 191766,
    "likes": 7598,
    "comments_count": 316,
    "description": "As Seen on TV products, good or bad?  Is the iPhone 12 Pro Worth It?  Pixel 5 - I Was Wrong:  iPhone 12 Mini vs iPhone 12 Pro Max:  Do(n't) Buy the Surface Laptop Go:  Why Did Sony Do This?! PS5   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/crjVuHr-j4M",
        "https://youtu.be/5dE9gwwMoKY",
        "https://youtu.be/PjaQ96i_BkE",
        "https://youtu.be/hsGLMAquEaY",
        "https://youtu.be/RlBbKV1D-Co",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is. Where we're taking a look at as-seen-on-TV products, but first, Matt, time to start drinking at work. - I've been waiting my entire life for this moment. Let me see here, what'd you got? Oh! Oh. - I'm sorry, I'm not a wine connoisseur over here. - I mean I'm definitely a red person myself. So while I queue up our first product. - (chuckles) Matt, you're not, you're not. - So sometimes after your Friday night, you need to move the night back home. So what do you do with the rest of that wine bottle? You pull out your Wine Condom. So they come in a box. I love that they are actually just condoms. - Like (laughs) it's just, look. - Okay, so this is the point where I pull it, right? - Yes. - Okay. Do I just pull straight up? I feel like I need a little, it's not like a...like a little hook you got right here. I just pull it? What a great pour you have there, Matthew. If only we had some way of solving our empty wine, oh no. - Give you that So if we pull this out. (laughing) - Wow, - You take the wine condom. - It actually looks really tight. - It is it's very tight. - I'll hold it for you and you just like, just wrap it around. - Thank you for holding this while I put on my condom. - Okay. Oh, Oh. - Make sure there's no holes in your condom. - Yep. - So you just roll that down and bam, you're good to go. - Alright, so did we do the test? - Yeah, we got to do the test. - Oh, well it gets a little, a little bulbous. As it fills up It's a little bit much. - A little bulbous. - It's okay, it's fine. - Like a true condom has got a little bulbous at the tip. - Cheers to being a little bulbous my friends. - Cheers. - As seen on TV, wine condoms - Totally works. - Wait, wait, are these really, as seen on TV? I don't see any as seen on TV - In this pack for $15, - $15? - You get six wine condoms. So it's actually a little bit cheaper just to get regular condoms. (both laughing) I don't know what I'd be more embarrassed to get at at like Walgreens. Would I do regular condoms or the wine condom? - Wine condoms, for sure. - Yeah - Always use protection kids As you continue to drink, why don't we move on to our next item in as seen on TV land what's the Mighty Sight? - So the Mighty Sight, you have glasses. - I do. - Yeah 'cause you don't have bionic vision. - Not yet. - I do have bionic vision, but sometimes I wish my bionic vision could be even better. What these are. Oh, wait Holy (beeps) They're actually like prescription. If you hold them out - I'll just put them on - Yeah, like how magnetite they are. - Okay, here we go. Ready and wait. Are these supposed to be used through your glasses? - No. - I feel like it said something about that. - This is advertised 160% magnification. Hands-free magnification, ultra bright LEDs, optical quality HD lenses, and rechargeable with a included Micro USB cable. - I feel like the wine's kicking me. - You're not gonna be walking around, wearing these. As I proceed to wear them for the rest of the episode. - Are you really gonna do that? - I mean, I think I have like, they do work. This looks huge to me right now. This condom is huge. - I hear that all the time. - So I can't read this, but now like this legit actually really helps me read this text. - So is it fair to say that this as seen on TV product is actually worth it, as the kids say? - Worth it, no. - How much was it? Like 20 bucks? - I don't remember. - You're so bright when you look at me, its like wine - Couldn't hear you over the sound of our next product. - Which is? - The Magic Ear. - No way. So this is just a radio with like a microphone in it and headphones. Oh, it's disguised as a pocket radio. - Disguised as a radio. - What's portable and discreet. So nothing's more discreet than an entire radio. - I remember when I first saw this, it was just like a giant Bluetooth headset. - Did you get click baited, man? - I don't remember. - Okay look how dumb this is. It has looked a little number on as if its like your radio station as if that's cool. All right, let's plug this in. I'm gonna improve my hearing. Do you have any idea how much this was? - No, I can look these up - Ah, who cares? As seen on TV means it's available for three monthly payments of 1999 so - Right before we started I said Austin, are you gonna wanna know the pricing of this? - No, I don't wanna know - And he's just like, no And then he's asked me every time. - I have asked if you have it off hand, - You know our thumbnail with like, should you switch to Chrome? - Yes - You have a giant head in that. - Yes. - That's what you look like in real life right now with these glasses - I think this is the micro here, let me try. Ow. Yep. That's the mic ow. It's so loud. - Is it loud? - It's on eight and it's very loud. Ow, Ow, it's beeping at me. Don't do that. So the idea is that you say, Ow, I don't touch the mic. Okay. So I like clip it to my belt like a cool oldster. I'll turn up my volume and then I can hear people talk. So I'm going to talk, talk, talk, talk, talk. That just sounds terrible. - So like, I remember that they were advertising that like you could hear, it was like for old people who had hard of hearing, - God, that's really weird to talk into it. I shouldn't do that. I shouldn't do that. You wanna try this? - No. - You shouldn't. - I mean, if I do, if I do try it, I will be literally the bionic man. I could see, I could see and hear. - Basically what's happening with the magic here. There's the microphone here. It is just being very heavily amplified into the headphones. So it doesn't sound good at all. Right. It sounds like you're listening to the world through a really crappy speaker or really crappy pair of headphones and this stupid magic here. - So skull candies. I want to use it like in a real scenario. - Okay. How's it going? My friend. I'm speaking in a slightly above average tone of voice right now, and you're all the way down at three. So if you really want the full experience, you can blow your eardrums out at a level nine. - It goes to the 15. - Don't do 15. - I can hear that West is going. I can't make out what he's saying. And he is pretty far away from me, but I am the bionic man. Moving on to our next product. I feel like I'm talking way louder than I was before, but it wouldn't be an as seen on TV episode without. (claps) The clapper. - I've never owned the clapper in my life. - It's you don't need to. - Okay, cool. Thank you very much for watching this episode of This Is. Thank you very much for subscribing to the channel for lots of wonderful content like this. - Right off the bat. The first thing that I immediately notice about this, it is not changed since like the eighties. When I first started seeing them. - But man, you got a winner, you better stick to it. Who needs? (beep) Hello? (beep) What's up Siri. Nobody needs any of that. - Every one of our comments now is just \"Austin set off my smart device\". In prepping for this video, we looked into like, okay, we got to get power cable to hook something up for this. And we look there is no grounded socket. - Have you ever actually used one before? - Yeah, I have. - Oh really? What did you use it for? Like legitimately. - My aunt had one. I gotta be honest. It is way smaller than I thought it was going to be. - So just to be clear, if you look behind us, you'll see the little gumball light it's on. So if I go. (claps) (claps) (claps) - Nothing's happened yet Matt. - Let's go to the, let's go to the top one. Then. (claps) - Nothing is happening to the light behind me. - But it just turned off. - It was already off. It was off as soon as you unplugged it. (claps) I hear it clicking. I have no idea what's supposed to happen right now. (claps) This is the worst episode of This Is yet. (laughs) That's saying something. - All right. Should you buy the clapper? No, because it's been broken in the box since the eighties. (beep) - How do you turn off my lights? Perfect. At least something works in the studio. - To redeem having an as seen on TV episode. What we have to do with the chia pet. (sound of crickets) Easy to do, fun to grow. How much work is a chia pet? I've never had one. - Nothing, like it's actually a lot of work. - We're not doing this right now. - Yeah, we are. - No we're not. - You want to build an entire chia pet? Or plant an entire chia pet? - It seems to be like so much like this right here, it's just a spacer in here in the box. I'll read the I'll read these because I'm the bionic man. - You are. - Separate container, mix two teaspoons of chia seed. (Austin snores) If you have added too much water or not enough seeds, the mixture is too runny. - So as seen on TV, planting an entire pet, I guess. - We are definitely going to keep the llama on the back there. - All right, I'll move it. I'll move it. I'll do it right now. - He's going to keep Roboraptor company. Roboraptor do not eat llama. Bring that back. I have the perfect thing for it. The perfect thing is our next product. The lizard cam. - Oh, it's also made by the makers of the atomic beam. - The izard cam, while sounding super bad-ass, is nothing more than a drain camp. - Is that, is that for? Where are you supposed to put that? - This is just an endoscopic camera. I can't always be bionic with the eyes I have, but with this. - Let's stick this up my nose. - Oh no. Oh no. - We're going in boys. We're going in. (laughs) That's so stupid. - You should, The order of operations for this was the wrong way. For the record, the viewing angle is on this screen is so terrible I can't see a single thing that he's doing right now. - Let's go inside the llama. - Yeah. I want to see what's inside the llama. I mean, but like that's trippy. Have you ever seen the inside of a not broken llama? - I'm out of orifices to pro - Oh, we are not out of orifice. Here's how we do this, okay? - Okay. I need to go fish this screw out. Yeah. All right. We're going in boys. Where are we dropping? Okay, we're going down. That screw will never be found again. What a wonderful accessory. - It has a little hook as well. - This is actually kind of cool because it gives you a perspective on the world that you never really see. - There are a lot of these cameras on, like, you can get on Amazon, that honestly are going to have a lot more features. Like some of them connect to your phone. But if you just want something for like your toolbox, this is not a bad thing. - What is our next item Matthew? - Our final item is MyPilllow. No, we didn't go to my house to get this. This is actually what it's called the MyPillow. - Why? What is, what is special about the MyPillow? - It is guaranteed the most comfortable pillow you'll ever own. - What, what makes the pillow special Matt? Are you a firm pillow sleeper? Or are you a soft pillow sleeper. - You might not know this about me. - I don't. - I actually have like 10 pillows. - Okay. - I like to, When I sleep, I like to give myself a pillow for. - What makes this pillow special. I don't understand. - It's supposed to be the most comfortable pillow you'll ever own. I thought they'd like vacuum sealed it. - No, that's just the pillow. - That is the - What a sad pillow. - That is the saddest pillow I've ever seen. This is just shredded mattress in here. (laughs) - It does feel like it. Do you wanna try to lay on it? - I don't want to lay on this. Is that the most comfortable pillow that you'll ever own? - No. - I want to know what's in it. - Okay. - Can we, can we cut it open? - Live your best life, man? How much was the MyPillow? $1999? $1999? - I'm assuming, - I feel like that sounds like a 1999 product. Oh, wow. Okay. Yikes. You do that with ruthless precision. Inside there is a yeah. It's mattress, just mattress. - It's just shredded up foam. - Yeah. We're going to put this back inside the pillow now. And we're going to throw this straight in the trash because it's going to be a giant mess in the studio. Well, thank you very much for watching this episode of This Is. Make sure to subscribe to the channel because hopefully we'll never do another one of these as seen on TV episodes again. But until the next episode where we inevitably have to buy something dumb on Amazon Matt, try to play us out? - Clap on, clap off. The clapper. (claps) (beep) (relaxing music)",
    "transcript_keywords": [
        "wine",
        "pillow",
        "Wine Condom",
        "Yeah",
        "Condom",
        "condoms",
        "episode",
        "bionic",
        "hear",
        "talk",
        "Matt",
        "product",
        "man",
        "feel",
        "wine condoms Totally",
        "pull",
        "bionic man",
        "pet",
        "chia pet",
        "radio"
    ],
    "transcript_entity_values": [
        "one",
        "Walgreens",
        "three",
        "15",
        "nine",
        "eight",
        "two teaspoons",
        "six",
        "Micro USB",
        "Matt",
        "1999",
        "Ow",
        "MyPillow",
        "160%",
        "monthly",
        "15",
        "Austin",
        "Friday night",
        "Siri",
        "Matthew",
        "Amazon",
        "Chrome",
        "Roboraptor",
        "West",
        "10",
        "the eighties",
        "first",
        "20 bucks",
        "MyPillow",
        "MyPilllow"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "LOC",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "MONEY",
        "PRODUCT",
        "PERSON"
    ],
    "vector": [
        -0.057919856160879135,
        -0.013526028953492641,
        0.053211621940135956,
        -0.08501941710710526,
        0.08057788014411926,
        0.026655910536646843,
        0.13728684186935425,
        0.044276006519794464,
        0.05068763718008995,
        -0.00733164232224226,
        0.02890959568321705,
        0.050225310027599335,
        -0.06849465519189835,
        0.035675257444381714,
        -0.01910395361483097,
        -0.057036254554986954,
        0.038785841315984726,
        -0.07166098803281784,
        -0.08509337157011032,
        0.044832129031419754,
        0.002350610913708806,
        -0.08061695843935013,
        0.026024626567959785,
        0.013446029275655746,
        0.07999184727668762,
        0.05786244943737984,
        -0.01607564650475979,
        0.036882683634757996,
        -0.05058792978525162,
        -0.018000617623329163,
        -0.03010755591094494,
        0.06553616374731064,
        -0.019194835796952248,
        -0.04977196082472801,
        -0.08508358150720596,
        -0.0967370867729187,
        -0.0017244723858311772,
        -0.016398895531892776,
        -0.048031799495220184,
        -0.016590800136327744,
        0.07406002283096313,
        -0.05994987115263939,
        -0.047759998589754105,
        0.09850385040044785,
        0.04385398328304291,
        -0.007770951371639967,
        0.027608796954154968,
        0.0536404550075531,
        0.0430736280977726,
        -0.024925142526626587,
        -0.07654889672994614,
        0.02816690318286419,
        -0.039100531488657,
        0.008471230044960976,
        0.0023328971583396196,
        -0.01088833250105381,
        0.0938800796866417,
        0.03340364247560501,
        0.0846724882721901,
        0.027028951793909073,
        0.08361349254846573,
        -0.09062060713768005,
        -0.012413378804922104,
        0.1184917613863945,
        -0.02919539250433445,
        -0.03303563594818115,
        -0.03257068991661072,
        0.07736343890428543,
        -0.039686962962150574,
        0.06339669972658157,
        -0.10053090751171112,
        0.023177629336714745,
        0.05919263884425163,
        0.03961113095283508,
        0.017508484423160553,
        -0.05070970207452774,
        0.07823985069990158,
        -0.10347603261470795,
        -0.06586096435785294,
        0.09207849949598312,
        0.024413149803876877,
        -0.0010047313990071416,
        -0.07654011249542236,
        0.03352714329957962,
        0.005563069600611925,
        0.0014824008103460073,
        0.00517473416402936,
        0.02401609718799591,
        -0.03680907562375069,
        -0.06295674294233322,
        -0.12756283581256866,
        0.044192805886268616,
        -0.038491129875183105,
        -0.00841961707919836,
        -0.016780829057097435,
        -0.056008219718933105,
        -0.021840881556272507,
        -0.05939474701881409,
        -0.0170148778706789,
        0.04882808029651642,
        0.023008689284324646,
        0.012135489843785763,
        0.044073473662137985,
        -0.08857531100511551,
        -0.026318887248635292,
        -0.023306213319301605,
        -0.09166261553764343,
        0.03751593828201294,
        0.07197241485118866,
        0.06751807779073715,
        -0.10286925733089447,
        0.05319158360362053,
        -0.031522080302238464,
        0.006799863185733557,
        0.015352915041148663,
        0.03518705442547798,
        -0.05329689383506775,
        0.04393292963504791,
        0.023377573117613792,
        -0.056351348757743835,
        -0.02542448230087757,
        0.027827609330415726,
        -0.020693957805633545,
        -0.028924621641635895,
        -0.001452190917916596,
        -0.07331225275993347,
        0.07493700832128525,
        7.678138081739173e-34,
        -0.0269238892942667,
        0.029461588710546494,
        -0.010971007868647575,
        0.03193129971623421,
        0.04106386750936508,
        -0.012185794301331043,
        -0.023420970886945724,
        0.09686349332332611,
        -0.004788453225046396,
        0.021405266597867012,
        0.026124712079763412,
        -0.085543192923069,
        -0.09508747607469559,
        0.02539200149476528,
        0.030827129259705544,
        0.01761465147137642,
        0.015853574499487877,
        -0.08494351804256439,
        -0.07833685725927353,
        0.0031840151641517878,
        0.023599114269018173,
        -0.03113643266260624,
        -0.004815410356968641,
        0.014868443831801414,
        -0.0791580080986023,
        0.05943235382437706,
        0.007701393682509661,
        0.03864585608243942,
        0.0658007562160492,
        0.0034035081043839455,
        -0.09561622887849808,
        0.025489697232842445,
        0.003988135140389204,
        -0.02565598301589489,
        -0.008973577991127968,
        0.00933812465518713,
        -0.03149986267089844,
        -0.07404246926307678,
        0.08624858409166336,
        -0.03502596914768219,
        -0.0959198996424675,
        0.09930863231420517,
        0.00019722717115655541,
        0.04910222813487053,
        0.022535109892487526,
        0.010922381654381752,
        -0.0025120682548731565,
        -0.007611963432282209,
        -0.049239516258239746,
        0.038366083055734634,
        -0.045265622437000275,
        0.030509082600474358,
        0.06372097134590149,
        0.03145935758948326,
        -0.07236281782388687,
        -0.009092576801776886,
        -0.002308227587491274,
        -0.0165104977786541,
        -0.011152644641697407,
        -0.03534427657723427,
        0.027134452015161514,
        -0.006543776486068964,
        -0.04261893779039383,
        0.047270517796278,
        -0.12130806595087051,
        0.06998054683208466,
        0.10232467204332352,
        0.0156785286962986,
        -0.0016750077484175563,
        0.002097103977575898,
        -0.057000067085027695,
        0.10641011595726013,
        -0.026780955493450165,
        -0.07643608003854752,
        0.00464181462302804,
        0.0270458422601223,
        -0.031478989869356155,
        -0.06626326590776443,
        0.024158215150237083,
        0.022471070289611816,
        0.003149532712996006,
        -0.0030349078588187695,
        0.002377189928665757,
        -0.01883293315768242,
        -0.0752396211028099,
        -0.03301423043012619,
        -0.003455771366134286,
        -0.10936461389064789,
        0.05535006895661354,
        0.05059900879859924,
        -0.057404130697250366,
        -0.07719070464372635,
        0.03925914317369461,
        -0.01454250793904066,
        0.03964885324239731,
        -3.15508634700853e-33,
        0.062002699822187424,
        -0.10246764123439789,
        0.020580118522047997,
        -0.040894243866205215,
        0.01675374060869217,
        -0.07018633931875229,
        0.0242612361907959,
        -0.025212014093995094,
        -0.04454691335558891,
        -0.040292248129844666,
        -0.031470246613025665,
        0.036596767604351044,
        -0.06184869259595871,
        0.04859056696295738,
        0.01632094569504261,
        -0.032020073384046555,
        0.04024423658847809,
        -0.002166040940210223,
        0.02309832163155079,
        -0.014824959449470043,
        0.07868744432926178,
        0.08543211966753006,
        -0.01790807954967022,
        -0.007115215063095093,
        -0.05171860009431839,
        0.005186502356082201,
        0.02252531424164772,
        0.026560470461845398,
        -0.019250158220529556,
        -0.004441127181053162,
        0.06545388698577881,
        -0.08730936795473099,
        -0.0779036208987236,
        -0.019511979073286057,
        0.056174445897340775,
        0.09313523024320602,
        0.014424560591578484,
        -0.026738865301012993,
        -0.08719026297330856,
        -0.06183360889554024,
        0.12386815249919891,
        -0.024949833750724792,
        -0.08169034123420715,
        -0.028439808636903763,
        0.03512496128678322,
        -0.012742218561470509,
        -0.08365999162197113,
        0.015288054943084717,
        -0.02910505048930645,
        0.06166840344667435,
        0.09147580713033676,
        0.06197772175073624,
        -0.08647357672452927,
        -0.02867581881582737,
        -0.057358913123607635,
        -0.07150047272443771,
        0.02519284002482891,
        0.005156473256647587,
        -0.015052041038870811,
        0.003967419266700745,
        0.04595360532402992,
        0.032267455011606216,
        -0.1302451193332672,
        -0.0483161136507988,
        -0.059981267899274826,
        -0.00634808512404561,
        0.09218928217887878,
        0.058692771941423416,
        0.028049100190401077,
        -0.03019815683364868,
        -0.01562855951488018,
        0.03385048359632492,
        -0.025435414165258408,
        -0.037219803780317307,
        -0.026922469958662987,
        0.02214314602315426,
        -0.10890968143939972,
        -0.03014693595468998,
        -0.05033199116587639,
        -0.010830484330654144,
        -0.02354346588253975,
        -0.04592658951878548,
        0.0682324469089508,
        0.08609836548566818,
        0.039876796305179596,
        -0.02140006609261036,
        0.028882667422294617,
        0.0077909003011882305,
        -0.07597552239894867,
        0.03507642447948456,
        0.00020469805167522281,
        0.019537920132279396,
        -0.032124586403369904,
        0.06503729522228241,
        0.05907195806503296,
        -6.475202241063016e-08,
        0.04253728687763214,
        0.016989074647426605,
        0.06978104263544083,
        -0.01986193284392357,
        -0.011561344377696514,
        -0.057682715356349945,
        -0.052786294370889664,
        0.0065414696000516415,
        0.0790860652923584,
        -0.03417057543992996,
        -0.0037056468427181244,
        -0.01998027041554451,
        0.026962684467434883,
        0.051105234771966934,
        0.04069368168711662,
        0.1270006150007248,
        -0.02660040371119976,
        -0.0267180185765028,
        -0.02005131170153618,
        -0.005112818907946348,
        -0.010747433640062809,
        0.032085102051496506,
        -0.003920220769941807,
        -0.00011890881432918832,
        -0.010291160084307194,
        -0.008600529283285141,
        -0.023668861016631126,
        0.046405158936977386,
        0.09835950285196304,
        -0.021522710099816322,
        -0.008084970526397228,
        -0.024374214932322502,
        -0.032320357859134674,
        0.047104574739933014,
        0.01937904767692089,
        0.005699605215340853,
        0.027580054476857185,
        -0.019786376506090164,
        0.07409795373678207,
        0.05529323220252991,
        -0.025062715634703636,
        -0.15314295887947083,
        -0.053175684064626694,
        0.01979094371199608,
        -0.037660151720047,
        0.0051434882916510105,
        -0.026303963735699654,
        -0.08160685002803802,
        -0.010408915579319,
        0.025840379297733307,
        -0.003809582907706499,
        -0.005336268804967403,
        0.02721608430147171,
        0.025925522670149803,
        0.05063728615641594,
        -0.010460876859724522,
        0.029954561963677406,
        -0.032403308898210526,
        0.02091952972114086,
        0.03612908348441124,
        0.06411231309175491,
        -0.040687598288059235,
        -0.0029711395036429167,
        0.04644795134663582
    ]
}