{
    "id": "UXNjNIn0DU4",
    "title": "How to photograph wildlife you can't see",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-02-16T15:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=UXNjNIn0DU4",
    "category": "Science & Technology",
    "tags": [
        "the verge",
        "becca farsace",
        "full frame",
        "photography",
        "camera trapping",
        "camera",
        "nature",
        "wildlife",
        "wildlife photography",
        "nature photography",
        "cats",
        "fox",
        "best camera",
        "camera set up",
        "camera rig",
        "deer",
        "funny cats",
        "cute cats",
        "camera trap",
        "nature documentary",
        "nature sounds",
        "photography basics",
        "learn photography for beginners",
        "how to learn photography",
        "photography tips",
        "how to",
        "catskills",
        "brooklyn",
        "new york",
        "hands on",
        "review",
        "technology",
        "tech",
        "tech news",
        "verge",
        "wildlife 4k"
    ],
    "views": 164223,
    "likes": 6369,
    "comments_count": 285,
    "description": "When I think of wildlife photography, I think of telephoto lenses on expensive cameras in the Sahara desert. That was until I saw the wildlife camera trapping that Carla Rhodes was doing. I knew I needed to try it for myself in Brooklyn, NY.    The Verges sponsors play an important role in funding our journalism, but do not influence editorial content. For more information about our ethics policy, visit   Read more:    Carla Rhodes:    Dan Yacobellis:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:   #photography #theverge #fullframe #beccafarsace",
    "description_links": [
        "https://www.theverge.com/ethics-statement.",
        "https://www.theverge.com/e/22690115",
        "https://www.carlarhodes.com/",
        "https://www.instagram.com/misscarlarhodes/",
        "https://www.tamakocewildernessprograms.com/",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So this is me nose deep in a sapling. It kind of smells like rubber. - [Dan] Like rubber? Do it again. - 'Cause I'm wrong? I'm trying to figure out what peed on it. - Oh, that's totally a skunky smell. - I had seen these photos a few months ago and I needed to know how, which led me to the Catskill Mountains and my nose centimeters away from an animal marking. It's kind of nice. - I love the smell. - [Becca] Welcome back to Full-Frame, buds. This is what I think of when I hear the words wildlife photography. Powerful animals photographed using long lenses and absolutely epic environments. But sometimes getting an amazing wildlife photo requires a different approach. - I really like this show because it's hosted by Becca Far-cha-cha-cha-cha-cha. - I'm Carla Rhodes. I specialize in wildlife conservation photography and I absolutely adore camera trapping. (camera shutter clicking) I got my first DSLR camera in 2015. I was pursuing comedic ventriloquism. - Hello, my name is Keith Richards, you know, and I'm like an alcoholic (indistinct). - Keith, Keith, wrong meeting. - All right, rock and roll. - So I got the DSLR to actually make videos, and my husband and I had moved up to the Catskills around that time. And I just started photographing nature up here. (camera shutter clicking) I just got really into it. You know when you find something and it just like grabs you by the throat, but in a nice way? In the fall of 2019, I got the camera trap set up that I use now. - [Becca] Camera trapping is the process of leaving a camera and a trigger system out in the wild in hopes that an animal will walk by, trip the sensor and then be captured by the camera. The camera is typically kept in protective housing. And when done ethically, the flashes are placed well above the animal's eye line. You can trigger the system in different ways, but one common way is by using a passive infared sensor, or a PIR sensor, which typically detects abrupt changes in heat in a coned area, then triggers the camera and flashes. Another popular method uses a break beam, which requires a transmitter and a receiver to form an invisible beam that when broken by, hopefully an animal, triggers the system. - I've really leaned in the camera trapping because I find it's extremely challenging. And it's a way to show wildlife through a different point of view. You can get shots that you just can't get, even with a telephoto lens. - [Becca] I asked Carla if she'd be willing to teach me how to do all of this. And while she agreed, she also insisted that I talk to one more person, because as it turns out, getting all these photos takes a lot more than just knowing what gear to use. That's Dan Yacabelis. - [Dan] I got something cool here. - [Becca] He's the founder of Tamokoce Wilderness Programs and he's trying to teach me a bit about track and sign. - One toe here. Another toe there, another toe there - Track and sign is the art of looking for wildlife signs and patterns to try to understand where animals might have been or where they might soon go. - I realize if you really study track and sign, it makes your success rate for your photos go way up. - [Becca] So we hiked around the Catskill Mountains for about three hours, looking for clues. - Two and three eights by one and seven eights. Perfect range for a red fox. We have a deer bed right here and, yeah, this is a hoof. - [Becca] And we landed right in front of a very small sapling. - These little green saplings, foxes just love 'em. - [Becca] Which Dan then insisted I smell. - You wanna give it a breath, like a hot, a nice warm breath, and then take a nice sniff in. - Kind of skunky? - There you go. That's, that's a red fox. - [Becca] The pee of a red fox, to be clear. We decided to place a camera trap at the sapling because all signs led to a red fox being there. It was cold, it was wet. It got dark, but we got a trap set. And then I went back to Brooklyn to set a trap of my own. There's this little black cat that lives in my backyard. And although I've never met him, I am absolutely in love with him. After learning about camera trapping, I made it my goal to take awesome photos of this little dude. First, some track and sign. I set up a $20 Wyze cam facing the backyard so that I could find the exact paths that he walks to better place my camera. While I let that sit and collect data, I gathered my gear. I spent most of my budget on a Cognisys scout camera box and break beam trail monitor, because they both have long battery lives and they seamlessly talk to each other. I chose the break beam as opposed to the PIR sensor because its straight break line makes for an easier place to focus my camera. But by going with Cognisys for all of this, it meant that I couldn't spend as much money on a flash system. Carla recommended that I start out with two Nikon SB-28 speedlights. But because they're discontinued, I had to order two used ones from KEH in Adorama. I never in my life did I think I would be picking up a Nikon SB-28 flash from Adorama in 2022. They came out in the early 2000s, but because they have a sleep mode and a quick wake-up time their battery can last a lot longer out in the field. I also ordered two sets of Yongnuo wireless flash triggers so that the SB-28s could talk to my camera. And then I had to order rechargeable batteries for all of that. And then finally I decided I would put a Canon 7D and a Canon 16-to-35 millimeter F2.8 lens in my box. I have a 5D Mark IV that I would later use, but at first I was a bit wary of leaving so much money outside in Brooklyn. I set everything up in my house and it took me about four hours to get it all working. It just works. Oh my God. Okay, okay, okay, okay. But I don't think it would've taken me quite as long if I wasn't also filming myself doing it. Wow. So after setting everything up, I took one more look at my Wyze footage to pick a spot. Just about every day, the cat would come to this little hut that we made him for the winter. And he'd always come right down the middle of the yard. And luckily it had just snowed, so I had the paw prints in the snow to back me up. Carla had all sorts of gorgeous mounts for her flashes and cameras, but here in Brooklyn, I used a lot of twine, trees and bricks. Carla also taught me a lot about ethics. And although I think a flash would be more effective at a lower height, I don't wanna hurt the cat, so I put the flashes well above his eye line. I fired off a few test shots once it got dark and I waited. All right, good morning. This is my first night of leaving the trail cam out. Oh my God. - Oh, man. Oh, man. No, it's like way too dark. No. And for the next five days, every morning was a bit like that. Batteries would die and the flashes wouldn't go off. So the image was super dark. Or the cat would be slightly out of frame. Or the only photos on the card were of me setting up the night before. The best photo I got of the little black cat was from the first night, when he looked directly to camera. But then something unexpected happened. I think we're at like day five, day six. Anyway. - What? Look at this. I've never seen this cat before in my life. A whole new subject stumbled through my trap. A cat I had truly never seen before. And he was pretty freaking cute. But little did I know, there was another surprise yet to come - [Carla] Oh my God, you're not gonna believe this. We got the fox sniffing the pee tree. - [Becca] Three weeks after placing our camera trap, the red fox stumbled on through. Initially I got this feeling of satisfaction, knowing that all of the track and sign we did was worth it and correct. And then I realized, holy hell, I was there. And I was surrounded by amazing animals and wildlife that I will likely never see with my own eyes. And with that came a deep desire to show everyone I know this one photo of a beautiful red fox and explain that they are here and that they love saplings and that their paws are around two and three-eighths of an inch wide. And most importantly, that their pee smells skunky but it also, it kind of smells good. You see camera trapping is like leaving a photo booth out in the wild. And when you stop and look for all of the animal signs, you get the right gear, and then you let the animals take photos of themselves, you get a much better view into the hidden world that exists all around us. And with that, thank you for watching. My name is Becca Farsace and I am the official feral cat photographer from Brooklyn, New York. So Full-Frame has been truly getting the glow up as of late and I'm having a blast. But what do you think, bud? Let me know down below. More of this? More of this, right? Yeah. And Dan, Carla, I couldn't have done this without you so thank you so much for all of your time and your knowledge. I really, really appreciate you. That's it, bud.",
    "transcript_keywords": [
        "camera",
        "camera trapping",
        "red fox",
        "cat",
        "camera trap",
        "Carla",
        "fox",
        "photos",
        "wildlife",
        "track and sign",
        "red",
        "animal",
        "trap",
        "Catskill Mountains",
        "sign",
        "track",
        "Brooklyn",
        "set",
        "trapping",
        "animals"
    ],
    "transcript_entity_values": [
        "2015",
        "New York",
        "SB-28s",
        "Three weeks",
        "Full-Frame",
        "Carla",
        "one",
        "around two and three-eighths",
        "Becca Farsace",
        "5D Mark IV",
        "three",
        "Dan Yacabelis",
        "Cognisys",
        "20",
        "DSLR",
        "Nikon",
        "Adorama",
        "five, day six",
        "the winter",
        "the night",
        "the Catskill Mountains",
        "a few months ago",
        "Tamokoce Wilderness Programs",
        "the fall of 2019",
        "Cognisys",
        "the early 2000s",
        "Canon",
        "First",
        "a Canon 7D",
        "Yongnuo",
        "Keith Richards",
        "the next five days",
        "two",
        "Two",
        "Carla Rhodes",
        "about four hours",
        "Brooklyn",
        "Catskills",
        "KEH",
        "every morning",
        "about three hours",
        "first",
        "PIR",
        "Becca Far-cha-cha-cha-cha-cha",
        "seven",
        "Dan",
        "millimeter",
        "SB-28",
        "Keith",
        "the first night",
        "2022"
    ],
    "transcript_entity_types": [
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "LOC",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "GPE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "GPE",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "TIME",
        "DATE"
    ],
    "vector": [
        0.006006799638271332,
        -0.02962491288781166,
        0.08405464887619019,
        0.0035167112946510315,
        0.14993156492710114,
        -0.11540639400482178,
        0.0217290036380291,
        0.04134171083569527,
        0.04328126832842827,
        0.06512007862329483,
        -0.013357439078390598,
        0.0007932734442874789,
        -0.004340305458754301,
        0.13067626953125,
        -0.0076051680371165276,
        -0.012604936957359314,
        0.05543236806988716,
        0.00709149893373251,
        -0.045708801597356796,
        0.062090322375297546,
        -0.04252985492348671,
        0.0250321663916111,
        0.11302869021892548,
        -0.02076040953397751,
        -0.10605007410049438,
        -0.02054114267230034,
        -0.029780428856611252,
        -0.08051551133394241,
        -0.06084029749035835,
        -0.02588915266096592,
        -0.017823826521635056,
        0.10542679578065872,
        -0.0932822898030281,
        0.02335328981280327,
        -0.03352636843919754,
        -0.026198988780379295,
        0.02019834704697132,
        0.005904525518417358,
        0.03480321168899536,
        -0.018267836421728134,
        -0.013737985864281654,
        -0.07988786697387695,
        0.00974846538156271,
        -0.04532216116786003,
        -0.04252510890364647,
        -0.054739125072956085,
        0.0008331619901582599,
        -0.04700102657079697,
        0.11413878947496414,
        -0.10105747729539871,
        -0.0788683295249939,
        -0.11911225318908691,
        -0.002966234227642417,
        -0.035210952162742615,
        -0.03908155858516693,
        -0.057215578854084015,
        -0.08122275024652481,
        -0.019954629242420197,
        0.025051569566130638,
        -0.05296960473060608,
        0.08373194932937622,
        -0.06197601556777954,
        -0.024579539895057678,
        0.05596160516142845,
        -0.028052903711795807,
        0.062459710985422134,
        -0.03892593830823898,
        0.015254450030624866,
        0.08359628915786743,
        -0.07449419796466827,
        -0.004966567736119032,
        0.004184930585324764,
        -0.005496338941156864,
        -0.033250316977500916,
        0.005012664943933487,
        0.027046537026762962,
        0.09182869642972946,
        0.06378097087144852,
        0.04333800449967384,
        -0.10871443897485733,
        0.10641638189554214,
        0.008177746087312698,
        0.06923435628414154,
        0.02189505286514759,
        0.019474919885396957,
        0.004865176975727081,
        -0.002912473864853382,
        -0.009137705899775028,
        -0.045182231813669205,
        -0.028740884736180305,
        -0.052257172763347626,
        -0.052994612604379654,
        -0.06431388854980469,
        -0.09941434860229492,
        0.027586739510297775,
        -0.04468405619263649,
        -0.07041037827730179,
        -0.0634717121720314,
        -0.018053727224469185,
        0.07059374451637268,
        0.008694617077708244,
        -0.0605512335896492,
        0.02630956657230854,
        -0.05905585363507271,
        0.032060541212558746,
        -0.026096943765878677,
        -0.0349775105714798,
        0.03384390100836754,
        0.0891067385673523,
        0.04992711544036865,
        -0.08670087903738022,
        0.13128337264060974,
        0.014966614544391632,
        0.0439390167593956,
        0.036672454327344894,
        -0.04135383293032646,
        -0.01617588847875595,
        -0.025149580091238022,
        0.039638224989175797,
        -0.07610463351011276,
        0.01499945018440485,
        0.03237127512693405,
        -0.0925714373588562,
        -0.016747023910284042,
        0.09590450674295425,
        -0.031338874250650406,
        -0.027880998328328133,
        1.797824019021646e-33,
        0.013564261607825756,
        0.12811803817749023,
        0.04108602926135063,
        -0.06834159791469574,
        0.014103101566433907,
        0.016751857474446297,
        -0.06146828830242157,
        -0.014707772061228752,
        -0.07548889517784119,
        0.03112857975065708,
        0.026828957721590996,
        -0.0023791752755641937,
        -0.03892087936401367,
        0.05312153697013855,
        0.04982856288552284,
        -0.018172558397054672,
        -0.012010939419269562,
        -0.000806191994342953,
        -0.04540199041366577,
        -0.039331890642642975,
        -0.04029032215476036,
        -0.03437034785747528,
        0.02415603958070278,
        0.01702280528843403,
        0.02678625099360943,
        0.003808277891948819,
        0.027297701686620712,
        -0.04818814620375633,
        0.051236703991889954,
        0.053403738886117935,
        -0.024894937872886658,
        0.0117423627525568,
        -0.013577406294643879,
        -0.005725474562495947,
        0.03806721046566963,
        0.027870601043105125,
        0.005289388354867697,
        -0.07092263549566269,
        -0.0035425995010882616,
        -0.034354012459516525,
        0.024233832955360413,
        0.04993255436420441,
        -0.05769551172852516,
        0.019501397386193275,
        -0.015457901172339916,
        0.10616331547498703,
        0.031964387744665146,
        0.053236108273267746,
        0.004123065620660782,
        0.046041909605264664,
        0.052271414548158646,
        0.03978050500154495,
        -0.04220617190003395,
        -0.03753923624753952,
        -0.010162907652556896,
        0.05113519728183746,
        0.04059701785445213,
        -0.14126668870449066,
        0.008818414993584156,
        -0.12788128852844238,
        0.032181400805711746,
        0.008278768509626389,
        -0.02028423175215721,
        -0.003191147232428193,
        -0.024005582556128502,
        -0.01791612058877945,
        -0.04092084988951683,
        0.06175731495022774,
        -0.04370519518852234,
        0.05179116129875183,
        -0.06863298267126083,
        0.07696475088596344,
        -0.07300101220607758,
        -0.04609275609254837,
        -0.03233441710472107,
        0.05305512249469757,
        -0.03141988441348076,
        -0.012005618773400784,
        0.06875798851251602,
        0.09311565011739731,
        -0.04290907084941864,
        0.00642350222915411,
        -0.0077966488897800446,
        -0.02830774337053299,
        -0.028466086834669113,
        -0.014996674843132496,
        0.0441737100481987,
        -0.0022993467282503843,
        0.03515292704105377,
        0.013341540470719337,
        0.004154192749410868,
        0.041106920689344406,
        -0.07009844481945038,
        -0.02096245437860489,
        -0.043242521584033966,
        -3.302507297597061e-33,
        -0.06414823979139328,
        0.0011997409164905548,
        0.0113533278927207,
        0.02757111005485058,
        -0.029448386281728745,
        -0.058015935122966766,
        0.042770907282829285,
        0.025546230375766754,
        0.08396948128938675,
        -0.05022070184350014,
        -0.035269998013973236,
        0.007199072279036045,
        -0.03236399218440056,
        -0.0035283027682453394,
        -0.024155529215931892,
        0.004728283733129501,
        0.018540333956480026,
        -0.0275947954505682,
        -0.032688140869140625,
        -0.06597806513309479,
        -0.020200815051794052,
        0.021389901638031006,
        -0.03420800343155861,
        0.026167983189225197,
        -0.016100306063890457,
        0.14025872945785522,
        0.05697666481137276,
        0.010888515040278435,
        -0.019487718120217323,
        -0.06815706193447113,
        -0.010719149373471737,
        0.0032312958501279354,
        0.008005215786397457,
        -0.028526974841952324,
        0.046859290450811386,
        0.05552813038229942,
        0.04216480627655983,
        -0.08117049932479858,
        -0.04402641952037811,
        -0.09475623816251755,
        0.06764768064022064,
        -0.03138012811541557,
        -0.041638415306806564,
        -0.048009663820266724,
        -0.10637277364730835,
        -0.06876957416534424,
        -0.030512532219290733,
        0.07286158204078674,
        -0.010943801142275333,
        0.011503643356263638,
        0.06436411291360855,
        0.036901164799928665,
        0.00569381657987833,
        0.015471368096768856,
        -0.0012299661757424474,
        -0.016742125153541565,
        0.019320515915751457,
        0.0028898981399834156,
        0.023598497733473778,
        0.044838860630989075,
        0.012187984772026539,
        0.0663631334900856,
        -0.10825025290250778,
        -0.03112177550792694,
        -0.01713459938764572,
        -0.03638356924057007,
        0.010645945556461811,
        -0.00629267655313015,
        -0.024855105206370354,
        0.021935321390628815,
        0.05655456334352493,
        0.04377109184861183,
        0.0007228937465697527,
        -0.07813441753387451,
        0.07771198451519012,
        0.048125118017196655,
        0.017922040075063705,
        -0.015170540660619736,
        -0.03239312395453453,
        0.07066598534584045,
        0.0609070248901844,
        -0.07604581117630005,
        0.03592083230614662,
        0.06661225855350494,
        0.0920581966638565,
        0.09295491129159927,
        -0.07470248639583588,
        0.0037805845495313406,
        -0.04511857405304909,
        -0.002250152174383402,
        -0.024342913180589676,
        -0.009749950841069221,
        -0.06782888621091843,
        0.10617794096469879,
        0.10567058622837067,
        -6.447517364449595e-08,
        -0.037192098796367645,
        -0.049315787851810455,
        0.013614446856081486,
        -0.012918089516460896,
        -0.0035571162588894367,
        -0.028625376522541046,
        0.013746523298323154,
        0.035508401691913605,
        -0.07333291321992874,
        -0.04033193737268448,
        -0.039240412414073944,
        -0.04312211647629738,
        -0.05587032064795494,
        0.08445443958044052,
        0.08140849322080612,
        0.0196693018078804,
        -0.03850088268518448,
        -0.03595366328954697,
        -0.05464283004403114,
        0.004860608838498592,
        -0.0791824460029602,
        -0.04707670956850052,
        -0.016442641615867615,
        -0.04357460141181946,
        -0.007306294050067663,
        -0.024710802361369133,
        -0.017284955829381943,
        -0.030952000990509987,
        0.042823050171136856,
        0.009099510498344898,
        -0.04555034264922142,
        0.03934817388653755,
        -0.07331907749176025,
        0.02146258018910885,
        -0.050768714398145676,
        -0.063038669526577,
        0.01471411157399416,
        -0.013001362793147564,
        0.044364459812641144,
        0.061708927154541016,
        0.0208088681101799,
        0.040198273956775665,
        0.0569152757525444,
        0.061788760125637054,
        -0.0439443364739418,
        0.006097438279539347,
        0.07676146924495697,
        -0.03376619890332222,
        -0.008987035602331161,
        0.022359997034072876,
        -0.04064397141337395,
        -0.04659072682261467,
        0.0450718067586422,
        0.09644105285406113,
        -0.0508306585252285,
        -0.011341508477926254,
        0.06492490321397781,
        -0.046945665031671524,
        -0.04546625167131424,
        0.06304199248552322,
        0.038455549627542496,
        -0.05576583743095398,
        -0.02149040624499321,
        0.05485375225543976
    ]
}