{
    "id": "uxsTpMXzEU0",
    "title": "Hey Siri, I’m Giving You A Second Chance - WWDC 2024",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-06-11T10:33:27Z",
    "video_url": "https://www.youtube.com/watch?v=uxsTpMXzEU0",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Air Pods",
        "iOS 18",
        "iPadOS 18",
        "macOS Sequoia",
        "visionOS 2",
        "tvOS",
        "Tim Cook",
        "WWDC",
        "Developers",
        "API"
    ],
    "views": 1232669,
    "likes": 47953,
    "comments_count": 3974,
    "description": "Check out iFixits options for laptop repairs, including replacement batteries and SSDs, at   While most of these updates and features for iPad OS 18, iOS 18, and MacOS Sequoia aren't exactly new, it was pretty cool seeing them at Apple's 2024 WWDC event. Is their version of AI or \"Apple Intelligence\" going to be the first one the average person uses on a daily basis? DoesT9 on iPhone matter to anyone but Linus? Will Tim Cook FINALLY find a way to sell more Vision Pros?  Discuss on the forum:   Check out Apple iPads:  Check out Apple Mac Products:    Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:08 Siri 2:30 AI 4:48 iOS 18 9:15 macOS Sequoia 10:31 visionOS 11:10 iPadOS 18 12:27 tvOS 13:40 Safari 15:19 Outro",
    "description_links": [
        "https://ifix.gd/ltt",
        "https://linustechtips.com/topic/1573248-hey-siri-i%E2%80%99m-giving-you-a-second-chance-apples-wwdc-2024-keynote/",
        "https://lmg.gg/omqNS",
        "https://lmg.gg/HqoiW",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "After this year's WWDC, it is gonna be really hard to be an Apple hater. They showed off a laundry list of new features and quality of life improvements across their platforms that finally address some of my most long-standing gripes and introduced me to ideas that I never knew that I needed. Shazam, but for TV and movies? That sounds shamazing. A reader mode that doesn't block ads, but rather defocuses them? Yes, please. RCS text message support? I mean, sure, as long as I can still tell who the disgusting green bubbles are. Wait, T9 dialing? Are you kidding me? This is amazing! And how about an AI enhanced Siri that can find that email that someone sent me? The list is seriously so long and legitimately exciting that it was hard to find a spot to segue to our sponsor. iFixit. Laptops aren't cheap, so why would you run out and buy a new one when iFixit can help give your old one a new lease on life? Check out their replacement parts and guides at the link in the video description. Let's kick off with what's new with Siri, starting with the ability to talk to Siri via text. Finally, I don't need to look like a jackass yacking at my phone just to quickly set a reminder. I still will, of course, because my hands being full is the main reason to use a digital assistant, but hey, it's the thought that counts. Speaking of... Siri can finally understand when you pause and can't remember what you were going to say, or if you just mess up, rather than needing to start a new prompt. It's things like this, assuming they actually work this time, that should really help bring the experience closer to what we were sold back with the iPhone 4S. And it's not just Siri either. New AI-enhanced functions are now built into all of Apple's operating systems that allow you to quickly generate smart replies, proofread, or rewrite messages, and summarize content, which is incredibly useful. Probably the most useful tool for me, though, is Reduce Interruptions, which uses clues to figure out what notifications are likely to be actually important versus which ones are probably not so much. It's kind of like focus mode, but more automatic. But how is all of this working? Well, Apple claims that their machine learning algorithms primarily run on-device, as they always have, but... Because of the increasing complexity of these tasks, Apple's implementing what they call \"Private Cloud Compute\", a system whereby information relevant to the task, and only that information, is sent to Apple's servers to supplement the computer that's in your pocket or on your wrist. Apple explicitly pointed out that these servers run Apple Silicon, which means... I don't know, maybe XServe is coming back? Probably not, but you can't blame a girl for hoping. Whatever Silicon is involved, Apple was very careful to make it clear that they cannot read your information, even going as far as to dedicate whole sections of the hour and a half long presentation to explaining how the system works. Now, assuming that you trust Apple more than you do Microsoft, their Recall-like features might be pretty useful. And, like Recall, most of the functionality is already on your iDevice in a more limited form, for example, you can already search for people's faces or for appointments in iMessage, but now you can do so in a more natural, open-ended way. Apple didn't explain how metadata for these new capabilities is handled, where it's stored, and whether local apps can access it, but they did invite independent experts to audit the process, and according to Apple, iDevices and Macs will refuse to connect to a private cloud server unless it's been publicly logged for inspection. In general, it was clear that they wanted to avoid any comparisons to Microsoft around the issues of privacy and security. This extends even to the integration of ChatGPT in iOS 18 and macOS Sequoia, a little more on those later. For example, if a prompt is deemed to be too complicated for Siri, it will ask you before sending it to OpenAI and it will obfuscate your device's IP address. On the subject of OpenAI, you can link your OpenAI account if you want to access paid ChatGPT features, but by default, it is free with no account required, and Apple's agreement with OpenAI requires them to not store requests. Moving on, genmojis are an interesting, if eerie concept, but what's cooler is Apple's new tool Image Playground that underpins it. It can be used to create images out of simple prompts and its integration in applications like Apple Notes allows you to quickly and easily turn just a basic sketch and maybe a simple word cloud into a finished image. For now, it's available in three different styles, but I would expect that to expand in the future. Now let's shift gears and talk about what I am most excited about. iOS 18 and its ability to do what Android has done since basically forever. That's right, my friends, T9 dialing baby! Just kidding, they did add that, but they added so much more. You can finally arrange your apps and widgets however you want to. If you've got a nice picture you want to set as your wallpaper, but. Key parts are covered with those stupid app icons. You don't have to deal with that anymore. Also, they barely touched on this during the presentation, but you can now resize your apps, which is great if you were in your prime when the first iPhone came out, but aren't as dexterous as you once were. They've also got their new dark mode to make those icons black, but what's even cooler is their new customization sheet that lets you tint them with whatever color you want. And I get it, this is a minor thing that doesn't serve a purpose, other than to make your device look a little more \"you\". But look, if you're gonna list customization as something that you love about Android, you don't get to suddenly not care about it when Apple has a cool idea. Like their new personalization for Control Center. Not only can you swipe to new groups of controls, like for media playback or for your smart home, but you can add more controls to each group through the new Controls Gallery. You can resize them. You can change the layout, and thanks to the new Controls API for Devs, you're gonna see third-party app controls as options that you can just add wherever you want. Just like you can add pins wherever you want. Our keyboard pins are back on lttstore.com. Overall, this is... amazing? I mean, it feels like Apple is finally starting to get why so many people prefer Android devices. I mean, obviously, they're still nowhere near as open as the competition, and... I would have loved to see features like these, I don't know, 10 years ago, but late is better than never. And on that note, similar to the competition, you're going to be able to do stuff from the lock screen now, like take a note instead of being locked to just the camera and flashlight buttons. Man, that's a really big one. Oh, speaking of phone locks, another feature Apple has always been big on has been security and privacy. So, of course, we're getting more of that with the ability to lock and hide individual apps. What's really cool is that any info from a locked app won't even appear in other places, like in search or notifications. So finally... I can lend Yvonne my phone without her seeing a random Grinder notification. Wait, who put that in the script? We don't talk about that. No, I'm joking, obviously. I'm more of a Scruff guy anyway. But in all seriousness, this is a great feature for personal privacy, or even just parents who lend their phone to their kids and don't want their stuff messed up. On the subject of personal privacy, you can now choose which contacts an app can see when it requests access, so... You can avoid your weird uncle on Instagram or what have you, and you can keep your Bluetooth accessories private and hide them from anything else that might be on your network, like your computer or your TV. It's funny because I don't think I've ever asked for that, but now it just seems like a brain-dead obvious thing. Like, notifying someone when a call is being recorded should also obviously be a thing. Texting is also getting some love with super cool features for messaging like satellite messaging on iPhone 14 and up when you're off grid and scheduled send. Dude, I love scheduled send. I use it all the time with Gmail and Teams and they've added support for text formatting like bold and italics, text effects, using any emoji or sticker for tap backs and at long last, RCS or rich communication services messaging support. Wow, I feel like that was a lot. And there's more, moving on to mail. It's getting some love as well with the ability to categorize everything. Something that Gmail has been doing for a while now but still nice to see here. And it's nice to see topography in the Maps app and the ability to properly plan hiking trails including turn by turn directions. Apple Pay is also getting just about the coolest thing ever. Tap to cash so you can perform quick, private user to user transactions along with third party browser support. Even with some of the stuff we're not getting to, like the ability to stall in people out of your photos or game mode, which reduces background sessions and reduces response time for Bluetooth accessories like headphones and controllers, it really feels like Apple has absolutely knocked this out of the park. But wait, there's more. Switching over to MacOS, they're making it a lot more appealing to switch over to MacOS. Sequoia adds some major improvements to using your iDevices together with continuity. Need to answer a message on your iPhone, but too lazy to get up and go grab it? With iPhone Mirroring, Apple's answer to Microsoft Phone Link, you can! It is fully interactable, and whether you're docked or in standby mode, or your iPhone is just sitting on the kitchen table, the only person who can see what you're doing is you. And they have finally done it, guys. You get suggested tile layouts when you drag a window to a corner or to the edge of your screen. It's a feature Windows has had natively for... a while now, and I'm very happy to see it here. The same goes for their new presenter preview and background replacement capabilities for FaceTime and Zoom. There's a new passwords app for Keychain that stores all your passwords, pass keys, and verification codes. Okay, that was just like before. But now it's on all devices, including Windows via iCloud for Windows, which should make dipping your toes into the ecosystem just a little bit easier. It's even available for the Vision Pro! Haha, that's right! Apple hasn't given up on it! There's not a lot to talk about with Vision OS, too. There's ultra-wide monitor mirroring now, and you can turn 2D images into 3D ones, but mainly it seems like Apple just really wants people to develop for the Vision Pro, with a bunch of new developer API support. With that said, they are making spatial content a lot easier to make with a new professional workflow and an EOS R7 spatial lens for Canon. All of this, still super expensive, but we'll have it and all the other Apple products we mentioned today in the link down below. We'll also have the new iPad with its stunning Tandem OLED screen. We did a short circuit on that recently. I couldn't believe my eyes. Pads. Haha, get it? Anyway, it's confirmed to be getting a ton of new support with iPad OS 18. There's a lot of overlap obviously with iOS 18, like the customization features we talked about earlier, as well as the new floating tab bar that morphs into the sidebar, and just about everything's getting new animations to look cool and flashy, but what's huge on iPad OS is the fact that it's finally got a calculator. Yeah. Okay, that doesn't seem like the kind of thing that I would normally get excited about, but along with math notes, this thing f*cks, and it's also available on macOS. There's way too much to cover about their calculator in this video, but I think it's safe to say that if you're going to school for anything math and graphing heavy, it is going to be an absolute game changer. Another big deal is the remote permissions capability that your friendly neighborhood family IT guy or girl is going to love. That's right, no more endlessly repeating instructions over the phone to help grandma or grandpa access the photos they hid in some random folder. Now, you can just... Ask for remote access, and do it yourself. Gotta love it! That is assuming that your grandma can figure out how to allow remote access. And, when you pick up your Apple TV remote, you now get the ability to run 21x9 widescreen projectors for a full-frame cinematic experience. Okay, we didn't have much of a segue into that, but that's a cool feature. If you're lucky enough to have a 21x9 widescreen projector in-screen. If not, you can still access the other big new tvOS feature by pulling out what Apple's calling \"Insight\" which will provide you with shot-by-shot information on actors and background music. It's actually a lot cooler than it sounds when you see it happening in real-time and if you guys need to mute that music or rewind that scene, closed captions will come up automatically to keep your latest binge going strong. And if you just want to hear what the actors are saying, you can toggle on their new dialogue enhancer. Nothing groundbreaking here but little tweaks nonetheless. Love to see them. If tweaks to Apple TV make you roll your eyes and shake your head, then Siri would have taken that personally. As a command. The AirPods Pro will finally be able to respond to Siri prompts like incoming calls or text messages silently with just a nod or shake of the head. That means that in a noisy environment you can answer a call with a nod and the upgraded voice isolation tech will kick in and hopefully let the person on the other side hear you and not the jackhammer that is working on the street that you're trying to cross. Safari's got a couple of new features too, like highlights, which uses machine learning to highlight relevant information as you browse. It's neat, but I'm not nearly as sold on it as I was on the new redesigned reader view, which now removes distractions from articles, gives you a table of contents, and includes a summary. I can't help but wonder what ad service delivery networks Sorry, excuse me. Can't help but wonder what they're gonna think about all of this. Is it technically not blocking ads if they just de-focus them? Ha ha, Mertre's interesting. Anywho, guys, there's so much more. They've updated their game porting toolkit, they've made improvements to Safari, they've updated the health app and watchOS in general. And last but not least. There's the segue to our sponsor. iFixit. Repairing your laptop might seem like brain surgery, but with iFixit, it doesn't have to be. All you need is a steady hand and iFixit's guides, high quality tools, and reliable replacement parts. Let's break it down together. First, match your laptop and its issue with one of their step-by-step repair walkthroughs. Then, pick up the exact component you require. You can trust iFixit to carry pretty much anything you can think of. Got a dead battery? Hey! They've got brand-new replacements, got corrupted storage, they've got SSDs of all shapes and sizes. And then finally, every surgeon needs a good set of instruments and iFixit's toolkits are meticulously assembled to provide exactly what you need for your repair. See? That's not so bad. So go check out iFixit using our link in the description to give your busted laptop a new lease on life. If you guys enjoyed this video, I'm gonna throw it at lmg.gg/floatplane, where Emily and Jonathan from our team did a reaction, sort of more stream-of- consciousness conversation. That you guys can check out over there.",
    "transcript_keywords": [
        "Apple",
        "Siri",
        "Apple hater",
        "finally",
        "year WWDC",
        "run Apple Silicon",
        "features",
        "app",
        "iFixit",
        "feature Apple",
        "ability",
        "love",
        "access",
        "WWDC",
        "Apple Silicon",
        "feature",
        "controls",
        "phone",
        "thing",
        "servers run Apple"
    ],
    "transcript_entity_values": [
        "Canon",
        "the hour and a half",
        "iFixit",
        "one",
        "year",
        "Apple Silicon",
        "MacOS",
        "Apple",
        "Sequoia",
        "first",
        "Windows",
        "the Vision Pro",
        "Tandem",
        "iDevice",
        "Silicon",
        "Zoom",
        "First",
        "Emily",
        "RCS",
        "iPhone",
        "Vision OS",
        "Grinder",
        "iPad",
        "FaceTime",
        "Yvonne",
        "iOS 18",
        "Insight",
        "Control Center",
        "iPhone",
        "today",
        "Mertre",
        "Controls Gallery",
        "macOS Sequoia",
        "Siri",
        "WWDC",
        "Maps",
        "21x9",
        "AI",
        "iOS 18",
        "Private Cloud Compute",
        "Siri",
        "Controls API",
        "emoji",
        "Apple TV",
        "Instagram",
        "Jonathan",
        "Keychain",
        "Recall",
        "Macs",
        "EOS",
        "18",
        "Safari",
        "Gmail",
        "three",
        "iCloud",
        "iMessage",
        "iDevices",
        "Image Playground",
        "iPhone 14",
        "Microsoft Phone",
        "Windows",
        "Scruff",
        "iOS 18",
        "third",
        "The AirPods Pro",
        "XServe",
        "Devs",
        "10 years ago",
        "Microsoft",
        "API",
        "Android"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "LAW",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "EVENT",
        "LOC",
        "ORG",
        "ORG",
        "EVENT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.09946532547473907,
        -0.09574399888515472,
        0.04782935604453087,
        -0.10143613070249557,
        0.14627602696418762,
        0.02999339997768402,
        0.018806667998433113,
        0.06982366740703583,
        -0.012235207483172417,
        0.007298450451344252,
        0.02713688090443611,
        0.02527378872036934,
        -0.04577721282839775,
        -0.01003845315426588,
        0.031482793390750885,
        0.0066362107172608376,
        0.05365719646215439,
        -0.07154115289449692,
        -0.04591177776455879,
        -0.03291233256459236,
        0.010640046559274197,
        0.030986661091446877,
        0.10005658119916916,
        -0.05161194130778313,
        0.013629778288304806,
        -0.011798460967838764,
        0.022191591560840607,
        -0.14695213735103607,
        -0.02540755271911621,
        -0.000800539564806968,
        -0.006876092404127121,
        0.02195015363395214,
        -0.01831182651221752,
        0.043234098702669144,
        -0.05952892825007439,
        -0.10164446383714676,
        0.05002693086862564,
        -0.025790086016058922,
        -0.02729114517569542,
        -0.07942214608192444,
        -0.03175009414553642,
        -0.05750778317451477,
        -0.04951128363609314,
        0.015434470027685165,
        0.024919943884015083,
        -0.005724793765693903,
        0.04035549238324165,
        -0.04139470309019089,
        -0.010055890306830406,
        0.033263180404901505,
        -0.02204849198460579,
        -0.09471000730991364,
        0.021197855472564697,
        -0.024283289909362793,
        0.01478526834398508,
        0.04448135942220688,
        -0.019302966073155403,
        -0.012922297231853008,
        0.09386040270328522,
        0.05024540796875954,
        0.07237480580806732,
        -0.08367480337619781,
        0.015784241259098053,
        0.08811622858047485,
        0.030571606010198593,
        -0.019748086109757423,
        7.779646693961695e-05,
        -0.012731147930026054,
        -0.0009213493904098868,
        -0.08979357779026031,
        0.041701532900333405,
        0.033224768936634064,
        0.058933764696121216,
        0.005365835968405008,
        -0.0018192497082054615,
        0.03752166032791138,
        0.06642873585224152,
        -0.03776903077960014,
        0.03150284290313721,
        -0.054900288581848145,
        0.04191421717405319,
        0.057308416813611984,
        0.04028908535838127,
        0.010958085767924786,
        0.02641253173351288,
        -0.03878018260002136,
        -0.07877473533153534,
        0.04515693336725235,
        -0.02855919674038887,
        -0.015731677412986755,
        0.0172917228192091,
        -0.02087327279150486,
        0.01767973229289055,
        -0.03507993742823601,
        0.015742439776659012,
        0.000692698871716857,
        -0.007372970227152109,
        -0.07203011214733124,
        -0.07522907853126526,
        0.04571522772312164,
        -0.03171421214938164,
        0.007743634283542633,
        -0.0002472092164680362,
        -0.07307109981775284,
        -0.0388302281498909,
        -0.016802674159407616,
        0.07554025948047638,
        -0.02251467853784561,
        0.034144941717386246,
        0.07824340462684631,
        0.014877142384648323,
        0.03350237011909485,
        -0.0960114598274231,
        0.0002637324796523899,
        0.04624215513467789,
        -0.026588723063468933,
        -0.06974069774150848,
        0.08254484087228775,
        0.07194919139146805,
        -0.0025024644564837217,
        -0.02230863645672798,
        0.02331605553627014,
        -0.0051992484368383884,
        -0.02013435773551464,
        -0.02056136168539524,
        0.0704180896282196,
        -0.02321416698396206,
        3.195653024397392e-33,
        -0.08073554933071136,
        0.05701156333088875,
        -0.0429094024002552,
        -0.03063778579235077,
        0.030662817880511284,
        -0.053802549839019775,
        0.009504903107881546,
        0.04003765061497688,
        0.022688724100589752,
        -0.020913947373628616,
        -0.06117986515164375,
        -0.006457342300564051,
        -0.10819560289382935,
        0.03299526497721672,
        0.05623938888311386,
        -0.07078216969966888,
        -0.04065213352441788,
        0.028947453945875168,
        0.021628817543387413,
        -0.012976125814020634,
        0.020962726324796677,
        -0.03392426669597626,
        0.015008926391601562,
        -0.012085232883691788,
        0.06389170140028,
        -0.03491533547639847,
        0.08766084909439087,
        -0.014768455177545547,
        0.081865593791008,
        0.017935914918780327,
        -0.09861920028924942,
        0.06384924054145813,
        -0.025162160396575928,
        -0.09176861494779587,
        -0.029139414429664612,
        0.037027761340141296,
        -0.04541730880737305,
        -0.08266131579875946,
        0.07394592463970184,
        -0.0037557086907327175,
        -0.06554015725851059,
        0.1036868765950203,
        -0.03051133267581463,
        -0.08400866389274597,
        0.04067738726735115,
        0.006325144320726395,
        0.02447972632944584,
        0.05590008571743965,
        -0.0232971403747797,
        -0.010257013142108917,
        -0.11392520368099213,
        -0.012576650828123093,
        -0.0684700757265091,
        -0.08976168930530548,
        -0.011412856169044971,
        -0.03452923148870468,
        0.00841180793941021,
        -0.09017113596200943,
        0.05282832682132721,
        0.015656983479857445,
        0.04886573553085327,
        -0.007661326788365841,
        -0.01158500649034977,
        -0.011524486355483532,
        -0.0813397690653801,
        0.06094572693109512,
        0.0366610512137413,
        -0.011929478496313095,
        -0.0816512256860733,
        0.07950247079133987,
        -0.005772666074335575,
        -0.03665616735816002,
        -0.03420468047261238,
        -0.0704447478055954,
        -0.013004547916352749,
        0.023834312334656715,
        -0.014898446388542652,
        0.009390482679009438,
        -0.02330281026661396,
        0.0167317483574152,
        -0.0359903946518898,
        0.0668613389134407,
        0.062020283192396164,
        0.05343041941523552,
        0.06653909385204315,
        0.027442820370197296,
        0.0022439947351813316,
        0.0238684993237257,
        -0.040198974311351776,
        0.06995383650064468,
        0.058544714003801346,
        0.03149998560547829,
        -0.060308411717414856,
        0.023619377985596657,
        -0.08811202645301819,
        -5.636591655792842e-33,
        -0.06212867051362991,
        0.005893411114811897,
        -0.04103412106633186,
        0.0081230653449893,
        -0.00686415983363986,
        -0.039148442447185516,
        0.030172687023878098,
        0.017069734632968903,
        0.021445058286190033,
        -0.0660700798034668,
        0.01406495925039053,
        -0.0028171504382044077,
        -0.07505559176206589,
        -0.05320693925023079,
        -0.019340714439749718,
        -0.05851224064826965,
        -0.050526440143585205,
        -0.08639737963676453,
        0.037094876170158386,
        -0.035991959273815155,
        0.12500962615013123,
        0.03546120598912239,
        0.0047883144579827785,
        -0.030263999477028847,
        0.010578041896224022,
        0.0015434998786076903,
        -0.013693463057279587,
        0.09243128448724747,
        -0.05943487584590912,
        -0.026537936180830002,
        0.004715281073004007,
        -0.12261814624071121,
        -0.04312809929251671,
        0.026884209364652634,
        0.10788945108652115,
        0.0021090065129101276,
        0.08683951944112778,
        0.020989280194044113,
        -0.06634072214365005,
        0.02226666733622551,
        0.09887687116861343,
        0.009713169187307358,
        -0.010429836809635162,
        -0.022447841241955757,
        -0.005362565629184246,
        -0.014555652625858784,
        -0.06034144014120102,
        0.023352663964033127,
        -0.005888858810067177,
        -0.05666442960500717,
        0.015288964845240116,
        -0.00219268468208611,
        -0.04949674755334854,
        -0.0077530862763524055,
        -0.0819954201579094,
        0.05232186242938042,
        0.04512433335185051,
        0.03202458471059799,
        -0.0607018768787384,
        0.004652015399187803,
        0.016901178285479546,
        0.02607741951942444,
        0.00878811627626419,
        -0.07026907801628113,
        -0.026865985244512558,
        -0.0351601205766201,
        0.004747328814119101,
        0.027919890359044075,
        -0.0071753887459635735,
        -0.019530972465872765,
        0.03335883468389511,
        -0.058464888483285904,
        -0.029624339193105698,
        -0.10612712055444717,
        -0.0594673790037632,
        0.04151878133416176,
        0.06587651371955872,
        -0.03333494812250137,
        -0.005030426196753979,
        -0.04476756602525711,
        0.000476398243336007,
        0.068543940782547,
        0.05049663782119751,
        0.012135996483266354,
        0.067158542573452,
        0.10289331525564194,
        0.0933564081788063,
        -0.058633361011743546,
        -0.005762947257608175,
        0.06000347062945366,
        -0.10634801536798477,
        -0.005835528019815683,
        -0.053796589374542236,
        0.01803162507712841,
        -0.06900113821029663,
        -5.8843426131716114e-08,
        -0.054808780550956726,
        0.07283349335193634,
        0.0630541443824768,
        -0.020915985107421875,
        -0.007758460473269224,
        -0.10958214849233627,
        -0.04540030285716057,
        -0.0010523026576265693,
        0.05387704819440842,
        0.004879888147115707,
        0.02413901500403881,
        -0.057234134525060654,
        -0.04330432787537575,
        0.03938964381814003,
        0.08976250141859055,
        0.03728179633617401,
        -0.03372227028012276,
        0.05076088011264801,
        -0.018498193472623825,
        -0.04954618588089943,
        0.02163679152727127,
        0.028743555769324303,
        0.017723435536026955,
        0.021499132737517357,
        -0.020378487184643745,
        0.045885831117630005,
        -0.0177866630256176,
        0.023735474795103073,
        0.045311350375413895,
        0.035165730863809586,
        -0.0601147823035717,
        0.007461182307451963,
        0.044808126986026764,
        -0.003621935611590743,
        0.09499731659889221,
        -0.11592069268226624,
        -0.07410609722137451,
        0.03295260667800903,
        0.03268520534038544,
        0.05435514822602272,
        -0.08236826956272125,
        -0.025056932121515274,
        0.018392084166407585,
        0.04083217307925224,
        0.051481571048498154,
        -0.06846260279417038,
        -0.01848500594496727,
        -0.04227272793650627,
        -0.012725920416414738,
        0.05358879640698433,
        0.010446096770465374,
        -0.050992920994758606,
        0.04481822997331619,
        0.053959719836711884,
        0.032995060086250305,
        -0.028626281768083572,
        0.06019056588411331,
        -0.09988866001367569,
        -0.09821556508541107,
        0.08726634830236435,
        0.07656450569629669,
        -0.09963281452655792,
        -0.003733038902282715,
        0.07931286096572876
    ]
}