{
    "id": "uXu4TgKyth0",
    "title": "Mac Users Deserve Better – 7 Unacceptable Problems with MacOS",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-11-12T18:00:25Z",
    "video_url": "https://www.youtube.com/watch?v=uXu4TgKyth0",
    "category": "Science & Technology",
    "tags": [
        "macOS",
        "OS",
        "Operating System",
        "Macintosh",
        "Annoying",
        "Apple",
        "OSX",
        "OS X",
        "Ventura",
        "Corner Snapping",
        "Volume Mixer",
        "Multi Monitor",
        "Full Screen",
        "Magic Mouse",
        "Scroll Direction",
        "Options"
    ],
    "views": 2101495,
    "likes": 76869,
    "comments_count": 6495,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   Try Zoho One free for 30 days with no credit card required here:   Apple has a bigger presence at Linus Media Group than ever before: an increasing number of our staff are choosing their excellent M1 and M2 powered laptops as their work machine or use Macintosh systems at home. But this increased usage has led to more annoyances being discussed around the office so we put together this list of some of the more noticeable omissions!  Discuss on the forum:   Buy an Apple Magic Mouse 2:  Buy a Logitech MX Master 3S for Mac:  Buy a Plugable Laptop Docking Station:  Buy an Apple Gift Card:  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:18 Corner Snapping 3:08 Full Screen is Weird 4:03 Traffic Light Inconsistencies 4:48 Scroll Direction Decoupling 5:22 Multi Monitor UI Issues 6:12 Multiple External Monitors 7:21 Volume Mixer MIA 8:05 Rapid Fire Points 8:33 A Difference in Philosophy 9:33 We DO Like macOS! 10:24 Conclusion",
    "description_links": [
        "https://www.freshbooks.com/linus",
        "https://www.zoho.com/one/lp/linus.html",
        "https://linustechtips.com/topic/1467197-mac-users-deserve-better-%E2%80%93-7-unacceptable-problems-with-macos/",
        "https://geni.us/BUikcN",
        "https://geni.us/z0cjZg",
        "https://geni.us/7EVqe",
        "https://geni.us/LBeT",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- For my entire adult life, Macs have been more expensive than PCs while being simultaneously useless for gaming. So the bugs, quirks, and outright bad decisions that Apple has made in the development of Mac OS never really affected me, outside of the few isolated instances where I was forced to use it. However, Linus Media Group has more daily Mac users than ever before and even they agree, there are a shocking number of Mac OS deficiencies, some that Linux and Windows solved 10 or even 20 years ago. And if Apple would address them, it could improve their workflow, reduce daily frustrations, and generally boost the user friendliness of the operating system. So, with the help of our team and our community, we've put together this list of ways that we think Mac OS falls short of Apple's \"just works\" philosophy and how they could be done better. And we've put together our sponsor. - Zoho One. Zoho One brings together sales, marketing, finance, analytics, and support into a single unified platform to run your entire business. Try Zoho One today for 30 days using the link below. (icon beeps) (upbeat music) - Right off the top, I want to make it clear that we are talking about the stock operating system, not apps like BetterTouchTool or SnapTool or Magnet or anything like that. If you have to download a third party app to fix it, it doesn't count, Anything outta the box from Apple is fair game, though. So let's jump straight into the big one, corner snapping. Linus and a small handful of others have been calling attention to the lack of this feature for years at this point. On Mac OS, you cannot by default snap a window by dragging it around. It just moves. To Apple's credit, they do give you options when you click and hold the green button and even more options if you also hold down the appropriately named option key on the keyboard, but this is miles away from the simplicity offered by Windows. Behold, drag and drop a window to the side you want it on and it will snap in place and resize automatically, even with multiple monitors. Stuck using a touchpad? Windows still has you covered. Press the arrow keys while holding the Win key and the active window moves accordingly. You don't have to awkwardly drag it around, and that's just what Windows does out of the box. Microsoft even extends the power of their corner snapping with a first party tool called FancyZones, which is part of their PowerToys line of utilities designed to give control back to the power users who want that extra degree of customization. Virtual Desktops actually used to be a PowerToy. It's a real shame that Apple doesn't offer a similar suite of programs for their power users. They did introduce Stage Manager with the recent Ventura upgrade, but control over window placements still lags behind other operating systems. If you do want that level of control, you're going to be left looking at one of the many third party solutions like BetterSnapTool, Magnet, or Swish. But get your wallet ready, because these are all paid apps. - While we're on the topic of active application management, the weird full screen behavior in Mac OS is another popular point of friction. We're not gonna comment on the inclusion of a notch on a laptop screen, but my brother in Christ, Apple, you cannot change the meaning of the words full screen just because of that. As a wild and crazy suggestion, we think the option to automatically hide and show the menu bar when in full screen should probably do what it says and hide the damn menu bar, not just the text. That is not free real estate and I want it back. And the current implementation is different from one app to the next. If you enter full screen mode from a non-full screen Firefox window, the menu bar and traffic lights don't appear, but if you do the same thing from Chrome or Safari, they do, and to further complicate things, if you enter full screen on Firefox before doing a full screen video, now they do appear. And you know what? The way that the traffic light buttons are handled currently differs from app to app, as well, though it really shouldn't. Full screen calendar and Safari have them animate from left to right. In Maps and Notes, they fade in instead, and in Messages and the App Store, a bar slides down from the top so you can't click on what's underneath the damn bar. The worst part is that a lot of the time, there's enough room for them to just stay there, but they disappear anyway. Why hide them in the first place? To fix this, Apple either needs to give developers a single set of rules for handling this UI element or give users an option in the system settings that forces the colored buttons to always stay visible, just like you can stay visible in our new color block hoodies at lttstore.com. - Also annoyingly absent from the setting of its menu is an option to decouple the scroll direction of the touch pad from the scroll direction of the Magic Mouse. And this may sound ungodly to some, but it's a really popular gripe. Like it or not, though, you're stuck scrolling in the same direction on the Magic Mouse as on the touchpad. And I hate natural scrolling. 'Cause even though there are two separate options for this in the menu, they're linked. To solve this, I just use a third party mouse that has its own software. Our final missing setting has to do with multiple monitors. As it currently stands, the dock will move any monitor that your mouse happens to brush along the bottom of, unless that is, you change the displays have separate spaces option, which doesn't seem like it should affect the dock, but it does. Is natural scrolling on on this teleprompter thing? - [Camera Person] Yes. - Really? Are you trolling me with this? What is up and what is down? Like the other missing options we mentioned, you personally might love the default behavior, but that doesn't mean that the people who don't like the out of box experience should have to suffer. I did not write this, I should, end note. A few extra toggle options would be a long way for a lot of folks here. I definitely did not write this. I like the out of box experience and it's been a big argument in the research of this video. - This leads us to something that actually prevented me from switching to daily driving a MacBook, or I did switch, but I'm just really mad about it, using external displays. Using multiple external displays requires choosing an M1 Pro Max or Ultra-equipped machine. If you've got a system with a base M1 or M2, you're limited to a single external display. This is despite the Thunderbolt-enabled USBC ports on the M1 and M2. But slow down. This sounds like hardware talk, though it certainly affects modern Mac OS machines. So where does the hardware end and the software begin? Market segmentation, that's where. See, the single Thunderbolt bus on the systems with the base M1 or M2 could easily drive more than one external display, like it does on the XPS 15, but especially in the case of the MacBook Air, that would be stepping on the toes of the higher end Apple products. And what's the easiest way to encourage people to spend more on features they need? Artificial limitations, and the most frustrating part is it used to be better. Intel-based Airs had no trouble outputting to multiple monitors. (Alex groans) - On the topic of limitations, Mac OS also limits you in terms of audio. There's no way of setting the volume of individual applications. This is something that Windows introduced in 2007 with the release of Vista, and Linux distros like Ubuntu followed suit shortly afterwards in 2008 because it was a good idea. But 15 years later, Mac OS still only has one master volume slider. I mean, you're not doing more than one thing at a time on your computer, are you, really? You can ostensibly control this by creating your own multi output device in the audio MIDI app, but this is a clunky solution and has to be redone for every additional application you want to control. It's maddeningly complex, a far cry from the simple and accessible menus of Windows and Ubuntu. I do have problems with Windows, though. - Now, here's some rapid-fire pain points that deserve a mention. There's no way to create a new file through Finder, even if you're already in the location you want the file to be saved. Checking ethernet connectivity and speed is buried in a couple sub menus, and in general, we wonder why Apple seems to hate ethernet when it's so much better than wifi. And having the option to get a preview when hovering over an open application in the doc would be massively helpful. Just give us the option. You love animations. - Ultimately, a lot of the choices Apple has made come down to a difference in how they expect their software will or should be used. Windows, for example, has a massive presence in the enterprise and business world, where support for legacy systems is critical, and Windows tends to hold on then to features that these systems might need in order to function properly, even if no one else needs them. Meanwhile, Apple tends to take a more forward-looking approach, out with the old, in with the new. A prime example would be that Windows 11 no longer supports 32-bit processors, but it does still support 32-bit applications with no end in sight. Then there's Linus Torvalds, who just a few weeks ago was discussing the possibility of maybe one day perhaps removing support for the Intel 486 microprocessor, a 33-year-old chip that tops out at .1 gigahertz. Apple also makes it a point to think different, which can sometimes lead to much better integration and functionality. - One thing I like about Mac OS is that it keeps, like, everything kind of compartmentalized, so if you download an application and install it, it's in the Applications folder, and that's just where it is. - It's got a really powerful terminal. By default, these days, you're getting ZSH, and you also have, like, Python and Ruby pre-installed. Like, you had pretty much everything you need in order to just do whatever you want outta the box. - It doesn't have Windows Modern Standby. Windows Modern Standby can just suckle my (beep). I don't think I can say that, but... (Alex laughs) - But, thinking different can also lead to a stubborn unwillingness to adopt a better method of accomplishing a task, seemingly because they're just salty that someone else thought of it first. At any rate, love them or hate them, Apple's differences contribute nicely to our conclusion here. There's just no such thing as a perfect operating system. Whether you're greeted by an Apple, a Window, a cute penguin, or hey, even a sword and scales when you're boot your PC, there's going to be an element of imperfection, and that's okay. Blindly being a fanboy of anything is bad, but being the kind of enthusiast that will take the time to see and understand the flaws, then give feedback about a product that you love, well, that's pretty cool. And even if it wouldn't turn me team Mac OS anytime soon, we would genuinely love to see the imperfections that we highlighted get the attention they deserve for Mac OS users in our office and around the world. - FreshBooks. Now, I'm gonna go ahead and guess that you're not an accountant. Maybe you are, but you're probably not, which is why you're gonna love this software. It's built for freelancers and small business owners alike who don't have time to waste on invoicing and accounting and payment processing. In fact, FreshBooks users can save up to 11 hours a week by streamlining and automating pesky admin tasks, like time tracking and following up on invoices and expense tracking, with features like the new digital bills and receipts scanner. Over 24 million people have used FreshBooks and they love it for its intuitive dashboard and reports. It's easy to see how to glance exactly where your business stands, and it's even easier to turn everything over to your accountant come tax season. 94% of FreshBooks users say it's super easy to get up and running, and with award-winning support, you're never alone. Try FreshBooks free for 30 days, no credit card required. Go to freshbooks.com/linus and get started today. - Thanks for watching all the way to the end. We hope the issues we mentioned are as annoying to you as they are to us and it didn't just feel like nitpicking and small details. If you wanna hear more about the positive aspects of Mac OS, we've got a video showcasing 10 ways that it is just flat out superior to the competition. Shout out to the Apple ecosystem in particular. That's a game changer for many.",
    "transcript_keywords": [
        "Apple",
        "Mac",
        "Windows",
        "full screen",
        "Windows Modern Standby",
        "window",
        "daily Mac users",
        "screen Firefox window",
        "entire adult life",
        "screen",
        "Linus Media Group",
        "Windows Modern",
        "option",
        "users",
        "full",
        "adult life",
        "useless for gaming",
        "expensive than PCs",
        "simultaneously useless",
        "app"
    ],
    "transcript_entity_values": [
        "94%",
        "30 days",
        "one",
        "UI",
        "M1 Pro Max",
        "the Magic Mouse",
        "Windows",
        "Apple",
        "Intel",
        "first",
        "20 years ago",
        "the App Store",
        "Airs",
        "Linus Media Group",
        "15 years later",
        "Thunderbolt",
        "MacBook",
        "M2",
        "just a few weeks ago",
        "One",
        "33-year-old",
        "M1",
        "the Magic Mouse",
        "32",
        "FancyZones",
        "Ventura",
        "Zoho",
        "Thunderbolt",
        "one day",
        "Vista",
        "Firefox",
        "daily",
        "Virtual Desktops",
        "Python",
        "today",
        "Alex",
        "Mac",
        "Windows 11",
        "Swish",
        "Over 24 million",
        "2007",
        "10",
        "Christ",
        "Notes",
        "Mac",
        "Mac OS",
        "M2",
        "MIDI",
        "Macs",
        "15",
        "Zoho One",
        "Safari",
        "2008",
        "Finder",
        "486",
        "FreshBooks",
        "Linus Torvalds",
        "Zoho One",
        "Chrome",
        "third",
        "Linus",
        "Linux",
        "Magnet",
        "Applications",
        "Linux",
        "Windows Modern Standby",
        "Microsoft",
        "two",
        "USBC",
        "the MacBook Air",
        "up to 11 hours",
        "these days",
        "years",
        "more than one"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.043848179280757904,
        -0.06997344642877579,
        0.0770552009344101,
        -0.05756672844290733,
        0.10526828467845917,
        0.009863332845270634,
        0.0819782167673111,
        0.007264311891049147,
        -0.0626692995429039,
        0.052928149700164795,
        0.06790413707494736,
        0.045707594603300095,
        -0.00871906615793705,
        -0.023049544543027878,
        0.0765390396118164,
        0.020374320447444916,
        0.0299790371209383,
        -0.073684923350811,
        0.007235371507704258,
        0.08605529367923737,
        0.06250748783349991,
        -0.0539899505674839,
        0.044224098324775696,
        0.07722724974155426,
        -0.04567940905690193,
        -0.03779685124754906,
        0.05766277015209198,
        -0.11844499409198761,
        -0.06820083409547806,
        -0.03736741840839386,
        -0.020785272121429443,
        0.06883794814348221,
        0.03884998708963394,
        -0.050968438386917114,
        0.023865176364779472,
        -0.1400468498468399,
        0.08390101790428162,
        -0.04534009471535683,
        -0.14556565880775452,
        -0.1397561877965927,
        -0.06864561140537262,
        -0.03747715801000595,
        0.11267594993114471,
        0.015795733779668808,
        0.0018514973344281316,
        -0.05943122133612633,
        0.06424374133348465,
        -0.05677621439099312,
        0.059016335755586624,
        0.08038098365068436,
        0.02783544734120369,
        -0.10944056510925293,
        0.047146789729595184,
        -0.014730522409081459,
        -0.029122062027454376,
        0.07247049361467361,
        -0.003405382391065359,
        -0.06994695961475372,
        0.043938715010881424,
        -0.019941220059990883,
        0.04037250578403473,
        -0.059041354805231094,
        -0.060176920145750046,
        0.06682895869016647,
        0.017133347690105438,
        -0.00750510860234499,
        0.03302394598722458,
        -0.0011914691422134638,
        -0.03848822042346001,
        0.054365258663892746,
        0.04468833655118942,
        -0.045245010405778885,
        0.014013009145855904,
        0.0794450044631958,
        -0.0013622649712488055,
        0.018347198143601418,
        0.004665475804358721,
        -0.014587575569748878,
        0.07676304876804352,
        0.03406989574432373,
        -0.05548630282282829,
        0.020078390836715698,
        0.0157585758715868,
        0.021110426634550095,
        0.03473671153187752,
        -0.02817007526755333,
        -0.022815877571702003,
        -0.004931091330945492,
        -0.03523113206028938,
        -0.03809433430433273,
        0.047727521508932114,
        0.06349269300699234,
        0.06593136489391327,
        0.0065349675714969635,
        0.029173903167247772,
        -0.042081549763679504,
        0.06306757777929306,
        -0.011098465882241726,
        -0.04625106602907181,
        0.054517101496458054,
        0.020403435453772545,
        0.09194383025169373,
        0.05079251900315285,
        -0.0511658675968647,
        -0.01830565184354782,
        -0.025669215247035027,
        0.011949064210057259,
        -0.0373900905251503,
        -0.014603808522224426,
        0.04395877942442894,
        0.026448138058185577,
        -0.028327830135822296,
        -0.07306282967329025,
        0.03646590933203697,
        0.03513190522789955,
        0.022628355771303177,
        0.05396931245923042,
        0.007557059172540903,
        0.07726503163576126,
        0.03806934878230095,
        -0.006967160385102034,
        0.017677918076515198,
        -0.015910936519503593,
        -0.06905060261487961,
        -0.025908682495355606,
        0.056108757853507996,
        -0.03100702352821827,
        4.463538659800419e-33,
        -0.0707971528172493,
        -0.004764840938150883,
        -0.04092004895210266,
        -0.055669207125902176,
        0.03069484606385231,
        -0.014879598282277584,
        0.05554646626114845,
        -0.008590664714574814,
        -0.028644662350416183,
        0.009131083264946938,
        -0.06710208207368851,
        0.024981601163744926,
        -0.05208941176533699,
        0.02195095643401146,
        0.04981572553515434,
        -0.040362391620874405,
        -0.01033084373921156,
        0.027682648971676826,
        -0.004350602626800537,
        0.017142977565526962,
        0.031461797654628754,
        -0.01706000789999962,
        0.0066121602430939674,
        -0.06513368338346481,
        0.0348057746887207,
        0.014716435223817825,
        -0.012217625975608826,
        -0.022892560809850693,
        0.11156056076288223,
        0.04188006743788719,
        -0.04546607285737991,
        -0.03433516249060631,
        -0.0036953152157366276,
        -0.09907318651676178,
        -0.06257109344005585,
        0.011136949993669987,
        -0.02256794273853302,
        -0.07299855351448059,
        0.07596462965011597,
        -0.06473158299922943,
        -0.09362635016441345,
        -0.017923327162861824,
        -0.06927122920751572,
        -0.07250050455331802,
        0.022113848477602005,
        -0.0003542954509612173,
        0.01701429672539234,
        -0.0037951115518808365,
        -0.010088217444717884,
        0.024367228150367737,
        -0.11344169825315475,
        -0.023098653182387352,
        -0.056047871708869934,
        -0.02473343349993229,
        -0.06048866733908653,
        -0.07929036766290665,
        -0.00531878462061286,
        -0.032898977398872375,
        0.04024399071931839,
        0.018882762640714645,
        0.017512265592813492,
        -0.007254120893776417,
        0.08108274638652802,
        -0.0450715571641922,
        -0.024125806987285614,
        0.02951401099562645,
        0.06925207376480103,
        -0.02598966658115387,
        -0.09267424046993256,
        0.024409284815192223,
        0.002190348459407687,
        -0.032541513442993164,
        0.0037043115589767694,
        -0.07313206046819687,
        -0.03882763162255287,
        -0.03084442764520645,
        -0.07947592437267303,
        0.022608932107686996,
        -0.08753450214862823,
        0.02326524816453457,
        0.017251813784241676,
        -0.02083846554160118,
        0.016559584066271782,
        0.09971213340759277,
        -0.01923350617289543,
        0.03721925988793373,
        0.004955729003995657,
        0.032082561403512955,
        -0.10808087885379791,
        0.05833257734775543,
        0.026242198422551155,
        0.0768316313624382,
        -0.006744960322976112,
        -0.0281896460801363,
        -0.08510241657495499,
        -5.79587811982697e-33,
        -0.009976998902857304,
        -0.040357816964387894,
        0.018585901707410812,
        0.02432728186249733,
        -0.022942977026104927,
        0.020886443555355072,
        0.013716311194002628,
        -0.008737048134207726,
        -0.0028648467268794775,
        -0.08273804187774658,
        -0.036597516387701035,
        0.015070045366883278,
        -0.03709467872977257,
        -0.025448676198720932,
        0.031664226204156876,
        -0.022980112582445145,
        -0.03804033249616623,
        -0.02172892913222313,
        0.04326409101486206,
        -0.09107515215873718,
        0.12265606224536896,
        0.05410690978169441,
        0.005324454978108406,
        0.033101703971624374,
        -0.017945563420653343,
        -0.06230231001973152,
        -0.04744169861078262,
        0.02738642692565918,
        -0.033222828060388565,
        0.0007019938202574849,
        0.02660510130226612,
        -0.002203661948442459,
        -0.001027277554385364,
        -0.02908424474298954,
        0.1254419982433319,
        -0.016362641006708145,
        -0.005445294082164764,
        0.10379938036203384,
        -0.002695823321118951,
        0.004270750097930431,
        0.03651544079184532,
        0.010967200621962547,
        0.06313227117061615,
        -0.04875589534640312,
        0.06852106750011444,
        -0.07280783355236053,
        -0.08140440285205841,
        -0.026489581912755966,
        0.06185669079422951,
        0.012909972108900547,
        -0.06965624541044235,
        -0.10069995373487473,
        0.016096560284495354,
        -0.03003937564790249,
        -0.06772781163454056,
        -0.017338423058390617,
        -0.0248845424503088,
        -0.013136614114046097,
        0.019713381305336952,
        -0.013675671070814133,
        -0.027804093435406685,
        -0.010457406751811504,
        -0.03529417887330055,
        -0.011098834685981274,
        0.04703144356608391,
        -0.016333207488059998,
        0.032533060759305954,
        0.049238916486501694,
        0.008734861388802528,
        0.036250751465559006,
        -0.0024640669580549,
        0.03368256241083145,
        0.06811151653528214,
        -0.04522057622671127,
        -0.03064623661339283,
        0.086896613240242,
        0.04362448304891586,
        -0.06834710389375687,
        0.002305450150743127,
        -0.09909366071224213,
        0.03317097947001457,
        0.055139582604169846,
        0.0845266655087471,
        -0.021754520013928413,
        -0.059424832463264465,
        -0.0013977093622088432,
        0.07856648415327072,
        -0.03282681852579117,
        -0.037273626774549484,
        -0.004880855791270733,
        -0.04874938726425171,
        -0.041860830038785934,
        -0.07357762008905411,
        0.01953667588531971,
        -0.033439140766859055,
        -5.544776726651435e-08,
        -0.05242638662457466,
        0.012550816871225834,
        0.03267844766378403,
        0.05469310283660889,
        0.026293793693184853,
        0.005110256373882294,
        -0.02179507166147232,
        0.045792460441589355,
        0.05844531208276749,
        0.002607417991384864,
        0.05143054574728012,
        -0.06872279942035675,
        -0.03220145404338837,
        0.053266022354364395,
        0.04713059961795807,
        0.08642154932022095,
        -0.026011956855654716,
        0.10568488389253616,
        -0.04621481895446777,
        -0.047424089163541794,
        0.03396279737353325,
        0.04535159096121788,
        0.05528923124074936,
        0.006228461395949125,
        0.0040722996927797794,
        0.038758859038352966,
        0.011175760067999363,
        0.10226013511419296,
        0.09649006277322769,
        -0.008730682544410229,
        -0.08830871433019638,
        -0.024301063269376755,
        -0.006532329600304365,
        0.04864001274108887,
        -0.020301245152950287,
        -0.09950298815965652,
        -0.09222494810819626,
        0.04234061390161514,
        0.0088391387835145,
        -0.0023026226554065943,
        -0.030240492895245552,
        -0.06300073117017746,
        -0.007637054659426212,
        -0.04845736548304558,
        -0.022838862612843513,
        -0.08276241272687912,
        -0.04263485223054886,
        -0.004591344855725765,
        -0.03255357965826988,
        0.09201853722333908,
        -0.014531237073242664,
        -0.016491971909999847,
        0.08457409590482712,
        0.04334687814116478,
        0.015721987932920456,
        -0.01226391177624464,
        0.019935011863708496,
        -0.0004961587837897241,
        -0.013004319742321968,
        0.023986972868442535,
        0.09889155626296997,
        -0.06796760857105255,
        -0.04389882832765579,
        0.1456175595521927
    ]
}