{
    "id": "uYbdx4I7STg",
    "title": "The Weird World in RGB",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-08-28T17:25:17Z",
    "video_url": "https://www.youtube.com/watch?v=uYbdx4I7STg",
    "category": "Science & Technology",
    "tags": [
        "RGB",
        "color theory",
        "color vision",
        "color blindness",
        "hue",
        "saturation",
        "studio",
        "red",
        "green",
        "blue",
        "primary colors",
        "human vision"
    ],
    "views": 2523567,
    "likes": 77277,
    "comments_count": 4952,
    "description": "You can support this channel on Patreon! Link below    Have you ever wondered why the word looks so weird? Wait. Weird as in, like, all the time? Of course! We live in a weird world! But light, though! What about weird light? Ahhh, that's what this video is all about. This is the strangest vid. description I've written in a while. Cool.  Alright, so now here's the part where some links go:  The all-important second channel discussion;   Technology Connections on Twitter:   The TC Subreddit   Technology Connections 2 (the channel where I sometimes talk about stuff and generally dont prepare for anything):   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel stay as weird as it is (and maybe, just maybe, get even weirder!), please check out my Patreon page. Thank you for your consideration!   And of course, thank you to the following patrons! Paul Robins, David Riediger, Les, Keenan Finucan, funcrusher, Ian Clanton-Thuon, Ryan Pratt, Don Nguyen, Gregory Knott, Paul Newton, Greg Golds, Robbert van Rijsewijk, Theo Keeler, Travis Hagen, Albizu Garcia , Tyler Alberico, Benjamin Ratner, Doug Davenport, Paul Sharp, Craig Brickey, Zidy, Justin Trout, Brandon, John Galus, Karl Kornel, Danila Fediashchin, KD, Sound Board, Adam, Zach Rose, Arvin Prasetya Wiranata, Patryk Majewski, Chris & Brigette Rodriguez, Mattis Mlbakken, Dirk Lembens, WB, AmbientCyan, Sam Calandra, Wolfgang Gschwendtner, qzb, William Preston, Dave Treadwell, Stuart Stanfield, Howard Longden, Christopher Olson, Kor Nielsen, Adrian Hunziker, Kori Fulgham, Stephen Amar, Bryce, Andy Holzhammer, Ethan Mears, Eli Rueda, Jon Clegg, David Jeroslow, Ian Hills, Charles MacDonald, Andrew, Tim Jones, Chris Burger, Paul, Phil E, AnsulFolf, c sporn, Zachary Kordenbrock, Roy Burns, Ian Spence, Mike A, Brandon Dean, Alex Dodge, hipp1eguy, Blake Kwasnicki, Mick Carroll, Justin Derleth, El Jefe, mrjoro, NEON725, Bree Asher, Emily Eisenberg, Mark Christian, Dylan Leblanc, Samuel, Brad Rustvold, Megan Turcotte, LGR, Jeffrey Frasure, kn0tsin, Pedro Soto, Michael Gooden, David Wulff, Dan Ryan, Max, Fredrik Lindroth, Michael Riegel, Paul Kavanagh, Tarocco, AFIFI, Zane Finley, Isaac Clarke, Sean Hearrell, Christopher Macdonald, Selectric, Hamrat, Adam De Witt, Keithius, Snke Schlter, Julian Haldenby, Seb Bacanu, Mauricio Lara, Hunter Thornsberry, Austin C Borger, Gabe Cook, Anapan, S0N0S, Sonic Ether, mike quick, Adam, Lucas, microserf, Daniel Kraut, Patrick Williams, Andr Gil da Costa, Paul Han, jacob topkok, Luka Sanzin, Peter Hillier, PeterH, Gus, William Holt, Grant Campau, Else, Michael Dunn, Rin, Cameron Workman, Richard Hicks, Matthew Foulks, Mike Roach, Simon Janssen, Jorge Caballero, Claude Dion, Kyle Messner, Mainstream, Matthew Schwartz, gs, ashka, Mr. Yan, Matthias Feist, RedR0ze, adan c, Thomas Fuchs, Ralph, Alan Holland, Philipp Doppelhofer, Dan Boulden",
    "description_links": [
        "https://youtu.be/gN5TSzRUxKk",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "What color is this? Youre probably thinking, \"its red!\" which, well, it is. And what about this? Why, its green, of course! And what video on color would be complete without an appearance by our old friend blue? Weve been using these three colors to fool our eyes and brains into thinking that were looking at a full-color image for over a century. We can do this because of how our eyes and brains perceive color. Its all about ratios, and though it often seems a little freaky, we can mimic the effect of any real color using just these three in controlled amounts. But now that we have the luxury of bringing the primary colors of light into the real world with bright, monochromatic LEDs, we can get a glimpse into just how wonderfully strange our sense of color perception actually is. In this video, were going to look at a series of demonstrations where objects in the real world are lit using light from the digital world. What well find is that things can behave a little unexpectedly when we play around with light. None of the footage in this video has been altered. I promise no matter how weird some of this looks, Im seeing the same things in person. Lets start with a brief overview of what it is were doing here. Im using these RGB studio lights to provide illumination. I can control the ratio of red, green, and blue light they produce by adjusting their hue and saturation parameters. For the most part, well be staying with a saturation of 100%, and this means well be cycling through the 3 primary colors, red, green, and blue, as well as various shades of the three secondary colors that lie between them, yellow, cyan, and magenta. When I need to, I can switch to standard phosphor-coated white LEDs which provide a reasonable approximation of true, full-spectrum lighting. Yes, these lights really are G Bees knees. In RGB mode, the light they produce is trichromatic, just like our vision, but each individual color is monochromatic, meaning its comprised of a single wavelength. And this is where the breakdown between the real and digital world can occur. Ill explain this in a little more detail shortly, but first lets move on to a demonstration. Well be spending much of this video, in the dark. Here we have a kind of disappearing, color-changing ink. This whiteboard, when lit with apparently yellow light, appears to have some red writing on it. Well, watch this. Now its gone. But it re-appears, now as a slightly more orange color, with the presence of some blue light. Now watch as before your eyes the ink becomes a jet black. It stays black even as the light grows brighter and we approach cyan, before the black turns to red once more. And finally, its gone again. Whats happening here? Well, the ink on this whiteboard is in fact red. Switching to normal white lighting reveals that. The red ink absorbs nearly all of the light coming from the green and blue LEDs, which is why the ink appears black when the scene is anywhere between blue and green. It doesnt reflect any of that light back into the camera. But in addition to absorbing the green and blue light, this red happens to be a near-perfect match to the red produced by the lights red LEDs. And thats why it disappears under red light. The white of the whiteboard reflects pretty much all of the red light back to the camera, as do most white objects, but so does the red ink. And so, theres very little contrast between the ink and the board, and the ink effectively disappears. Lets move on. What color is this can of spray paint? Its pretty hard to tell, isnt it? In fact, its impossible to tell. Right now, this can of spray paint is being lit solely by the red LEDs, which means its lit by a monochromatic light source. Doing this fundamentally breaks our color vision because we rely on the mixing of colors to determine what it is were seeing. Under the same red light, lets look at some construction paper. This packaging says there are 8 colors here. Well, what on Earth are they? As far as I can tell, these are red, a darker red, a differently darker red, and uh, more red. I think theres black, too, but Im not sure. With only one wavelength of light available in this scenario, theres just no way to know what it is youre seeing. Notice how we cannot tell what the colors are on these Rubiks Cubes. We can see that each color reflects the light back in different amounts, causing the stickers to appear in different brightness levels, but theyre all just different shades of the same red. But, with this being a Rubiks Cube, we know the colors are white, yellow, orange, red, green, and blue. We can make some educated guesses into which stickers are which colors. The brightest are probably red, yellow, orange, and white, as these will reflect most or all of the red light back into the camera. The darkest are going to be blue and green. Now we can be reasonably sure the darkest of them all is blue, as thats farthest from red, and the next darkest is green. But as far as the bright colors? Thats really anybodys guess. The brightest is probably white, but then again there look to be too many that we might call white. So white and at least one other color look kinda the same. But which colors are they? Well, lets switch the light over to white and find out. Oh, sorry, this one is actually monochromatic lemme, lemme get that out of here. So, we were right about green and blue, but orange, white, and yellow all appear to be the same. Red was actually slightly darker, which you might not have expected given that we were using red light. This tells us that the hue of this red is actually not purely red, as it does absorb some of the red we were throwing at it. And if yellow and orange were reflecting the same amount of red light back as white, well that again goes to show how strange our color perception is, and why monochromatic light breaks it. So how do we see in color? Well, in our eyes, we dont just have a bunch of plain photoreceptors. We have some, known as rods, which just detect brightness, but those of us with typical trichromatic vision also have three types of color-sensitive cells, called cone cells. These are pigmented to filter the wavelengths of light that hit them. Now, we often think of these cone cells as being sensitive to red, green, and blue light. Which is broadly true, but their actual stimulation curves look like this. Notice how the medium and long cones, which correspond to green and red, kinda, overlap a lot, but the short cone is way over there. Well, where they are along the spectrum doesnt actually matter all that much. What matters is that they respond differently to any given color. Say we have a yellow-green wavelength right here. Well, for this one color, and this one color only, the long and medium cones get equal stimulation, and the blue cones get negligible stimulation. This unique ratio allows our brains to interpret this color as yellow-green. As we move towards red and head into yellow, now the medium cone gets progressively less stimulated, and the long cone gets more stimulation. So, our brains know this color is closer to red than it is green. As we continue moving deeper into true red, the stimulation from the long cone starts to taper off, but the medium cone is tapering off faster. The important thing to remember is that any color at all along the visible spectrum will cause a unique ratio of stimulation between these three cells, and so our brains know what color that is. And so, we can easily fool our eyes and brains into thinking were seeing any color at all by using just three primary colors. We need one of them to be way over here, so that the long cone gets a fair bit of stimulation, but the medium cone doesnt get all that much. So well use red. We also need one to the left of the long-medium crossover, that way it stimulates the medium cone more intensely than the long. So well use green. And of course, we also need one way over here that stimulates the short cone a lot, but doesnt really influence the other two. So well use blue. Now, to make a color like yellow-orange, we can simply mix red and green together, so that theres a lot of red and a bit of green. This mixture causes the same stimulation that an actual yellow-orange object would. Because theres overlap between the three cone cells, all real colors just cause a unique mix of stimulation between the three of them. That includes, by the way, white, which is all three in close to equal amounts. So, if we use three pure colors that allow us to selectively stimulate the three cells with any given ratio, we can artificially reproduce all visible colors. Our eyes simply dont have a way to know theyre being fooled. But while we can make any color appear by using just three colors in different ratios, that doesn't mean that the world will look right without the whole spectrum to paint the whole picture. And unless we have a way to make the cone cells get stimulated in different ratios, we cant see color at all. And with that in mind, lets move onto some more demonstrations. This scene contains many red objects. But, under monochromatic blue light, youd never know. Watch what happens, though, when I add just the tiniest amount of red light. Suddenly, the red pops into existence. This is a pretty trippy effect in person, because its as if someones messing with the RGB sliders of real life. Until we have red light available, red objects appear, well, grey or black. Even with green light, the same thing occurs. Notice how with green and blue light together, we can start to see the yellow and oranges of the Rubiks Cube become distinct from the blue and green. Still, though, the red objects remain completely dull. Pure green light keeps them in the dark, just like blue. Keep in mind that the green light is still stimulating the long cones a fair bit, but without a third, longer wavelength to allow for comparison between the long and medium cones, our brains cannot see red. Plus, since the red objects in the scene arent reflecting any of that green light, they stay dull. Add just a hint of red, though, and suddenly the scene explode into color. Now, there is red light to be reflected, and more importantly for our eyes, there is red light to be detected and compared with green and blue. Heres a different kind of color. A game boy color. Under blue light, this thing looks weird to say the least. Now Ill add a bit of red and green, alternately. Compare the light on my hand to the light on the game boy, and youll see that overall, Im not changing the color in the scene much at all. But the game boy drastically changes. This game boys color, by the way, is dandelion. Which is of course, to our eyes, a mixture of red and green. An important thing to note is that, just like our eyes, the cameras Bayer filter (which actually separates subpixels into red, green, and blue elements) doesnt filter red, green, and blue perfectly. Theres a lot of overlap. And I can show it to you, even with only one wavelength to see. You might assume that if light is a monochromatic green, then the cameras blue and red subpixels will never become active. But this isnt true. If I overexpose the image, youll see that it starts turning white. That happens because even though the light source is monochromatic, the red and blue filters will still let some through, so the image starts to turn white with enough exposure. The same thing happens with blue and red. However, this doesnt mean we can start to tell colors apart. We still only have one wavelength illuminating the scene, which means the ratio of stimulation in the cameras subpixels stays the same. The cameras method of vision is surprisingly similar to our eyes. Well, as a matter of fact its built for our eyes. And even under normal exposure levels, there is some green slipping in. You might expect the image to turn black if I remove all of the red channel, but in fact theres a faint green image hiding underneath. That green is actually helping to define the ultimate hue of the red were seeing on-screen. Which brings me to my next demonstration. We can have a monochromatic light source of any color, not just red, green, and blue. With RGB lights, I can only produce yellow light by mixing red and green. This then becomes a dichromatic color, and if I illuminate this scene with it, we can actually tell some of the colors apart. We can even kinda tell blue from green. But, if I break out my yellow traffic light module (or amber, whatever), this is in fact a monochromatic yellow. This color looks quite similar to the yellow Ive been making by mixing red and green, but its actually very different. So now, even though the green and red subpixels are both getting stimulation from the yellow light, because its actually just yellow they always receive the same relative stimulation no matter whats in the scene. Our eyes, and the camera, both see these two sources of light as essentially the same color, but if we use them to illuminate the real world, and take a look at how they get reflected back, we discover theyre actually very different. And that brings us to what makes this whole ordeal so messy. You may have heard of a term called the color rendering index, or CRI. This describes how well an artificial light source reproduces the color of the objects around us. Incandescent lights, being a blackbody radiator, had a perfect CRI, just like the sun, but more efficient LED and fluorescent light sources, indeed practically all light sources that arent incandescent, dont emit light as a perfectly uniform spectrum. Now, as we know, one of the most common ways to mimic white light is to produce red, green, and blue light, because, well, if you havent figured that out by now youve not been paying much attention. This works absolutely fantastically for creating a display device like the one youre staring at now. Because its providing its own illumination, it doesnt need to worry about how the red, green, and blue channels interact with the objects around you. It just needs to fool your eyes into thinking theyre looking at a full-color image. And, well, displays are getting better and better, with incredibly lifelike colors, all from just three colors of light. Except for that one time Sharp got all weird with the yellow subpixel which was absolutely unnecessary especially since nobodys encoding color in an RGB-Y space, but I digress. But the problem with using just three colors of light to illuminate the real world is that this rarely looks right. Think about that whiteboard earlier. The red ink was invisible under red light. This meant that it reflected practically all of the red light back. Now, imagine Im using these lights with red, green, and blue all working together. This looks white to my eyes, but when it gets reflected off of the objects around me, the ratio of colors coming back can be way off. In the case of the whiteboard, the red looks way too intense and bright. Which makes sense. If one third of the light from these lights is red, and the red ink reflects all of it, its suddenly freakishly bright because, well, red is not one third of the color spectrum. Under true white light, a much greater percentage of light gets absorbed, and the red appears more dull, like it should. As a quick note, this is the one demonstration where the camera couldnt quite capture what my eyes were seeing. The difference in person is much more dramatic. The problem here is that the ability to reduce the real world into three wavelengths of light is not reversible. If we have a truly white light source, then all the in-between colors get reflected as they truly are. Our eyes can see any wavelength of light because of all that overlap between the cone cells. And indeed, cameras can see any wavelength of light, because their RGB bayer filters also have overlap between them. And so we can reproduce the stimulation real objects cause in our eyes with just three wavelengths of light, but we cannot expect those three wavelengths to produce the same stimulation ratios that they should when they hit and get reflected off of real objects in the real world. This can perhaps best be demonstrated by the color purple. Purple is a rather strange color in general. It, along with magenta, are what are called non-spectral colors. If you look on the color spectrum, youll find violet just on the other side of blue, but true violet is rather dull, and in fact we have a hard time seeing it. Which is no surprise since it barely registers with any of our cone cells. Purple and magenta are kinda similar to real violet, but in a sense, these colors exist only in our minds. Thats pretty wild, when you think about it. Now obviously purple things exist in nature and we can see them with our eyes, so its not like the color is imaginary. But, it cannot be reproduced with a single wavelength of light. We only see purple and magenta when our eyes receive blue and red stimulation, but little green. Therefore, purple and magenta objects absorb a fair bit of green light, but reflect both red and blue. And luckily, our brains have synthesized this combination of stimulation into magenta, and not the average wavelength between them, as we do with yellow and cyan. Otherwise, it would be another green. Anyway, lets take a look at our old friend Putt-Putt. This particular anthropomorphic automobile is a rather vibrant shade of purple. Now, using the phosphor-coated white LEDs, he looks pretty normal. But when I switch to the RGB LEDs, well not so much. Under green light, he looks pretty dull. Which we might expect, given that we can of course make purple by mixing red and blue pigments, which will together absorb mostly green wavelengths. When we add blue light, well now he just looks blue. All into the cyan range, Putt-Putt looks just like a blue, and once we hit blue, well now he looks kinda like a grey, as his white features become blue, and his body becomes a slightly darker blue. But heres the weirder thing. Add red, and now he really looks grey. If I change the angle so you can see his tongue, yes cars have tongues, duh, his tongue is bright red, but his body still looks grey. And perhaps stranger still, replace the blue with some green and move into yellow territory and he looks burgundy? A burnt red? I dont know exactly what this color is, but it is not purple. Now, some of this is down to how our brains white balance works, as we are comparing his white eyes to his body color, and in fact if we look in Photoshop well see that what looked grey to us is actually fairly purple. Its not the right purple, but it is purple. And when you think about it, that makes perfect sense. Assuming this shade of purple is just a darker magenta, then if lit with magenta light, his body would appear to be the same hue as his white features, but at a reduced intensity. Without any sort of color contrast, that reduction in intensity just looks grey. Grey is simply a darker version of white, and what is white in this scene, is actually magenta. This also explains why his tongue looks so vibrant. His tongue is now the only thing actually changing the relative amounts of color being reflected back. Since it absorbs blue like a good red should, its now able to set itself apart from the magenta mess that is everything else. And of course, we can also explain why he looks red under yellow light. His body will be absorbing most of the green coming from the lights, so the only thing it reflects back is red. It looks a little weird because of the fact that it does absorb some of the red just as it absorbs some blue, so it looks darker than his tongue. And our brains vain attempt to compensate for the yellow light and assume thats real white makes it look stranger, still. Now were not quite yet done with Putt-Putt. So far, Ive been showing you how he looks under various colors of light. But even under apparently white light, comprised of red, green, and blue, this purple color simply does not get rendered correctly at all. Notice how differently he looks under normal white light using the phosphor-coated LEDs, compared to the false white made by the RGB LEDs working together. Something about the way this purple absorbs wavelengths in the visible color spectrum simply cannot be reproduced using a trichromatic RGB light source. At least, not these lights. So keep in mind that even though I can show you this royal purple on a screen using only some red, some green, and some blue, I cant just use those three colors in the real world and expect to achieve the same result. Now, before I leave you, well first of all that can of paint was yellow, sorry I forgot to answer that earlier, but more importantly while setting these demos up I think I may have accidentally discovered one of the most effective ways to understand color blindness. Now, Ive seen lots of simulated images online, but theyve never really clicked with me like this did. The most common type of color blindness is red-green colorblindness. There are varying degrees of this deficiency but in general it means that the green / medium cones are either malfunctioning or not present. Now, I have no way to turn down or otherwise stop the green cones in my eyes from working. But, if I light the room Im in with dichromatic magenta light, the effect is somewhat similar. Now, its not like this is what a color-blind person sees. Especially because the entire scene is intensely colored, and green objects, like this marker, appear very dark, not simply similar to red. But, for the first time, I truly felt like I could not distinguish red and green all that well. The snake figure, here, suddenly had its red and lime green become awfully similar. Again, this is by no means accurate, look at how the green stickers on the Rubiks Cube look black, but it is certainly interesting to have the color information of the real world become limited in ways Ive never experienced. Anyway, thats it for now, I think. I didnt buy these lights assuming I was going to make a video about how strange RGB lighting is, but playing around with them led to some interesting places. And honestly, its helped me understand color vision even better than I did before. Thanks for watching, and as always a huge thank you goes out to the people supporting this channel on Patreon. Thanks to the support of people like you, I can make bizarre little detours like these, and I really enjoy it. I hope you do, too. If youd like to join these people in supporting my work, you can check out the link in the description. Thanks for your consideration, and I'll see you next time! trichromatically smooth jazz Hey! Its me! But from the future! Woah. So many of you probably know this but if you didnt, I have a second channel where I sometimes upload rather random things, they tend to be kind of rambly, and I wanted to let you know that following this video I want to have a more relaxed discussion about some of the subtle differences between using true white lighting and RGB white lighting. So if you want to check that out, theres gonna be a link in the description as well as a card on the end screen. For now, I hope youre enjoying this rather groovy looking Rubiks Cube. It's pretty groovy looking. Groovy.",
    "transcript_keywords": [
        "red",
        "light",
        "color",
        "red light",
        "green",
        "blue",
        "colors",
        "blue light",
        "white",
        "green light",
        "red light back",
        "eyes",
        "white light",
        "yellow",
        "lights",
        "yellow light",
        "cone",
        "RGB",
        "light back",
        "stimulation"
    ],
    "transcript_entity_values": [
        "third",
        "Bayer",
        "Rubiks",
        "only one",
        "Photoshop",
        "Putt-Putt",
        "two",
        "Putt-Putt",
        "RGB",
        "3",
        "8",
        "just three",
        "one third",
        "Rubiks Cube",
        "Patreon",
        "Grey",
        "CRI",
        "at least one",
        "100%",
        "first",
        "one",
        "Earth",
        "over a century",
        "Sharp",
        "second",
        "three"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORDINAL",
        "CARDINAL",
        "LOC",
        "DATE",
        "PERSON",
        "ORDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.08989833295345306,
        -0.11692271381616592,
        0.06991991400718689,
        -0.03666548430919647,
        0.0878419429063797,
        -0.08721356093883514,
        0.08801472932100296,
        -0.021933238953351974,
        0.0166064091026783,
        -0.05238254740834236,
        -0.017046703025698662,
        0.031101679429411888,
        0.007944047451019287,
        0.007621444296091795,
        -0.01262790895998478,
        0.004567422438412905,
        -0.00014767757966183126,
        -0.10600360482931137,
        -0.14091670513153076,
        0.030449489131569862,
        0.007271477021276951,
        -0.059200745075941086,
        0.042344678193330765,
        -0.02920382283627987,
        -0.03955920785665512,
        -0.012575763277709484,
        -0.005474794190376997,
        -0.02959590218961239,
        0.017378246411681175,
        -0.058965567499399185,
        -0.043674059212207794,
        0.1462508887052536,
        -0.05411861464381218,
        0.004987894091755152,
        -0.007771530654281378,
        -0.010458596050739288,
        0.0344880186021328,
        0.005435295403003693,
        -0.0008028774755075574,
        -0.0011978726834058762,
        0.034230295568704605,
        -0.1306181102991104,
        0.04246032238006592,
        0.004885975271463394,
        -0.07031739503145218,
        0.013089943677186966,
        0.04375527426600456,
        -0.07278246432542801,
        0.008741747587919235,
        -0.08103755116462708,
        -0.03251686319708824,
        -0.06340925395488739,
        0.04871024936437607,
        0.03533957526087761,
        -0.03556422144174576,
        0.04826292395591736,
        0.04241769015789032,
        0.03144142031669617,
        0.047378070652484894,
        -0.03217511251568794,
        0.04891399294137955,
        -0.03919707611203194,
        -0.030519532039761543,
        0.019396644085645676,
        0.06930507719516754,
        -0.0100241145119071,
        -0.027919132262468338,
        0.08656550198793411,
        -0.008900991640985012,
        -0.0681711807847023,
        -0.027193965390324593,
        0.057369548827409744,
        0.037616144865751266,
        0.05453817546367645,
        0.02552136220037937,
        0.003124756971374154,
        0.057637449353933334,
        -0.04354119300842285,
        0.007383081596344709,
        -0.030130624771118164,
        0.0850367471575737,
        -0.011365337297320366,
        -0.01412862166762352,
        -0.0462697371840477,
        0.022888032719492912,
        -0.011399435810744762,
        -0.014752074144780636,
        0.023073485121130943,
        -0.008045902475714684,
        0.024824419990181923,
        -0.12529602646827698,
        0.09452132880687714,
        0.08659570664167404,
        -0.026171762496232986,
        0.01576467789709568,
        -0.008403741754591465,
        -0.025411538779735565,
        -0.06512676924467087,
        -0.036571383476257324,
        0.06977279484272003,
        0.012491823174059391,
        0.039900001138448715,
        0.01788560301065445,
        0.010240535251796246,
        -0.03547815605998039,
        -0.007467019371688366,
        -0.07728367298841476,
        0.15375877916812897,
        0.11537270247936249,
        0.03249843046069145,
        -0.04655733332037926,
        0.039788488298654556,
        -0.023905351758003235,
        -0.0096983527764678,
        -0.06029081344604492,
        0.027337921783328056,
        0.006137970834970474,
        0.037709739059209824,
        0.047427013516426086,
        -0.04060259461402893,
        0.015168344601988792,
        0.01945943757891655,
        -0.023204252123832703,
        -0.024504590779542923,
        0.0882476419210434,
        -0.08970348536968231,
        -0.004012918099761009,
        1.0808219643524798e-33,
        0.06226691976189613,
        0.10182689875364304,
        -0.05436383932828903,
        0.0061629158444702625,
        0.08794953674077988,
        0.048057109117507935,
        -0.09413895010948181,
        0.02633071132004261,
        -0.11705610156059265,
        0.029551515355706215,
        0.03624250367283821,
        -0.02415645308792591,
        -0.032184991985559464,
        0.01497947983443737,
        -0.018930407240986824,
        -0.0876823291182518,
        -0.09102413803339005,
        -0.06660298258066177,
        -0.03874232620000839,
        0.01195576973259449,
        0.018284961581230164,
        0.04101291298866272,
        0.02168835885822773,
        -0.002186782890930772,
        0.0022129486314952374,
        -0.05894852802157402,
        0.0404777005314827,
        0.029669499024748802,
        0.11002640426158905,
        0.0331486314535141,
        -0.018753785640001297,
        0.07080302387475967,
        0.033720701932907104,
        -0.03053879365324974,
        0.035067763179540634,
        -0.0646653100848198,
        0.013697272166609764,
        -0.14439518749713898,
        0.01892356388270855,
        -0.01007762923836708,
        0.003078488865867257,
        0.021137714385986328,
        -0.05614253506064415,
        0.022464599460363388,
        -0.03312569484114647,
        0.07607237249612808,
        0.16716986894607544,
        -0.032593682408332825,
        -0.030950060114264488,
        0.05929164960980415,
        -0.07170111685991287,
        0.0017361869104206562,
        -0.024637993425130844,
        -0.03767021745443344,
        0.025964003056287766,
        -0.04925156012177467,
        -0.007620722521096468,
        -0.03335798531770706,
        0.03731174021959305,
        -0.08559036999940872,
        0.01760236918926239,
        -0.008453288115561008,
        -0.0008751834975555539,
        -0.018674949184060097,
        -0.02945830300450325,
        0.03301454707980156,
        0.0016644616844132543,
        0.06529869139194489,
        -0.022525597363710403,
        0.03334211930632591,
        -0.04101099446415901,
        -0.004090041853487492,
        -0.07924207299947739,
        -0.07133695483207703,
        -0.04094020277261734,
        0.00826831255108118,
        -0.07720271497964859,
        0.01725061610341072,
        0.05223366990685463,
        0.02413305453956127,
        0.04089144617319107,
        -0.020541833713650703,
        0.002154333284124732,
        0.014367347583174706,
        -0.016248643398284912,
        -7.790353265590966e-05,
        0.033095456659793854,
        -0.031441301107406616,
        0.004958548117429018,
        0.007312004454433918,
        0.023887358605861664,
        0.013862717896699905,
        0.037301305681467056,
        -0.008268123492598534,
        -0.043280843645334244,
        -1.9720359552333553e-33,
        -0.03176751360297203,
        -0.019428862258791924,
        -0.0543181411921978,
        0.013337292708456516,
        0.06799567490816116,
        -0.10232841223478317,
        0.0132691515609622,
        0.0032158889807760715,
        0.09458117932081223,
        0.014070648699998856,
        0.08470263332128525,
        0.008987030945718288,
        -0.0825580283999443,
        -0.040546905249357224,
        -0.01964753307402134,
        -0.08744044601917267,
        0.031196219846606255,
        0.06228642910718918,
        -0.030111830681562424,
        0.019537100568413734,
        0.01945285126566887,
        0.027827810496091843,
        -0.08780492097139359,
        0.03559882566332817,
        0.020787961781024933,
        0.06259417533874512,
        -0.038350991904735565,
        0.05414372310042381,
        0.014678046107292175,
        0.019328666850924492,
        -0.00173651659861207,
        0.03765624389052391,
        -0.039578262716531754,
        -0.03563068062067032,
        0.06184035912156105,
        0.05132012441754341,
        0.030021345242857933,
        -0.0033943273592740297,
        -0.041335273534059525,
        -0.07157253473997116,
        0.024671172723174095,
        0.042083557695150375,
        -0.027874864637851715,
        -0.04318329319357872,
        -0.10365370661020279,
        -0.029522793367505074,
        -0.09216076880693436,
        -0.050467364490032196,
        -0.11265718191862106,
        0.010172098875045776,
        0.060010556131601334,
        0.008721988648176193,
        0.08199135214090347,
        -0.05798798054456711,
        -0.034885648638010025,
        0.019263003021478653,
        -0.022735366597771645,
        0.08873263001441956,
        0.05123791843652725,
        0.015535038895905018,
        0.06599186360836029,
        0.009805675595998764,
        -0.02689685858786106,
        0.003554384224116802,
        0.04639030247926712,
        -0.03362833708524704,
        0.038844574242830276,
        0.059585846960544586,
        0.03986499458551407,
        0.040745217353105545,
        0.022853676229715347,
        -0.02418585866689682,
        -0.08673951774835587,
        -0.025329820811748505,
        0.055256832391023636,
        -0.05042402073740959,
        0.054408103227615356,
        -0.0715014636516571,
        -0.10300734639167786,
        0.07597765326499939,
        -0.006808750797063112,
        0.07910139858722687,
        0.05678606033325195,
        0.002133331960067153,
        0.07530642300844193,
        0.04728320613503456,
        0.023595411330461502,
        0.09917619079351425,
        -0.0678740069270134,
        0.015402771532535553,
        -0.03261581435799599,
        0.04553576931357384,
        -0.006432692985981703,
        0.07035936415195465,
        0.07544805854558945,
        -5.3487994478018663e-08,
        -0.0011131316423416138,
        -0.029656553640961647,
        -0.03850701451301575,
        0.006716598756611347,
        0.01779146119952202,
        -0.0716848373413086,
        -0.02091314271092415,
        -0.05852602794766426,
        -0.017944063991308212,
        -0.01521302480250597,
        -0.048244405537843704,
        -0.05431067943572998,
        -0.053489964455366135,
        0.017005108296871185,
        0.08732770383358002,
        0.01530453097075224,
        -0.1263696253299713,
        -0.0036881749983876944,
        -0.05420801416039467,
        -0.024943072348833084,
        -0.01965760625898838,
        0.04106099158525467,
        0.040022529661655426,
        0.02309584803879261,
        -0.01712767779827118,
        0.11132781207561493,
        0.020637061446905136,
        0.03938669338822365,
        -0.018232284113764763,
        0.02160482294857502,
        -0.002734680427238345,
        -0.015260144136846066,
        -0.06645404547452927,
        0.00964284222573042,
        -0.08318576216697693,
        -0.023029763251543045,
        -0.061902664601802826,
        -0.039271656423807144,
        0.046268485486507416,
        0.059267766773700714,
        0.006901819724589586,
        -0.01646588370203972,
        0.058407012373209,
        0.07623202353715897,
        -0.0009800480911508203,
        -0.0018969406373798847,
        -0.04031413793563843,
        -0.05016065016388893,
        0.02112823911011219,
        -0.023699207231402397,
        0.0003931451356038451,
        -0.010845121927559376,
        -0.038239799439907074,
        0.019353747367858887,
        0.07872749119997025,
        -0.057152897119522095,
        0.03756432980298996,
        0.06930752843618393,
        -0.031084999442100525,
        0.040541067719459534,
        0.08216038346290588,
        5.5059567785065155e-06,
        -0.040940020233392715,
        -0.017993278801441193
    ]
}