{
    "id": "V0BTEYkH56g",
    "title": "iJustine: the YouTuber that never quit",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-08-22T14:00:34Z",
    "video_url": "https://www.youtube.com/watch?v=V0BTEYkH56g",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ijustine reviews",
        "ijustine iphone",
        "justine ezarik",
        "ijustine apple",
        "ijustine tech",
        "unboxing",
        "ijustine tech reviews",
        "review",
        "ijustine apple review",
        "ijustine unboxing",
        "tech",
        "the verge",
        "content creator",
        "youtube",
        "full frame",
        "becca farsace"
    ],
    "views": 201228,
    "likes": 12694,
    "comments_count": 885,
    "description": "Justine Ezarik, better known as iJustine, has been creating content for nearly 18 years. She is one of the only creators I know who was uploading videos to YouTube in 2006 and is still doing so today. So it was a no-brainer to include her in my Full Frame: Creators series where I spend a day with a creator I admire to figure out how they do what they do.  0:00 Who is iJustine? 1:02 The video that started it all 2:20 The history of Justines content 3:28 How Justine vlogs 6:31 How Justines YouTube brain works 9:05 When will iJustine quit YouTube? 9:33 Beccas goodbye :(  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/vergecast",
        "https://link.chtbl.com/decoder",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "- [Becca] She was vlogging before Casey Neistat. - Hi everybody. So I'm hanging out here in the Apple store. - [Becca] Doing man on the street interviews well before TikTok. - [Justine] What's your favorite treat? - Probably bread pudding. - [Justine] Bread pudding? - I've really never met a bread pudding that I don't love. - And even live streaming before Twitch. And by the time I started my tech journalism career in 2017, iJustine was a solidified face in the YouTube tech space. I mean, Tim Cook says it best. - She needs no introduction because her creativity and her insights and her passion for technology, are extraordinary and known to everybody in here, I'm sure. - Justine is a creator who has blazed the trail for not just tech creators, but pretty much any type of creator, because at some point or another, she has literally tried it all, and that has given her the confidence and this sort of unconscious know-how to endlessly create. I'm Becca. This is the last episode of my \"Creator\" series and it is also my last video for \"The Verge.\" And I could not be more honored that it's about a creator I have watched my entire career. This is the story of iJustine. - I think. I think this is mine. I think this is the one that I bought. (boxes clatter) Yeah, so here it is. This is, this is my first iPhone. It doesn't turn on anymore. I'm sure I could probably have somebody replace the battery, but this is kind of, I don't wanna say where it all started, but it sort of gave me that motivation and realization that there was something here. - Knew I had something here. It's a term that I've heard a lot of creators say. There seems to be this moment in all of their careers where a piece of content does really well, and it gives them the confidence to keep going. And for Justine, it was this video. - I have an iPhone and I had to switch to AT&T. Okay, that's wonderful. Well, I got my first AT&T bill. Right here. In a box. - [Becca] It's an incredibly straightforward video of Justine opening an absurd 300 page bill from AT&T when she got her first iPhone. - And at the time, then everyone was making fun of me for like making videos and doing weird stuff and posting stuff online. And then finally when this happened, and like news outlets were contacting me and just like, it just blew up like all around the world, that made me feel like something was here. And it kind of gave like my family a little bit of hope. Like okay, she's, this is actually something. - [Becca] And since that moment, Justine never really stopped creating. In fact, something I noticed very early in the day, was that her content making brain is always on. - Oh, there's actually a TikTok that I wanted to do with some of these things. So we might be able to do that as well. - [Becca] And it's been on for a long time. She was one of the first people to stream her life 24/7 on Justin TV which would later become Twitch. This went on for six straight months and included some of the first acts of what we now call stream sniping, where people would call restaurants she was at and tell them it was her birthday, or literally show up where she was. There was a gaming period, cooking videos, interviews, song parodies, collabs, and even a time when she unboxed tech using Google Glass as the second camera. And I mean, that right there is amazing. Bring that back. But throughout all of that, it's her love of technology that has been both the most successful content she's made and what she's most personally interested in. - [Becca] You have so many Apple pencils. - [Justine] Okay, so that might be my prized possession. - [Becca] Wow. - It's like a weird flex. - [Becca] These days, her channel is mostly focused on consumer tech and the day I was hanging out with her, happened to be the day she was picking up arguably the most talked about piece of tech this year. - [Justine] Look, there's a cyber truck behind us. No way! Getting in behind us! I wanna let him know I'm going to get mine right now. We're gonna be, we're gonna be cousins! I'm going to get one right now. I'm going to pick mine up right now. Dude, I'm so psyched. Bye, nice to meet you! I made it weird. - [Jenna] Now look how friendly that person was. - I made it super weird. - [Jenna] No way, they were excited. - With her sister and fellow creator, Jenna, in tow, we headed to a Tesla dealership in LA to pick up Justine's cyber truck, a relatively controversial car these days. - It's hard because I definitely don't support everything that Elon supports, but the tech is really good. Yeah, and also just reading the comments of how much people don't like it. - [Becca] Make you nervous? - I mean, the money is already in their bank account. And I feel like you know, at some point, I mean, I don't know, I don't know. - [Becca] Using a Sony A7S Mark IV with a 24 to 70 millimeter F2.8 lens, Justine was filming her cyber truck pickup in her vlog style, meaning that her and her sister take turns filming Justine's experience. - [Jenna] A little look, Jus. - [Justine] Little look see. - [Jenna] Okay, here we go. Nothing in there. - We can fit golf clubs or a small body. - [Becca] The first thing I noticed about their vlogging style is that there's absolutely no planning and very little directing. After well over a decade of doing this together, they sort of just dance around each other. Never even having to do a second take. - [Justine] Can't see anything. - [Jenna] Hey, Jus? - What's up? Don't you touch it. No, this stays on. - You can't leave that on. - Yes. - You cannot leave this on. - Yes, I can. - You're gonna, you're not gonna be able to. - I'm gonna take that off once it doesn't feel like it's gonna melt. I have left the Tesla one on my car for the past three years. - [Jenna] You cannot leave that on. - And Jenna keeps trying to take it off of me. And I'm like, no, you're absolutely not. - [Becca] They are incredibly well practiced at creating content. - Are you videoing or photo? - [Jenna] Photo. - [Becca] Instinctively shooting both photos and video. - [Jenna] Okay video? - Yup. - [Jenna] Ready, go. - Uh, just doing a little test, walk around, just picked it up. - [Becca] Remembering to screen record when they're setting things up on their phones. - Do a little screen record here. - [Becca] And of course, stopping for intrusive noise. (plane roars) You literally do one take of everything. Like I didn't really see you do second takes. - For vlog stuff, there's yeah, rarely ever two takes. But if it's like something scripted and planned in like an actual review, I'll definitely do several takes. Especially trying to like memorize specs and stuff like that. I'm like, that wasn't right. I didn't like the delivery. Do it again. But I feel like these kind of follow me around type kind of little vlogs, it's, it is what it is. - She's so good at being natural and giving a genuine response on camera, while also having the YouTube and content creating smarts to know how to capture those moments. And I think that is what has allowed her to continue to upload YouTube videos all the way from 2006 to now. I mean, I don't know a single other person who has done that. And she's not just good at doing it for herself either. She was doing it for me. For example, our day actually started at a jiu-jitsu class and I brought my camera with the intention of filming it. But then we got there and I got so busy living the experience, that I completely forgot about filming it. But Justine didn't. At one point, she literally had me in a choke hold and she said, you should film this. You could title it \"iJustine Put Me Into a Chokehold.\" So I did. I ran over to my camera, I set up a really crappy shot, and I filmed it. And that moment didn't end up being a large part of my story, but it certainly is a core memory. And it could have been more, provided I would've filmed more, I'm sure. And then there was this moment a few hours later when we were watching old videos of hers and reading the comments. And I was so enjoying learning how Justine thinks about commenters and her first videos, that I wasn't even thinking about the lighting or the audio, but Justine was. - [Justine] Do you want more light? - I mean, she would even instinctively turn down the audio on her computer when one of us would begin to speak. And while I'm sure that a lot of this is simply learned from doing this for 18 years, you can see this ability to both be incredibly authentic, yet capture a moment, in a way that makes sense and looks good, as early as the 300 page bill video. - First AT&T bill. Right here. In a box. - She was simply reacting and having an emotion about a moment, yet was able to capture it in a way that also conveyed the feeling. To be present and authentic while also capturing a moment, is incredibly hard to do, something that I certainly have struggled a lot with. And I think it's Justine's superpower. (Jenna gasps) - [Becca] What's the best? - That's a perfect cut. - That's a perfect cut. - That is a absolute perfect cut. - [Jenna] Oh. (Jenna gasps) No! - [Justine] We didn't think this one through. - [Becca] I had one last question for the YouTuber that has yet to quit. And how long do you think you'll do this? - I think I'll do this until I don't wanna do it anymore. So that could be tomorrow. Could be next week, could be forever. - [Jenna] Hold on! Vroom! Look, sorry. - This time just keeps ticking. - [Jenna] I saved us six minutes but. - 37 minutes late. - With that, includes my last video for The Verge. I wanna thank you so much for supporting me and believing in me. It has never been lost on me, how lucky I am to get to do this job and for all of you to want to tune in. I appreciate you so much, bud. And I wouldn't be here without you. I hope you'll stick with me, and I hope I'll see you on the next one. Okay. - How was the? (group speaks indistinctly)",
    "transcript_keywords": [
        "Casey Neistat",
        "Justine",
        "video",
        "tech",
        "moment",
        "Neistat",
        "creator",
        "Casey",
        "videos",
        "vlogging before Casey",
        "bread pudding",
        "time",
        "content",
        "day",
        "kind",
        "made",
        "weird",
        "feel",
        "bill",
        "literally"
    ],
    "transcript_entity_values": [
        "Twitch",
        "iJustine",
        "Google Glass",
        "Elon",
        "These days",
        "one",
        "Apple",
        "AT&T",
        "Casey Neistat",
        "37 minutes",
        "The Verge",
        "the day",
        "Tesla",
        "Jus",
        "YouTuber",
        "24 to 70 millimeter",
        "Justine]",
        "2017",
        "iJustine Put Me Into a Chokehold",
        "iJustine",
        "the past three years",
        "Becca",
        "Tim Cook",
        "2006",
        "YouTube",
        "Justine",
        "two",
        "our day",
        "300",
        "18 years",
        "this year",
        "Jenna",
        "next week",
        "Justin TV",
        "second",
        "TikTok",
        "Justine",
        "these days",
        "Sony",
        "YouTube",
        "six straight months",
        "first",
        "Justine] Bread",
        "iPhone",
        "LA",
        "jiu-jitsu",
        "six minutes",
        "a few hours later",
        "tomorrow",
        "Mark IV",
        "First"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "TIME",
        "DATE",
        "PERSON",
        "ORDINAL"
    ],
    "vector": [
        -0.041684456169605255,
        -0.09004689007997513,
        -0.00024030960048548877,
        -0.11890355497598648,
        0.051459796726703644,
        0.02433941885828972,
        0.00028528820257633924,
        0.06334051489830017,
        0.03564733639359474,
        0.008054000325500965,
        -0.032613277435302734,
        0.035940658301115036,
        -0.002267118776217103,
        0.01116916909813881,
        -0.0791187584400177,
        0.014094693586230278,
        0.08150941133499146,
        -0.02437717095017433,
        -0.12703432142734528,
        -0.01723150908946991,
        -0.024811532348394394,
        0.02542302757501602,
        0.030185287818312645,
        0.03966270759701729,
        -0.08133076131343842,
        -0.00377291371114552,
        -0.049846213310956955,
        -0.028548888862133026,
        0.048528268933296204,
        -0.05574819818139076,
        0.0115724578499794,
        0.016159014776349068,
        0.02219347655773163,
        -0.007448351010680199,
        -0.046754881739616394,
        -0.010819174349308014,
        -0.005818903911858797,
        0.01487261988222599,
        -0.04657267406582832,
        -0.03029295615851879,
        0.013487077318131924,
        -0.0992768183350563,
        -0.054807987064123154,
        -0.012053483165800571,
        -0.0216071717441082,
        -0.05206482857465744,
        0.01844477280974388,
        -0.0402902252972126,
        -0.012839218601584435,
        0.010758857242763042,
        -0.08849848806858063,
        -0.05596541985869408,
        0.06669627875089645,
        -0.0526331402361393,
        -0.057745158672332764,
        -0.026916533708572388,
        -0.021855000406503677,
        0.11177074909210205,
        0.09882427752017975,
        0.03382623940706253,
        0.10301383584737778,
        -0.04375365003943443,
        -0.03204153850674629,
        0.047470856457948685,
        -0.03376559540629387,
        0.04339165613055229,
        0.07606343179941177,
        0.0691685676574707,
        0.006242240313440561,
        -0.021104726940393448,
        -0.005645156372338533,
        -0.021636279299855232,
        -0.05175156891345978,
        0.04659982770681381,
        0.07831999659538269,
        -0.006480319891124964,
        0.08805626630783081,
        0.011216467246413231,
        -0.01945132203400135,
        -0.05199643597006798,
        0.06323246657848358,
        -0.0972408875823021,
        0.07666164636611938,
        -0.04023635759949684,
        -0.00547333899885416,
        -0.052278414368629456,
        0.0347413569688797,
        0.04207189381122589,
        0.0809435322880745,
        0.0471724234521389,
        -0.0901234820485115,
        0.10232123732566833,
        0.053841397166252136,
        -0.042454157024621964,
        0.05720800161361694,
        -0.032328009605407715,
        -0.0658746063709259,
        -0.03631596267223358,
        -0.025977831333875656,
        0.05494440346956253,
        0.010505102574825287,
        0.06038007140159607,
        -0.022283397614955902,
        -0.004241114016622305,
        0.0312797985970974,
        -0.09487593173980713,
        0.00671513844281435,
        0.0388442762196064,
        0.060789987444877625,
        0.024300558492541313,
        -0.060661207884550095,
        0.027175094932317734,
        -0.03851727768778801,
        0.014364849776029587,
        0.10704123228788376,
        0.049821045249700546,
        0.002959328470751643,
        0.08443011343479156,
        0.047353439033031464,
        -0.0476183257997036,
        0.04536580294370651,
        0.0777130052447319,
        0.00907061155885458,
        -0.010526705533266068,
        -0.04744143411517143,
        -0.027654055505990982,
        -0.0884896069765091,
        3.7334027516482174e-33,
        -0.0299777090549469,
        0.04244498908519745,
        0.019132034853100777,
        0.006326759234070778,
        0.033838625997304916,
        0.04209041967988014,
        -0.06764934211969376,
        0.07123637944459915,
        -0.0394752062857151,
        -0.055895183235406876,
        0.03987010568380356,
        -0.02532702311873436,
        -0.014590911567211151,
        0.022545136511325836,
        -0.007812206633388996,
        0.023003730922937393,
        -0.026679804548621178,
        -0.02561001665890217,
        -0.046284228563308716,
        0.005166076589375734,
        0.11432147771120071,
        0.0274322759360075,
        0.02507442608475685,
        0.0014607476769015193,
        -0.06160890311002731,
        -0.01645461656153202,
        0.05420195311307907,
        -0.026430826634168625,
        0.059390436857938766,
        0.04129761829972267,
        -0.13847072422504425,
        -0.06575063616037369,
        -0.003974849358201027,
        -0.05852794647216797,
        0.03931145742535591,
        0.04486306756734848,
        -0.041678447276353836,
        -0.050572484731674194,
        0.01648414321243763,
        0.02082102745771408,
        -0.059311021119356155,
        0.05094318091869354,
        -0.021441170945763588,
        -0.08311745524406433,
        -0.11929457634687424,
        -0.02006630040705204,
        0.08734307438135147,
        -0.010597427375614643,
        0.07757621258497238,
        -0.032811760902404785,
        0.06362533569335938,
        0.042767252773046494,
        -0.018583066761493683,
        -0.06453754752874374,
        -0.009678720496594906,
        0.07708004862070084,
        -0.0419396311044693,
        0.003629756160080433,
        0.00927640125155449,
        -0.048678863793611526,
        0.03648138418793678,
        0.021473444998264313,
        -0.013806648552417755,
        0.08301664888858795,
        -0.025659259408712387,
        0.019203176721930504,
        0.03465191274881363,
        0.005025110673159361,
        -0.03306741267442703,
        0.012814493849873543,
        -0.1165204793214798,
        0.03961746022105217,
        -0.016197310760617256,
        -0.045959122478961945,
        -0.04696505144238472,
        0.012616983614861965,
        -0.08760819584131241,
        -0.004492287524044514,
        -0.009349563159048557,
        0.08228279650211334,
        0.055853042751550674,
        0.027190089225769043,
        0.05482541024684906,
        -0.056230202317237854,
        -0.015111506916582584,
        -0.10121651738882065,
        0.0619826540350914,
        0.03552398085594177,
        0.030441274866461754,
        0.043065521866083145,
        0.026320677250623703,
        0.027647295966744423,
        -0.015045427717268467,
        0.057567499577999115,
        -0.026760250329971313,
        -6.689282846468695e-33,
        -0.08377470076084137,
        0.03647454455494881,
        -0.006309321615844965,
        0.027763044461607933,
        0.023260492831468582,
        -0.003638377645984292,
        0.029278557747602463,
        0.05069125071167946,
        0.10717453807592392,
        -0.04981706663966179,
        -0.0006906785420142114,
        -0.11137671768665314,
        -0.05282449349761009,
        -0.03970364108681679,
        -0.07825109362602234,
        -0.055153943598270416,
        0.0057828123681247234,
        -0.07330760359764099,
        -0.09319364279508591,
        -0.07855896651744843,
        0.03658926114439964,
        -0.0336727574467659,
        -0.06090247631072998,
        -0.017195209860801697,
        -0.009423777461051941,
        0.01596297323703766,
        0.10184285789728165,
        0.06655438989400864,
        0.004190391395241022,
        0.013621163554489613,
        0.003833465278148651,
        -0.021052038297057152,
        -0.07907533645629883,
        -0.07750143855810165,
        0.029294023290276527,
        0.06934589147567749,
        -0.021868815645575523,
        -0.021052373573184013,
        -0.05125046521425247,
        -0.06030166149139404,
        0.026059893891215324,
        0.09641531854867935,
        -0.03810623660683632,
        -0.039629977196455,
        -0.03527339920401573,
        0.013420040719211102,
        -0.02257513999938965,
        0.04272502660751343,
        -0.02977653220295906,
        -0.05487491562962532,
        -0.0014331868151202798,
        0.0027842302806675434,
        0.040933627635240555,
        0.018158094957470894,
        0.022442389279603958,
        -0.037158235907554626,
        -0.02631881646811962,
        0.04201686754822731,
        0.042808979749679565,
        -0.008791704662144184,
        -0.03121349774301052,
        -0.01846565306186676,
        -0.09090663492679596,
        -0.03845575824379921,
        -0.004420675802975893,
        -0.039657432585954666,
        0.073623426258564,
        0.00931279081851244,
        -0.0680462047457695,
        -0.04421450197696686,
        0.11854705214500427,
        -0.044794946908950806,
        -0.06342552602291107,
        -0.0838453471660614,
        0.031930044293403625,
        0.03973579779267311,
        0.0024987575598061085,
        -0.06105801835656166,
        -0.06723492592573166,
        -0.08121239393949509,
        0.023607753217220306,
        -0.04469698667526245,
        0.03826593607664108,
        -0.024217315018177032,
        0.0768933892250061,
        0.007291797082871199,
        0.04616580531001091,
        0.059597138315439224,
        0.02903994545340538,
        0.06395252048969269,
        0.06861721724271774,
        -0.0021469208877533674,
        -0.10580507665872574,
        0.04243330657482147,
        0.05537319555878639,
        -5.951619286292953e-08,
        -0.06415265798568726,
        -0.03736823424696922,
        -0.042060501873493195,
        0.04811857268214226,
        -0.003649188904091716,
        0.008332926779985428,
        0.030332019552588463,
        0.052003636956214905,
        -0.026967721059918404,
        0.03235902637243271,
        0.015007716603577137,
        -0.05366888269782066,
        -0.01864917203783989,
        -0.0004192886408418417,
        0.02588709630072117,
        -0.013489551842212677,
        0.014844866469502449,
        0.011036543175578117,
        0.006332704331725836,
        0.0285115335136652,
        -0.0673494040966034,
        -0.052826978266239166,
        0.09092756360769272,
        -0.16619661450386047,
        -0.036286935210227966,
        -0.020243097096681595,
        -0.02049175836145878,
        0.009814123623073101,
        -0.02712925709784031,
        0.017951559275388718,
        -0.0389757864177227,
        0.04941941425204277,
        -0.041370879858732224,
        -0.09626815468072891,
        -0.08482018113136292,
        -0.05016476660966873,
        0.015496398322284222,
        0.0015868644695729017,
        0.025229105725884438,
        0.060358528047800064,
        0.04114534333348274,
        0.05029313638806343,
        0.08179659396409988,
        0.05788472294807434,
        0.03489965200424194,
        0.01402417290955782,
        0.009706939570605755,
        -0.033776137977838516,
        0.050048548728227615,
        -0.07881436496973038,
        -0.021475063636898994,
        -0.05048441141843796,
        0.08182152360677719,
        0.04562414810061455,
        0.07727385312318802,
        -0.011922602541744709,
        -0.024457115679979324,
        0.03067208267748356,
        -0.05722535401582718,
        0.02427736669778824,
        0.030105359852313995,
        -0.030102906748652458,
        0.04956677928566933,
        -0.05849609896540642
    ]
}