{
    "id": "v1uSP8WWrY8",
    "title": "Sony A1 review: A fast camera in a fast city",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-06-23T13:30:09Z",
    "video_url": "https://www.youtube.com/watch?v=v1uSP8WWrY8",
    "category": "Science & Technology",
    "tags": [
        "sony a1",
        "sony alpha 1",
        "sony",
        "sony a1 review",
        "sony a1 8k",
        "sony a1 video",
        "sony alpha 1 review",
        "sony alpha 1 video",
        "sony alpha 1 camera",
        "sony a9ii",
        "sony a7r",
        "sony a7s iii",
        "sony e-mount camera",
        "sony alpha 7c",
        "sony a7c",
        "sony a7c review",
        "sony a7c camera",
        "mirrorless camera",
        "best mirrorless camera",
        "best mirrorless camera for video",
        "terry barentsen",
        "cmos sensor",
        "oled",
        "8K video",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 229474,
    "likes": 7925,
    "comments_count": 368,
    "description": "Sonys top-of-the-line Alpha 1 mirrorless camera checks every spec box and comes with every feature. Its one of the most capable cameras you can buy. We hit up one of NYCs fastest cyclists, Terry Barentsen, to see how well it can keep up under pressure.  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the Sony A1 here:   Read more:    Check out Terry Barentsens channel:    Watch more from Full Frame with Becca Farsace:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://bhpho.to/3j6kiIn",
        "https://bit.ly/3wOJdnX",
        "https://bit.ly/3d6WvEe",
        "https://bit.ly/3zY6S7t",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- When I first heard about Sony's newest addition of the Alpha lineup, the A1, there was one spec that really caught my eye 50 megapixel photos at 30 frames per second burst with continuous auto focus and auto exposure. In this body? What? Man, I live in a very, very fast city. So I was quite excited to put that spec to the test. (indie music) (click-click) If 50.1 megapixel stacked CMOs sensor, AK filming at 30 frames per second, 120 auto focus calculations per second, and all that viewfinder capable of 240 frames per second refresh rate, a mechanical shutter flash sync up to one, 4000th of a second, all in a body that doesn't feel that much bigger than my A7C. To say that I've been excited to get my hands on this $6,400 Sony A1 is completely an understatement, but now that it's here, man, oh man have I been putting that burst mode to the test? I've shot birds, fountains fireworks. You name it. I pointed this camera at it, but there is one really fast thing I knew I had to pair this camera with, (click-click-click) This is Terry Berenson. He runs a YouTube channel all about biking and more specifically, biking very quickly. (video audio) - For well, over three hours, I made him bombed down all sorts of Hills in Midtown Manhattan, and I am very happy to report the A1 had no trouble keeping. (camera flash) I shot Terry with the A1 paired with the hundred to 400 millimeter Sony G master lens with auto focus continuous sensitivity set to the most responsive settings. In order to reach that 30 frames per second, with continuous auto focus you have to have your camera above 1250th shutter speed using the electronic shutter mode and only shooting any of the raw compressed or JPEG format. I shot Terry in rock compressed. And honestly, I was pretty impressed with how much dynamic range that still offered me. But back to that in a minute, let's talk about this auto-focus. (upbeat music) This burst mode performs best when paired with the latest XD linear motored lenses that can very quickly move the focusing elements within the lens. Now Sony claims the A1 can perform up to 120 auto focus calculations per second. And I had no problem finding Terry, well over a block away and holding tight to him despite my shaking hands, moving cars and Terry's fast pace. It really felt like cheating when my only job was to stomp down on the shutter and just keep tearing frame. There were very few auto focus shots even when Terry was coming directly at the camera and I was able to take over a hundred consecutive shots before buffering slowed down. And because the old led EVF can perform at up to 240 frames per second, my view was never interrupted or lagged. And when using the electronic shutter, a white box comes up on the frame and flashes every time a shot is captured in lieu of the sound of the shutter. Also, I had to come clean. I've never shot a cyclist before. So I felt really out of my element kneeling in the middle of 42nd street trying to catch a biker who was racing straight at me yet the A1 made my job pretty easy and it kind of made it look like I knew what I was doing. (click-click) Now, back in the edit the image quality is sharp. It's full of contrast and true to life. I do wish I had shot a bit wider though. Now, knowing just how much I could punch in before losing quality. What surprised me the most though was the range I still had even with compressed raw files. The A1 claims to have 15 stops of dynamic range. And when attempting to bring a shadowed figure back, even in the compressor off files I was able to do so with ease but outside of action photography, the A1 still shines, that 50.1 megapixel sensor captures an incredible amount of detail. I had a blast pairing it with that really long a hundred to 400 millimeter lens and taking photos of the city. But I had just as much fun popping on the 85 stopping down to like a one, four, maybe a two and taking portraits where that eye focus is super accurate and it just captures loads and loads of detail. All right but physically the A1 is nothing new and that's a good thing. (click-click-click) It's compact. Slight weight feels great in my hands. If you've used any of Sony's alpha cameras it will feel very familiar in your hands. And it also gives me enough physical buttons and dials to lessen the need for jumping into the menu, which although better is still a behemoth. It also uses the same Sony NPF C 100 batteries that much of the latter half of the alpha line uses. With my A7C I can get well through a day of shooting both photo and video with one of these batteries. But with the A1 I was really only averaging about half a day of use. And that's with mostly just photo use. There are a plethora of ports on the left side of the camera, including an ethernet port and a full-size HTMI, they're all covered by solid feeling plastic doors that close with a very nice click. (click-click) And on the right side is a dual SD card slot that both supports either SD or CF express type A cards. All right Sony, I like totally see the monopoly that you have over CF express type a cards, but it would have been really nice to get those type B cards here. I mean, not only is there way more buying options for those but they're twice as fast. (instrument playing) I was also disappointed by the articulating screen that doesn't flip out to face the front of the camera. Well, great for blogging. It's also very helpful for tight angles or setting up self portraiture or even flying this camera on a gimbal. Instead I wound up using Sony's image edge mobile app that while basic and design does work well for remote shooting, an image transfer. This app could use a refresh though. The design hasn't changed in years, and every time you close out of the app or open another app, you gonna have to repair your camera when you want to use it again. It's a pain in the ass. Video on the A1 tops out at the very impressive eight K 30 frames per second at 10 bit 4, 2 0 8, 2 6 5 and well Canons are five beat the A1 to that spec. The A1 does a better job at not overheating. Hey Alex, camera's getting a little, a little toast due to the touch, 82 degrees in New York city direct sunlight toasty to the touch. Well the camera certainly got warm to the touch. Especially during these hot days New York city has been experiencing it never stopped recording due to overheating. Gerald and Dunn did wonderful testing of those long run eight K video recording sessions. And in short it just doesn't have those overheating problems that the Canon R5 had. Instead it has quick recovery times and with a dummy battery you can record for seemingly ever, or at least many hours. Sony has also made some improvements to the rolling shutter problem of mirror less cameras past cars no longer appear as jello cars though. At high speeds I did still see this unwanted effect on trains. Sony has also added a variable shutter option for fine tuning your shutter speed to avoid flickering lights or in my case, flickering phone screens and flash photography users will be very happy with this camera's mechanical shutters ability to sync with flashes at one 400th of a second. Now I am not a big flashy user, but industry standard for sync speeds is around 1250th and a second. And this is a whole two third stop faster than that. And that's a big deal. Other reviewers have been pointing out the EVF blackout problems that occur with the A1. And it definitely happened to me, but just once I was in direct sunlight, as most reviewers have noted and I went to put my eyes to the sensor and nothing came up and I brought the camera down there was nothing to see there either. I ended up having to turn the camera on and off and then it seemed the problem was resolved. Also I've noticed that the menu sometimes chugs along or is just a little bit slow. For $6,500, this is unexcusable and Sony really should be addressing this problem more seriously. The A1 is $6,500, and that is certainly not inexpensive especially when you compare it to the $4,000 Canon R5 rival. But I don't think it's unfairly priced. It has a massive sensor, high-spec video, all the dials and buttons one could need, an outstanding auto focus system and it is truly a speed demon when photographing action sports or animals, it can work across in many disciplines with all of these features from professional video work to studio strobe work and even action photography. And if you're able to get that much use out of this camera then that price is more than justified. Although I think most people will buy a cheaper body in the alpha line and maybe buy two lenses with that extra money instead. Sony took everything it is learned from the mirrorless world and made an incredibly capable yet compact 50.1 megapixel camera. The A1 has something new for everyone. In a body that won't feel foreign. Sony didn't reinvent the wheel with the A1. It simply took all of the features we've come to love and a bit more and put it into one. But thank you so much for joining me on another full frame. I know it's been a minute. I haven't seen you on well, I hope that you're well and I hope that everyone you love is well. What camera are you reviewing next? Drop it down below. Talk soon. That's a wrap!",
    "transcript_keywords": [
        "Sony newest addition",
        "Sony",
        "camera",
        "auto focus",
        "shutter",
        "Terry",
        "auto",
        "focus",
        "Sony alpha cameras",
        "shot Terry",
        "continuous auto focus",
        "frames",
        "newest addition",
        "Sony newest",
        "auto focus calculations",
        "shot",
        "auto focus shots",
        "auto exposure",
        "auto focus continuous",
        "made"
    ],
    "transcript_entity_values": [
        "AK",
        "the middle of",
        "CF express",
        "New York",
        "50.1 megapixel",
        "82 degrees",
        "6,400",
        "over three hours",
        "Gerald",
        "at least many hours",
        "one",
        "third",
        "30",
        "Alpha",
        "four",
        "around 1250th and a",
        "about half a day",
        "the hundred to 400 millimeter",
        "A1",
        "1250th",
        "eight",
        "2",
        "Canon R5",
        "EVF",
        "120",
        "50.1",
        "85",
        "years",
        "4,000",
        "Dunn",
        "linear",
        "JPEG",
        "15",
        "half",
        "two",
        "Canons",
        "400th",
        "6,500",
        "Terry Berenson",
        "50",
        "SD",
        "Alex",
        "Sony",
        "second",
        "five",
        "a day",
        "Hills in Midtown Manhattan",
        "YouTube",
        "240",
        "a hundred to 400 millimeter",
        "first",
        "42nd",
        "100",
        "Terry",
        "a minute",
        "10"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "TIME",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "FAC",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL"
    ],
    "vector": [
        -0.0014284892240539193,
        -0.0745278000831604,
        -0.03561358526349068,
        -0.08213560283184052,
        0.0507148802280426,
        -0.02327580749988556,
        -0.018512224778532982,
        0.07090836763381958,
        0.04246580973267555,
        0.07771286368370056,
        -0.02808784320950508,
        0.03267861157655716,
        -0.04472348839044571,
        0.020384127274155617,
        0.010301025584340096,
        0.020979592576622963,
        0.12488718330860138,
        -0.06619419157505035,
        -0.02752034366130829,
        0.04689094424247742,
        -0.022934267297387123,
        -0.10865258425474167,
        0.06630530208349228,
        0.00250078528188169,
        0.025036675855517387,
        0.008292849175632,
        -0.07142000645399094,
        -0.05566324666142464,
        -0.03161125257611275,
        -0.03674113377928734,
        -0.05405634269118309,
        0.09157394617795944,
        0.08379998058080673,
        0.004220698960125446,
        -0.03197179362177849,
        -0.07357890903949738,
        0.07896818220615387,
        0.00531981373205781,
        -0.022421779111027718,
        -0.003947442397475243,
        -0.0032858659978955984,
        -0.01288118027150631,
        -0.001026736805215478,
        0.04018906131386757,
        0.023807507008314133,
        0.0023991193156689405,
        0.030962428078055382,
        -0.032366763800382614,
        0.04633307084441185,
        0.022832991555333138,
        -0.10336843878030777,
        -0.08120284229516983,
        0.05821744725108147,
        -0.0434003509581089,
        -0.041906893253326416,
        -0.0004196212103124708,
        -0.04974260553717613,
        0.01705440878868103,
        0.030075447633862495,
        -0.012256504036486149,
        0.0333084911108017,
        -0.05689104273915291,
        -0.003581625409424305,
        0.06719181686639786,
        0.04268185421824455,
        0.06078072637319565,
        0.015458636917173862,
        -0.021857913583517075,
        0.008940134197473526,
        -0.04505299776792526,
        -0.08348681777715683,
        0.03917814791202545,
        0.03796200826764107,
        -0.01487691979855299,
        -0.037786755710840225,
        0.00534166069701314,
        0.04386608302593231,
        -0.04327942430973053,
        -0.007907272316515446,
        -0.08381050825119019,
        0.09183371812105179,
        -0.031786199659109116,
        -0.08876035362482071,
        0.014549186453223228,
        0.0279739648103714,
        0.019452674314379692,
        0.03599175438284874,
        0.08638197928667068,
        -0.07285720854997635,
        -0.032547369599342346,
        -0.09604278951883316,
        0.023227166384458542,
        -0.026665501296520233,
        -0.04083925858139992,
        -0.02460564486682415,
        -0.025820478796958923,
        -0.041629813611507416,
        -0.054694343358278275,
        -0.03935039043426514,
        0.02279389649629593,
        0.051018234342336655,
        -0.011804798617959023,
        0.03280050680041313,
        0.015523839741945267,
        -0.07725102454423904,
        -0.09581232815980911,
        0.036303695291280746,
        0.07511963695287704,
        0.01676597259938717,
        0.12213786691427231,
        -0.03267191722989082,
        0.080152727663517,
        -0.04624735191464424,
        -0.039334625005722046,
        0.024662377312779427,
        0.012933502905070782,
        -0.0021015263628214598,
        0.047491930425167084,
        0.11355358362197876,
        -0.04706365615129471,
        0.004971043672412634,
        -0.0328865684568882,
        -0.05318770930171013,
        -0.014052344486117363,
        0.04387734830379486,
        -0.024113256484270096,
        -0.024022359400987625,
        4.762679564223628e-33,
        -0.033319100737571716,
        0.12908290326595306,
        -0.019608329981565475,
        -0.01461638230830431,
        -0.042585231363773346,
        -0.007038115058094263,
        -0.005405864678323269,
        0.07371395826339722,
        -0.03588937595486641,
        -0.004507081583142281,
        -0.02842314913868904,
        -0.014990698546171188,
        -0.016637535765767097,
        0.058521587401628494,
        0.028897849842905998,
        -0.055639080703258514,
        0.026650430634617805,
        0.003924091812223196,
        -0.09059654176235199,
        0.03831101953983307,
        0.042739301919937134,
        -0.03639780730009079,
        -0.0023846528492867947,
        0.028497586026787758,
        0.03352395445108414,
        0.04506167769432068,
        0.02525457553565502,
        0.0038240840658545494,
        0.07344096153974533,
        0.021845370531082153,
        -0.11129017919301987,
        0.054080378264188766,
        -0.06012517586350441,
        -0.0737825483083725,
        0.022126764059066772,
        -0.034201547503471375,
        -0.10311022400856018,
        -0.013920173980295658,
        -0.021397428587079048,
        -0.03295402228832245,
        -0.05136002227663994,
        0.09824568778276443,
        -0.10544214397668839,
        -0.06305410712957382,
        0.026443012058734894,
        0.05252480506896973,
        -0.031818829476833344,
        0.09338401257991791,
        -0.023117894306778908,
        0.008155934512615204,
        0.01586008071899414,
        0.021203873679041862,
        -0.09727303683757782,
        -0.03758029639720917,
        0.025085866451263428,
        -0.030248742550611496,
        -0.016631893813610077,
        0.007584121078252792,
        -0.011907007545232773,
        0.09199266880750656,
        0.08414018899202347,
        0.02133701555430889,
        -0.07959849387407303,
        0.047730907797813416,
        -0.15531133115291595,
        0.07554446160793304,
        0.01773279905319214,
        0.05522003024816513,
        -0.03006146289408207,
        0.057515695691108704,
        -0.014557176269590855,
        -0.0072034671902656555,
        0.004663774278014898,
        -0.05753421038389206,
        0.08203915506601334,
        0.029848778620362282,
        -0.0871148556470871,
        -0.004004230722784996,
        -0.036692190915346146,
        0.039460767060518265,
        -0.09562838822603226,
        0.019092166796326637,
        0.030087748542428017,
        -0.0032856990583240986,
        -0.022722959518432617,
        0.027135420590639114,
        0.04146352782845497,
        0.027545491233468056,
        -0.11051498353481293,
        -0.022735537961125374,
        0.027889931574463844,
        -0.0296389851719141,
        -0.03976712003350258,
        0.036285851150751114,
        -0.071905717253685,
        -4.6105015349341135e-33,
        0.03659549728035927,
        -0.0436762273311615,
        -0.04073254019021988,
        -0.021626491099596024,
        -0.012664629146456718,
        0.0034045707434415817,
        0.05299709364771843,
        0.06412782520055771,
        0.04167116805911064,
        -0.031100763007998466,
        0.04571821168065071,
        -0.013472883962094784,
        -0.039603132754564285,
        0.018158338963985443,
        0.00832645408809185,
        -0.10646066069602966,
        0.04806023836135864,
        -0.131035715341568,
        -0.008784787729382515,
        -0.020914193242788315,
        0.13896164298057556,
        0.05725672468543053,
        0.03459347411990166,
        0.022026771679520607,
        -0.020821062847971916,
        0.05746418610215187,
        0.04344169795513153,
        0.08591421693563461,
        -0.011771019548177719,
        -0.0668133869767189,
        -0.054375264793634415,
        0.05803758651018143,
        -0.02122332714498043,
        -0.03227298706769943,
        0.01828492432832718,
        0.10778053849935532,
        -0.018485046923160553,
        -0.0226609967648983,
        -0.07326675951480865,
        0.019509343430399895,
        -0.006613594945520163,
        0.03204818069934845,
        -0.0412120558321476,
        -0.0009451154619455338,
        -0.0013822277542203665,
        -0.016340158879756927,
        -0.04387998953461647,
        0.03763207793235779,
        0.011828998103737831,
        0.03126592934131622,
        -0.023808499798178673,
        0.03021598421037197,
        -0.01729009300470352,
        0.013477734290063381,
        0.02658633328974247,
        -0.024849778041243553,
        -0.11530682444572449,
        -0.009029245935380459,
        0.02856055274605751,
        -0.002077207900583744,
        -0.0010929596610367298,
        0.015217600390315056,
        -0.1112920269370079,
        -0.0012684306129813194,
        -0.031540825963020325,
        -0.03926107659935951,
        0.08478479087352753,
        -0.02628912962973118,
        -0.005907644052058458,
        0.10217811912298203,
        0.021688392385840416,
        0.04961580038070679,
        -0.01390368677675724,
        0.02756360173225403,
        -0.014522789046168327,
        0.01014904398471117,
        -0.00837490614503622,
        -0.016233963891863823,
        0.03920431062579155,
        -0.014837760478258133,
        -0.061999037861824036,
        -0.01688101887702942,
        0.06024671718478203,
        0.12778009474277496,
        0.11004456132650375,
        0.04233265668153763,
        -0.012802857905626297,
        -0.0975368320941925,
        -0.04627100005745888,
        0.08654645085334778,
        0.0033766150008887053,
        -0.00017384187958668917,
        -0.06758648157119751,
        0.07209423929452896,
        -0.030367380008101463,
        -5.772037781071049e-08,
        0.043024949729442596,
        0.003834170987829566,
        0.020071061328053474,
        -0.018837688490748405,
        0.03940461575984955,
        -0.07242906838655472,
        -0.040306173264980316,
        0.10026529431343079,
        0.03706362470984459,
        0.002334144664928317,
        0.057045187801122665,
        -0.02366417460143566,
        0.0025682251434773207,
        0.06950362026691437,
        0.0002904218272306025,
        0.03232951462268829,
        0.016461612656712532,
        -0.022628922015428543,
        -0.022619912400841713,
        0.0024187597446143627,
        -0.0017358505865558982,
        -0.016615625470876694,
        0.031871289014816284,
        -0.07919180393218994,
        0.06755302846431732,
        -0.03630092367529869,
        -0.11261428892612457,
        -0.024437185376882553,
        0.052669819444417953,
        -0.03667027875781059,
        -0.041406258940696716,
        0.0028305216692388058,
        0.058286264538764954,
        -0.0844072625041008,
        0.01881467178463936,
        -0.04357535019516945,
        0.029221534729003906,
        0.04612721502780914,
        0.039718713611364365,
        -0.005029905587434769,
        0.029597017914056778,
        -0.10097889602184296,
        0.00883966963738203,
        0.038535282015800476,
        0.02776004746556282,
        -0.03737252950668335,
        -0.03909483179450035,
        -0.12025236338376999,
        -0.03642483055591583,
        -0.015578231774270535,
        0.012314061634242535,
        0.000398810429032892,
        0.021634342148900032,
        0.053387656807899475,
        0.025090739130973816,
        8.357099432032555e-05,
        0.026886528357863426,
        -0.06692652404308319,
        -0.04905468598008156,
        0.07169168442487717,
        0.1055716946721077,
        -0.038958702236413956,
        -0.03328743577003479,
        0.06775332987308502
    ]
}