{
    "id": "v3JULO-C70U",
    "title": "5 Mods Nintendo wishes were Illegal",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-06-19T17:00:28Z",
    "video_url": "https://www.youtube.com/watch?v=v3JULO-C70U",
    "category": "Science & Technology",
    "tags": [
        "console games",
        "video games",
        "retro games",
        "modding",
        "jailbreaking",
        "piracy",
        "pirate",
        "nintendo",
        "I hate nintendo",
        "Free Nintendo Games",
        "video game consoles",
        "mario",
        "zelda",
        "jailbreak",
        "upscaling",
        "free upgrade"
    ],
    "views": 1537965,
    "likes": 71719,
    "comments_count": 2782,
    "description": "Try Rocket Money for free:  (US Residents Only) #rocketmoney #personalfinance   Signup for a Hetzner server and use code LTT24 to save 20 at:   Nintendo makes GREAT games, and bad decisions. With one of the most aggressive stances on piracy and homebrew, weve seen them come after gamers time and time again. Its time to equip you with the tools to fight back with these console mods that will free you from their archaic limitations, and allow you to unlock the true potential of the machines you paid good money for. HDMI upgrades, Type C power, Migswitch, JAILBREAKING - and MORE!  Discuss on the forum:   Buy a Nintendo Switch:  (Canada:  Buy a Nintendo Switch OLED:  (Canada:  Buy a GameCube Blue Retro Internal Adapter:  Buy a GameCube GC Dual 5.3 480p Internal Upgrade Kit:  Buy an ElectronAVE Kit:  Buy a Noiseblocker XS-1 50mm Fan:  Buy a Translucent Purple GameCube Replacement Shell:  Buy a MiSTer FPGA Full Kit (Saturn 2023 Version):  Buy a Mig Switch V2:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0    Check out the amazing creators featured in this video!  MachoNacho Productions   Good Vibes Gaming   Emulators & Gameplay HD   Taki Udon    CHAPTERS --------------------------------------------------- 0:00 Hack your Switch... sorta. 0:58 The Migswitch is GREAT, but... 2:48 You need to mod your WiiU 4:32 Wii are very serious 6:58 Speaking of the GAMECUBE! 8:26 You don't need an N64, use this instead",
    "description_links": [
        "https://RocketMoney.com/ltt",
        "https://htznr.li/LTT2406",
        "https://linustechtips.com/topic/1574155-5-mods-nintendo-wishes-were-illegal/",
        "https://geni.us/W9MSnA",
        "https://lmg.gg/6GRYY)",
        "https://geni.us/mbME",
        "https://lmg.gg/ze6kn)",
        "https://lmg.gg/ajZUd",
        "https://lmg.gg/Jm6rj",
        "https://lmg.gg/Am9hB",
        "https://lmg.gg/pUiug",
        "https://lmg.gg/Nr6Az",
        "https://lmg.gg/8YCfC",
        "https://lmg.gg/4p9AJ",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE",
        "https://www.youtube.com/c/MachoNachoProductions",
        "https://www.youtube.com/@GVG",
        "https://www.youtube.com/@EmulatorsGameplay",
        "https://www.youtube.com/@TakiUdon"
    ],
    "transcript": "This dangerous modified cartridge makes playing backed up Switch games so easy that anyone can do it. No rare hardware revisions, no mod chips, nothing. And when I say dangerous, I don't mean to you, you'll be fine. I mean for me. If this video gets taken down, the MIG Switch is going to be the reason. You see, I'm not doing anything illegal, and I won't be violating any of Nintendo's copyrights in this video, but what I will be doing is showing you guys some accessories and modifications that Nintendo wishes were illegal, and they are well-known for- Oh, w-we're back? That's great! Well, quick, before it happens again, let me tell you about our sponsor. Hetzner. They offer GDPR-compliant high-performance cloud servers, which consist of on-demand cloud computing platforms and APIs on a metered pay-as-you-go basis. Don't miss out and use code LTT24 at the link below, For 20 euros off. Well, if the goal was for me to not be able to tell that I've got a pirate cartridge in here, mission accomplished. This feels exactly like the real thing. And that's because as far as your Switch can tell, it is the original cartridge. Now, we may never find out who exactly is making the MIG Switch. I mean, sure, Mr. Bowser, notorious Nintendo hacker slash main villain, got out of jail the year prior to its release and, sure, his email was tied to the product's URL for a second, but come on, Nintendo's leash on him is so tight that they allegedly garnished $175 of his prison wage. And besides, it takes a lot longer than that to design a tool that is this seamless and sophisticated. To use it, all you need is the MIG Switch itself, your Switch console, and the contents of your own authentic game cartridge, which you can obtain using either the MIG Switch dumper accessory, or the MIG dump tool app. We're gonna have more of a guide-style video for some of the too- hot-for-YouTube stuff that we're doing today over at lmg.gg/floatplane, but, at least for this mod, I think you guys will figure it out on your own. It's not perfect. As of right now, it's pretty hard to get your hands on the dumper. And, if your intention was to use it for pirating Switch games, you should be warned that it is hard to find ROMs in the correct format online. Also, if you intend to use a ROM that you obtained via \"illegitimate means\" online, be warned that logging in with a \"cartridge\" that has been ripped and used by multiple people could easily get you flagged if Nintendo decides to employ very draconian countermeasures against this device. Now, I have my doubts about them doing that, since this would also impact the owners of second-hand games, but Nintendo has done some pretty surprising stuff in the past. Speaking of the ghosts of Nintendo's past... With two more eShop closures in 2023, the only Nintendo-approved way to grow your Wii U library is to pay the exorbitant collector's tax for those sweet teal DVD cases. But this video isn't about the Nintendo-approved way, is it? It's modding time, folks! Thanks to the helpful folks over at wiiu.hacks.guide, you too can have your Wii U swearing allegiance to the flag in less than 30 minutes. Custom firmware unlocks the ability to play back-ups. As well as unlocking hidden features, like compatibility with GameCube ISOs in hardware. That's right, my friends, no emulation performance hit. To oversimplify things a little bit, the Wii U's Espresso processor is essentially three Wii CPUs duct-taped together, which each in turn are the GameCube's Gecko chip on steroids. The Wii U's system controller then just... Adjusts the cores, disables some RAM, and enables a hidden GPU block, and baby, you're Cuban. Man, I have really got to do this to mine. Three generations of hardware-level Nintendo game support, and that is on top of the dozens of other machines that you can emulate. That is depending on the OS that you choose to install. Now the standard moving forward is Aroma, but a lot of homebrew is still awaiting compatibility updates. So we'd recommend installing both it, and the older Tiramisu tier SD card in the meantime. And there you have it. A modded Wii U is the easiest option if you want an almost one-stop shopped Nintendo machine, but is it the best option? Well, actually, maybe not. You see, because the Wii U was outsold by its older brother seven times over, it happens to be seven times rarer, and therefore about seven times as expensive. So, if you need an HDMI output, but you're not interested in the shrinking list of Wii U only titles, the AVE HDMI mod for the original Wii might be a better option. It grabs a digital signal right from the graphics chain, so there's no crappy conversion, but be warned, this install is definitely for advanced users only, but there are some very compelling reasons to put in the effort. The Wii has built-in hardware support for GameCube controllers, memory cards, and disks. It has a much bigger modding scene, so it's easier to find resources, and it doesn't require you to switch from TV to GamePad in order to navigate menus. It also looks a lot better, which I know sounds crazy, but hear me out. While the Wii U scales OG Wii games to 1080p for its HDMI output, it doesn't do it well. And yes, the Wii's output is blurry, too. But that's only if you do things Nintendo's way. You see, instead of pushing more pixels or using sophisticated post-processing hardware in order to enhance smoothness, Nintendo chose to implement two visual shortcuts that seriously degrade the Wii's output. The first is that in widescreen mode, games are just natively rendered in 4x3, then they're stretched for the final output. Widescreen? More like widescam. And the second, and more egregious of the two, was their smear filter that was meant to mitigate the flicker of interlaced video and also serve as a form of rudimentary anti-aliasing. Thankfully, with a modded Wii system, you can toggle these options off, and the softmod is even simpler than the one for the Wii U. Just follow the guide at wii.hacks.guide, install USB Loader GX to the Homebrew channel, and disable both filters at will. Now, there are times when you might want to leave the frame buffer option enabled in order to preserve the shape of on-screen objects, but other times, I promise that you will notice a significant improvement in both the analog signals and, assuming yours is modded, the HDMI output, which, by the way, can both be used simultaneously, even while playing GameCube games. Super cool for streamers. Speaking of the GameCube, the list of possible upgrades feels endless for this guy. Want a quieter fan? Great, mod a cheap connector onto a better one. Want to throw out this stupid brick of a power brick? Drop in a new type C power board. Wired cables and high Wavebird prices got you down? How about this Bluetooth compatible input board from Laser Bear? Now, of course, none of those things really fit in with our title, so let's talk about playing backed up games. Now you could wait for the Flippy Drive to become available soon TM. It's going to be less than $40. And we'll have a solderless install using this nifty folding cable that slides between the optical disc and the motherboard connectors. Anyone who pre-ordered is going to be able to play both backup ISOs and physical discs, which isn't a given for most drop-in optical drive emulators. But, pre-order? That doesn't help me today, does it? So, instead, we've used less than $5 worth of parts, a micro SD card, and a soldering iron, and embarked upon an adventure of pico-booting our lunchbox and Unlocking the wonders of the galaxy ube You can back up your games load up some homebrew or our favorite You can use your gameboy player without that stupidly expensive disc that you lost years ago The non-official gameboy experience is honestly better. Anyway, once you've installed the mods you want Hey, maybe treat yourself to a shell replacement for both the console and the gameboy player to give it a y2k aesthetic That would make Joanna Dark's highlights blush Speaking of y2k if you want to play n64 games Notice we don't have one of those consoles on the table. That's because you don't need one instead You can get a mr. FPGA and use the n64 core now regular viewers of this channel Or who follow the retro gaming scene probably already know that the mr. FPGA is an open source project that aims to use programmable hardware to provide a nearly perfectly accurate retro experience in one tiny box. And there are cores for more than just the N64. Pretty much anything up to the fifth generation of gaming, including retro PC platforms, can be not emulated, but almost replicated in hardware. There are a ton of options for parts, accessories, and cases. This Retro Castle aluminum case is Bob from Retro RGB's favorite one. So it's our favorite too. He's a great guy. But in the past, you were always locked to the DE-10 Nano, a development board that has more than doubled in price ever since Terasic saw a jump in demand and figured out that gamers were using it to play games. Thankfully, though, a clone board using the same FPGA chip is coming soon TM at the DE-10's original $99 price tag. Just, uh, don't tell Nintendo. Speaking of... If you're even more price-conscious, you'll be glad to know that PC software emulation is better than ever, and not just for the N64. Dolphin, the best GameCube and Wii emulator, can boost both smoothness and fidelity, and all it costs you is a little bit of accuracy. But, that's just the tip of the iceberg. There are other projects, like N64 Recomp, that are providing tools to simplify recompiling the code of fifth-generation Nintendo games to run natively on PC. This will unlock quality-of-life upgrades like widescreen support and higher frame rates to make them more enjoyable than ever before. In fact, this one might be worth a dedicated video, so give us a thumbs up and leave a comment if that's what you want to see. I can't wait to see some of the mods that are going to show up for these older games. Mods can long extend the life of products that you already own, and while I understand Nintendo's perspective that this type of modding is tantamount to piracy, which harms their bottom line in the short term, it's clear from their current diversification strategy that at least someone over there understands that there are other ways to capitalize on their beloved IP that can not only be less antagonistic toward their fans, but also more lucrative. For everyone else over at Nintendo, here's what I'll say about the current approach to shutting down the kinds of mods that we've looked at today, especially for stuff you don't sell anymore. One, it's not gonna work. On their own principles, such as they are, hackers will outsmart your DRM scheme. Two, some of the highest software attach rates of consoles past were easy targets for pirates, meaning there may not be a direct long-term correlation between a platform's resilience to piracy and higher game sales. And number three, history has shown that the only way to effectively combat theft or piracy is to make paying for games a better experience than downloading them. And I promise you that if Nintendo hardware was the best and smoothest way to experience Nintendo software, Switch emulation on handheld PCs wouldn't seem like such a threat. Just like our sponsor won't seem like a threat, thanks to this smooth segue to... Rocket Money. At this point, it seems like almost every product and service has moved to a subscription model, which can make it all too easy for your hard-earned cash to start disappearing from your bank account. But Rocket Money wants to help by putting control back in your capable hands. Are you getting lost in the weeds of all those subscriptions? Rocket Money makes it simple to round them all up and cancel the ones you don't use. Just a couple clicks and you're free. The best part, they can even help with things like your phone or internet bill. Just upload your bill onto Rocket Money and they can negotiate the best rates on your behalf. Go to rocketmoney.com/LTT or click the link in the description to get started for free. You can also unlock even more futures with premium. If you guys enjoyed this video, maybe check out the one we did on upgrading older gaming machines, like my Sega Game Gear, and David who wrote this videos PlayStation Vita.",
    "transcript_keywords": [
        "Wii",
        "Nintendo",
        "MIG Switch",
        "Switch",
        "games",
        "Switch games",
        "Wii output",
        "MIG Switch dumper",
        "Nintendo game support",
        "dangerous modified cartridge",
        "Wii games",
        "Rocket Money",
        "MIG",
        "Nintendo game",
        "modded Wii",
        "video",
        "hardwarelevel Nintendo game",
        "HDMI output",
        "fifthgeneration Nintendo games",
        "hardware"
    ],
    "transcript_entity_values": [
        "about seven",
        "one",
        "GameCube",
        "One",
        "DRM",
        "GPU",
        "seven",
        "20 euros",
        "Wii",
        "Three",
        "eShop",
        "C power board",
        "PlayStation Vita",
        "Tiramisu",
        "the Flippy Drive",
        "dozens",
        "AVE",
        "FPGA",
        "three",
        "the Wii U's",
        "Wii U",
        "Nintendo",
        "Espresso",
        "the year",
        "MIG",
        "4x3",
        "Homebrew",
        "first",
        "USB Loader GX",
        "less than $40",
        "Recomp",
        "DE-10",
        "Wii",
        "GDPR",
        "GameCube games",
        "2023",
        "years ago",
        "Rocket Money",
        "Joanna Dark's",
        "OG Wii",
        "IP",
        "99",
        "1080p",
        "175",
        "SD",
        "n64",
        "N64",
        "Castle",
        "David",
        "the MIG Switch",
        "Laser Bear",
        "less than $5",
        "Aroma",
        "a ton",
        "number three",
        "Switch",
        "y2k",
        "Sega Game Gear",
        "Gecko",
        "two",
        "MIG Switch",
        "less than 30 minutes",
        "Bowser",
        "second",
        "N64",
        "Two",
        "Retro RGB's",
        "gameboy",
        "TM",
        "today",
        "fifth",
        "Wavebird",
        "RAM",
        "GamePad",
        "Terasic",
        "Wii U",
        "Cuban",
        "Bob"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "EVENT",
        "PERSON",
        "LANGUAGE",
        "PERSON"
    ],
    "vector": [
        -0.0954633355140686,
        -0.06861304491758347,
        0.0736946165561676,
        -0.1232939064502716,
        0.06401747465133667,
        0.02027159556746483,
        0.025565851479768753,
        0.039925623685121536,
        -0.06666070222854614,
        0.04067784920334816,
        0.018720947206020355,
        0.028621681034564972,
        -0.04469515010714531,
        -0.07080687582492828,
        0.0819268748164177,
        0.04305355250835419,
        0.04820776358246803,
        -0.05250861495733261,
        -0.02624892070889473,
        -0.019358253106474876,
        0.064032182097435,
        -0.09572099149227142,
        -0.06527476757764816,
        -0.006627017166465521,
        0.006463775411248207,
        0.02858179621398449,
        0.0008334519225172698,
        -0.012523645535111427,
        -0.048089589923620224,
        -0.022162899374961853,
        -0.007145079784095287,
        0.01731632836163044,
        -0.023511623963713646,
        -0.016427161172032356,
        -0.04081486538052559,
        -0.13419072329998016,
        0.019067319110035896,
        -0.10515300929546356,
        -0.04062659293413162,
        -0.08667181432247162,
        -0.06795438379049301,
        -0.014239310286939144,
        -0.04832806438207626,
        0.060797058045864105,
        -0.05534258484840393,
        -0.06259185820817947,
        -0.010647728107869625,
        -0.06671804189682007,
        0.027568120509386063,
        -0.01971687376499176,
        0.019301334396004677,
        -0.04158169403672218,
        0.047957200556993484,
        -0.04916435852646828,
        0.08913873881101608,
        0.01072558294981718,
        0.0019526814576238394,
        -0.0061532240360975266,
        0.12708301842212677,
        0.010675846599042416,
        -0.012532788328826427,
        -0.04746345803141594,
        -0.02017640322446823,
        -0.008198907598853111,
        -0.011902288533747196,
        -0.006980374921113253,
        0.009865731932222843,
        -0.06181925907731056,
        0.017534997314214706,
        -0.05765032023191452,
        -0.04952909052371979,
        -0.006502655800431967,
        0.04456881061196327,
        0.04231187701225281,
        -0.0466160774230957,
        -0.012783847749233246,
        0.0034943106584250927,
        -0.05204378068447113,
        0.025912784039974213,
        3.5367153031984344e-05,
        -0.04158398509025574,
        -0.02652224339544773,
        -0.0004101143858861178,
        0.012279241345822811,
        0.028286714106798172,
        -0.0070483791641891,
        -0.021926242858171463,
        0.038120344281196594,
        0.010131139308214188,
        2.554943785071373e-05,
        0.007274078205227852,
        0.04188099130988121,
        0.14149770140647888,
        0.05954192206263542,
        -0.025730276480317116,
        -0.04694405943155289,
        0.052861325442790985,
        -0.10566022247076035,
        -0.014849960803985596,
        0.04665866494178772,
        -0.0032664621248841286,
        -0.024431662634015083,
        0.05446943640708923,
        -0.021502239629626274,
        0.01749444007873535,
        -0.03446733206510544,
        -0.052077922970056534,
        0.07326441258192062,
        -0.05203699320554733,
        0.008770732209086418,
        -0.07755927741527557,
        0.07027942687273026,
        -0.03416640684008598,
        -0.008775249123573303,
        -0.01903415098786354,
        -0.02258143201470375,
        -0.03928816318511963,
        0.01917700283229351,
        0.06254564225673676,
        -0.022206928580999374,
        -0.03384953737258911,
        0.0013676447561010718,
        -0.016896646469831467,
        0.014336180873215199,
        -0.021013645455241203,
        -0.044475942850112915,
        -0.05879422649741173,
        7.549887974644615e-33,
        0.012389362789690495,
        0.08289089053869247,
        -0.054767586290836334,
        0.04403356462717056,
        0.00807653646916151,
        0.10794923454523087,
        0.07103808224201202,
        0.06787732988595963,
        -0.0035710902884602547,
        0.025460081174969673,
        -0.01213078387081623,
        0.013898720033466816,
        -0.11934394389390945,
        0.03218459337949753,
        0.1237669587135315,
        -0.05859419330954552,
        -0.03324522078037262,
        -0.05391760915517807,
        0.08074312657117844,
        0.0303201787173748,
        0.04777307063341141,
        -0.006382100284099579,
        0.046377088874578476,
        -0.00458328053355217,
        -0.02272777631878853,
        0.010730816051363945,
        -0.07652578502893448,
        -0.038104940205812454,
        0.11894337832927704,
        0.04741845652461052,
        -0.04962925240397453,
        -0.012689684517681599,
        0.05590393766760826,
        -0.0012329714372754097,
        0.06730831414461136,
        -0.021452896296977997,
        0.053889114409685135,
        -0.07975306361913681,
        -0.09916625916957855,
        0.02767924778163433,
        0.00851235631853342,
        0.02779361419379711,
        -0.1316998302936554,
        -0.012700898572802544,
        0.039721790701150894,
        0.03349767252802849,
        0.06571844220161438,
        0.011752242222428322,
        -0.05763975530862808,
        0.08403158187866211,
        -0.077630914747715,
        0.017871711403131485,
        -0.02632044069468975,
        -0.03574814647436142,
        0.014281081967055798,
        -0.04615228250622749,
        0.006173300556838512,
        0.004804999101907015,
        0.11263632029294968,
        0.03917550668120384,
        0.009396709501743317,
        0.016537265852093697,
        0.08547990769147873,
        -0.02143392711877823,
        -0.00882785301655531,
        0.07888967543840408,
        0.01935547962784767,
        -0.04382715001702309,
        -0.06449670344591141,
        -0.001981464447453618,
        0.008122448809444904,
        0.03705456852912903,
        -0.004009915981441736,
        0.012593518942594528,
        0.0112876296043396,
        0.01556929387152195,
        -0.08219300210475922,
        -0.014830196276307106,
        -0.020339034497737885,
        -0.09245972335338593,
        0.03247283026576042,
        0.022435637190937996,
        8.919691026676446e-05,
        0.06902389228343964,
        0.11678241938352585,
        0.010512285865843296,
        0.0026505731511861086,
        0.06006151810288429,
        -0.06933361291885376,
        -0.011761445552110672,
        0.008142025209963322,
        -0.08169104158878326,
        0.06514794379472733,
        -0.001992243342101574,
        -0.0235737431794405,
        -6.912397551726519e-33,
        0.0126182334497571,
        -0.09333080053329468,
        -0.03582227975130081,
        0.04307397082448006,
        0.06235773488879204,
        -0.02454250492155552,
        0.012105537578463554,
        -0.015165395103394985,
        0.03244376555085182,
        -0.01624106615781784,
        0.03238421306014061,
        0.03563502058386803,
        0.040892232209444046,
        0.006848528515547514,
        -0.014824560843408108,
        -0.09506122022867203,
        -0.02237508073449135,
        -0.001561538316309452,
        -0.03048515133559704,
        -0.011607768945395947,
        0.055860549211502075,
        0.00427699089050293,
        -0.031241698190569878,
        0.02163734659552574,
        -0.03134048730134964,
        0.05962963402271271,
        -0.07135725021362305,
        0.009572911076247692,
        0.028046533465385437,
        0.06716196984052658,
        0.021615909412503242,
        0.11347086727619171,
        0.06031958758831024,
        0.061889391392469406,
        0.09494365006685257,
        -0.02928760275244713,
        0.11267776787281036,
        0.08111917972564697,
        -0.026446228846907616,
        -0.08475317806005478,
        -0.046920523047447205,
        0.034161776304244995,
        0.006827137898653746,
        0.01822781190276146,
        -0.03591796010732651,
        0.016141334548592567,
        0.010019329376518726,
        -0.08668854832649231,
        0.04733731970191002,
        0.05924106016755104,
        0.00048380866064690053,
        -0.0950193777680397,
        0.04166524484753609,
        0.001699431799352169,
        -0.03951207920908928,
        -0.09891010075807571,
        0.019262326881289482,
        0.019068969413638115,
        0.07069378346204758,
        0.021661724895238876,
        0.07066722959280014,
        -0.03854803368449211,
        -0.03659878671169281,
        -0.03712534159421921,
        0.05595358461141586,
        -0.012998602353036404,
        0.05188794061541557,
        0.035699695348739624,
        0.093307264149189,
        -0.05607018247246742,
        -0.03542008623480797,
        -0.06881053000688553,
        0.04601525515317917,
        -0.0847967341542244,
        0.0027820318937301636,
        0.04345009848475456,
        0.018807386979460716,
        0.004572994541376829,
        0.04505084827542305,
        -0.00460704555734992,
        -0.02025786228477955,
        -0.013206219300627708,
        0.057095106691122055,
        0.012371128425002098,
        0.03521072119474411,
        -0.05576520785689354,
        0.07335120439529419,
        -0.008054758422076702,
        0.022597530856728554,
        -0.04517696797847748,
        -0.06006617099046707,
        0.05049743875861168,
        -0.003705893410369754,
        0.07555337995290756,
        0.08190108835697174,
        -6.295928045574328e-08,
        0.03239857405424118,
        0.0001477297773817554,
        -0.03012286126613617,
        0.05433587729930878,
        0.07305416464805603,
        -0.04387853667140007,
        -0.07955018430948257,
        -0.06779017299413681,
        0.05931396782398224,
        -0.03453037142753601,
        0.06031095236539841,
        -0.01742168702185154,
        -0.027213050052523613,
        0.029133934527635574,
        0.04283255711197853,
        0.0337543711066246,
        -0.01681281253695488,
        0.06504148244857788,
        -0.006790018640458584,
        0.08347322791814804,
        -0.09613636136054993,
        0.02099200151860714,
        0.06761975586414337,
        -0.051520977169275284,
        -0.013542217202484608,
        -0.030944915488362312,
        0.027326803654432297,
        -0.006635824218392372,
        0.11266522109508514,
        0.01216018944978714,
        -0.06279398500919342,
        -0.010784982703626156,
        -0.03284801170229912,
        -0.04079745337367058,
        -0.02280575968325138,
        -0.02862512692809105,
        -0.06815717369318008,
        0.019633550196886063,
        0.08742805570363998,
        -0.00044015320600010455,
        0.02887265756726265,
        -0.0946723148226738,
        -0.13968031108379364,
        0.0014403057284653187,
        0.008250422775745392,
        -0.05359852313995361,
        -0.060639526695013046,
        -0.056281495839357376,
        -0.09904523938894272,
        0.06246963515877724,
        -0.016514355316758156,
        0.0689660906791687,
        -0.04204895719885826,
        -0.025703541934490204,
        0.06660204380750656,
        0.01161811500787735,
        0.005189820658415556,
        0.05651785060763359,
        -0.02344970963895321,
        0.01582474820315838,
        0.0443083792924881,
        -0.03889670968055725,
        -0.04588938131928444,
        0.04562461003661156
    ]
}