{
    "id": "v3x7Ksn5WnY",
    "title": "HomePod Mini! 💕",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-12T16:03:49Z",
    "video_url": "https://www.youtube.com/watch?v=v3x7Ksn5WnY",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 668506,
    "likes": 25719,
    "comments_count": 1626,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- You guys, the HomePod mini is officially here. It's a dream. We don't have to wish for it, we don't have to hope, it is here. Our wishes and dreams have been granted. I am such a huge fan of my HomePod, I have them in every single room, and now the fact that you can get a home pod for $99, is incredible. Let's open it up. (knife clicks) (knife scraps box) (wrapping crinkling) Look at it, I love these colors, so great. The suspense. Oh my, whoa. What? Look at this. Oh, my, it's a baby. I have to be very careful. (gentle music) This is so small. It's about the size of a softball. I used to be a fast pitcher. (hums) It's almost actually about the same weight, too. Like if we didn't have this cable. (gentle music) Like look at this size comparison. (laughs) It's like not even a comparison. This thing is so tiny. Oh wow. I do have two of them, which will allow you to do a nice stereo pair. Oh, look at that little Apple logo on the bottom. Is there an Apple logo? There is, huh, what do you know? (gentle music) Let's plug this in. Look at this braided cable. Very, very nice. I like that this is a USB-C cable, as opposed to an actual plug. Is there something else in here? There is, look, we have more things. It does include a wall charger. It is plugged in. Oh, look, it's ready. HomePod mini set up. Look at that, oh my gosh. Hi, oh, I can't wait to talk to you. (chuckles) It's been a while since I've talked anybody other than Tyler for a real long time. (laughs) Where are we gonna to set this up? We're gonna set this up in, let's just say we're gonna set it up in the basement. Basement HomePod. I don't have a basement. You can enable personal requests, which means I can have Siri read my text messages, I can send messages. Just got a little notification here that says Siri for everyone, Siri can recognize the voices of each person in the home, provide access to music, reminders, calendar, and more. Invite people to your home in the home app after setup. Alright, should I plug in this dude too? (HomePod mini beeps) Look at that. Oh, you missed it. Okay, HomePod is ready. Play Third Eye Blind. (upbeat music) Wow. (upbeat music) Oh my gosh. I'm gonna get a copyright stripe because this is so loud. Can you believe how loud that is? - [Tyler] No. - Holy moly. (Tyler chuckles) There's hardly any distortion, like that sounds so, that was all the way up. (upbeat music) This is only $9, and it sounds like a million bucks. Like I don't need to have this big HomePod in every single room now, because a lot of my rooms are fairly small, and this would be perfect. So the HomePod mini is $99. The HomePod, HomePod is 299. Obviously the HomePod is much larger, so there's a lot more room for larger drivers, and the sound quality is better in this one. But that's not to take away from the fact that this small, tiny, little device is putting out incredible sound. Like I was honestly very surprised. (upbeat music) So the new mini has a four microphone design and these are used to detect when you say, \"Hey S\", and the fourth is used for echo cancellation, so that Siri is able to hear you even when it's noisy, or if music is playing. Now, this little device is surprisingly powerful, with the S5 chip and a full range driver delivering some really impressive sound. Much like the full-size HomePod, the top is touch sensitive, so you can use the surface to play, pause, you double tap for the next track, you triple tap for the previous track, and then you can press and hold to activate Siri. There's also some little plus and minus buttons here that you can see, and those you can adjust the volume, but you would also do this with your voice by simply saying, \"Hey, turn up the volume\", \"Turn the volume down\", \"Turn the volume to 15%\", \"Turn up the volume to 50%\". If you're using HomePod in a household where there's multiple people, when you have your family connected to it, it'll be able to recognize the voices of each family member, so that they'll be able to have access to all of their playlists, and their recommendations. So Siri is constantly learning who's talking to her, or him, you can always change the Siri voice. Since I do have a lot of HomePods in my house, it's kind of crazy because anytime I tell her to play music everywhere, the entire house just automatically starts playing music. Another cool thing that I wanted to call attention to is the fact that the HomePod mini is one of the first Apple devices to have thread support, and Nanoleaf just launched some new light bulbs that are also thread enabled, which will allow more compatibility with more internet of things devices. So I have the Nanoleaf app ready, I've got a light ready, let's open this up and set it up. (box scraping) Oh, I'm so excited about these. I love Nanoleaf, they have so many cool products. (switch clicks) Ooh, it's a little warm. Now swap it out, now swap it out Now swap it out, now swap it out Look at that old tech. (light bulb scraping) We're gonna be able to change the colors. We're gonna be able to do so many things with this. Like turn it off and turn it on, and change the colors. Add to home, let's do it. Connecting, make sure it stays it. We're doing this. Living room, little light. I want it to turn on when I arrive home, turn off when I leave. Turn off little light. (gasps) Turn on little light. - [Siri] Okay, the little light is on. - Turn off little light. - [Siri] Okay, the little light is off. - Little light, it's a little light. (laughs) Inside the app, look at this, what color do we want little light? Turn, little light blue. - [Siri] Got it. (Justine gasps) - I didn't even know if that was gonna work. Turn little light pink. - [Siri] Okay. - Another thing that you could do with these is set them up as a stereo pair. You were also able to do this with a previous HomePods, but it's really cool because now, these fits so much better right here on my TV entertainment center. You now have the ability with just these two HomePods to have that stereo sound and have a much more immersive experience. You'll be able to use U-1 equipped phone, and that will allow you to be able to just kind of hold your phone up next to the HomePod, and it'll transfer the music or your phone call, or your podcast. So this is gonna be kind of neat because if you're in your car, listening to your music, or if you're on a phone call, and you come into the house, and your home pod recognizes that your phone is near it, it'll automatically transfer whatever it is that you're listening to, right to your HomePod. One thing that I use my HomePod for more often than I'd like to admit, is to find my iPhone. Find my iPhone. - [Siri] Just a moment. I found three iPhones nearby, which one? Pig phone pig face, or iPhone? (Justine laughs) - Pig phone pig face. (iPhone chiming) Surprise, it's right here. Intercom is a really fun feature that I've been using to further my quarantine problem of talking to myself. So now I'm talking to myself through my home pods and my phone, and this is kind of interesting because I'm able to use intercom on my phone, on the Apple watch, by telling Siri to, \"Hey, intercom everyone\", and then I say whatever message that I wanna say. And it's cool because this will show up right here, on my phone, and then I can also use my phone to respond, and then that can also go throughout my entire house, and activate on every single home pod. Are you having a good day? - [Siri] Hmm, I don't have an answer for that. Is there something else I can help wit? (Justine laughs) - That is now gonna be my answer when anybody asks me. Hmm, I don't have an answer for that. Is there something else that you would like to ask me? - [Tyler] Hey Justine, how you doing? - Hmm. (laughs) So I know this was just a quick look at the new HomePod mini, but I'm very excited about this, because this is kind of changing the way that we're able to interact with our devices, and at a much lower price point. This is only $99, which is still on the higher end for some of these smart speaker devices. But if you are looking to keep this sort of in the Apple ecosystem, if you want a good speaker, if you want to have access to Siri, and it will have those updates with the U-1 chip hopefully very soon. Well, thank you guys so much for watching. As always, I will see you in the next video, and if you haven't subscribed, please do so and hit the bell, so you'll be notified when I post a new video. And I will see you guys in the next one. (upbeat music) Did you do that? (upbeat music) Did you do that? I didn't do that. Shut up, yes, you did. So I think what happened is- (upbeat music) Are you doing? No, you're shut u- Are you messing with me? No, you're doing it. - [Tyler] I'm not connected to your pods. - Yeah, but you can airplane to it. - [Tyler] No, but I didn't. - He did it. - I didn't. (gentle music)",
    "transcript_keywords": [
        "HomePod",
        "turn",
        "Siri",
        "light",
        "phone",
        "HomePod mini",
        "home",
        "Apple",
        "set",
        "mini",
        "music",
        "Hey",
        "volume",
        "HomePods",
        "kind",
        "thing",
        "home pod",
        "sound",
        "devices",
        "Nanoleaf"
    ],
    "transcript_entity_values": [
        "one",
        "Nanoleaf",
        "a good day",
        "the next one",
        "Apple",
        "Justine",
        "Siri",
        "99",
        "HomePods in my house",
        "iPhone",
        "three",
        "299",
        "only $99",
        "HomePod",
        "U-1",
        "HomePods",
        "Basement HomePod",
        "S5",
        "four",
        "iPhones",
        "Siri",
        "only $9",
        "two",
        "million bucks",
        "Nanoleaf",
        "Tyler",
        "50%",
        "Intercom",
        "first",
        "fourth",
        "15%",
        "One"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "NORP",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "PERCENT",
        "CARDINAL"
    ],
    "vector": [
        -0.0015302510000765324,
        -0.04590408504009247,
        -0.04559239372611046,
        -0.11653648316860199,
        0.025481905788183212,
        0.06021362170577049,
        0.041843075305223465,
        0.06589449197053909,
        -0.027559174224734306,
        0.06398750841617584,
        0.027534088119864464,
        0.007190223317593336,
        -0.03614455834031105,
        0.003130723023787141,
        -0.0101456418633461,
        0.030451960861682892,
        0.027154820039868355,
        0.021343013271689415,
        0.005087710451334715,
        0.046695783734321594,
        -0.036830704659223557,
        -0.026217469945549965,
        0.02724442258477211,
        0.037501052021980286,
        -0.00436009606346488,
        0.0727342814207077,
        0.010899991728365421,
        0.034836769104003906,
        -0.07016100734472275,
        -0.06290562450885773,
        -0.03051624447107315,
        0.02719014137983322,
        0.10595833510160446,
        -0.0011129920603707433,
        0.0196502897888422,
        -0.018045110628008842,
        0.04744773730635643,
        -0.017269372940063477,
        -0.021963264793157578,
        -0.025641627609729767,
        0.020159680396318436,
        -0.035468973219394684,
        0.023161614313721657,
        -0.0440133698284626,
        -0.0877370536327362,
        -0.09119214862585068,
        -0.026581836864352226,
        -0.07507611066102982,
        0.05246802046895027,
        0.059721656143665314,
        -0.09279455989599228,
        -0.0352570116519928,
        0.043022241443395615,
        0.016698479652404785,
        -0.06255947053432465,
        -0.00893077626824379,
        -0.09699635207653046,
        0.007349332328885794,
        0.0814494788646698,
        -0.08784452825784683,
        0.06578083336353302,
        -0.07274238765239716,
        0.03885267674922943,
        0.038289133459329605,
        -0.031255535781383514,
        -0.09336376935243607,
        0.011983226984739304,
        -0.018661871552467346,
        0.02213173732161522,
        0.014438432641327381,
        -0.08925656974315643,
        0.07041692733764648,
        -0.044151149690151215,
        0.022274745628237724,
        -0.022005688399076462,
        0.02840512990951538,
        0.04287796840071678,
        -0.029628241434693336,
        -2.3343964130617678e-05,
        0.08416469395160675,
        0.026248933747410774,
        -0.02468118444085121,
        -0.05957527086138725,
        -0.022908281534910202,
        0.015690604224801064,
        0.051258593797683716,
        0.020049789920449257,
        0.004746333695948124,
        -0.03686412796378136,
        -0.09414967894554138,
        -0.08440844714641571,
        0.00317483046092093,
        -0.012741643004119396,
        -0.04059579223394394,
        -0.025618061423301697,
        -0.08822771161794662,
        -0.011328436434268951,
        -0.052510593086481094,
        -0.046749431639909744,
        0.07752647250890732,
        0.091278575360775,
        -0.03538982942700386,
        0.020341427996754646,
        -0.011804400943219662,
        0.0046538677997887135,
        -0.11789066344499588,
        -0.0448787659406662,
        -0.0015674801543354988,
        0.024502716958522797,
        0.02020035870373249,
        -0.05160125717520714,
        0.011429734528064728,
        -0.055559709668159485,
        -0.06540489196777344,
        0.0062605892308056355,
        0.10998956859111786,
        -0.026962298899888992,
        0.061167337000370026,
        0.05865149572491646,
        0.0056779757142066956,
        -0.011792203411459923,
        -0.10161513835191727,
        -0.002732400316745043,
        0.013722548261284828,
        0.013908390887081623,
        0.028654851019382477,
        -0.06724241375923157,
        1.3368269831792124e-32,
        0.02467077597975731,
        0.07560350745916367,
        0.01409248635172844,
        0.03724343329668045,
        -0.039519306272268295,
        -0.03599280118942261,
        -0.02532900497317314,
        0.11068491637706757,
        -0.018266035243868828,
        -0.0067961374297738075,
        0.0022712606005370617,
        0.04329318925738335,
        -0.028856322169303894,
        0.044424645602703094,
        0.030526814982295036,
        -0.05292825400829315,
        -0.04247211292386055,
        -0.040889959782361984,
        -0.043552760034799576,
        -0.010037291795015335,
        -0.0032617170363664627,
        -0.01788724586367607,
        0.0007183647248893976,
        0.08826541155576706,
        0.0853925496339798,
        0.03489881008863449,
        0.08377498388290405,
        -0.02217445708811283,
        0.06046896055340767,
        0.01968499645590782,
        -0.0019050226546823978,
        -0.06283468008041382,
        -0.0023824376985430717,
        -0.0819520577788353,
        -0.022277843207120895,
        -0.03305423632264137,
        -0.06995141506195068,
        -0.003427833318710327,
        -0.04080038145184517,
        -0.07671181857585907,
        0.002483172807842493,
        -0.00023667961067985743,
        -0.06831173598766327,
        -0.07091260701417923,
        0.06221719831228256,
        0.02806919440627098,
        0.06484009325504303,
        0.07495399564504623,
        -0.019137542694807053,
        -0.008032633922994137,
        -0.02704576961696148,
        -0.009181384928524494,
        -0.07040970772504807,
        0.014514368958771229,
        -0.005836771801114082,
        -0.08087211847305298,
        -0.016591893509030342,
        0.04302478954195976,
        0.026340335607528687,
        0.027710162103176117,
        0.010783775709569454,
        -0.027664221823215485,
        -0.0005282145575620234,
        -0.033648714423179626,
        -0.04042201116681099,
        0.11526921391487122,
        0.08884664624929428,
        -0.05562502145767212,
        0.06184583529829979,
        0.06041456758975983,
        0.0226434376090765,
        0.014144876040518284,
        0.061668384820222855,
        0.006943507120013237,
        0.0380232110619545,
        0.0533611923456192,
        -0.0570930652320385,
        -0.05970202758908272,
        -0.007723899092525244,
        -0.03271359205245972,
        -0.10145609825849533,
        0.06600960344076157,
        -0.010468722321093082,
        0.12230309098958969,
        -0.05269649624824524,
        -0.08400202542543411,
        0.028185490518808365,
        -0.03369078412652016,
        -0.05010697990655899,
        0.023463046178221703,
        -0.01942221261560917,
        0.06142982468008995,
        -0.10053186863660812,
        -0.0245232991874218,
        -0.05280528590083122,
        -1.2118679663933693e-32,
        0.03839356079697609,
        0.02835097536444664,
        -0.0009500106680206954,
        -0.029814088717103004,
        0.03293139860033989,
        -0.0298220943659544,
        0.07242925465106964,
        0.09007690101861954,
        0.06404244899749756,
        -0.06598719209432602,
        0.04664509743452072,
        -0.07843128591775894,
        -0.08195923268795013,
        0.021729230880737305,
        -0.02752315253019333,
        -0.005611018743366003,
        -0.06546256691217422,
        -0.06954968720674515,
        0.10439778864383698,
        -0.00600760942324996,
        0.08179005980491638,
        0.11966438591480255,
        0.09523475915193558,
        0.0367753729224205,
        0.043692514300346375,
        0.0059491409920156,
        0.06110520660877228,
        0.027468424290418625,
        0.031438883394002914,
        0.009852890856564045,
        0.019719198346138,
        -0.07433034479618073,
        -0.044401269406080246,
        0.03335512802004814,
        0.003995753359049559,
        0.03756416589021683,
        -0.031648628413677216,
        0.04547237232327461,
        0.01762760803103447,
        -0.08681380748748779,
        0.03203989192843437,
        0.0012377153616398573,
        0.021407462656497955,
        -0.03354955464601517,
        0.006345502100884914,
        -0.15251564979553223,
        -0.041138265281915665,
        0.060250598937273026,
        -0.00048708097892813385,
        -0.009273938834667206,
        -0.0730118453502655,
        -0.05264781415462494,
        -0.025217348709702492,
        -0.01137444470077753,
        -0.03764444962143898,
        0.004550411365926266,
        -0.03696814924478531,
        -0.032429300248622894,
        0.019321803003549576,
        0.04430730640888214,
        0.03278190642595291,
        -0.04335183650255203,
        -0.0683656856417656,
        -0.05180983990430832,
        -0.020047349855303764,
        -0.03778162971138954,
        0.041193779557943344,
        0.04290134087204933,
        -0.026305966079235077,
        0.03163892403244972,
        0.017871743068099022,
        0.04145665839314461,
        0.1048436239361763,
        0.01607516035437584,
        0.04492809250950813,
        0.019620712846517563,
        -0.08926109224557877,
        0.00526523357257247,
        0.11969631165266037,
        -0.05607138201594353,
        -0.06370692700147629,
        -0.007677607703953981,
        0.02874804101884365,
        0.08012451976537704,
        0.10777285695075989,
        0.08968478441238403,
        0.06668893992900848,
        -0.005035224370658398,
        -0.02317647449672222,
        0.07972625643014908,
        0.03458182141184807,
        0.07134804874658585,
        0.07779423892498016,
        0.10013819485902786,
        -0.07863026857376099,
        -6.18274427210963e-08,
        0.057114001363515854,
        0.02427056059241295,
        -0.01996644027531147,
        -0.0010931321885436773,
        0.00870880950242281,
        -0.07382387667894363,
        -0.017195358872413635,
        0.0020188314374536276,
        0.039684902876615524,
        -0.04532189294695854,
        0.05118712782859802,
        -0.02933969721198082,
        -0.0076721846126019955,
        0.10338281095027924,
        0.021995212882757187,
        0.020937902852892876,
        -0.08409260213375092,
        0.06648596376180649,
        -0.04301787540316582,
        -0.08064579218626022,
        -0.05118131265044212,
        0.02223973348736763,
        0.038836367428302765,
        -0.006960001774132252,
        0.018115170300006866,
        -0.0020686949137598276,
        0.00337897683493793,
        -0.005185545422136784,
        0.03466608747839928,
        -0.02547399140894413,
        -0.09200090914964676,
        0.013855298049747944,
        -0.02416890673339367,
        0.022124191746115685,
        -0.06310771405696869,
        -0.011547480709850788,
        -0.07383530586957932,
        -0.0035102919209748507,
        -0.019450394436717033,
        0.02359079197049141,
        0.018797636032104492,
        -0.13350607454776764,
        -0.0747305378317833,
        -0.025925425812602043,
        0.01261659525334835,
        -0.03185949847102165,
        0.047797899693250656,
        -0.09970774501562119,
        -0.05301157757639885,
        -0.02821880578994751,
        -0.03325650095939636,
        0.019709566608071327,
        0.03645991161465645,
        -0.01569126360118389,
        0.05489901080727577,
        0.013395915739238262,
        0.029144104570150375,
        0.03797319531440735,
        -0.020169613882899284,
        -0.005801383405923843,
        0.019868453964591026,
        0.04730013757944107,
        -0.03328869119286537,
        0.06745997816324234
    ]
}