{
    "id": "v7pXOcAtSnw",
    "title": "Chevy Bolt EV Review: Electric Excellence",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-06-13T06:30:22Z",
    "video_url": "https://www.youtube.com/watch?v=v7pXOcAtSnw",
    "category": "Science & Technology",
    "tags": [
        "chevy bolt ev review",
        "chevy bolt review",
        "best electric car 2017",
        "electric car review",
        "chevy volt review",
        "chevy bolt test drive",
        "mrmobile",
        "michael fisher",
        "tesla central"
    ],
    "views": 84913,
    "likes": 3633,
    "comments_count": 353,
    "description": "This may be the summer of the Tesla Model 3, but GM will always be able to say that it got here first. The Chevy Bolt EV is an all-electric car boasting an EPA-estimated 238-mile range, a zero-to-sixty time of 6.8 seconds, and enough storage and cabin space to qualify as a crossover (in Chevy's terms, at least). It's neither the sexiest nor the most luxuriously appointed electric car on the road, but its combination of range and power make those shortcomings easy to forgive ... and its $37,500 starting price before incentives make it all the more alluring if you're in the market for a car that doesn't run on splodey-juice. Find out if \"the electric car for everyone\" is the best electric car for you  in MrMobile's Chevy Bolt EV review!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Chevy Bolt EV:    [ABOUT THE CHEVY BOLT REVIEW]  MrMobile's Chevy Bolt EV Review was produced following six days with a Chevy Bolt LT and a Chevy Bolt Premier on loan from Chevrolet. DISCLOSURE: The Provincetown test drive mentioned in the video included a hotel stay and meals provided by Chevrolet. No other promotional consideration or compensation was provided for this review.   [LINKS]  \"Mapping How The U.S. Generates Its Electricity\" [Washington Post]:   \"A Simple Guide To DC Fast Charging\" [fleetcarma]:   \"Federal Tax Credits For All-Electric Vehicles\" [fueleconomy.gov]:   \"Chevy Bolt EV Is Already Being Discounted\" [electrek]:    [MUSIC]  Home Organ by Zach Nicita, available at Premium Beat:   No Major Delays by Julian Bell, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/2ku",
        "https://www.washingtonpost.com/graphics/national/power-plants/?utm_term=.f9ed4d218f4b",
        "http://www.fleetcarma.com/dc-fast-charging-guide/",
        "https://www.fueleconomy.gov/feg/taxevb.shtml",
        "https://electrek.co/2017/03/20/chevy-bolt-ev-discounts/",
        "https://www.premiumbeat.com/royalty_free_music/songs/home-organ",
        "https://www.premiumbeat.com/royalty_free_music/songs/no-major-delays",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] I maybe a smartphone super nerd but like most of you I'm not an auto expert. When it comes to cars, I'm just a normal guy. And the Chevy Bolt EV is the firs all-electric car that feels like it was made for the average person. I've spent six days driving it. And this is the Mr. Mobile review. (rhythmic music) If you've subscribed to Mr. Mobile on YouTube you've probably already seen the broad-strokes on the Bolt EV in my test-drive video from a while back and if you haven't seen that please subscribe to Mr. Mobile on YouTube, so you don't miss another one. I came away from that test-drive hopeful but skeptical about just how far I could take the Bolt EV on a single charge. This so called range anxiety is the number one concern among would-be electric car buyers which makes sense. You can't fuel up an EV in five minutes like you can with a gas-powered car so you want one with enough range to get you where you're going without spending hours at the charger. To test this GM took some of us press folk on an overnighter from Boston to Provincetown Mass a one-way drive of about 120 miles. This being New England in the springtime the weather was a rainy 48 degrees on the way down, about 65 and sunny on the drive back the next day and later in my review week, the temperature climbed past 90 for the first real taste of summer. What does this have to do with the Bolt's range? Well actually climate control is one of the more energy sucking features in an electric car, so to try to maximize my range for the coldest leg of the trip I kept the cabin heat off relying on the seat warmers and heated steering wheel to keep me comfy instead. Maybe you can guess the result. My butt and hands were warm but my feet were freezing and in any case the constantly fogging windows made defrost a must. So for the rest of the week I decided look I'll just drive the Bolt like any other car using heat and A/C when I want. That's how I figure most people want to drive anyway and what I found was that in New England you can totally get away with that. Pull up a map of EV charging stations on an app like PlugShare and you'll find that Massachusetts has almost as many car chargers as Sox Fans so while I made the 120 mile trip to P-town with an estimated 64 miles left in the battery according to the confidence gauge I had plenty of options for a quick top-up on the way down including a handful of DC quick charge locations that promise 90 miles of power in a half hour. Much more common in my Boston usage though were the level two charging stations that offer about 25 miles per charging hour. Going back to those range numbers for a sec my 120 mile trip to P-town plus an estimated 64 miles remaining equals 184 well short of the EPA estimated 238 mile range for the Bolt but keep in mind a couple things. This was my first trip with the car so the gauge wasn't yet calibrated to my driving style and that style was a lot more aggressive than normal as I put the bolt through its paces. Honestly with as much power as this car gives you it's hard not to push it to the limit which by the way is a software-defined ceiling of 93 miles per hour. Mash the accelerator and the 200 horsepower front wheel drive kicks you from zero to 60 in 6.8 seconds. You want to grip the steering wheel a little tighter if you do that. There's a bit more wobble in the wheels when you really floor it but that kind of zip comes in handy for merging passing and quick turns near blind corners. Of course you use a lot of power driving this way so to reclaim some of it the Bolt uses regenerative braking. Drop the gear shifter from D into L and you enter a mode called one pedal driving which is exactly what it sounds like. Rather than using the brake pedal to slow down you just let up on the accelerator. In this mode the drive motor actually changes roles and becomes a generator momentarily slowing the car as it converts some of its kinetic energy into potential energy which is then diverted into the car's 60 kilowatt hour battery. There's also a steering wheel pedal to manually toggle regen if you prefer to stick to to two pedal driving but I've been driving that way for about 20 years and even so it only took me about a day to get used to one pedal driving. Oh and yes the brake lights do go on in this mode. They're triggered when you're deceleration rate crosses a certain negative G threshold. The Bolt's performance was about the same across the two trim levels I drove. The LT and Premier have the same power plant but while I found the LT serviceable with its fabric seating and no frills design I have to admit I was happy to switch into the Premier with its roof rails, leather interior, and accent lighting. Still you won't find other high-end amenities like power seats or a sunroof. Chevy says these were omitted to save weight giving you the freedom to ferry more stuff around. The 17 cubic feet of cargo space with all seats occupied expands to nearly 57 cubic feet. If you fold down the seats and factor in the basement space under the available false floor. And while we're talking available options, I should note that my Premier model also included both driver confidence packages. Those bells and whistles include forward and aft proximity warnings, side mirror danger lights, that warn you when someone's in your blind spot and that surround vision feature that combines images from four cameras into a bird's-eye view of your car. All this stuff together makes the Bolt EV a lot easier than most cars to drive especially in the city. One thing missing, a built in NAV system but I didn't miss it at all. Chevy figures you'd rather plug in your smartphone and use Apple Carplay or Android Auto and in my case Chevy is right. Finally GM's OnStar service is here and the onboard LTE hotspot kicks out Wi-Fi for up to seven devices at a time. The data is unlimited and costs a very reasonable twenty bucks a month if you want it. Are there still little hinky things about the Bolt EV? Naturally. Personally I find the design pretty ugly. I wish it was sleeker both for looks and a better drag coefficient. Also I think features like high-speed charging and the requisite adapters should come standard in all models, if GM really wants EVs to take off and well that's something of an open question as much as I like some of the company's cars, its history with electric vehicles is spotty. You've got to do your homework when shopping for an electric car. If you're buying it to save on gas make sure your electricity rates are competitive and see how robust the charging network is where you live and work. If you're buying it to curb your emissions research how much of your state's energy comes from renewable resources and be sure to factor in the various incentives if you buy electric. Depending on options the Bolt EV runs from 37.5 all the way past 45K but federal and state incentives can take that down quite a bit as can the various dealer discounts being reported as this video goes live. Apparently it's not moving as quickly as Chevy hopes but that might change when national availability kicks off later this summer. Of course that's also when Tesla Model III deliveries are slated to begin but one thing I'm pretty sure about for now is that if you know you want an electric vehicle right now it's tough to find a better mix of range, power, and utility than the Chevy Bolt EV. It's only been a day since I gave it back but I miss it already. The Chevy Volt sounds a lot like the Bolt but oh what a difference a letter can make. Check out my Volt review from last year at the Mr. Mobile on YouTube and please once again subscribe so you don't miss more a mobile tech video landing every week. Until next time thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "Bolt",
        "car",
        "Chevy Bolt",
        "Chevy",
        "smartphone super nerd",
        "electric car",
        "Mobile",
        "range",
        "super nerd",
        "drive",
        "miles",
        "driving",
        "Bolt range",
        "power",
        "pedal driving",
        "electric",
        "cars",
        "pedal",
        "mile trip",
        "charging"
    ],
    "transcript_entity_values": [
        "Apple Carplay",
        "the week",
        "an estimated 64 miles",
        "EPA",
        "Bolt",
        "Provincetown Mass",
        "LTE",
        "Android Auto",
        "sec",
        "six days",
        "6.8 seconds",
        "GM",
        "184",
        "Tesla Model III",
        "Wi-Fi",
        "summer",
        "Volt",
        "90 miles",
        "about 20 years",
        "Bolt",
        "the Bolt EV",
        "48 degrees",
        "every week",
        "hours",
        "about 25 miles",
        "last year",
        "YouTube",
        "the next day",
        "60",
        "EV",
        "four",
        "the Chevy Bolt EV",
        "about 120 miles",
        "DC",
        "200",
        "Mobile",
        "the Bolt EV",
        "Massachusetts",
        "Sox Fans",
        "60 kilowatt hour",
        "Bolt EV",
        "nearly 57 cubic feet",
        "37.5",
        "Boston",
        "93 miles per hour",
        "first",
        "17 cubic feet",
        "One",
        "two",
        "Chevy",
        "120 mile",
        "past 90",
        "five minutes",
        "zero",
        "about a day",
        "NAV",
        "about 65",
        "twenty bucks",
        "OnStar",
        "238 mile",
        "PlugShare",
        "New England",
        "45",
        "later this summer",
        "seven",
        "one",
        "a half hour"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "FAC",
        "QUANTITY",
        "DATE",
        "TIME",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "LOC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME"
    ],
    "vector": [
        -0.0714576318860054,
        0.029489731416106224,
        0.018983066082000732,
        0.019279850646853447,
        0.028906984254717827,
        0.007751056458801031,
        -0.06486765295267105,
        0.06495089828968048,
        0.004936019890010357,
        0.0013070241548120975,
        -0.03972787782549858,
        0.06222742795944214,
        0.010596155188977718,
        -0.03788447007536888,
        -0.02714749425649643,
        0.009087950922548771,
        0.09824574738740921,
        -0.031794749200344086,
        0.015423380769789219,
        0.024754125624895096,
        -0.016674578189849854,
        -0.04901494085788727,
        0.050309356302022934,
        -0.035812050104141235,
        0.064079649746418,
        0.020982764661312103,
        -0.05052895098924637,
        0.06137781962752342,
        -0.04278256744146347,
        -0.026564281433820724,
        -0.02666614018380642,
        -0.0830356776714325,
        0.042136311531066895,
        -0.042024433612823486,
        0.009780441410839558,
        -0.0001654277293710038,
        -0.024150554090738297,
        -0.016406718641519547,
        -0.01801518350839615,
        0.006151797715574503,
        -0.025949738919734955,
        -0.060537468641996384,
        -0.009390129707753658,
        -0.048886798322200775,
        0.03896358236670494,
        -0.024138810113072395,
        0.02976984716951847,
        -0.038573890924453735,
        0.0008179268916137516,
        -0.09600326418876648,
        -0.025611383840441704,
        -0.050998833030462265,
        0.008099986240267754,
        -0.03362897410988808,
        -0.0666196420788765,
        0.04002196341753006,
        -0.05018911138176918,
        -0.04754917323589325,
        -0.006836030166596174,
        0.014433429576456547,
        -0.011384132318198681,
        -0.009465263225138187,
        0.0049587758257985115,
        -0.0264742374420166,
        -0.04225904494524002,
        -0.052436601370573044,
        0.009593849070370197,
        -0.037585701793432236,
        -0.024501902982592583,
        0.028820155188441277,
        0.03245701268315315,
        0.027892248705029488,
        -0.015818363055586815,
        0.056530602276325226,
        -0.06238829344511032,
        0.03039533831179142,
        0.13900646567344666,
        -0.05620868504047394,
        -0.01160458568483591,
        0.009443976916372776,
        0.02051469124853611,
        0.04583822190761566,
        -0.0823754221200943,
        -0.02755635604262352,
        0.022087089717388153,
        -0.00667194789275527,
        -0.004227267578244209,
        0.0184389129281044,
        -0.06234411522746086,
        0.1034775823354721,
        0.02887984737753868,
        0.054198771715164185,
        -0.027586180716753006,
        0.025571681559085846,
        -0.009883574210107327,
        0.11018884927034378,
        -0.008683772757649422,
        -0.05685313791036606,
        0.030463123694062233,
        -0.04801218584179878,
        0.023125920444726944,
        0.04042453318834305,
        0.03298990800976753,
        -0.06964856386184692,
        -0.01819031313061714,
        -0.018907316029071808,
        -0.0027170339599251747,
        0.04901771992444992,
        0.04240431636571884,
        0.003654747037217021,
        0.026638003066182137,
        -0.039494629949331284,
        -0.07822703570127487,
        0.005507219582796097,
        -0.1257314682006836,
        -0.002342484425753355,
        -0.05588291957974434,
        0.01074143871665001,
        0.12939830124378204,
        0.14707493782043457,
        0.010702344588935375,
        -0.03206489235162735,
        0.0581289567053318,
        0.04898971691727638,
        0.01033029519021511,
        -0.018906982615590096,
        0.06806773692369461,
        1.1775361294083681e-33,
        -0.12869177758693695,
        -0.015519639477133751,
        0.016566596925258636,
        -0.03622999042272568,
        -0.0046219793148338795,
        0.07278899848461151,
        0.0017635369440540671,
        0.034388184547424316,
        -0.04964052140712738,
        0.056751325726509094,
        -0.04734432324767113,
        -0.006612276658415794,
        0.05475139990448952,
        0.0086241839453578,
        -0.008470414206385612,
        -0.015714403241872787,
        -0.09844200313091278,
        -0.08660527318716049,
        -0.06589539349079132,
        -0.016665153205394745,
        0.012862689793109894,
        -0.03438978269696236,
        0.062091682106256485,
        0.03530251607298851,
        0.06573096662759781,
        -0.07807452976703644,
        0.06109938025474548,
        -0.0663323849439621,
        0.012540937401354313,
        0.04723922163248062,
        -0.07168294489383698,
        0.043396662920713425,
        0.0014338423497974873,
        -0.011624597012996674,
        -0.030063262209296227,
        -0.059201013296842575,
        -0.016787482425570488,
        -0.06294769793748856,
        -0.03259262070059776,
        0.039694178849458694,
        0.01409242581576109,
        -0.011566763743758202,
        -0.0772147923707962,
        -0.03509468212723732,
        0.029453128576278687,
        0.04190807044506073,
        0.06583309918642044,
        0.021532027050852776,
        -0.023792626336216927,
        0.017998812720179558,
        0.006289977580308914,
        0.0324089415371418,
        0.025356337428092957,
        0.018920404836535454,
        -0.03922361880540848,
        0.033543556928634644,
        0.011950621381402016,
        0.041886989027261734,
        0.04397236183285713,
        0.04107530787587166,
        -0.10931859165430069,
        0.10222607105970383,
        0.015439821407198906,
        -0.06089199334383011,
        -0.020010054111480713,
        0.04260392114520073,
        -0.0044480315409600735,
        0.01936955749988556,
        -0.022958287969231606,
        0.03277694061398506,
        0.08704157173633575,
        -0.15144218504428864,
        -0.040978047996759415,
        0.019102152436971664,
        0.031895462423563004,
        -0.008802752010524273,
        -0.026291081681847572,
        0.09135011583566666,
        0.04021383076906204,
        -0.048287466168403625,
        -0.047141365706920624,
        0.04984477534890175,
        0.037113457918167114,
        -0.001400731853209436,
        0.08540114015340805,
        0.03394569084048271,
        -0.06054026260972023,
        -0.006793182343244553,
        0.01904722861945629,
        0.043975070118904114,
        0.0815218836069107,
        0.012212641537189484,
        -0.03510470688343048,
        0.012927888892591,
        0.018618520349264145,
        -3.545097740196103e-33,
        0.03612053766846657,
        0.029912617057561874,
        0.006109197624027729,
        0.08651103079319,
        0.032617032527923584,
        -0.013174246996641159,
        -0.07319826632738113,
        0.02033901959657669,
        0.0053833117708563805,
        0.042943451553583145,
        -0.011440188623964787,
        0.013119849376380444,
        -0.005804114509373903,
        -0.0018334724009037018,
        0.07555150985717773,
        0.004014675971120596,
        -0.006140196695923805,
        -0.08581461757421494,
        0.04176792874932289,
        0.062324125319719315,
        0.06685744225978851,
        0.06608154624700546,
        0.03879686817526817,
        0.0357079952955246,
        0.0594351664185524,
        -0.011334036476910114,
        -0.020368454977869987,
        0.04827750101685524,
        0.023331573233008385,
        0.0004699344572145492,
        -0.0561237707734108,
        0.0803816169500351,
        0.015504802577197552,
        -0.011126803234219551,
        -0.00513367960229516,
        -0.0015148670645430684,
        0.007885651662945747,
        -0.01215277798473835,
        0.06356845051050186,
        0.06385411322116852,
        0.07703712582588196,
        -0.026574140414595604,
        0.043835196644067764,
        -0.023836974054574966,
        0.023718243464827538,
        0.011542118154466152,
        -0.022786078974604607,
        -0.034376662224531174,
        0.06891476362943649,
        0.07885180413722992,
        -0.00888584740459919,
        -0.021980373188853264,
        -0.02961510419845581,
        0.06450599431991577,
        -0.030969170853495598,
        -0.1722104251384735,
        0.01172283198684454,
        0.02254202589392662,
        -0.0414469875395298,
        0.014158309437334538,
        0.058545585721731186,
        0.03428254649043083,
        0.025642167776823044,
        -0.010103809647262096,
        -0.03602560609579086,
        -0.07592900097370148,
        0.043638452887535095,
        -0.033774882555007935,
        -0.020330840721726418,
        -0.08503685891628265,
        -0.08120031654834747,
        -0.03858962655067444,
        -0.02649148926138878,
        -0.08893615752458572,
        -0.1017051637172699,
        0.0738447830080986,
        0.060806307941675186,
        -0.04507835581898689,
        0.05149209126830101,
        -0.0970943495631218,
        0.028768083080649376,
        0.06892859935760498,
        0.026279348880052567,
        -0.05232113227248192,
        0.0158457700163126,
        0.011352247558534145,
        -0.08577755838632584,
        0.05155954882502556,
        -0.010832061991095543,
        0.10719960927963257,
        0.03190722316503525,
        -0.017598342150449753,
        -0.0072504328563809395,
        0.0011797876795753837,
        -0.0762317106127739,
        -5.426471361147378e-08,
        0.07350082695484161,
        0.08393663167953491,
        0.0761939138174057,
        0.017478076741099358,
        0.09712791442871094,
        0.008898237720131874,
        -0.04181881621479988,
        0.020536869764328003,
        0.04401182755827904,
        0.04796944186091423,
        0.0813620463013649,
        -0.06257124245166779,
        0.03135494142770767,
        0.015483167953789234,
        -0.06853269040584564,
        -0.019701644778251648,
        -0.029805097728967667,
        0.01050327904522419,
        -0.009550763294100761,
        0.03828749433159828,
        -0.026119135320186615,
        0.013146121054887772,
        -0.07731329649686813,
        0.017166947945952415,
        0.07890049368143082,
        -0.05818704143166542,
        -0.027779143303632736,
        -0.0647071823477745,
        0.061866894364356995,
        -0.09605225175619125,
        -0.09950569272041321,
        -0.004001430235803127,
        0.07098093628883362,
        0.02375895343720913,
        -0.03210301324725151,
        -0.06126849353313446,
        -0.024799402803182602,
        -0.03308844938874245,
        -0.0031229378655552864,
        -0.12100857496261597,
        0.08698383718729019,
        -0.11276309192180634,
        0.01076501328498125,
        -0.08147310465574265,
        -0.12731201946735382,
        -0.0005919429240748286,
        -0.10880552232265472,
        -0.07532204687595367,
        -0.025417566299438477,
        0.08156992495059967,
        -0.027163248509168625,
        -0.08018830418586731,
        -0.004671871662139893,
        0.013546311296522617,
        0.05520614981651306,
        -0.023936377838253975,
        -0.0624721422791481,
        -0.0159625094383955,
        -0.02965734526515007,
        -0.08510550856590271,
        0.0430830679833889,
        -0.08633699268102646,
        -0.02018091268837452,
        0.06692388653755188
    ]
}