{
    "id": "v_d_O7IufBA",
    "title": "DTEK50 Teardown - Cute Charging Port - BlackBerry Screen replacement",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-01-18T14:00:30Z",
    "video_url": "https://www.youtube.com/watch?v=v_d_O7IufBA",
    "category": "Howto & Style",
    "tags": [
        "dtek 50 repair",
        "dtek 50",
        "blackberry",
        "smartphone",
        "android",
        "tech",
        "screen replacement dtek 50",
        "charging port fix",
        "repair",
        "how to fix dtek 50"
    ],
    "views": 263651,
    "likes": 5181,
    "comments_count": 1004,
    "description": "Current Price for the DTEK50:  Metal phone opening tool:  Let me know if that link stops working!!  Awesome Smart Phone Tool Kit:  Green Pry tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2iGucxw",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2iZ67Ty",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The DTEK50. Its time to take apart the pretty inexpensive budget phone from Blackberry. Besides the plastic earpieces, it did pretty darn well in my durability test video. So lets see what it looks like on the inside. [Intro] The back of the phone, thankfully, is very easy to remove. A gentle nudge from my thin metal pry tool allows the whole back to just pull off. If you want one of these thin metal pry tools I will link them in the video description. The back is held down my some simple adhesive and some clasps. Its light weight enough that it will never come off on its own though. On the back of the back cover you also have the NFC pad. NFC stands for near field communication. Just like the name states, it allows for your phone to communicate with other devices that are very close to it. Because of this communication, the pad needs to have protection from other electronic noise or interference from the internals circuits of the phone. And thats what this huge black rectangle of metallic tape is for; its not to hold the battery in place, its there to shield the NFC pad. It does tear pretty easy though so when you try to remove it, keep it intact as much as possible. Now for the internals. There are 5 screws down at the bottom of the phone and then the plastic shield comes up and away. Attached to that shield we get the loud speaker and the two little golden contact pads that you see let it receive the signal from the motherboard. There are 3 screws holding down the metal plate over the battery, which technically I should have removed and unplugged first. The phone is probably still fine; its just a safety thing. Always unplug or remove the battery from electronics before diving in. Ill set that silver cover off to the side and then unsnap the battery and the charging port ribbons. They are connected just like little Legos. The charging port ribbon is pretty much the smallest charging port in the history of charging ports. Ive never seen one this small on any other phone. I would even classify it as a cute little charging port. It is micro USB which is currently being phased out on all of the newer cell phones now in favor of USBC. And the little metal circular thing you see on the side is the vibration motor for the phone. Thumbs up for how cute and easy that was to remove. The 2,610 milliamp hour battery is held down by some of those same magical pull tabs we found on the iPhone. Just gently pull those little pull tabs out from underneath the battery and they will stretch and release. There is one pull tab on the bottom of the battery and two pull tabs at the top of the battery; three total. Both of my top pull tabs broke halfway through so I did have to initiate the Pry of Shame. Heat does help with this pry. You dont want to bend the battery too much since, you know, explosions and fire and all of that stuff. There is one more metal plate held down by two screws. This one pulls away and then we can unplug the little snap on the side and the screen ribbon cable connector. There are two more little Lego snaps along the side of the motherboard as well, at the top and the bottom. And then we have 4 more screws holding down the top black plastic piece at the top of the phone. Once that is off we can see the earpiece with its two little golden contact points on the underside. These just rest up against the motherboard to receive the signal. To remove the motherboard Im going to unclip the big ribbon cable and then the black signal wire as well. And then the motherboard will just lift up and away from the phone if you are smart enough to remove the SIM card tray. I swear I dont forget these things on purpose, I just dont remember that it exists with like every single tear down that I do. Ill remember on the next onehopefully. One cool thing about the motherboard is the LED flash is built in; thats kind of fun. The small 8 megapixel camera is still attached to the motherboard as well. And now that the motherboard is out of the frame we can see what these little side ribbons do. The bottom one is for the front capacitive buttons. The middle one is for that programmable convenience button on the side of the phone. And the top ribbon is for the volume rocker. The 13 megapixel camera is still sitting inside of the phone frame. This plugs into the back of the motherboard which Ill show you in just a second. All of the other components like the front sensors and the all-important headphone jack are attached to this ribbon cable here. Now if you want to replace the screen, it is very much attached to the frame. Kind of similar to how the recent Samsung Galaxy phones are. So only attempt removing your screen if it is already broken because it will not survive the removal process. It will require a lot of heat from a blow dryer or hair gun to soften the adhesive as you remove it. Replacement parts to this phone are actually pretty hard to find. Blackberry doesnt sell a whole lot but Ill link the parts that I do find down in the video description as soon as they become available. If you find any that I dont have linked, let me know in the comments and Ill add them as soon as I can. Remember that rear camera? This time Ill be plugging it into the motherboard before setting it down into place. Just line up the little plug with its counterpart on the motherboard and it will snap in like a little Lego. Make sure everything is out from underneath the motherboard before setting it down into place and then clip in all of the ribbon cables. There are those 3 tiny ones along that left side. The screen ribbon in the center and the top sensors need to be plugged in as well before that top black plastic shield goes down over the top of them. And theres always that black signal wire that gets clipped in as well. The built in flash is actually dual color which does help with the image quality when taking pictures while using the flash. The cute little charging port gets tucked into the little slot at the bottom of the phone along with the circular vibrating motor. And remember that the battery gets tucked underneath the charging port ribbon cable. You dont want to be pinching things that shouldnt be pinched. The bottom plastic gets pushed down over the charging port and the two metal plates protecting their ribbon connectors get set back into place as well. The metal plates are important. These are so that the connections dont pop loose if you ever drop your phone, which does tend to happen with almost everybody. And we can screw back in all of the screws. It is important to keep these organized during the repair process since there are so many of them. Quick note on the camera lens... We did discover it is made out of glass in our last durability video, and it just rests inside of the black plastic back. If I find any replacement lenses I will link them in the video description. So if yours breaks you can replace it. And that is it. Everything should snap into place relatively easily. If you have to apply too much force, something isnt where it needs to be and you should recheck all of your connections. Let me know if you have any questions down in the comments. Let me know what phone you want to see torn down next. I do read all of the comments and the phones I see suggested most often will definitely get the Jerry Rig treatment. Thanks for watching. Ill see you around.",
    "transcript_keywords": [
        "phone",
        "motherboard",
        "charging port",
        "battery",
        "ribbon",
        "back",
        "top",
        "Ill",
        "charging",
        "charging port ribbon",
        "pull",
        "port",
        "metal",
        "remove",
        "side",
        "ribbon cable",
        "pull tabs",
        "bottom",
        "black",
        "plastic"
    ],
    "transcript_entity_values": [
        "2,610 milliamp hour",
        "USBC",
        "iPhone",
        "8 megapixel",
        "Blackberry",
        "Lego",
        "two",
        "Samsung Galaxy",
        "jack",
        "three",
        "Legos",
        "4",
        "SIM",
        "5",
        "NFC",
        "the Jerry Rig",
        "first",
        "second",
        "13 megapixel",
        "3",
        "One",
        "USB",
        "one"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.19884835183620453,
        0.09117570519447327,
        0.07108093053102493,
        -0.08345461636781693,
        -0.018427666276693344,
        -0.04660188779234886,
        0.09851520508527756,
        0.07807527482509613,
        -0.049615874886512756,
        0.05799288675189018,
        0.08387455344200134,
        -0.006100563332438469,
        0.009917891584336758,
        0.02547013945877552,
        -0.020377371460199356,
        -0.025673391297459602,
        0.044180408120155334,
        -0.025164037942886353,
        -0.074442557990551,
        0.05321088433265686,
        0.03298023343086243,
        0.004293469246476889,
        0.03956693410873413,
        -0.02750309742987156,
        -0.06352747976779938,
        0.04388244450092316,
        0.016572268679738045,
        0.04800790548324585,
        -0.04197295382618904,
        -0.09114931523799896,
        -0.03385739400982857,
        -0.013403818011283875,
        -0.07611333578824997,
        0.010074461810290813,
        0.020067313686013222,
        -0.009665506891906261,
        -0.03295360878109932,
        -0.017400402575731277,
        -0.08423803746700287,
        -0.02776629664003849,
        -0.03769659623503685,
        -0.06536353379487991,
        -0.009858816862106323,
        -0.01315166987478733,
        -0.017183518037199974,
        0.01374722458422184,
        0.07057148218154907,
        -0.11945008486509323,
        0.0035217604599893093,
        -0.012222982943058014,
        -0.05023489519953728,
        0.05426562577486038,
        0.06268728524446487,
        0.03510599210858345,
        -0.03703349083662033,
        -0.044532742351293564,
        0.025196490809321404,
        0.016690529882907867,
        0.019456615671515465,
        0.04441756755113602,
        0.07332836836576462,
        0.01972321979701519,
        -0.026410309597849846,
        0.04704875871539116,
        0.019581403583288193,
        0.031108325347304344,
        0.03877650573849678,
        -0.07863844931125641,
        -0.006575325038284063,
        0.004031765274703503,
        -0.05372411385178566,
        -0.057342760264873505,
        -0.06626077741384506,
        0.025443214923143387,
        -0.01539210882037878,
        0.02903609350323677,
        0.00815619621425867,
        -0.0520656555891037,
        -0.024289090186357498,
        -0.04596327245235443,
        0.04673750326037407,
        -0.007769284304231405,
        -0.0076172444969415665,
        -0.002790560480207205,
        -0.016068678349256516,
        0.09030915796756744,
        -0.004641139414161444,
        0.04279568791389465,
        -0.001767383306287229,
        -0.00018420623382553458,
        0.015212000347673893,
        0.03954562172293663,
        0.011063065379858017,
        0.04675469547510147,
        0.035477153956890106,
        -0.046437859535217285,
        -0.0700049102306366,
        -0.07600555568933487,
        -0.06602524220943451,
        0.057533882558345795,
        0.006856515537947416,
        -0.0006114913267083466,
        0.03920232132077217,
        -0.07047312706708908,
        -0.010771550238132477,
        -0.050800736993551254,
        -0.08505576848983765,
        -0.06073186174035072,
        -0.025505119934678078,
        0.02064700424671173,
        0.02078607864677906,
        0.06850691884756088,
        -0.05842987447977066,
        -0.02135455422103405,
        0.04242940619587898,
        -0.03597841411828995,
        -0.10519374907016754,
        0.043731264770030975,
        0.07259956747293472,
        -0.045412689447402954,
        0.04274844750761986,
        0.007516856770962477,
        -0.03112427145242691,
        -0.0007162942783907056,
        0.016525540500879288,
        -0.020504552870988846,
        0.024729209020733833,
        4.22988307629358e-33,
        0.06560977548360825,
        0.054162658751010895,
        -0.033990584313869476,
        -0.033039238303899765,
        -0.047518547624349594,
        0.03682839497923851,
        0.027138568460941315,
        0.07351352274417877,
        0.025304950773715973,
        0.08404358476400375,
        -0.0013312387745827436,
        0.03376264497637749,
        -0.04952722787857056,
        -0.08202703297138214,
        0.00779958488419652,
        0.01725991629064083,
        -0.007218797691166401,
        0.015092053450644016,
        -0.0687885582447052,
        0.01954248733818531,
        -0.027130920439958572,
        -0.056106310337781906,
        -0.017166217789053917,
        0.07183343917131424,
        0.037878189235925674,
        0.06531565636396408,
        -0.017417792230844498,
        -0.0006755872745998204,
        0.04307890310883522,
        0.04168526828289032,
        -0.11778504401445389,
        -0.002751401625573635,
        0.06597014516592026,
        0.030764594674110413,
        -0.01828634925186634,
        0.036762624979019165,
        -0.057609811425209045,
        -0.06713693588972092,
        -0.07247545570135117,
        -0.04661683738231659,
        -0.05061015114188194,
        -0.02636115998029709,
        -0.023102356120944023,
        0.015794778242707253,
        0.02421504631638527,
        -0.07006983458995819,
        -0.008679205551743507,
        0.022411374375224113,
        -0.09747295826673508,
        -0.014379196800291538,
        -0.07488976418972015,
        -0.04489397257566452,
        0.08405730873346329,
        -0.017080890014767647,
        -0.10317475348711014,
        0.013782970607280731,
        0.009595310315489769,
        -0.020327502861618996,
        0.04886312782764435,
        0.05615234375,
        0.010842708870768547,
        0.05563924089074135,
        0.006196989677846432,
        0.040043286979198456,
        -0.02053084410727024,
        -0.03283718228340149,
        0.05885870382189751,
        0.032962482422590256,
        -0.07065603137016296,
        -0.016765005886554718,
        -0.05434698984026909,
        -0.005576061550527811,
        0.029376542195677757,
        -0.050785742700099945,
        -0.035154953598976135,
        0.028305405750870705,
        -0.01555529236793518,
        -0.008271182887256145,
        0.03597153723239899,
        -0.06229753792285919,
        0.002132564317435026,
        -0.07084875553846359,
        0.06862295418977737,
        -0.04115927964448929,
        0.014553315937519073,
        -0.018528934568166733,
        -0.010016858577728271,
        -0.10089340060949326,
        -0.0033359790686517954,
        0.05668722838163376,
        -0.05921350419521332,
        -0.016923177987337112,
        -0.08533588796854019,
        0.0267306100577116,
        0.031227828934788704,
        -6.887765067605038e-33,
        -0.0017503584967926145,
        0.003971353638917208,
        -0.013017475605010986,
        0.021382484585046768,
        0.05988934263586998,
        -0.04579293727874756,
        0.019612818956375122,
        0.014966411516070366,
        0.039520345628261566,
        -0.06270061433315277,
        -0.018835442140698433,
        -0.005048700608313084,
        -0.08050113171339035,
        -0.11429658532142639,
        0.05392440780997276,
        -0.013294789008796215,
        -0.06395061314105988,
        -0.04827398061752319,
        -0.04770059138536453,
        0.010808718390762806,
        0.039288971573114395,
        0.06520943343639374,
        0.041003476828336716,
        0.08959342539310455,
        -0.018324241042137146,
        0.02516002394258976,
        -0.03542209789156914,
        -0.020829860121011734,
        0.024247244000434875,
        0.04326470196247101,
        0.06065204739570618,
        -0.06045699864625931,
        -0.0020721927285194397,
        0.11472650617361069,
        -0.021293746307492256,
        0.004907980561256409,
        0.12462520599365234,
        0.03050699457526207,
        0.022685537114739418,
        -0.11395745724439621,
        0.054924435913562775,
        0.09274327009916306,
        0.007768980693072081,
        0.059225037693977356,
        -0.056056827306747437,
        -0.09270177781581879,
        -0.06148285046219826,
        -0.09332948923110962,
        -0.013040922582149506,
        0.002689891494810581,
        0.00727732852101326,
        0.02118717133998871,
        0.009950333274900913,
        0.03771505132317543,
        -0.0595829114317894,
        0.056685373187065125,
        0.09278926998376846,
        -0.06195855885744095,
        -0.050215259194374084,
        0.020767534151673317,
        0.08423737436532974,
        0.017744969576597214,
        -0.02528657577931881,
        0.06493537127971649,
        0.04129564017057419,
        -0.017803648486733437,
        0.07679114490747452,
        0.05770982801914215,
        0.03169146925210953,
        -0.005894261412322521,
        0.0837014839053154,
        0.015986528247594833,
        0.05700536072254181,
        -0.15983636677265167,
        0.02305818535387516,
        0.0013544622343033552,
        -0.09542714804410934,
        -0.05276446416974068,
        -0.06122852861881256,
        -0.024040717631578445,
        0.08988877385854721,
        -0.04102102294564247,
        0.02444574423134327,
        0.05867060273885727,
        -0.007210834883153439,
        -0.046093057841062546,
        0.03955820947885513,
        0.061605796217918396,
        -0.03135480359196663,
        -0.00953814759850502,
        -0.08618775010108948,
        0.019617775455117226,
        -0.07077372074127197,
        0.15663649141788483,
        -0.04112541303038597,
        -6.053557655150144e-08,
        -0.0083635738119483,
        0.09613260626792908,
        -0.0519716739654541,
        -0.019840069115161896,
        0.03385627269744873,
        -0.0356464646756649,
        0.004742767661809921,
        0.05912164971232414,
        9.095537097891793e-05,
        -0.03364281356334686,
        0.0292949341237545,
        -0.03663236275315285,
        0.0034623737446963787,
        0.139373317360878,
        -0.0011950156185775995,
        -0.008681745268404484,
        -0.02920854464173317,
        0.0630737915635109,
        -0.046726878732442856,
        0.004685449879616499,
        0.00943883415311575,
        -0.027744507417082787,
        0.09144936501979828,
        -0.014197061769664288,
        -0.043871112167835236,
        0.027561621740460396,
        -0.08109551668167114,
        0.05063292756676674,
        0.06361356377601624,
        0.04300931096076965,
        -0.09090707451105118,
        0.016225161030888557,
        0.00945607665926218,
        0.043231748044490814,
        -0.0034226689022034407,
        -0.007743326015770435,
        -0.004190544132143259,
        -0.038584720343351364,
        -0.023184029385447502,
        0.05336010083556175,
        -0.018543783575296402,
        -0.086479552090168,
        0.0024345265701413155,
        0.0848957747220993,
        -0.01678338274359703,
        -0.07306697219610214,
        0.006743833888322115,
        -0.0692237988114357,
        -0.016068657860159874,
        0.05723358690738678,
        -0.04836545139551163,
        0.0469186045229435,
        -0.0807332992553711,
        0.0057325647212564945,
        -0.004669825546443462,
        0.038854047656059265,
        0.0392189584672451,
        0.03998742252588272,
        -0.023560060188174248,
        -0.022275108844041824,
        -0.017520712688565254,
        -0.05881877988576889,
        0.07117729634046555,
        0.01326361857354641
    ]
}