{
    "id": "VAlliyFZtXc",
    "title": "Google Stadia wants to be the Netflix of gaming",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-03-21T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=VAlliyFZtXc",
    "category": "Science & Technology",
    "tags": [
        "google gaming",
        "stadia",
        "gaming",
        "google",
        "google console",
        "stadia gaming",
        "google gaming console",
        "stadia google",
        "doom eternal",
        "gaming console",
        "gaming news",
        "video games",
        "streaming",
        "google video games",
        "google gdc",
        "video game",
        "google game console",
        "gdc",
        "gdc 2019",
        "game controller",
        "games",
        "nintendo",
        "nintendo switch",
        "2019",
        "event",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "mkbhd",
        "apple",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 643468,
    "likes": 13313,
    "comments_count": 1484,
    "description": "Google's Stadia cloud gaming platform will let you stream console and PC-quality titles across laptops, desktops, TVs, tablets, and phones. At launch, Google says it will support up to 4K at 60 fps, and it will work on any screen so long as you have a Chrome browser or Chromecast Ultra. Googles building the Netflix of video games and the company has the software and infrastructure to pull it off. But, there are still a lot of open questions.  Read more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2FpBCCS",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So now we are focused on our next big effort, which is to build a game platform for everyone. - Google, this week, announced a bold vision for the future of gaming. It's a cloud gaming platform called Stadia and it's the culmination of years of work the company has been doing around networking technology and streaming video. Essentially, Google wants to build the Netflix of video games. That way, you could play any game on any screen, any time you wanted, regardless of what physical hardware you have. You wouldn't even need a console or a PC. We've certainly heard this before. Maybe you remember OnLive or Gaikai, but Google says it has the infrastructure, the technology, and the resources to finally pull this off for real. Of course, Google isn't alone here. Every big tech and gaming company is trying to figure out this tech. But earlier this week, at GDC here in San Francisco, Google, one of the most powerful and cash-flush companies in the entire tech industry, made a convincing case that it'll get there first. - With Stadia, we can all dream bigger and together, build a playground for every imagination. Thank you. (audience clapping and yelling) - So how does Stadia work? Well, it's a simple concept that is notoriously difficult to pull off. Cloud gaming, unlike music streaming or television steaming, requires you run a game remotely in a data center. That's a huge shift and I talked to Phil Harrison, who now leads up the Stadia project at Google, about what it all means. - We just broke through that glass ceiling today by giving the entire data center to the game developer and being completely device agnostic. And so, no, we don't need a console and that's the whole point. - So you essentially have a PC on a server rack running a game in some data center somewhere and it's sending a video feed of that over the internet to your screen. Then you, as a player, are pressing buttons on a controller and sending that input back over the internet. And all of that is supposed to happen with no latency, no lag, at 1080p, 60 frames per second. That's pretty much unbelievable and historically, it hasn't really worked. - No, we can't beat the speed of light, but we can cheat it enough that we can deliver a very, very high performance experience. Hence the reason why we had id on our stage saying, Doom Eternal-- - Will be capable of running at true 4K resolution with HDR color at an unrelenting 60 frames per second. - Essentially, the company is making use of every critical part of its business to turn cloud gaming into a reality. The first piece is the Chrome browser, and by extension, the Chromecast dongle. That's going to be how Google gets the video from the game on the server in the data center all the way to your TV or whatever screen you're playing Stadia on. The second piece is the Android operating system. It's the most ubiquitous OS on the planet and it's going to be how Google gets Stadia running on mobile phones and tablets. The third piece is YouTube, and will enable all sorts of futuristic features that will be huge selling points when the service launches. The first feature will let you launch a game using Stadia with the press of a button just by watching a YouTube video or stream. You'll then be taken to that exact point in the game. Another feature will be, when you're watching a streamer live stream on YouTube, they can invite you into the game, so with the press of a button you can queue up and play with your favorite streamer. A third feature is an interesting one where you can use Google Assistant to even cheat. You can press the Google Assistant button if you're stuck on a particularly hard puzzle on, say, Tomb Raider or a game like that, and it'll overlay a YouTube video with a tutorial showing you how to beat that particular puzzle or solve that particular problem. The fourth piece is Google's cloud and its data centers. That's the backbone of the service and it's what's going to make it all work. And lastly, there is going to be a bit of hardware. Google built its own Stadia controller, one that actually connects over Wi-Fi to Google's data centers. That way, when you're switching devices from a tablet to a phone, from a phone to a laptop, from a laptop to a TV, you won't need to re-sync that controller to a new device every time. It'll just communicate over the internet with the Stadia servers and connect automatically. We saw most of these pieces work together last fall in a trial run of sorts called Project Stream and it did work quite well. It let players test the new Assassin's Creed Odyssey on any device with a Chrome browser, so long as they had a 25 Mbps internet connection. But it wasn't at anywhere near the scale Google is hoping for with Stadia when it's supposed to launch and that has me a bit uncertain and skeptical, and there's good reason to be. Cloud gaming has been the holy grail of the industry for decades and a number of companies have tried and failed to make it work. In this case, Google hasn't even talked about how much Stadia will cost or even if it's a subscription service. It could just be a way to play games you already own or games that you buy elsewhere in the cloud and on any screen. That's a really interesting concept, but it's not quite as ambitious as a full-blown, cloud-based game-streaming service. There's also a huge amount of technical uncertainty here. Sure, Google has state-of-the-art infrastructure and a data center operation that's one of the robust and biggest on the planet, but that doesn't necessarily mean it's going to be able to stream millions of instances of games at 1080p, 60 frames per second to people with internet connections that are varying wildly. And even then, even if you get all that technical stuff down, well, you're going to need games. Right now, the only launch title confirmed for Stadia is id Software's Doom Eternal. Now, id is saying Doom Eternal's going to be available on Stadia at 4K, 60 frames per second. That's very impressive, but Google is going to need more than one game to get people to use this service. With Stadia, Google is trying to change, not just how games are played, but how they're developed, how they're distributed, and how they're funded and sold. Netflix did this for TV and film, and changed Hollywood forever. Games could change similarly, but it's not going to happen overnight and it's not clear Google is going to be the one that wins. For instance, Microsoft has its own xCloud service. Sony also has its own competing service called PlayStation Now, and you can even subscribe to that today. Not only that, but Amazon, Verizon, Nintendo, and even EA, they're all working on cloud gaming right now. It's a race to the future and Google has come out of the gate harder and faster than any other company in the industry. But remember, it took years and years for Netflix and Spotify to change how we consume TV, film, and music, and even then, physical media still exists. By today's standards, it's going to take us a while to get to where we're going and gamers are notoriously stubborn when it comes to change, especially when the benefits aren't clearly obvious. But the promise of cloud gaming is there and with a company as big and powerful as Google in the mix, that could give it the push it really needs to happen. - One of the success factors for me with Stadia is that three years from now, you and I meet here at GDC or some other forum, and we're talking about a brand-new developer that none of us had heard of before who has built something so new that it's pivoted the world a little bit on its axis, then we would be considered successful.",
    "transcript_keywords": [
        "Google",
        "Stadia",
        "game",
        "cloud gaming",
        "Google Assistant",
        "games",
        "data center",
        "gaming",
        "Google data centers",
        "cloud",
        "data",
        "Doom Eternal",
        "service",
        "Google Assistant button",
        "video",
        "platform called Stadia",
        "work",
        "Google data",
        "center",
        "Google cloud"
    ],
    "transcript_entity_values": [
        "Stadia",
        "Android",
        "this week",
        "one",
        "third",
        "fourth",
        "Project Stream",
        "Chromecast",
        "millions",
        "today",
        "last fall",
        "Stadia",
        "Google",
        "Spotify",
        "60",
        "GDC",
        "25 Mbps",
        "Hollywood",
        "years",
        "Doom Eternal's",
        "Phil Harrison",
        "Gaikai",
        "1080p",
        "three years from now",
        "Amazon",
        "Nintendo",
        "Chrome",
        "4",
        "EA",
        "id Software's",
        "earlier this week",
        "PlayStation Now",
        "second",
        "Sony",
        "Doom Eternal",
        "Verizon",
        "Netflix",
        "YouTube",
        "decades",
        "Microsoft",
        "first",
        "Wi-Fi",
        "Doom Eternal-- -",
        "OnLive",
        "San Francisco",
        "more than one",
        "xCloud",
        "Tomb Raider",
        "Assassin's Creed Odyssey"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "GPE",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "LOC",
        "PERSON",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.016526345163583755,
        -0.09852424263954163,
        -0.003445639507845044,
        -0.1266956925392151,
        0.013645024970173836,
        0.005707752425223589,
        -0.042706575244665146,
        -0.061081111431121826,
        0.016455983743071556,
        0.05050867050886154,
        -0.04184490442276001,
        0.06088724732398987,
        -0.03553268313407898,
        -0.05631742253899574,
        0.04012388363480568,
        -0.013913909904658794,
        0.12279260158538818,
        -0.11148685961961746,
        -0.02297460474073887,
        -0.019989676773548126,
        -0.0030063840094953775,
        -0.07145673781633377,
        -0.00975450873374939,
        -0.07492348551750183,
        -0.021733352914452553,
        0.07006153464317322,
        -0.01033973041921854,
        -0.0519353449344635,
        -0.028203735128045082,
        -0.022550512105226517,
        0.021719375625252724,
        0.02525750733911991,
        0.01785101369023323,
        0.05429239571094513,
        -0.09637750685214996,
        -0.008700014092028141,
        -0.04659893736243248,
        -0.06449618935585022,
        -0.08493228256702423,
        0.013651273213326931,
        -0.02308354713022709,
        -0.10882144421339035,
        -0.021141989156603813,
        0.026051528751850128,
        0.008982673287391663,
        -0.020079467445611954,
        0.056086402386426926,
        -0.014962702058255672,
        0.03445034846663475,
        -0.04228837788105011,
        -0.02248074859380722,
        -0.08918491750955582,
        0.008484182879328728,
        -0.036876846104860306,
        -0.10211643576622009,
        0.043655432760715485,
        -0.07684320956468582,
        0.052857376635074615,
        0.0609382800757885,
        0.05657464265823364,
        0.06321848183870316,
        -0.052856530994176865,
        0.025187071412801743,
        0.07490676641464233,
        0.04563242942094803,
        -0.004108099266886711,
        0.06251650303602219,
        8.381998486584052e-05,
        -0.018762625753879547,
        -0.0323932021856308,
        -0.008595161139965057,
        0.05711415037512779,
        -0.0014309881953522563,
        -0.0498037151992321,
        -0.01863039657473564,
        -0.013003671541810036,
        0.02994426339864731,
        0.004132105968892574,
        0.06304370611906052,
        -0.03984013944864273,
        0.07355417311191559,
        0.0035180405247956514,
        0.023534271866083145,
        0.022694410756230354,
        -0.008476300165057182,
        -0.043252479285001755,
        0.004183533135801554,
        0.03730952739715576,
        -0.005566498730331659,
        -0.04401920363306999,
        -0.05736573785543442,
        0.04446432739496231,
        0.05243080109357834,
        0.10026714205741882,
        -0.025477619841694832,
        0.06522338837385178,
        -0.014330296777188778,
        -0.10719114542007446,
        -0.02699531614780426,
        0.034244079142808914,
        0.024000748991966248,
        0.054881446063518524,
        0.09688021242618561,
        0.06376346200704575,
        -0.03028167225420475,
        -0.004804153926670551,
        -0.04861455783247948,
        0.15099254250526428,
        0.010096371173858643,
        0.02409791387617588,
        -0.06699742376804352,
        0.0733024999499321,
        -0.04190496727824211,
        -0.0341990664601326,
        -0.022819597274065018,
        0.011914028786122799,
        0.01522190123796463,
        -0.03390061482787132,
        0.12384362518787384,
        0.04259652644395828,
        -0.01661446876823902,
        0.07293777167797089,
        -0.034355808049440384,
        -0.0008062577689997852,
        0.03915770351886749,
        0.040682509541511536,
        -0.05646263062953949,
        4.75683166349928e-34,
        -0.0236711073666811,
        0.042984556406736374,
        0.041439834982156754,
        -0.0880962535738945,
        0.004480832256376743,
        0.0037901708856225014,
        0.01994776912033558,
        0.050216980278491974,
        -0.06874681264162064,
        -0.04189743846654892,
        -0.007073339074850082,
        0.0722547098994255,
        -0.06029840558767319,
        0.02479330264031887,
        0.13690988719463348,
        -0.0697208046913147,
        -0.014784954488277435,
        0.01298635732382536,
        0.038916364312171936,
        -0.016591530293226242,
        0.027161341160535812,
        -0.029718417674303055,
        0.018895117565989494,
        -0.03579528629779816,
        0.013641003519296646,
        0.005134065169841051,
        -0.038824353367090225,
        0.01480519212782383,
        0.024815743789076805,
        0.04761071875691414,
        -0.05091605708003044,
        -0.05702418461441994,
        -0.05047648772597313,
        -0.056671999394893646,
        0.026598380878567696,
        -0.008566927164793015,
        -0.14031532406806946,
        -0.08968351036310196,
        -0.02217964455485344,
        0.06025411933660507,
        -0.07859406620264053,
        0.007691517472267151,
        -0.12661944329738617,
        -0.026829183101654053,
        -0.09804509580135345,
        0.021321022883057594,
        0.06071522831916809,
        -0.09697490930557251,
        -0.09032493829727173,
        0.0361945703625679,
        0.01152524258941412,
        0.08622340857982635,
        -0.0539373904466629,
        -0.022804245352745056,
        0.016346028074622154,
        0.001771078910678625,
        0.02863321453332901,
        0.0021986833307892084,
        0.04487907141447067,
        -0.013967564329504967,
        -0.016619335860013962,
        -0.034551750868558884,
        -0.041122566908597946,
        0.06474887579679489,
        -0.0583413690328598,
        0.002556929364800453,
        0.12567980587482452,
        0.12277207523584366,
        -0.038141924887895584,
        -0.0037132822908461094,
        0.019602380692958832,
        0.03021194413304329,
        0.07017450779676437,
        -0.03898691013455391,
        0.04072923958301544,
        0.03574896603822708,
        -0.07744678854942322,
        -0.05934254452586174,
        -0.04155885428190231,
        0.03328220546245575,
        -0.0008269550162367523,
        -0.02198992483317852,
        -0.039848655462265015,
        -0.02356276474893093,
        -0.05488501489162445,
        -0.0031745501328259706,
        0.059176087379455566,
        -0.009251837618649006,
        -0.06037645414471626,
        -0.0030601320322602987,
        -0.12530791759490967,
        -0.02078377641737461,
        -0.011160512454807758,
        0.044774848967790604,
        0.049307432025671005,
        -2.9350102946475814e-33,
        -0.10221933573484421,
        -0.0558098740875721,
        -0.07453436404466629,
        0.05361590161919594,
        -0.007246559020131826,
        -0.04903537034988403,
        0.06549523770809174,
        0.01210912223905325,
        -0.0016592119354754686,
        0.03635397553443909,
        -0.01625674217939377,
        -0.007636828348040581,
        0.0005050653126090765,
        0.014977541752159595,
        -0.06626157462596893,
        -0.05614301189780235,
        -0.010404977947473526,
        -0.10422389209270477,
        -0.05864793062210083,
        -0.0071281976997852325,
        0.022354459390044212,
        0.03565705195069313,
        -0.01880880631506443,
        0.03771344944834709,
        0.1067759245634079,
        -0.00011692077532643452,
        0.02938750758767128,
        0.0009863305604085326,
        -0.009586947970092297,
        0.005050709005445242,
        0.04785354807972908,
        0.005876235663890839,
        0.007769616786390543,
        0.009790152311325073,
        0.06803928315639496,
        0.003597121685743332,
        0.0432843379676342,
        -0.0194878950715065,
        0.00015940766024868935,
        -0.09310835599899292,
        0.0801318883895874,
        -0.03201768174767494,
        0.023754430934786797,
        -0.048200126737356186,
        0.03721209615468979,
        0.11823232471942902,
        -0.025096366181969643,
        0.0036988439969718456,
        -0.02680147811770439,
        -0.039896514266729355,
        0.061956848949193954,
        0.05598566308617592,
        -0.03360756114125252,
        0.0021268045529723167,
        0.06318250298500061,
        -0.052610114216804504,
        -0.04759956896305084,
        0.010366562753915787,
        -0.033635783940553665,
        -0.04896828532218933,
        0.03022768162190914,
        -0.04634780064225197,
        -0.06655881553888321,
        0.05463745445013046,
        0.0948702022433281,
        -0.054491076618433,
        0.03476540371775627,
        0.044532276690006256,
        0.038089144974946976,
        0.011753394268453121,
        -0.0394599623978138,
        -0.08227164298295975,
        -0.020040037110447884,
        0.010070002637803555,
        -0.06486234068870544,
        0.03741682693362236,
        0.10509835183620453,
        -0.06022727116942406,
        -0.027218962088227272,
        -0.01338491216301918,
        0.009225341491401196,
        -0.052705828100442886,
        0.13627073168754578,
        -0.012732616625726223,
        0.06859777867794037,
        -0.07200808078050613,
        0.056452877819538116,
        -0.013813787139952183,
        -0.022948184981942177,
        0.000788068282417953,
        -0.03143574669957161,
        0.04873745143413544,
        -0.16590161621570587,
        0.04484615847468376,
        0.009442740119993687,
        -4.797213293272762e-08,
        0.01882421039044857,
        0.026753611862659454,
        -0.029352683573961258,
        -0.017827479168772697,
        0.01480722613632679,
        -0.05435546860098839,
        0.045703399926424026,
        -0.011583954095840454,
        0.052617061883211136,
        -0.0007844139472581446,
        0.01757834665477276,
        -0.1079181581735611,
        -0.008694133721292019,
        0.0764613002538681,
        0.05825089290738106,
        0.05239088460803032,
        -0.009416123852133751,
        -0.028275853022933006,
        0.016835283488035202,
        -0.017261795699596405,
        -0.06057453155517578,
        0.036732710897922516,
        0.054298244416713715,
        -0.04549262672662735,
        0.01991840824484825,
        0.031796302646398544,
        0.017519362270832062,
        0.0020981538109481335,
        0.052554793655872345,
        -0.03025919198989868,
        -0.05930875241756439,
        0.0018142345361411572,
        -0.004307367838919163,
        -0.08219575136899948,
        0.02233652025461197,
        -0.05219791829586029,
        0.063789963722229,
        0.0062177651561796665,
        0.06681328266859055,
        0.04052598029375076,
        -0.017571434378623962,
        -0.014437162317335606,
        0.03277343139052391,
        -0.0025389662478119135,
        0.056790776550769806,
        0.058464545756578445,
        -0.031329862773418427,
        0.033655013889074326,
        0.0234256312251091,
        0.025772586464881897,
        -0.03577165678143501,
        0.04062826558947563,
        0.004664470907300711,
        0.011304215528070927,
        0.08756263554096222,
        -0.0026827603578567505,
        0.01646997034549713,
        0.0022445747163146734,
        -0.03445753827691078,
        -0.005769327748566866,
        0.0660131424665451,
        0.017138192430138588,
        -0.014932731166481972,
        0.06743162125349045
    ]
}