{
    "id": "vaMxTSm53UU",
    "title": "This CPU is FREE! - Milk-V Pioneer with RISC-V",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-12-07T03:32:18Z",
    "video_url": "https://www.youtube.com/watch?v=vaMxTSm53UU",
    "category": "Science & Technology",
    "tags": [
        "CPU",
        "gaming",
        "risc-v",
        "riscv",
        "risc",
        "cpu architecture",
        "desktop pc",
        "ai",
        "machine learning",
        "gaming pc",
        "pc gaming",
        "euro truck simulator 2",
        "arm",
        "arm processor",
        "apple",
        "mac",
        "linux",
        "fedora",
        "made in china 2025",
        "chinese cpu",
        "chip fabrication"
    ],
    "views": 1277899,
    "likes": 51002,
    "comments_count": 2018,
    "description": "Your business deserves a website! Create one for free at   Who doesnt like a free CPU? The answer is a bit more complicated than youre imagining. This computer might look small and unassuming, but inside it is a motherboard youve never seen before, a 64-core processor unlike anything you currently own, and the technology behind it could have far reaching geopolitical implications in the very near future. It is the subject of trade sanctions, stock dumps, and could lead us into the next technology-fueled cold war. But can it game?  Discuss on the forum:   Check out the Milk-V Pioneer:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:31 What is this thing? 2:37 What is an Instruction Set Architecture? 3:39 Using the Milk-V Pioneer 4:56 RISC vs CISC 5:55 ARM and RISC-V 6:28 Steam with box64 7:25 Why not just use ARM? 7:58 Looking at the hardware 9:52 Who is behind this CPU? 10:41 US vs China 12:03 What does it mean for gamers? 13:04 ARM's Race 14:49 Euro Truck Simulator 2 15:56 The Future/Conclusions",
    "description_links": [
        "https://odoo.com/LTT",
        "https://linustechtips.com/topic/1545665-this-cpu-is-free/",
        "https://milkv.io/pioneer",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "This computer is free. Or well, it costs money to buy one, but the idea behind it is free. Free from patent restrictions, licensing fees, and all other manner of innovation crushing limitations. And it actually works today. Look at it go. I can run regular old desktop Linux with a regular old keyboard and mouse. I can even browse the regular old internet. But can I play a regular old 3D accelerated game? Yes! Even a few short years ago, the idea of RISC-V displacing or even competing with established architectures like x86 or ARM seemed like a pipe dream. But it's amazing just how much can be accomplished by a team of highly motivated industry giants like Google, Tencent, and Qualcomm. But the question is, why are they so motivated? What's wrong with x86 and ARM anyway? And why is U.S. Senator Marco Rubio over there in the corner? I'm just here to segue to our sponsor. Odoo. Their free, easy-to-use website designer, online sales tools, and new integrated AI copywriter can help you find a voice for your small business. Click the link below or keep watching till the end of the video to learn more. This is the Milk 5 Pioneer, and most of its specs are pretty normal. It has 128 gigs of DDR4 memory, a one-terabyte NVMe solid-state drive, and a Radeon R5-230 graphics card. We're gonna have it linked down below. What isn't normal is the 64-core RISC-V processor. RISC-V, or Reduced Instruction Set Computer 5, is an open standard instruction set. That means that anyone can build a processor using it without any licensing fees or even permission. The one in here was built by, actually, okay, that's a little bit complicated. We're gonna get to that later. First, let's fire it up and see how she works. Ooh. You know, this isn't actually the first time that we've looked at a RISC-V machine. That honor goes to the Hi5 Unleashed way back in 2018. But I think that you're gonna see that things have progressed quite a lot since then. Let's see if we can get into the BIOS on this bad boy. Spoiler, we can't. While it is expected to arrive sometime in the next month or so, at this time, there isn't a BIOS or a UEFI in the traditional sense. You just press the button and then wait for it to boot, which takes a couple of minutes. So while we wait for that, let's talk a little bit about RISC. As a bit of a refresher from our previous videos on the topic, an instruction set refers to the collection of the most basic functions that all other programs are built upon. Things like adding, subtracting, writing to memory, or reading from memory are all things you might find in a CPU's instruction set. The idea of a processor with a minimal or reduced instruction set started in the late 1970s with the experimental IBM 801, and it stuck around pretty much since then in some form or another. Power PC processors, like those found in old Macs, and ARM processors, like those found in new Macs, not to mention your cell phone, are both examples of RISC architectures. ARM even used to be called Advanced RISC Machines. Though, of course, RISC-V is not ARM, even if they share some heritage. So don't expect to just throw Mac OS or Windows for ARM on this thing. Thankfully, Linux exists, specifically Fedora 38 for our demo today. Start by loading up Firefox then. It's taking a while. Oh, wow, it's really slow. I feel like that's a bit of a spoiler for later in the video, but yikes. What other software have we got on here? LibreOffice? Can we word process? Yes! Buddy? Oh, she crashed. Give it another shot. Hey! What about spell check though? Yes! Pretty exciting. Time to try some free open source games like Open Arena. Come on, Tony. Come at me, bro. Oh, geez, where'd you go? Whoa, Ayumi. Oh, wait, I got a rocket launcher. Oh, this is good. This is very good. No, I want my rocket launcher. What the heck is this? She teleports. What the? What just happened? Come on, how did that not count? I don't have a single kill yet. You know what? I'm gonna blame that on the low frame rates. Those make sense given that the system is only drawing about 90 watts from the wall right now. So at least you can't fault the efficiency. Remember, that number includes our GPU as well. But we've glossed over a pretty important detail so far. The R in RISC is for reduced. Sure, okay, but reduced from what? CISC or complex instruction set computer processors like the x86 chips made by Intel or AMD have much more robust instruction sets. This allows them to complete complex operations with fewer inputs, something that used to be used to reduce both development time and the amount of disk space needed to store a program. Except the thing is, modern development tools are nothing like what they used to be. And your typical dev no longer needs to worry about whether the CPU will perform one complex operation or if it will achieve the same result with half a dozen simpler ones. And Apple proved with the launch of their M-series silicon that RISC's traditional role as an efficient but low performance alternative could be left behind. This new level of acceptance is a huge shot in the arm, pun intended, for RISC-V. You see, porting to RISC-V from some other RISC ISA is much simpler than porting from x86, which has resulted in a much larger software library than the last time that we checked in. But that's not even the coolest part. The special sauce that made Apple's M1 launch so successful was Rosetta 2, a translation layer that allowed x86 applications to run on Apple's new ARM RISC chips. And I bet you probably see where I'm going with this. Box 64 is a super cool piece of software that should allow us to run x86 64-bit applications on RISC-V without recompiling them up front. Let's go ahead and try and install Steam, which isn't in our package manager. And we did find a Debian version of, but this is a problem. Unfortunately, unless you're on Apple, Steam is only 32-bit and Box 64 doesn't work with 32-bit applications. So maybe there's another way for us to install Stardew Valley? The answer is obviously yes, because Petite Seb got it running here, but we ran into an issue with GOG's Mojo installer that we weren't able to get past, at least at the time of filming. So in a nutshell, it's kind of like the early days of the Proton translation layer for gaming on Linux. There's clearly a lot of work to be done, but the bones are there, and that is really, really exciting. A big question we haven't touched on yet, though, is why not just use ARM? The truth is that the RISC-V instruction set is pretty similar, but there's a big difference, and that is that ARM is licensed. You see, even though Apple manufactures their own M3 chips with partners like TSMC, and they've modified them quite a bit compared to the ARM chips that are produced by other manufacturers like Qualcomm or Marvell, they still have to pay ARM some kind of licensing fee, which is often a function of how many units they sell, which, in Apple's case, is a lot. And while they won't move nearly as many of these things, there's still a lot to be learned from poking at it a bit more, because it's sort of half PC and half development kit. Starting with the front I.O., this Type-C port, for example, doubles as a debug console connector. Then there's the fact that it runs quad-channel memory. That's something I've not seen on the desktop in quite some time. There's two PCIe 16x slots that seem to operate at Gen 4 speeds, though it should be noted that one of them is only a x8 connection, and then we've also got an M.2 and another M.2, meaning there's a fair bit of PCIe on this thing. The SATA ports are weird. There's five of them, which is an odd number, literally and figuratively. And the fact that they've all got these little covers on them, right? Like, what is up with that? According to Milk-V, these are dust covers, and that's not the only odd thing that we ask them about. There's an MCU on here, which is an ARM chip. And according to Milk-V, they have no intention of replacing it with a RISC-V equivalent in the near future. And the same can be said about the PCIe controller in the top left of the board that is also an ARM chip and actively cooled by a super annoying little fan. If you guys heard that earlier in the video, I unplugged it. That's why it hasn't been making noise anymore. Oh, wow, this is funky. It only uses a 24-pin power connector. No additional 4-pin or 8-pin or anything for the CPU. That's pretty cool. These banks of pins along the bottom are apparently for USB debugging, UART, and JTAG connections. And then the cooler is a really interesting one. You can see here, this has been modified to fit an Intel LGA 1150 cooler with a bracket that's included. So theoretically, you could use any 1150 cooler you wanted, but that's not what we're interested in. We wanna take a look at what exactly it's cooling. It turns out it's a Sofon SG2042 made by SophGo, a subsidiary of Bitmain. Now, Bitmain's major product up until this point has been the Antminer, a crypto mining machine that accounts for over 70% of all the processing power on the Bitcoin blockchain. But SophGo didn't design the actual cores that they're using. The C920 core comes from T-Head Semiconductor Limited, the chip division of Alibaba, the owner of AliExpress, not to mention a vast number of other companies. This chip then could be described as a collaboration between arguably the most powerful company in crypto and arguably the most powerful company in China. It's not exactly high performance at the moment, but it does work. And if you think this has some folks scared, you are right. SiFive, maker of the original RISC-V computer, has laid off roughly 20% of their workforce recently. Now, they claim that this is a restructuring, and it likely is, but there could be more to this story. After the United States government announced the ban on exporting RTX 4090s to China, several senators wanted to take it a step further, with Marco Rubio, oh, that's why we had him in the background, quoted as saying, -\"Communist China is developing open source chip architecture to dodge our sanctions and grow its chip industry.\" He's referring to RISC-V here, and he's not entirely wrong, even though in typical politician fashion, his solution is more of a self-own than a clever maneuver. The idea of banning US companies from working on RISC-V with Chinese companies kind of makes sense on the surface. I mean, why export your technological innovation to a foreign adversary? But in practice, it's not gonna hurt China nearly as much as it's going to hurt US companies, like SiFive, as we hurdle towards a RISC-V future. And I cannot overstate the pace at which this is happening. During the writing of this video, SiFive and SophGo announced two new desktop chips that are slated for release in 2024. This could be a big moment for SiFive's continued growth, particularly in the wide-scale adoption sense. But SophGo, they've already got competing products on the market. Of course, you might be wondering at this point, with our mentions of Steam and Proton, what does all of this mean for gamers? For now, probably not much. Not only will you not be buying one of these and throwing the latest GPU hotness into it, you won't even be throwing last-gen GPU hotness into it. We tried an AMD 6000 series card, and no bueno, no drivers. But that doesn't mean that you'll be limited to the best that Milk 5 certifies the system for, which is the RX 550. We found that it would work with any 500 series card, as long as you have a beefy enough power supply, and went with an RX 580 to see how things would go. Just note, though, that you might need an upgraded power supply in order to get this working, as normally the system ships with a 350-watt power supply. But with that said, with how little power draw we had before, maybe that would work fine anyway, I don't know. Oh, sick, Zenotic is working. Wait a minute, am I in an actual game? Oh, shoot, this is, oh, my mouse is only sporadically working. Are these bots, or what? I can't, I have no idea what's happening here. I believe those are bots. Okay, good, now I have a chance. Let's go, where's my FPS? Oh, there it is, down in the bottom corner. Hey, that's way better. And these are better graphics than we had last time. Hey, fragged airhead, let's go. There's no way any human could be beaten by me right now. The best gaming computer ever? Certainly not. My mouse just stopped working. But if things continue to improve, this could be a viable option very soon. The biggest organization likely scared of RISC-V is obviously Arm. But the story goes a bit deeper than most people realize. Arm is owned by SoftBank. SoftBank's CEO, Masayoshi Son, was one of Alibaba's first investors, and until this past year, SoftBank owned up to 24% of Alibaba. Jack Ma, co-founder of Alibaba, sat on the board of directors for SoftBank for 13 years starting in 2007. These two companies then were more than just close. But that has changed drastically in the past two or three years, when Jack Ma said some things, then disappeared until he didn't, but then did he. And regardless of all of that, under the new jackless leadership of Eddie Wu and Joe Tsai, Alibaba's various entities seem to have doubled down on producing their own chips separate from Arm in line with the Chinese government's Made in China 2025 campaign. And RISC-V is a key part of that strategy, allowing the Chinese government to be free of any foreign interference in their tech development, at least at some point. Based on the benchmarks, there is still a lot of work to be done. All right, so it's been a few days, and I think I've got something really exciting going. Wait, we already did the Milk-V. Yes, but I went back and did it better. No, shut up. Yeah, it's running. No. I am the first person on earth to get Euro Truck Simulator working on a RISC-V CPU. I mean. I mean, no, you know what? Yeah, let's go. Okay, shut up, really? We're gonna be standing here for a minute. It's slow, but it actually does like load, and you can almost drive a truck good. Holy. All right, I did crash the truck in the last game, so. That he may have done. Let's see if I can crash the game. It's running at about four FPS, which means the physics and inputs are a little funky, but are you guys seeing this? Running poorly is a big step toward running well. That's why I passed gym class. Okay, what happens if you hit a gas station? How is the destructibility of the environments? Not so good. The growth of RISC-V then is all but set in stone, at least for the next few years. Qualcomm and Google have announced that their next line of wearables will use RISC-V. Manufacturer Ventana claims that their upcoming Veyron V2 CPU is the most powerful RISC-V processor ever, and they intend to roll it out to data centers. And GPU startup Imagination Technologies is beginning to roll out their new line of RISC-V GPUs that can do DirectX 11. So these are still early days, but it is a heck of a start. If you remember back to 2012, with the first release of Windows RT for ARM, it was notoriously fairly crap, but then Apple released the M1 in 2020, and people were shocked at how competent it could be at such a low power level. Well, if you ask me, RISC-V is a lot closer than you would think to its M1 moment. With a solid backer deciding they are done paying Intel or ARM for licensing fees, it could be your next desktop or laptop processor virtually overnight. All it takes is one company, like a Google, a Huawei, or an Apple that implements it into their ecosystem, and boom, you've got a RISC-V processor right there beside you. Just like right beside me is this segue to our sponsor. Odoo, wanna create a website for your small business but don't know how to code? Odoo's open-source intuitive platform makes building a website quick and painless. Simply drag and drop from their massive selection of design elements to make an eye-catching site. Anyone can do it, even if they think the word coding means coming up with passphrases for secret clubs. And now, Odoo has added their own AI copywriter powered by ChatGPT. So in just a few clicks, you can write, rewrite, lengthen, or change the tone of any text on your website. Best of all, Odoo's site builder is free to use, comes with unlimited hosting, and they'll even pay for your domain name for the first year. Need more than just a basic site? Well, Odoo has you covered there too with over 50 integrated apps to choose from, so you'll have access to the perfect tools to suit your business's needs. So don't wait, click the link below and start creating a website for free today with Odoo. If you guys enjoyed this video, check out our first look at RISC-V and a little history lesson from 2018.",
    "transcript_keywords": [
        "RISCV",
        "ARM",
        "Instruction Set",
        "RISCV processor",
        "ARM RISC chips",
        "RISCV instruction set",
        "Apple",
        "ARM chip",
        "RISC",
        "Set",
        "Instruction",
        "Instruction Set Computer",
        "Reduced Instruction Set",
        "free",
        "bit",
        "time",
        "ARM RISC",
        "RISCV CPU",
        "Odoo",
        "things"
    ],
    "transcript_entity_values": [
        "one",
        "Euro Truck Simulator",
        "only 32",
        "the Milk 5 Pioneer",
        "Mojo",
        "Alibaba",
        "500",
        "the next few years",
        "801",
        "SoftBank",
        "M.2",
        "Steam and Proton",
        "Firefox",
        "Antminer",
        "GPU",
        "UEFI",
        "Qualcomm",
        "2018",
        "Open Arena",
        "Apple, Steam",
        "2007",
        "AI",
        "16x",
        "64",
        "Mac",
        "AMD",
        "the next month",
        "Marvell",
        "Joe Tsai",
        "24",
        "half",
        "2024",
        "Marco Rubio",
        "a few short years ago",
        "Apple",
        "first",
        "the late 1970s",
        "about four",
        "M1",
        "First",
        "32",
        "Bitmain",
        "RISC",
        "ISA",
        "Stardew Valley",
        "Windows RT",
        "AliExpress",
        "half a dozen",
        "Radeon R5-230",
        "the first year",
        "Jack Ma",
        "Macs",
        "United States",
        "M3",
        "CPU",
        "the early days",
        "2025",
        "Eddie Wu",
        "Imagination Technologies",
        "Odoo",
        "Debian",
        "TSMC",
        "I.O.",
        "6000",
        "Intel",
        "Box 64",
        "Reduced Instruction Set Computer 5",
        "early days",
        "this past year",
        "Petite Seb",
        "Intel LGA 1150",
        "Windows",
        "Google",
        "China",
        "UART",
        "MCU",
        "one-terabyte",
        "2012",
        "JTAG",
        "Advanced RISC Machines",
        "five",
        "DirectX 11",
        "over 50",
        "Bitcoin",
        "up to 24%",
        "350-watt",
        "Tony",
        "Ayumi",
        "Tencent",
        "Veyron V2",
        "PCIe",
        "Linux",
        "two",
        "13 years",
        "2020",
        "IBM",
        "128",
        "Huawei",
        "U.S.",
        "GOG",
        "Milk 5",
        "Chinese",
        "the past two or three years",
        "RISC-V. Manufacturer Ventana",
        "Bitmain",
        "today",
        "SiFive",
        "over 70%",
        "SATA",
        "roughly 20%",
        "8",
        "about 90 watts",
        "1150",
        "US",
        "Masayoshi Son",
        "2",
        "Fedora 38",
        "USB",
        "Odoo",
        "Linux",
        "Zenotic",
        "a minute",
        "Gen 4",
        "a couple of minutes",
        "a few days",
        "580"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "LAW",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "NORP",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "PERSON",
        "CARDINAL",
        "LAW",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "TIME",
        "FAC",
        "TIME",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.04084330052137375,
        -0.05625121295452118,
        0.030419740825891495,
        -0.059936944395303726,
        0.09708718210458755,
        0.03427453339099884,
        -0.07064035534858704,
        0.07892286777496338,
        -0.041596412658691406,
        0.010647199116647243,
        -0.023797666653990746,
        0.03210516646504402,
        -0.021182972937822342,
        -0.08290612697601318,
        0.0033510178327560425,
        -0.0539097897708416,
        0.02878711000084877,
        -0.06857594102621078,
        0.0014115748926997185,
        -0.04033029451966286,
        0.003935609944164753,
        -0.06966539472341537,
        -0.05734267830848694,
        0.002950893249362707,
        0.07547155767679214,
        0.003566255560144782,
        0.015272107906639576,
        -0.032554611563682556,
        0.020749518647789955,
        -0.06851039826869965,
        -0.03138241916894913,
        -0.010521452873945236,
        0.03872271999716759,
        0.029787003993988037,
        0.04627978801727295,
        -0.018523408100008965,
        0.052909377962350845,
        -0.09988003224134445,
        -0.028466107323765755,
        -0.07179941982030869,
        0.02487122267484665,
        -0.06205536797642708,
        0.02041715756058693,
        0.0627557635307312,
        -0.0061843376606702805,
        -0.0049056303687393665,
        0.020898083224892616,
        -0.0715131089091301,
        -0.02332470938563347,
        0.037910547107458115,
        -0.03698238357901573,
        -0.0966527983546257,
        0.05421106517314911,
        -0.02301354520022869,
        -0.0926959291100502,
        0.006579513195902109,
        0.03003462590277195,
        -0.06342965364456177,
        0.0010757159907370806,
        0.011471000500023365,
        0.007184930611401796,
        -0.10771628469228745,
        0.004877130966633558,
        0.05572300776839256,
        0.08583757281303406,
        -0.012253508903086185,
        0.003357177134603262,
        0.0357750803232193,
        0.013132615014910698,
        -0.08572939783334732,
        0.00309576909057796,
        -0.05244896560907364,
        0.022887807339429855,
        0.06937360763549805,
        -0.019426312297582626,
        0.02346191555261612,
        0.08306366950273514,
        -0.046153973788022995,
        0.10635355859994888,
        0.03408713638782501,
        0.03862254321575165,
        -0.006756132934242487,
        -0.03701574727892876,
        -0.054613493382930756,
        -0.007580779958516359,
        -0.02934144251048565,
        0.03249341994524002,
        0.017679298296570778,
        0.0843215063214302,
        -0.17583392560482025,
        -0.10003142058849335,
        0.05953123793005943,
        0.11689537763595581,
        -0.0033827153965830803,
        0.029844796285033226,
        0.03889699652791023,
        -0.048549894243478775,
        -0.05756426230072975,
        -0.038785576820373535,
        0.04517946019768715,
        0.0005898292874917388,
        0.019524715840816498,
        0.008739843964576721,
        -0.07171328365802765,
        -0.10875634104013443,
        -0.010410632006824017,
        -0.10720602422952652,
        0.09523214399814606,
        -0.04947083443403244,
        -0.005350529216229916,
        -0.09378671646118164,
        0.0942067950963974,
        -0.02726319618523121,
        0.01675027795135975,
        0.05162899196147919,
        -0.05660170316696167,
        -0.06098776310682297,
        -0.08365368098020554,
        0.016734682023525238,
        -0.007231110241264105,
        -0.013420888222754002,
        -0.0014330215053632855,
        -0.013677369803190231,
        0.01840326189994812,
        -0.045014746487140656,
        -0.030300088226795197,
        -0.049707554280757904,
        2.1412916732103806e-35,
        -0.03206748887896538,
        0.06667633354663849,
        -0.020479002967476845,
        -0.09399883449077606,
        0.02386699989438057,
        0.044144339859485626,
        0.00816273782402277,
        0.0019068929832428694,
        -0.08664786070585251,
        0.09658505022525787,
        -0.026649007573723793,
        0.03902595490217209,
        -0.026973707601428032,
        0.08213836699724197,
        0.10941469669342041,
        -0.06270332634449005,
        0.05012432113289833,
        0.016637366265058517,
        0.08016606420278549,
        -0.018588874489068985,
        -0.004314476624131203,
        0.009286664426326752,
        -0.02083301730453968,
        -0.011467307806015015,
        0.0727328285574913,
        -0.059717807918787,
        -0.048607680946588516,
        -0.04623619094491005,
        0.04040246084332466,
        0.009801056236028671,
        -0.041023336350917816,
        -0.011628448031842709,
        -0.07347392290830612,
        -0.03512263298034668,
        0.0423271469771862,
        -0.02918890118598938,
        -0.06467919796705246,
        -0.05629822984337807,
        0.013030274771153927,
        0.055372100323438644,
        0.02300289086997509,
        0.06810453534126282,
        -0.0390726700425148,
        -0.06867367029190063,
        -0.03608511760830879,
        0.013393040746450424,
        -0.005783489905297756,
        -0.042129602283239365,
        -0.027220409363508224,
        -0.04487740620970726,
        -0.024018535390496254,
        0.03008587658405304,
        -0.0842173844575882,
        -0.03432006761431694,
        0.05514167621731758,
        -0.010930387303233147,
        0.03978777676820755,
        0.008251514285802841,
        0.09391049295663834,
        0.07379001379013062,
        0.025818128138780594,
        -0.002174859866499901,
        0.011396708898246288,
        0.02283415012061596,
        -0.06690149754285812,
        0.07610850036144257,
        -0.0006946489447727799,
        0.01645493693649769,
        -0.07335516810417175,
        0.09375685453414917,
        -0.03606868162751198,
        -0.06692584604024887,
        0.042030949145555496,
        -0.05257173255085945,
        -0.0009936157148331404,
        0.08431093394756317,
        -0.05363402143120766,
        -0.045412808656692505,
        -0.0331619493663311,
        -0.03850088268518448,
        -0.017803454771637917,
        -0.027009084820747375,
        0.011845378205180168,
        0.03387276083230972,
        0.0589982233941555,
        -0.0005476704682223499,
        -0.12142081558704376,
        0.014302250929176807,
        0.014144236221909523,
        0.023326389491558075,
        -0.037956058979034424,
        -0.030838677659630775,
        -0.03037567064166069,
        0.06105533614754677,
        -0.055619459599256516,
        -2.4304451402624536e-33,
        -0.060993924736976624,
        -0.04231151193380356,
        -0.047514792531728745,
        0.026675520464777946,
        0.0205263402312994,
        -0.04712787643074989,
        0.0859157145023346,
        0.0441378653049469,
        -0.03922252729535103,
        -0.030815837904810905,
        -0.004643024876713753,
        -0.008796734735369682,
        0.009616636671125889,
        0.0575382262468338,
        0.014767341315746307,
        -0.019732529297471046,
        0.015453137457370758,
        -0.042225182056427,
        0.05114474520087242,
        -0.04397474601864815,
        0.061562709510326385,
        0.015917224809527397,
        -0.030368348583579063,
        0.03960222378373146,
        0.02386142499744892,
        0.03457461670041084,
        0.006662162486463785,
        0.005382586270570755,
        0.013441218063235283,
        0.09639088809490204,
        -0.021765602752566338,
        -0.048998914659023285,
        0.03205547109246254,
        0.02361626736819744,
        0.017961956560611725,
        0.014316035434603691,
        0.08824972063302994,
        0.0019069088157266378,
        0.029703835025429726,
        -0.06717744469642639,
        0.023559408262372017,
        -0.01840163767337799,
        -0.03594958037137985,
        0.013239878229796886,
        -0.03171271085739136,
        -0.03610460087656975,
        -0.011590496636927128,
        -0.07976090908050537,
        0.05428752303123474,
        0.007462325505912304,
        0.019757721573114395,
        -0.04958181083202362,
        0.13885612785816193,
        0.003295545233413577,
        -0.05075928941369057,
        -0.015651311725378036,
        -0.01611114665865898,
        0.0055973706766963005,
        0.05495402216911316,
        -0.04595333710312843,
        0.06804479658603668,
        -0.017448067665100098,
        -0.03572766110301018,
        -0.06834057718515396,
        0.06432059407234192,
        -0.0006378847174346447,
        0.030561087653040886,
        0.015161893330514431,
        -0.03863222897052765,
        -0.0423240028321743,
        0.08315658569335938,
        0.010922200046479702,
        -0.001939321868121624,
        -0.018001331016421318,
        -0.058774709701538086,
        0.08997034281492233,
        -0.012311817146837711,
        0.01529351994395256,
        0.022082814946770668,
        -0.00112612743396312,
        -0.048158321529626846,
        0.011272110044956207,
        0.03676331788301468,
        0.0016349434154108167,
        0.12305166572332382,
        0.004402349703013897,
        0.01370979193598032,
        -0.05199318751692772,
        0.0037444066256284714,
        -0.06386813521385193,
        -0.074643075466156,
        -0.008224209770560265,
        -0.01617780700325966,
        0.040271416306495667,
        0.023505771532654762,
        -6.116332684769077e-08,
        0.061577871441841125,
        -0.07171673327684402,
        0.04188721999526024,
        0.08119644969701767,
        0.03792998939752579,
        -0.04063434153795242,
        -0.015316691249608994,
        -0.0900721549987793,
        0.04789496213197708,
        0.06457389891147614,
        -0.00934381503611803,
        -0.029119644314050674,
        -0.029499296098947525,
        0.04401746764779091,
        0.023157792165875435,
        0.07828356325626373,
        -0.0024381920229643583,
        0.0885862186551094,
        -0.04006557539105415,
        -0.024312175810337067,
        -0.01011662371456623,
        0.02959725446999073,
        0.06873822957277298,
        0.00699984934180975,
        -0.008915244601666927,
        0.0019382358295843005,
        0.05555681139230728,
        0.0563751719892025,
        0.11070118844509125,
        0.013445379212498665,
        -0.07745754718780518,
        0.02512066811323166,
        0.02050420083105564,
        -0.037418462336063385,
        0.0538407601416111,
        -0.03479595482349396,
        -0.03513052687048912,
        0.044912904500961304,
        0.027804642915725708,
        -0.03289562836289406,
        -0.08451128751039505,
        0.0434500016272068,
        -0.0007639749092049897,
        0.004811497870832682,
        0.06326383352279663,
        -0.010512283071875572,
        -0.09336736798286438,
        -0.12759600579738617,
        0.024988526478409767,
        0.0615728385746479,
        0.0022556164767593145,
        0.03638661280274391,
        -0.0017190932994708419,
        0.1319364607334137,
        0.05296264961361885,
        0.020325463265180588,
        -0.04159028083086014,
        -0.010463178157806396,
        -0.002396985422819853,
        0.05119209736585617,
        0.07889531552791595,
        -0.1602579951286316,
        0.08832761645317078,
        0.0026218655984848738
    ]
}