{
    "id": "VaoL6njjizg",
    "title": "Back 2 Back Screens? - Nubia Z20 Teardown!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-11-01T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=VaoL6njjizg",
    "category": "Howto & Style",
    "tags": [
        "Nubia Z20",
        "dual screen phone",
        "Nubia Z20 Teardown",
        "Nubia z20 take apart",
        "nubia",
        "z20",
        "nubia z20 review",
        "double screen smartphone",
        "smartphone",
        "double screen",
        "mobile ph one",
        "2 screen smartphone",
        "folding phone",
        "iphone",
        "best smartphone"
    ],
    "views": 642532,
    "likes": 22741,
    "comments_count": 999,
    "description": "Get a 2 month free trial of Skillshare here:  Thanks to Skillshare for sponsoring this video! The Dual screen Nubia Z20 is ready to be taken apart. We will see how the nubia Z20 works from the inside with both the front and rear screen. Its amazing how much technology can be crammed inside such a thin little device. The Nubia Z20 is showing that it IS possible to have a feature rich phone for cheaper than 1000 dollars. Current pricing on the Nubia Z20 is here:   See the Z20 Durability test here:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://skl.sh/jerryrigeverything",
        "https://mall.nubia.com/pages/z20",
        "https://youtu.be/pZ9YzLr43SI",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "This dual screen Nubia Z20 is low-key one of my favorite phones of the year. At $550, it's half the cost of a normal flagship, yet has triple cameras and screens on both sides that can mirror each other. Or act as dual monitors. And now it's time to see how it all works from the inside. This video is sponsored by Skillshare. Let's get started. [Intro] When both screens are off, the Nubia Z20 looks pretty much just like any other smartphone, so getting inside it should be interesting. There never are any instruction books for tear downs like this, so we'll take an educated guess and start from the backside with the smaller secondary screen. Heating everything up till it's barely too hot to touch and then lifting up with my large suction cup while simultaneously slicing through the adhesive under the glass and continuing this process all the way around the edge of the phone. Finally, with all the adhesive cut, the back screen can fold open from the phone like a book, revealing a long display ribbon that crosses the length of the phone and plugs into the motherboard. It's probably a bad idea to turn the phone on at this point, but we're going to go ahead and do it anyway. Normally you can swap between the screens by physically flipping the phone around, but you can also manually trigger the screen swap with an on-screen button. And since the screens are currently side-by-side, that's what we're going to be using right now. I can have one app open on the front, and a different app open on the back. It's a pretty ingenious little system that Nubia is implementing and I'm a huge fan. You can see the camera lens scoping out the underside of the rear panel. Having the patient awake during surgery is kind of fun. Looks like you don't need the rear panel to take selfies. Anyway, let's go back to the teardown. There is a long black underscreen shield between the back of the AMOLED screen and the battery. But there is no way to unplug that battery just yet. There is a small metal bracket over the rear display connector. I'll unscrew that little screw holding it in place and then unsnap the screen connector from the phone like a little Lego. This is the AMOLED screen. The only way to get a display this this is by using an OLED panel where each individual pixel lights itself. An LCD screen which has a back light would be a bit thicker than this and take up more space inside of the phone. OLED is pretty cool technology. The same construction is also why OLED TVs are much thinner than LCD TVs. I can remove the 8 Phillips head screws holding down the top metal and plastic shield of the phone. Pulling it away from the body, we see that it comes attached to the triple LED camera flash. Two colors on the left and a single color on the right both of which plug into the motherboard with the same Lego-style connector. I'll unplug the battery first and make my way around to the other ribbon connectors, unclipping the screen and bottom extension ribbons, along with the smaller screen switching side button ribbons. Down at the bottom of the phone we have another 8 screws holding down the lower plastics and loudspeaker. Pulling it away reveals that the loudspeaker has no balls inside, but it does have the gold contact pads that allow it to communicate with the charging port board. There is no water resistance inside this phone. I'll unclip the charging port, unscrew one more screw down here, and then I can pull the coin-style vibrator motor and USB-C charging port out of the phone at the same time. The two are soldered together. The phone looks new and modern on the outside, but they are using some older-style build methods on the inside. Removing the last few small ribbons from the top of the motherboard. I also go to remove the black signal wire and it accidentally pops the head completely off of the motherboard. That super cheap price point is starting to show itself a little inside of the phone with that soldered vibrator motor and weak signal wire connections. I'll pull the SIM card tray out. It's got room for two SIM cards but no memory card expansion slot, which for me is pretty important, especially as the phone gets older. There is one more screw at the top of the motherboard, and then I can lift the whole motherboard away from the Nubia Z20 housing. It comes off with a triple camera setup still attached and leaves behind a gigantic blob of pink Double Bubble-style thermal paste underneath. The Z20 is using the metal frame of the phone as a heat dissipation system. The triple camera setup is all mounted together in their own metal housing and each camera has it's own Lego-style connector attached to the motherboard. The main 48 megapixel camera is on the left, which does have the optical image stabilization. And then we have the 16 megapixel ultra wide camera in the center and the 8 megapixel 3x telephoto zoom lens on the right side. Neither of the 2 secondary cameras have OIS. I'll plug the cameras back into the motherboard. I'm a huge fan of more phones coming out with this triple camera setup. Now for the battery. It is a few pennies cheaper to make the battery permanent and that's what Nubia has done with the Z20. This makes battery removal super dangerous. Bent batteries can tear and explode and start on fire, which isn't my favorite thing on the inside of a phone. Plus there are a few fragile ribbons underneath the battery that should be more protected. Eventually the battery does come out, but now that it's been bent, the internal layers have probably touched and it'll just slowly start expanding over the next few months, causing the phone to die a slow and painful death. So the best thing to do for the phone and the planet is just for Nubia to use removable adhesive next time, even if it does cost a few pennies more. The 4000 milliamp hour battery can fast charge at 27 watts. The 1080p larger front screen is glued into the metal housing and is using that same super thin AMOLED technology to utilize the least amount of space inside of the phone. It's pretty amazing how thing these things can get. The display is just as thin as the piece of glass that's on the outside protecting it. The smaller rear display is 720p. I'll put the battery back in and start putting this little guy back together. The goal is to have a working phone when I'm finished. I do feel like Nubia did cut some costs in a few areas with that weaker antenna connector, permanent battery, and a soldered vibrator. It's got the outside looking like a prime Olympic athlete, but the inside's looking more like a fast food eating couch potato. It all comes together to make a decent phone though, and still just proves that you don't need to spend $1000 for a flagship when a $550 phone can still get the job done just fine, even if the insides aren't as fine-tuned and glamorous as the outsides. I'll get the rear screen plugged in with a metal bracket in place. And then the whole thing folds shut into a functional device again. I'm a fan. It's still definitely one of my favorite phones of the year. I like it when companies innovate and try new things. The dual screen Nubia Z20 gets a thumbs up from me. Chances are if you're watching my videos, you like learning. And if you like keeping your mind active, the internet is a great place. Never in the history of ever has knowledge been so accessible. One concentrated location for learning is with Skillshare. Skillshare is an online community with thousands of classes covering dozens of entrepreneurial and creative skills. An annual premium membership costs less than $10 a month and gives you unlimited access to classes so you can pick and join whatever classes fit your style or your needs. From graphic design, to photography, to video editing. Personally, I went to school for business, which is fine, but everything I learned about video editing I learned from online tutorials. Kind of like this video editing with Adobe Premiere Pro for beginners taught by Jordy, a fellow YouTuber, over on Skillshare. Because Skillshare classes are all in one spot, it's easier to stay focused. There are less distractions. Because Skillshare is sponsoring this video, if you use the link down in the description, you get 2 months for free to try it out. The free trial link is down in the description, and huge thanks to Skillshare for sponsoring this video. It was a lot of fun taking apart the Nubia Z20. If you enjoyed this video, hit the subscribe button. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "dual screen Nubia",
        "screen",
        "Nubia",
        "screen Nubia",
        "battery",
        "inside",
        "Skillshare",
        "camera",
        "back",
        "AMOLED screen",
        "motherboard",
        "dual screen",
        "video",
        "screens",
        "phones",
        "triple camera",
        "metal",
        "favorite phones",
        "triple camera setup"
    ],
    "transcript_entity_values": [
        "a few pennies",
        "4000 milliamp hour",
        "3x",
        "Jordy",
        "8",
        "Lego",
        "the year",
        "1080p",
        "Instagram",
        "two",
        "OLED",
        "550",
        "Nubia",
        "thousands",
        "Two",
        "dozens",
        "Adobe Premiere Pro",
        "2 months",
        "half",
        "Phillips",
        "SIM",
        "Skillshare",
        "Nubia",
        "less than $10",
        "1000",
        "Nubia Z20",
        "first",
        "the Nubia Z20",
        "LCD",
        "YouTuber",
        "27 watts",
        "annual",
        "16 megapixel",
        "One",
        "48 megapixel",
        "the next few months",
        "Olympic",
        "AMOLED",
        "one",
        "Twitter",
        "Nubia",
        "2"
    ],
    "transcript_entity_types": [
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "LOC",
        "ORDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.11283287405967712,
        0.08595464378595352,
        -0.0030833682976663113,
        -0.07820326834917068,
        0.03846094384789467,
        -0.06980705261230469,
        0.04895681515336037,
        0.07319702208042145,
        -0.03780854493379593,
        0.08892563730478287,
        0.03996087983250618,
        0.014345365576446056,
        0.06345967203378677,
        0.023483773693442345,
        0.008244614116847515,
        -0.0025100719649344683,
        0.051436975598335266,
        -0.03578067570924759,
        -0.05321618542075157,
        0.08624280989170074,
        0.008982994593679905,
        0.022362137213349342,
        0.027672097086906433,
        -0.07224762439727783,
        -0.040473707020282745,
        -0.029354507103562355,
        -0.016001934185624123,
        0.025987131521105766,
        -0.051932189613580704,
        -0.0866934284567833,
        0.024489058181643486,
        0.07734522968530655,
        -0.05517907068133354,
        0.046119410544633865,
        0.04155931994318962,
        -0.07301109284162521,
        -0.004317549988627434,
        0.011236739344894886,
        -0.132710263133049,
        -0.034011974930763245,
        -0.03975718468427658,
        -0.01568649522960186,
        -0.006358490325510502,
        0.010749420151114464,
        0.00808866135776043,
        0.030393073335289955,
        0.11812245845794678,
        -0.020413188263773918,
        0.05317283421754837,
        -0.02252928912639618,
        -0.08727923035621643,
        -0.04817917197942734,
        0.019051088020205498,
        0.03829711303114891,
        -0.04620867595076561,
        0.06150088831782341,
        -0.024227147921919823,
        -0.04604896157979965,
        -0.040354326367378235,
        -0.023897752165794373,
        0.12028061598539352,
        -0.013190451078116894,
        -0.02315867878496647,
        0.0458894744515419,
        -0.0010706661269068718,
        -0.005808650981634855,
        0.024076055735349655,
        -0.11681327223777771,
        -0.034235939383506775,
        -0.036257416009902954,
        -0.006393670570105314,
        -0.026306625455617905,
        0.00818280503153801,
        -0.0819820687174797,
        -0.04733630269765854,
        0.026633920148015022,
        0.10839617252349854,
        -0.03503594174981117,
        -0.011946042068302631,
        -0.020377283915877342,
        0.05020975321531296,
        -0.008540197275578976,
        0.027538346126675606,
        -0.028341107070446014,
        0.02481737546622753,
        0.01788841001689434,
        -0.049627553671598434,
        0.07971986383199692,
        -0.03913741558790207,
        -0.048947710543870926,
        0.006212135776877403,
        0.049812495708465576,
        -0.013092906214296818,
        0.011192203499376774,
        0.006624570116400719,
        -0.09448496252298355,
        -0.08904052525758743,
        -0.059101320803165436,
        -0.02277155965566635,
        0.052143245935440063,
        0.05774259939789772,
        -0.055612947791814804,
        0.08868511766195297,
        0.0002872070181183517,
        -0.001967536984011531,
        0.0036633615382015705,
        0.07417785376310349,
        -0.03365316614508629,
        -0.08367663621902466,
        0.053065329790115356,
        -0.049431513994932175,
        0.09618696570396423,
        -0.03562215715646744,
        0.025793984532356262,
        0.012073811143636703,
        0.008902139030396938,
        -0.045023705810308456,
        0.07190867513418198,
        0.10299745947122574,
        -0.05706401914358139,
        -0.00515199126675725,
        -0.04725729301571846,
        -0.028628399595618248,
        -0.0048092021606862545,
        0.07374294847249985,
        -0.00861505139619112,
        -0.03795885294675827,
        7.021744240291916e-33,
        0.020280679687857628,
        0.173248291015625,
        -0.08646667003631592,
        -0.0003540742618497461,
        -0.04221015423536301,
        0.0735684484243393,
        0.043870724737644196,
        0.06693737208843231,
        -0.04402552917599678,
        0.05248168855905533,
        0.007345345336943865,
        0.02919819951057434,
        -0.0035724956542253494,
        -0.016349760815501213,
        0.06846754997968674,
        -0.0390755720436573,
        -0.02535276673734188,
        0.043029338121414185,
        -0.07351168990135193,
        0.024679824709892273,
        -0.03308217227458954,
        -0.013688561506569386,
        -0.020326662808656693,
        0.022400228306651115,
        0.06691274046897888,
        0.13929356634616852,
        0.030887272208929062,
        -0.06638931483030319,
        0.0174066461622715,
        0.034196604043245316,
        -0.05303201451897621,
        -0.007246633525937796,
        0.06154894828796387,
        -0.014289467595517635,
        -0.025781875476241112,
        -0.0005483363638632,
        -0.09934788197278976,
        -0.03701121732592583,
        -0.03979739174246788,
        -0.026292184367775917,
        -0.0568966269493103,
        0.04995867237448692,
        -0.017298711463809013,
        0.000822609115857631,
        -0.005325191654264927,
        -0.08612865954637527,
        0.003082956187427044,
        0.04880169779062271,
        -0.02936585061252117,
        -0.03290208429098129,
        -0.0029014996252954006,
        -0.07218573987483978,
        -0.0336996354162693,
        -0.09660912305116653,
        -0.09594831615686417,
        -0.015461627393960953,
        0.022644957527518272,
        -0.01382511481642723,
        -0.002724702237173915,
        0.02481924369931221,
        0.03222307190299034,
        -0.03430402651429176,
        -0.05018443241715431,
        0.036036789417266846,
        -0.035829633474349976,
        0.026431415230035782,
        0.01961611956357956,
        0.027730360627174377,
        -0.03036627732217312,
        0.055627912282943726,
        -0.04130183905363083,
        0.03135132044553757,
        0.022160707041621208,
        -0.015763701871037483,
        0.031446851789951324,
        -0.0005768710398115218,
        -0.008594469167292118,
        -0.03293386474251747,
        0.06805893778800964,
        -0.012604276649653912,
        -0.08391992002725601,
        0.030917475000023842,
        0.05346084013581276,
        0.006612725555896759,
        -0.004730278626084328,
        -0.041825681924819946,
        -0.00985004659742117,
        -0.08648868650197983,
        0.010677427053451538,
        0.040986064821481705,
        0.009295821189880371,
        -0.07725027203559875,
        -0.0664130225777626,
        -0.057405680418014526,
        -0.045166924595832825,
        -7.386498667984133e-33,
        -0.05694359540939331,
        0.017270531505346298,
        -0.06863102316856384,
        0.001629931153729558,
        0.046719904989004135,
        -0.06961621344089508,
        0.06454242020845413,
        0.07915955781936646,
        -0.006824348121881485,
        -0.07418227940797806,
        0.029592610895633698,
        0.04444071277976036,
        -0.026989614591002464,
        0.0009919991716742516,
        -0.006151273380964994,
        -0.05219491198658943,
        0.0006911882665008307,
        -0.10196559131145477,
        -0.006155220326036215,
        -0.02800188586115837,
        0.09072130918502808,
        0.03311535343527794,
        0.0974217876791954,
        0.035197626799345016,
        -0.023801779374480247,
        0.0365530401468277,
        0.022256048396229744,
        -0.011899354867637157,
        0.09064466506242752,
        0.02515782229602337,
        0.0034375719260424376,
        -0.05539048835635185,
        0.0260318610817194,
        0.05081511288881302,
        0.033438827842473984,
        0.07368979603052139,
        0.0050246198661625385,
        -0.029452180489897728,
        -0.030989767983555794,
        -0.08947347849607468,
        0.012433984316885471,
        0.09782437235116959,
        0.006967135239392519,
        -0.03727655112743378,
        -0.06326249241828918,
        -0.028858643025159836,
        -0.00703602796420455,
        -0.012560131959617138,
        -0.006428699009120464,
        -0.013491888530552387,
        0.001790227834135294,
        0.017085887491703033,
        0.018459178507328033,
        0.02138608507812023,
        -0.0486910305917263,
        0.012086203321814537,
        0.0336439274251461,
        -0.033675819635391235,
        -0.01581898331642151,
        -0.014359510503709316,
        0.06512288004159927,
        0.01516423374414444,
        -0.08594522625207901,
        -0.05730539187788963,
        -0.019044164568185806,
        0.005008700769394636,
        0.02903996966779232,
        0.05067092552781105,
        -0.03288803994655609,
        0.06345051527023315,
        -0.002888247137889266,
        0.00377834914252162,
        0.03555869311094284,
        -0.0971992164850235,
        -0.004656801465898752,
        0.062298018485307693,
        -0.04033647105097771,
        -0.03541698306798935,
        0.049358416348695755,
        -0.03807640075683594,
        0.025527741760015488,
        -0.08982532471418381,
        0.031017478555440903,
        0.07004409283399582,
        0.10050245374441147,
        -0.027056442573666573,
        0.0018310904270038009,
        0.044055767357349396,
        -0.020793862640857697,
        0.005099083296954632,
        -0.10262870043516159,
        0.015915242955088615,
        -0.023901326581835747,
        0.0736067071557045,
        -0.043504226952791214,
        -6.607343294717793e-08,
        0.0360548198223114,
        0.03306639567017555,
        -0.004485567566007376,
        -0.01548780407756567,
        -0.035355087369680405,
        -0.05347929894924164,
        -0.036597978323698044,
        -0.0338529534637928,
        0.024142252281308174,
        -0.059729792177677155,
        -0.0017653073882684112,
        -0.049710970371961594,
        0.00410118093714118,
        0.07100564241409302,
        -0.008224300108850002,
        0.14539380371570587,
        -0.047523196786642075,
        0.006135964300483465,
        0.016860099509358406,
        0.011660815216600895,
        -0.06415705382823944,
        0.028824813663959503,
        0.033798620104789734,
        -0.006675121374428272,
        -0.024442758411169052,
        0.09486345946788788,
        -0.12803086638450623,
        -0.026736928150057793,
        0.08214399963617325,
        -0.0015621104976162314,
        0.0013799737207591534,
        0.0006535129505209625,
        0.05495668575167656,
        0.048836756497621536,
        -0.041950780898332596,
        -0.043045561760663986,
        -0.035342734307050705,
        -0.014293937012553215,
        0.08044864237308502,
        0.0295268502086401,
        0.04672332853078842,
        -0.0364224798977375,
        -0.007588441018015146,
        0.09788277745246887,
        0.01229041162878275,
        -0.07079333811998367,
        0.03305624797940254,
        -0.16382700204849243,
        -0.0803774893283844,
        -0.06233178451657295,
        -0.06824405491352081,
        -0.01656177267432213,
        -0.07434964925050735,
        0.015028748661279678,
        0.04314273223280907,
        0.0342949815094471,
        0.11367706209421158,
        -0.038316428661346436,
        0.019557228311896324,
        0.08441641926765442,
        0.025944171473383904,
        -0.03163730353116989,
        -0.048105333000421524,
        0.04994108900427818
    ]
}