{
    "id": "vFpmTAigi7M",
    "title": "BlackBerry KEY2 - Does the screen fall off?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-07-23T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=vFpmTAigi7M",
    "category": "Science & Technology",
    "tags": [
        "Blackberry Key2",
        "Blackberry Key 2",
        "Key 2",
        "Key Two",
        "Blackberry",
        "Android",
        "smartphone",
        "best phone",
        "durable",
        "blackberry durability test",
        "blackberry screen fall off",
        "VPN",
        "consumer vpn",
        "online privacy",
        "net neutrality",
        "free the internet",
        "vpn for iphone"
    ],
    "views": 1837563,
    "likes": 40823,
    "comments_count": 2199,
    "description": "Blackberry is here with their newest flagship the Blackberry Key2! Start protecting your internet experience today with 77% off a 3 year plan by using code JERRYRIG at   CURRENT Blackberry KEY2 Pricing:   Last year, with the Blackberry Key1, there was an issue with the screen falling off on the smartphones:  Obviously this is not ideal. Luckily Blackberry was very quick to respond with the Key1 and started adding more adhesive to their screens and fixed the issue:   Will the Blackberry Key 2 suffer the same fate as its predecessor? Does the screen on the Blackberry Key 2 fall off? Is the Key Two screen secure? There is only one way to find out, and thats with the systematic durability tests of JerryRigEverything. Starting with the scratch test burn test   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://NordVPN.com/jerryrig",
        "https://amzn.to/2NDratT",
        "https://youtu.be/mavrdYZPg0Q",
        "https://youtu.be/2J1UgMAPNtw",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRig..."
    ],
    "transcript": "The BlackBerry Key2 is here. This is a retail version I bought myself. Huge thanks to NordVPN for sponsoring this video but more on that later. Last year's KEYone didn't do so well in my durability test. Turns out the screen didn't have enough adhesive on the back and it would randomly fall off. Not just on my phone, but on others in real life as well. Luckily BlackBerry was pretty quick to acknowledge the issue after my video and started gluing their screens on better and offering free replacements to anyone affected. Now we have the Key2 a new and improved Android phone with a full keyboard. But is the screen glued on? There's only one way to find out. Let's get started. [Intro] There aren't many phones out there with full keyboards these days. I used to have a BlackBerry Pearl back in the days of T9 texting. So the keyboard and I do have a fond history, even if I don't currently use one. The keyboard this year on the Key2 is more of a flat matte dry plastic, which I'm a fan of. I think it's better than the glossy rubberized keys from last year's KEYone. Also, the screen glass doesn't wrap around the edges of the phone. The Key2 has flat glass, which I think looks better and is more durable. The back is still the black rubber we've come to expect on BlackBerry phones. And the keyboard still doubles as it's own little track pad controlling the screen. Speaking of which, it's time for the scratch test. I have a set of Mohs picks that differentiate between different minerals and materials. BlackBerry did drop down to a Gorilla Glass 3 on the Key2, which compromises slightly on the shatter resistance, but personally, I feel like Gorilla Glass 3 is slightly harder and therefore slightly more scratch resistant than Gorilla Glass 5. Glass is still glass no matter what version it is. The different variations of glass are just marginally better than each other. This 4.5 inch screen still gets marked up at a level 6, with deeper grooves at a level 7. Up here at the top of the screen, the glass extends all the way to the top of phone protecting the 8 megapixel front facing camera, and also surrounds the earpiece which appears to be made from plastic. The earpiece is very well secured underneath the glass, so unless the screen falls out on it's own, which isn't outside the realm of possibilities with BlackBerry, the earpiece should be solid. The keyboard of the BlackBerry Key2 is my favorite part of the phone. It's unique. It might be argued that keyboards are outdated, but everyone has different preferences and that's what makes the smartphone world awesome there really is something for everyone. We're here for durability though. The flat non-grippy plastic is still scratchable, but I bet typing speed will increase when your thumbs tickle the old ivory since the the rubber isn't there to slow you down. The keyboard letters are printed on top of the plastic and not embedded all the way through like we saw with the Nintendo Switch. The printed keys are more cost effective, just time will tell if they wear off with normal use or not. They keys themselves are pretty awesome. Each individual key is very securely glued to a rubber backing over the circuit board. And judging by how far I can pull them away from the phone without breaking, these are going to last a while. They spring back into place like nothing happened. This phone has no water resistance though. We'll have to see if BlackBerry added any internal protections during my teardown video. The fingerprint scanner is very creatively integrated into the space bar, and surprisingly, does not scratch. The little guy is scratch proof. All the other keys are the normal plastic except for this space bar. Setting up my fingerprint was still pretty flawless and managed to open up the phone every time. I'm impressed. The scratch proof space bar definitely gets a thumbs up from me. The viewing angle does seem a little low on this phone, but BlackBerries have a reputation for being secure, so maybe that's a plan feature and not a flaw. The phone is made from metal though, which is great. 7000 series aluminum and still comes with a headphone jack. The sides are metal which is good. The volume rocker is also metal, although it did feel like plastic initially. And we have our heavily textured power button and a dedicated programmable button on the side. Nice of BlackBerry to leave it open so we can choose what we want to use it for. The SIM and SD card tray are metal. And the bottom of the phone brings our USB-C port all things we have come to expect on a 2018 flagship. Dual cameras are also the norm these days, and BlackBerry did it right with 2 different types of lenses. A normal 12 megapixel camera, and a 12 megapixel telephoto zoom lens. The dual 2 colored LED flash is plastic, but the light is getting diffused anyway, so scratches won't matter if they happen. The BlackBerry drupes are permanently displayed in the center of the phone. If you remember, drupes are what we call the little balls that make up the BlackBerry fruit hence the logo. And each drupe is very solidly secured into the back panel. These guys aren't coming out on their own. It's almost like BlackBerry was ready for me this time around. The back panel itself is made from, as BlackBerry calls it, textured diamond grip non-slip back. I call it rubber molded in the shape of diamonds. Also, fun fact, modern keys, the ones we use today, were invented in 1861. They've been around for almost 160 years. A modern key against this Key2 won't do any damage though. It should hold up against normal abuse, like keys and coins and stuff. BlackBerry is pretty recognized as one of the most secure smartphones, especially back when they had their own operating system. Nowadays, they are still secure on a software level, but against my physical flame, it lasted about 13 seconds. One thing that can make any smartphone or computer more secure is NordVPN...not against flames obviously, but it encrypts your internet traffic from one end to the other. Meaning no one can spy on your phone or computer when you're using Wi-Fi. These virtual private networks can be accessed from your phone or computer and can secure 6 devices simultaneously. NordVPN has over 4,000 severs in 62 different countries. It can redirect your traffic as if it's coming from anywhere. For a totally risk-free trial, you can use the code jerryrig and get 77% off your plan, bringing that final price down to about 2 dollars a month. Www.NordVPN.com/jerryrig. One new feature on the app is called CyberSec, which protects you against advertisements and online threats. Check the video description for links and thanks to NordVPN for sponsoring this video and supporting my expensive hobby. Now let's see if that screen pops off. A bend test gives us a pretty good idea of how well the phones are constructed, revealing any fragile points or kinks in the frame we need to worry about. Even with considerable pressure applied to the back of the phone, the front glass is very solidly intact and still glued in. Same from the rear. The back panel remains secure and in one piece this time around. If phone companies keep making super solid secure smartphones, I'm going to be out of a job as a professional phone breaker. Or maybe it's my job that keeps smartphone companies making solid smartphones. Who knows. From a physical standpoint, the Key2 is a success and passes all my durability tests. Nice work, BlackBerry. If you want to check out the current pricing or give NordVPN a try to secure your Internets, try the links in the video description. Let me know if you have any questions. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "BlackBerry",
        "glass",
        "Gorilla Glass",
        "back",
        "screen",
        "secure",
        "keyboard",
        "plastic",
        "keys",
        "video",
        "BlackBerry Pearl back",
        "phones",
        "BlackBerry phones",
        "scratch",
        "time",
        "pretty",
        "NordVPN",
        "back panel",
        "screen glass"
    ],
    "transcript_entity_values": [
        "a BlackBerry Pearl",
        "8 megapixel",
        "about 2 dollars",
        "7000",
        "6",
        "SD",
        "Wi-Fi",
        "Glass",
        "6",
        "This 4.5 inch",
        "the Nintendo Switch",
        "about 13 seconds",
        "the BlackBerry Key2",
        "12 megapixel",
        "CyberSec",
        "only one",
        "the days",
        "SIM",
        "77%",
        "Last year's",
        "Key2",
        "this year",
        "last year's",
        "2018",
        "almost 160 years",
        "1861",
        "today",
        "KEYone",
        "Android",
        "these days",
        "62",
        "BlackBerry",
        "One",
        "over 4,000",
        "USB",
        "Mohs",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "PERSON",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "TIME",
        "LAW",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.09459102153778076,
        -0.010326571762561798,
        0.05294060334563255,
        -0.06627603620290756,
        -0.024693910032510757,
        -0.0353425033390522,
        0.019827459007501602,
        0.03362175077199936,
        -0.04421883448958397,
        -0.02245846390724182,
        0.11320453137159348,
        0.09662101417779922,
        0.06339973956346512,
        -0.04547736421227455,
        -0.0256981011480093,
        0.010572721250355244,
        0.0018464539898559451,
        -0.03978898376226425,
        -0.027473071590065956,
        0.03188662976026535,
        -0.02844187431037426,
        -0.07556822896003723,
        0.05493193492293358,
        -0.059569548815488815,
        -0.048811063170433044,
        0.02885948307812214,
        0.013078393414616585,
        0.023065654560923576,
        -0.06694090366363525,
        -0.060253869742155075,
        0.0022943143267184496,
        0.04498620331287384,
        -0.05430372804403305,
        0.10069622099399567,
        -0.0574595145881176,
        -0.0572737492620945,
        0.05582902953028679,
        0.01933387666940689,
        -0.023353654891252518,
        -0.041169505566358566,
        -0.06793277710676193,
        -0.010508817620575428,
        -0.000866306247189641,
        0.04008883610367775,
        0.061434708535671234,
        0.017323601990938187,
        0.10784468799829483,
        0.03642362356185913,
        -0.04000001773238182,
        -0.028946423903107643,
        -0.08791659772396088,
        0.04721054807305336,
        0.03200096637010574,
        0.023423055186867714,
        -0.06150941923260689,
        0.08095027506351471,
        0.03938192501664162,
        0.03502989560365677,
        0.06325990706682205,
        0.06879007816314697,
        0.10549459606409073,
        0.042649075388908386,
        -0.05358835682272911,
        0.04713124781847,
        0.05552810803055763,
        0.044642917811870575,
        0.03242618218064308,
        -0.1756797432899475,
        0.02446645125746727,
        0.027408502995967865,
        0.011490873992443085,
        -0.1254643350839615,
        -0.07447679340839386,
        -0.10431405156850815,
        -0.028593191877007484,
        0.03361380100250244,
        -0.06354150176048279,
        -0.0357871949672699,
        0.0046704793348908424,
        0.008364390581846237,
        0.004426486324518919,
        -0.04586094990372658,
        0.004635703284293413,
        0.0058450340293347836,
        -0.057697538286447525,
        0.005785755813121796,
        0.010303689166903496,
        0.06881657987833023,
        -0.055502187460660934,
        0.039524469524621964,
        0.027449607849121094,
        0.04397622123360634,
        0.003879089141264558,
        0.042963966727256775,
        0.042679447680711746,
        -0.07478649914264679,
        0.004276527091860771,
        -0.09277188032865524,
        -0.009641452692449093,
        -0.005208804737776518,
        -0.030549416318535805,
        0.02165808528661728,
        -0.002033648546785116,
        -0.0429629422724247,
        0.06785434484481812,
        -0.00041535947821103036,
        -0.04198996350169182,
        -0.09212448447942734,
        -0.015131122432649136,
        0.04082069545984268,
        0.06894772499799728,
        0.06481271237134933,
        0.013868061825633049,
        0.07407587021589279,
        -0.013861446641385555,
        0.024527594447135925,
        0.05348577722907066,
        0.08724841475486755,
        0.09147913008928299,
        0.022037366405129433,
        0.05839699134230614,
        0.05229124054312706,
        -0.027151979506015778,
        -0.046082135289907455,
        -0.05800464376807213,
        0.01597909815609455,
        -0.07246940582990646,
        2.1400014246673904e-33,
        -0.034318119287490845,
        -0.01169902179390192,
        -0.0752362608909607,
        0.023904580622911453,
        -0.03468681871891022,
        0.07092326134443283,
        -0.007531785871833563,
        0.039825741201639175,
        -0.005664761643856764,
        -0.024989202618598938,
        -0.006449464708566666,
        -0.044799335300922394,
        -0.06200217083096504,
        -0.04418288171291351,
        0.04915624111890793,
        -0.03214006870985031,
        -0.029419679194688797,
        -0.00925872940570116,
        -0.0555647574365139,
        0.020718928426504135,
        -0.009929751046001911,
        -0.05414266884326935,
        -0.03450830653309822,
        0.018897248432040215,
        0.01926371082663536,
        0.06271275877952576,
        -0.0005024512647651136,
        0.02527477964758873,
        -0.0065365685150027275,
        0.021188661456108093,
        -0.059271786361932755,
        -0.04375672712922096,
        -0.002234717132523656,
        -0.022150138393044472,
        -0.02139904350042343,
        -0.010776742361485958,
        0.04151015356183052,
        -0.024394899606704712,
        0.010592123493552208,
        -0.02003806084394455,
        -0.12167016416788101,
        0.021822873502969742,
        0.0694531798362732,
        -0.03517594188451767,
        0.05314245447516441,
        -0.1122460588812828,
        0.01000254601240158,
        0.052351728081703186,
        -0.0002404110273346305,
        -0.05428427457809448,
        0.00726125156506896,
        -0.13550691306591034,
        0.028947781771421432,
        -0.033352576196193695,
        -0.12318070232868195,
        0.016055136919021606,
        -0.004291554447263479,
        -0.03494587540626526,
        0.055365078151226044,
        0.036895185708999634,
        -0.0068521699868142605,
        0.004239166621118784,
        -0.011911669746041298,
        0.009343445301055908,
        0.03005243092775345,
        0.05914394557476044,
        0.03499671444296837,
        0.05769116431474686,
        -0.08080614358186722,
        0.0475032776594162,
        0.03902502730488777,
        0.0027547881472855806,
        -0.00866392906755209,
        -0.016023259609937668,
        -0.037412308156490326,
        -0.004853673279285431,
        0.025059262290596962,
        -0.06981170177459717,
        0.08009897172451019,
        0.039071813225746155,
        0.0005395054467953742,
        0.05945128947496414,
        0.1427975744009018,
        -0.06673555076122284,
        -0.062181852757930756,
        -0.03970865532755852,
        -0.030840503051877022,
        -0.12682297825813293,
        0.03369292989373207,
        0.06735257804393768,
        -0.03945854306221008,
        0.02053515985608101,
        -0.05815697833895683,
        -0.004111041314899921,
        0.03943856433033943,
        -4.0244584589896774e-33,
        -0.04782915487885475,
        -0.07429975271224976,
        0.05369880422949791,
        0.04268782213330269,
        -0.028822334483265877,
        -0.013382834382355213,
        -0.003237224416807294,
        -0.006760224234312773,
        0.006947710178792477,
        -0.04758387431502342,
        -0.039243411272764206,
        0.04607893526554108,
        0.008276077918708324,
        -0.033690065145492554,
        -0.017805105075240135,
        -0.027914714068174362,
        -0.0025394607800990343,
        -0.012658894993364811,
        -0.003225745866075158,
        0.03405175730586052,
        -0.00010283930168952793,
        -0.024190330877900124,
        -0.028593629598617554,
        0.07986873388290405,
        0.050051409751176834,
        -0.003921670839190483,
        -0.012091308832168579,
        -0.04251440241932869,
        -0.010981651954352856,
        0.0020012285094708204,
        0.08843094855546951,
        -0.003373726736754179,
        -0.011515556834638119,
        0.019451964646577835,
        0.03393751382827759,
        0.02241337299346924,
        0.013044378720223904,
        -0.03518929332494736,
        0.029067005962133408,
        0.012798800133168697,
        0.0485837422311306,
        0.10929156094789505,
        -0.029512811452150345,
        -0.027170611545443535,
        0.0487566776573658,
        0.006520870141685009,
        0.08749672025442123,
        0.04277622699737549,
        -0.05272262915968895,
        0.049632661044597626,
        0.03916686773300171,
        0.059398915618658066,
        -0.04031318426132202,
        0.0006867392221465707,
        0.0009579170728102326,
        0.036215782165527344,
        0.00889196153730154,
        -0.00964176096022129,
        -0.00865720771253109,
        -0.050749871879816055,
        0.12556253373622894,
        0.003314160043373704,
        -0.0022443896159529686,
        0.006867585703730583,
        0.02056065946817398,
        -0.023332370445132256,
        0.04635297507047653,
        0.1099490076303482,
        -0.024032430723309517,
        -0.009685775265097618,
        0.051229171454906464,
        -0.08382412791252136,
        -0.0035036257468163967,
        -0.10931932926177979,
        0.06505884975194931,
        0.09140381962060928,
        -0.10658106952905655,
        -0.0009745166753418744,
        -0.0632433295249939,
        -0.013820657506585121,
        0.013490745797753334,
        -0.011844083666801453,
        0.005685488227754831,
        0.02204386331140995,
        0.059849824756383896,
        -0.016784898936748505,
        0.016693074256181717,
        0.0512768030166626,
        -0.05419745668768883,
        0.03812001273036003,
        -0.04614761844277382,
        -0.023960508406162262,
        -0.06378772109746933,
        0.0008279024623334408,
        0.02576688677072525,
        -4.407679199402992e-08,
        0.07409126311540604,
        0.06052625924348831,
        0.03569462150335312,
        -0.06396185606718063,
        -0.07936166971921921,
        -0.03910021111369133,
        0.02146998979151249,
        -0.008351477794349194,
        0.09016206115484238,
        -0.06636114418506622,
        -0.11973629146814346,
        -0.033551618456840515,
        -0.031482696533203125,
        0.01903340220451355,
        -0.034990452229976654,
        0.08779346942901611,
        -0.06340714544057846,
        -0.028913326561450958,
        -0.020554419606924057,
        0.02448144368827343,
        0.02550419233739376,
        -0.004085511434823275,
        0.02651873417198658,
        -0.036851342767477036,
        -0.110973060131073,
        0.04490917921066284,
        -0.09337060898542404,
        0.05234450846910477,
        0.023649899289011955,
        -0.03204132616519928,
        0.03331148624420166,
        -0.019810818135738373,
        0.026024213060736656,
        -0.056365612894296646,
        -0.08007505536079407,
        -0.08766527473926544,
        0.049251068383455276,
        0.0006143970531411469,
        0.11170939356088638,
        0.09180118143558502,
        -0.01877330057322979,
        -0.07333143800497055,
        -0.04555479437112808,
        0.04423941671848297,
        -0.04179206117987633,
        -0.025904623791575432,
        0.1234794482588768,
        -0.014000355266034603,
        -0.07354793697595596,
        0.019477510824799538,
        -0.006690960843116045,
        0.003475758945569396,
        -0.0480436272919178,
        0.0030557585414499044,
        0.03772643581032753,
        0.009187669493258,
        0.07924408465623856,
        0.030096370726823807,
        0.07163947075605392,
        -0.06992127746343613,
        -0.011355756781995296,
        -0.08207838982343674,
        -0.038964707404375076,
        0.01996947079896927
    ]
}