{
    "id": "vfUfSwwhjeg",
    "title": "Can A Gaming Phone Go Mainstream?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2024-01-16T02:00:20Z",
    "video_url": "https://www.youtube.com/watch?v=vfUfSwwhjeg",
    "category": "Science & Technology",
    "tags": [
        "gaming phone",
        "MKBHD",
        "ROG Phone",
        "ROG Phone 8",
        "ROG Phone review",
        "ROG phone 8 review"
    ],
    "views": 1999992,
    "likes": 78781,
    "comments_count": 3691,
    "description": "The flagship gaming phone has made some key changes this year for a high price...  MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds Playlist of MKBHD Intro music:   Phone provided by Asus for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(groovy electronic music) (camera whirring) (electronic buzzing) (switch clicks) - So, one of the best gaming phones on the planet is going mainstream. Like, look at all the previous ROG Phones: ROG Phone 1, ROG Phone 2, ROG Phone 3... Skipped 4 because 4 is bad luck. ROG Phone 5 ROG, Phone 6, and ROG Phone 7. Now, this one is the ROG Phone 8 Pro. This one is noticeably more regular. So ASUS still makes other regular phones, the Zenfone, and ROG still stands for Republic of Gamers. This is very much still a gaming phone. But the thing that makes gaming phones so good at gaming also makes them really good at media and just being all-around really good daily drivers. So ASUS has finally said, \"You know what? \"What if we just package our great gaming phone \"for the masses?\" And I think this is the first one where they've really committed to that idea. Now, don't get me wrong, they still pack in the gamer stuff. There's still a hidden display on the back of the phone and all kinds of crazy specs, but the pivot is real here. So, given the fact that it's still a gaming phone, we are not surprised that it still turns up the specs all the way to the bleeding edge with this 6.78-inch 165 Hz AMOLED display up front that gets to a crazy bright 2,500 nits. It's got a 3.3 gigahertz Snapdragon 8 gen 3 with up to 24 gigs of LPDDR5X RAM and a terabyte of UFS 4.0 fast storage. It smokes Geekbench. It just crushes 3DMark. It can play \"Genshin Impact\" at 60 FPS. Like, this phone is ridiculously fast. Also, opening and moving through apps and just using it like a normal phone is crazy. It's one of the snappiest phones I've ever used. Taking photos is extremely quick from the millisecond your finger touches the shutter button. Even this optical fingerprint reader underneath the glass is surprisingly fast. It's just overall the fastest, like, the most reactive phone I've ever used. So all that is great, and we know it can handle games, but if you're ASUS, how do you now package this as a great daily driver? 'Cause let's be honest, the previous gaming phones were just so gamery. So okay, first things first: It's gotta be more one-handable. Like, yes, you still want a huge display for gaming, and gamers will spend a lot of time with the phone sideways and in two hands, but regular phone stuff happens vertically with one hand all the time. So they've shrunken the bezels all the way around all the sides, and it's pretty noticeable at the top and the bottom, which is now looking on par with other full-screen flagships out there. And that does also mean it's the first time in an ROG Phone that they've ever had a hole punch camera. But it's also a pretty small hole punch, so it looks totally normal. And this also comes at the expense of a little bit of that front-facing speaker space. The speakers are still quite loud and full-sounding stereo front-facing speakers, but yeah, the fact is they're slightly less insane than last year. And then, they also went and made the phone thinner. So they flattened out the frame on the sides, again, similar to some other phones, so the whole thing is slightly more trim, cutting it under nine millimeters for the first time. And it's still, honestly, pretty well-balanced, even with this camera bump that we'll talk about in a minute. But, of course, thinner also means, you guessed it, slightly smaller battery, again, for the first time in an ROG Phone. It goes from 6,000 milliamp hours to 5,500 milliamp hours. To be honest, in using this phone, I haven't really noticed the difference because it's still such a battery champ with all the optimizations ASUS has pulled with the software, with this display, but they did technically make the battery smaller. So the result of all that trimming and sculpting is a phone that it's definitely still big, but it's much closer to a normal-sized phone. It's basically the same size as my Pixel 8 Pro that I've been dailying, but it still has room for the gamery, media-friendly features. Like, there's still a second USB-C port on the side, so you can keep charging while gaming in landscape. Still got the remappable shoulder triggers and the rare headphone jack. And side note, I've been testing a couple in-ear monitors lately and just enjoying using them in all kinds of places, and this is one of the rare phones that I can actually plug it in and use it with. And ASUS throws in a surprising amount of audio adjustment features and a bunch of different profiles and EQ settings that you can play with and make a big difference. And then, hey, if you're gonna use this daily, people are gonna want the confidence of water resistance. Like, real water resistance. Previous gaming phones don't really focus on that too much. ROG Phone 7 was IP54, and that's nice, but this is the first ROG Phone that stepped up to full IP68 water and dust resistance, which is sort of the gold standard of not just getting rained on but, like, you can spill a drink on your phone or drop it in the toilet and actually be totally fine. Now, do we still think this looks like a gaming phone? Honestly, I think they've done a good job. It's a nice balance. Like, they've done a slow ramp of toning it down a little bit over the years and less RGB and jagged lines and screens on the back and all that sort of stuff. Now, with this one, I think the camera bump is the weirdest part, but aside from that, it's pretty subtle. Like, this one, it's a satin black, so it doesn't show any fingerprints. It's got a single diagonal glossy strip, which definitely screams or maybe whispers, \"Gamer,\" but I don't mind it. And then I could probably do without all the text: The \"Republic of Gamers\" text or the \"Good luck, have fun\" text next to the USB-C port. But honestly, this is fine. It's super toned down. But what if I told you there is still a display on the back of this phone? 'Cause there is. They couldn't help themselves. Like, you literally cannot tell when the screen is off where it is. But if you go into the Armoury Crate and turn on AniMe Vision... I don't why it's called that. But the display then lights up, it comes to life. It's this all-white LED dot matrix display that can show all kinds of things, from logos to charging status to incoming call notifications and notification counters, et cetera. Even when you're taking a picture, if there's a countdown timer, it'll do the countdown on the outside screen. Or even when you're gaming, it'll just tell the world that you're playing a game. It is definitely certifiably gimmicky, but I like it anyway for a couple reasons: One, it's still pretty minimal on the back of the phone here. But two, it's actually functional. It's giving you real useful information on the back of the phone. I would say even more than the Nothing Phone. It's customizable, you can go through and make special ones just for whatever use case. And then when the screen is off, you just can't even see it, can't even tell it's there. And on top of all of that, they even made room for the first-ever wireless charging in an ROG Phone. So these gaming phones have always had so much chaos going around on the back of the phone, with these screens and lights, that they never had room for wireless charging, and that was totally fine because gamers just weren't interested. But this time, they've actually made the space for it. One thing I'll say though, the coil is a little higher up here than normal. It's above that little display. And so I think it's a little higher than most other phones 'cause if I put the phone on a vertical wireless charger like this, it actually doesn't line up, and it doesn't charge. But I discovered that if I turn it sideways, it does charge. So you may have to play with that a little bit. And, you know, lots of people don't use wireless charging, and that's fine, but just feels like this is something you have to offer to be considered one of the high-end versatile flagships. Even if you never use that, there's still 65-watt wired charging with the brick that is, yes, included in the box. Now, in previous reviews, I would literally say, \"The camera, it's pretty bad, but it's a gaming phone. \"That's not one of the reasons \"that you're buying this phone,\" and then, so it would just be fine. But in a phone that you want to package and sell as a mainstream phone, that goes from an afterthought to literally one of the most important pieces of this phone. So how did they do? Well, this is an all-new camera system for the ROG Phone. It's a 50-megapixel primary camera, a 3x telephoto for the first time, and a 13-megapixel ultra-wide. It's more hardware than before, but I would say it somehow still feels behind the Zenfone 10, which is also made by ASUS. Like, are those branches of the company even talking to each other? (laughs) This primary camera sensor is an IMX890. It's the same camera sensor that's in the OnePlus 11, and the Nothing Phone 2, and some other phones in the $600-$700 range. And it produces pictures that look kind of like those phones, too. They're decent sometimes in good light, but often a little too much motion blur and a lot too much HDR. Seriously, sometimes, with people as the subjects, it looks like they're just trying to blast the exposure on faces and drag everything else down. It's just very aggressive processing. Like it's running algorithms made for a sensor from five years ago. Now, there are upsides, like the super steady video it's now capable of thanks to the hybrid six-axis gimbal, just like the Zenfone. It means you can shoot slightly better handheld in low light, but it's really smooth video. And the front-facing camera is wider angle, so you can fit more people in the frame, even if it is still kind of HDR-ry. And the telephoto, that's something new that the Zenfone also doesn't have, and that is genuinely useful. If you shoot a lot of zoom, you know, 3x isn't the most zoom in the world, but the stabilization on it is so rock solid, so you can keep punching it with digital zoom. All that's to say it's leveled up, but it's clearly still not the focus of this phone. (chuckles) \"Focus.\" But it's not the strength of this phone, which might just be fine in another $600-$700 phone. But as you may have picked up from my tone and from the rest of the specs in this video, this is not a $600-$700 phone. This is a very flagship phone with a very flagship price. This ROG Phone starts at $1,100. And the spec that I'm reviewing, with the 24 gigs of RAM and the terabyte of storage, this ROG Phone Pro is $1,500. Now, I also wanna point out that you're gonna start noticing AI features with basically every phone that comes out this year with the Snapdragon 8 Gen 3. Like, this is one of the first ones. There's maybe one or two other Snapdragon 8 Gen 3 phones out. But Qualcomm has built in new AI capabilities into that chip, and oh, boy, every manufacturer's got some new AI stuff to play with in their phone. So, for this gaming phone, they've built in some clever things like pattern recognition inside of games to fast forward through recognize scenes in certain supported games or even recognize what's on the screen and prompt you to find a walkthrough of the part of the game that you're in. Now, I found, you know, the smaller stuff like the setting search more useful. It's got more semantic understanding. It can intelligently find the setting you're looking for based on what you write. So even if you type like \"Two of one,\" it knows, \"Oh, you're, you're talking about \"the Twin Apps feature \"that lets you have multiple accounts open \"for one app at the same time.\" But in general, that's just gonna be a theme of 2024 to look out for: AI capabilities of phones with this chip. You can just trust me on this one. So the summary of the ROG Phone (chuckles) is... Look, this is still a very capable, powerful, really fast Android phone, like it always is, and it's just a little more tame looking. Like, they've traded some of their gamery edge for mass appeal. And I think a lot of the decisions were really smart. Like trading some of the basic stuff like thinner bezels and a little bit more of a trim, like, overall form factor and one or two millimeters of thickness for a slightly smaller battery, fine. And I still think, you know, getting the gamer stuff with the display on the back but still having wireless charging and IP68 water resistance, that's great. But the one thing that they couldn't quite get over that hump is the camera system. It's good, but it's not over that hump, and that just happens to be one of the most important things about a mainstream phone. And so this remains a really good gamer phone. Thanks for watching. Catch you guys in the next one. Peace. Your words and things you bought",
    "transcript_keywords": [
        "ROG Phone",
        "Phone",
        "ROG",
        "gaming phone",
        "phones",
        "ROG Phone Pro",
        "previous ROG Phones",
        "gaming",
        "ROG Phones",
        "ROG Phone starts",
        "previous gaming phones",
        "good gamer phone",
        "camera",
        "makes gaming phones",
        "great gaming phone",
        "display",
        "good",
        "time",
        "ASUS",
        "mainstream phone"
    ],
    "transcript_entity_values": [
        "Republic of Gamers",
        "AI",
        "Qualcomm",
        "Genshin Impact",
        "the Nothing Phone",
        "ROG Phone 3",
        "one",
        "Zenfone",
        "UFS",
        "2024",
        "One",
        "the Zenfone 10",
        "nine millimeters",
        "60 FPS",
        "6,000 milliamp hours",
        "five years ago",
        "Two",
        "ROG",
        "8",
        "13-megapixel",
        "ROG Phone 7.",
        "ROG Phone Pro",
        "this year",
        "the years",
        "Android",
        "Gamer",
        "the Armoury Crate",
        "1,100",
        "4",
        "OnePlus 11",
        "600-$700",
        "65-watt",
        "1,500",
        "first",
        "Pixel 8 Pro",
        "USB-C",
        "two millimeters",
        "ASUS",
        "ROG Phone 1",
        "5,500 milliamp hours",
        "the ROG Phone",
        "EQ",
        "Geekbench",
        "RGB",
        "The \"Republic of Gamers",
        "3.3 gigahertz",
        "ROG Phone",
        "50-megapixel",
        "2,500",
        "second",
        "LPDDR5X RAM",
        "RAM",
        "six",
        "ROG Phone 7",
        "jack",
        "ASUS",
        "ROG",
        "ROG Phone 2",
        "two",
        "AniMe Vision",
        "3x",
        "Phone 6",
        "last year",
        "24",
        "6.78-inch 165 Hz AMOLED"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "FAC",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "LAW",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.03850150480866432,
        -0.046341344714164734,
        0.0009702958050183952,
        -0.017197007313370705,
        0.020253734663128853,
        -0.022177809849381447,
        0.032896265387535095,
        0.0937093198299408,
        -0.0426756851375103,
        0.010114608332514763,
        -0.0770503431558609,
        0.09972289204597473,
        0.013364267535507679,
        -0.059407927095890045,
        0.03241175413131714,
        -0.008671768940985203,
        0.10639332979917526,
        -0.08138793706893921,
        -0.0917547345161438,
        0.009807891212403774,
        -0.01021666545420885,
        -0.02697932906448841,
        0.09178603440523148,
        0.022488713264465332,
        0.051369935274124146,
        -0.03239684924483299,
        -0.03266669064760208,
        -0.018085604533553123,
        -0.03087223321199417,
        -0.033855438232421875,
        0.011935035698115826,
        0.12680082023143768,
        0.02466692216694355,
        0.0073239970952272415,
        -0.056062981486320496,
        -0.061135344207286835,
        0.046745121479034424,
        -0.049893569201231,
        -0.06292971223592758,
        0.007946482859551907,
        -0.033756073564291,
        0.007376192603260279,
        -0.030294617637991905,
        -0.03464953228831291,
        -0.0256220530718565,
        -0.11065278202295303,
        -0.018690690398216248,
        -0.06874267011880875,
        -0.022200023755431175,
        0.025038039311766624,
        0.017155613750219345,
        -0.05383596196770668,
        -0.010192287154495716,
        -0.03103957138955593,
        -0.1030116006731987,
        0.08111785352230072,
        -0.0829378291964531,
        -0.009197559207677841,
        0.08158271759748459,
        0.02622721716761589,
        0.06667425483465195,
        -0.03201800584793091,
        -0.05506670102477074,
        0.03710869699716568,
        -0.013926753774285316,
        -0.011189381591975689,
        -0.012951134704053402,
        -0.040072254836559296,
        -0.02866014465689659,
        0.06547227501869202,
        -0.03709401190280914,
        0.023741500452160835,
        -0.006446700543165207,
        0.049997638911008835,
        0.037547964602708817,
        0.10368018597364426,
        0.004091733600944281,
        0.017749739810824394,
        -0.008908252231776714,
        0.023099100217223167,
        0.09121235460042953,
        -0.06316276639699936,
        0.06274058669805527,
        -0.11976862698793411,
        0.04236436262726784,
        -0.019566919654607773,
        -0.05164627358317375,
        0.029637595638632774,
        -0.07468201220035553,
        -0.028403637930750847,
        -0.03838571161031723,
        0.1168607771396637,
        0.07013828307390213,
        0.0031273921485990286,
        0.006038576830178499,
        -0.003521702717989683,
        -0.011818443424999714,
        -0.13163639605045319,
        0.004830101504921913,
        0.03942018374800682,
        -0.017066750675439835,
        0.08075959980487823,
        0.060657650232315063,
        0.016271330416202545,
        0.0301249697804451,
        -0.001239013741724193,
        -0.01843005232512951,
        0.0284307599067688,
        -0.057782456278800964,
        0.022048454731702805,
        -0.08130543678998947,
        -0.030082784593105316,
        0.013655916787683964,
        -0.047412898391485214,
        -0.001268568099476397,
        -0.006507046986371279,
        -0.02846262790262699,
        0.06218738108873367,
        0.0582108236849308,
        0.012003942392766476,
        -0.018577346578240395,
        0.014350147917866707,
        -0.05850202217698097,
        -0.050866540521383286,
        0.06718245893716812,
        0.0983506292104721,
        -0.05171513184905052,
        6.956459488099154e-33,
        -0.020268699154257774,
        0.065976582467556,
        0.05166231468319893,
        -0.03257490321993828,
        -0.09429127722978592,
        0.0016192980110645294,
        0.014568742364645004,
        -0.03242713212966919,
        0.01514759473502636,
        0.03289380669593811,
        -0.026767071336507797,
        0.05576566234230995,
        -0.023803342133760452,
        -0.005149255506694317,
        0.14152655005455017,
        -0.015674090012907982,
        -0.05694836750626564,
        -0.050036314874887466,
        -0.007762832101434469,
        -0.005023330450057983,
        0.04301943629980087,
        0.05091654136776924,
        0.03557537496089935,
        -0.008542035706341267,
        0.020431412383913994,
        -0.006031652446836233,
        0.03288158029317856,
        -0.02467774599790573,
        0.007914485409855843,
        -0.00535186193883419,
        -0.041321586817502975,
        -0.06921403855085373,
        -0.014976420439779758,
        -0.02578325755894184,
        -0.013112017884850502,
        0.0712353065609932,
        -0.05164868384599686,
        -0.08225645869970322,
        0.005451549775898457,
        -0.01537136547267437,
        0.017442170530557632,
        0.043920233845710754,
        -0.12257084250450134,
        0.045253440737724304,
        0.011002245359122753,
        0.03449968248605728,
        -0.024391192942857742,
        -0.06789841502904892,
        -0.05531946197152138,
        -0.009772743098437786,
        -0.09937147051095963,
        0.02165561355650425,
        -0.018874485045671463,
        0.03248812258243561,
        0.00872900802642107,
        -0.0471891351044178,
        0.06908313184976578,
        0.0247501190751791,
        0.04566524922847748,
        0.006778994109481573,
        0.07677178829908371,
        -0.029598277062177658,
        -0.05185265466570854,
        0.017650218680500984,
        -0.03664711117744446,
        0.08325304836034775,
        0.030604928731918335,
        -0.016675565391778946,
        -0.12583096325397491,
        0.029270008206367493,
        0.08959561586380005,
        -0.002088190522044897,
        -0.016665151342749596,
        -0.013681542128324509,
        0.056769274175167084,
        0.008697722107172012,
        0.0039493124932050705,
        -0.06257915496826172,
        -0.006028574425727129,
        0.009069109335541725,
        -0.06691772490739822,
        0.0332118384540081,
        -0.06325699388980865,
        0.03694486618041992,
        0.0006928133661858737,
        -0.014508930966258049,
        0.07370448112487793,
        -0.05965692549943924,
        0.02537950500845909,
        0.06512299925088882,
        -0.08847041428089142,
        -0.057118047028779984,
        0.022113671526312828,
        0.06350518763065338,
        -0.0230393223464489,
        -5.879615194591765e-33,
        -0.08654804527759552,
        0.004115619231015444,
        -0.014392550103366375,
        0.07472053915262222,
        -0.004100525286048651,
        0.0014978644903749228,
        0.058657143265008926,
        -0.0027619607280939817,
        -0.012703804299235344,
        -0.10048577189445496,
        0.028410598635673523,
        0.07833500951528549,
        0.04972267523407936,
        0.015150889754295349,
        0.007192476186901331,
        -0.11138103157281876,
        0.04345007240772247,
        -0.04920075088739395,
        0.10769908875226974,
        0.024492431432008743,
        0.050851304084062576,
        0.04818514361977577,
        -0.03584772348403931,
        0.10874675959348679,
        -0.003820739919319749,
        -0.051294956356287,
        -0.029388289898633957,
        -0.017145473510026932,
        -0.015613098628818989,
        0.01673020049929619,
        0.11573418974876404,
        0.003895168425515294,
        0.0716160386800766,
        0.05261221155524254,
        0.06394113600254059,
        0.012397260405123234,
        0.060670219361782074,
        0.015292134135961533,
        -0.08176036179065704,
        -0.03545563295483589,
        0.005421439651399851,
        0.016034651547670364,
        0.009653103537857533,
        -0.027606995776295662,
        0.09858328849077225,
        0.03623354062438011,
        -0.018794912844896317,
        0.009956044144928455,
        -0.02127978764474392,
        -0.01518109068274498,
        0.06792312860488892,
        -0.027187595143914223,
        -0.016297707334160805,
        -0.04375161603093147,
        -0.06570961326360703,
        -0.01659516431391239,
        -0.024848174303770065,
        -0.11612644046545029,
        -0.055231980979442596,
        0.03741709887981415,
        0.10309834033250809,
        0.0565623939037323,
        0.011457759886980057,
        -0.0467737652361393,
        -0.012379658408463001,
        0.002057331148535013,
        0.05824640765786171,
        0.04079339653253555,
        -0.013694540597498417,
        -0.04059001803398132,
        -0.07127045840024948,
        -0.038566507399082184,
        -0.04280003160238266,
        0.032987330108881,
        -0.005805030465126038,
        0.043427590280771255,
        -0.05170691758394241,
        0.058265767991542816,
        0.0028141906950622797,
        -0.008733256720006466,
        -0.040198616683483124,
        0.022476742044091225,
        0.017682546749711037,
        -0.0063201552256941795,
        0.02412661351263523,
        -0.00017689124797470868,
        0.021946901455521584,
        -0.054427679628133774,
        -0.01824253611266613,
        -0.001044537639245391,
        0.06394752860069275,
        -0.05089271068572998,
        -0.08444575220346451,
        0.049323271960020065,
        0.0205551628023386,
        -4.7759598942320736e-08,
        0.08425068855285645,
        -0.0428067184984684,
        0.05611948296427727,
        -0.0035272412933409214,
        0.01976892538368702,
        -0.08363747596740723,
        0.016010556370019913,
        -0.11043969541788101,
        0.04435932636260986,
        0.06020266190171242,
        -0.01215912215411663,
        -0.09479782730340958,
        -0.0028347140178084373,
        0.020679928362369537,
        0.031108174473047256,
        0.11252227425575256,
        0.03104626014828682,
        0.07771632075309753,
        0.012374002486467361,
        0.0950150117278099,
        0.036245014518499374,
        0.047288719564676285,
        0.07538095116615295,
        -0.0829034298658371,
        0.07439233362674713,
        -0.015052911825478077,
        -0.07032068073749542,
        -0.05739256367087364,
        0.08777826279401779,
        -0.010059052146971226,
        0.06947703659534454,
        -0.020974984392523766,
        0.0740298181772232,
        -0.025369953364133835,
        -0.028376322239637375,
        -0.07037200778722763,
        0.0819544717669487,
        0.027204811573028564,
        0.05217123031616211,
        0.03278081864118576,
        0.02419484406709671,
        -0.057927206158638,
        -0.007703122217208147,
        0.006992273032665253,
        -0.0734383687376976,
        -0.037489473819732666,
        0.02358683943748474,
        -0.09609232097864151,
        -0.022254014387726784,
        -0.02257571741938591,
        -0.04095057398080826,
        0.0134217394515872,
        0.00025073764845728874,
        -0.07517565786838531,
        0.06156659126281738,
        -0.03365950658917427,
        0.038640234619379044,
        0.030725179240107536,
        -0.044352445751428604,
        0.0013040294870734215,
        0.014447628520429134,
        -0.05119861662387848,
        0.026368621736764908,
        0.10314445197582245
    ]
}