{
    "id": "VfUOl_eHIW0",
    "title": "I Got SCAMMED on Etsy",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-02-28T18:09:07Z",
    "video_url": "https://www.youtube.com/watch?v=VfUOl_eHIW0",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 251002,
    "likes": 7655,
    "comments_count": 237,
    "description": "My disappointment is immeasurable, and my day is ruined Sony is in TROUBLE:  You're Too POOR For These:  Razer, WHAT Have You Done?!  The WORST Tech of 2023:  Amazon's WORST PC Scams:   Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Lynaugh  Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 1:01 Hey you big DUMMY 1:54 Motorcycle Spiderman 2:52 Is Spiderman a GHOST?! 3:57 What kind of box is this?! 5:02 So Apropos 6:09 Austin puts on a dress 7:09 Suspicious Looking Cubes 7:55 Triple AAA Games 9:15 A Sweet Note 10:20 Matts FAVORITE Item 11:28 Austin Gets Hypnotized 12:05 Obligatory Pokemon Item 13:12 Was it worth it? 14:05 Last but probably least 15:28 Million Dollar Coin?? 16:58 What do you think?",
    "description_links": [
        "https://youtu.be/bGumK1Brh8M",
        "https://youtu.be/5roFfKoqX50",
        "https://youtu.be/4xL41svihM8",
        "https://youtu.be/mx-NtfD4E4M",
        "https://youtu.be/1HIN4OecBtQ",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Hello and welcome to This Is. Here at Overclock, we've looked at a mystery tech or two. And after almost an infinite amount of episodes, it feels like, we figured, why are we working hard for this? Why can't we let someone else do the work for us? - I mean, that's what I've been doing the whole time. - I wanna delegate to someone else now. (Austin laughs) So we went to Etsy and I ordered just about every mystery box I could find. So there's a handful of themes to these, - Oh, no. Which I'll be honest, I ordered these like two months ago. Okay. - [Aaron] All right. First up. - Okay, that's. - Yeah. - Matt, that's really big. How am I supposed to know what this is? It's just a big generic box. - Every one of these boxes had a very specific theme, except for one. Well, it's not like nicely packaged. It's just a bunch of random (man grunts) here. I think I get the gist of what this one's gonna be. (Matt laughing) Is this a dinosaur mystery box, Matt? - I, no. - No? - It's not. To give you a little backstory, when I ordered these, a lot of the sellers would contact me and say, 'Hey, is there anything particular you'd like in this mystery box?' And I said, 'Hey, you big dummy. (Austin laughs) I'm ordering a mystery box. I want it to be a goddamn mystery.' One star review. - I'm just gonna say we are getting to speed run this video little bit. - Yeah. We are. - Because there are probably a hundred items here. So this is a Jurassic World Dominion, LED nightlight. Note to parents, the Jurassic World film is rated PG-13. - Mm-hmm. - Oh, oh. This is way less cool. It's just a little, tiny LED and then just this thing that clips on the front of it. No. - All right. - No. - All right. Not a great start. - If that didn't tickle your fancy. - [Matt] Oh, it- - How bout a Miles Morales motorbike Spider-Man? This is the first mystery box. They're like 20 more items in this box. Oh my God. - Well, we don't have batteries for it, so it's just like. (glass shatters) (Matt laughs) - Well, it works. That's not good. You ready to be cool like Miles Morales? (motorcycle toy revs) (Matt laughing) That's it?! (motorcycle toy revs) - That's the whole thing. It's literally just two buttons. - Let's redeem this. Let's redeem this. - Let's move on to the next thing. - With a Frozen night light. (Matt and Aaron laugh) - So I will tell you that these are identical. - Well, I dunno what this is. Best Plus. So it's a bunch of little, like red, like curly guys. Sprinkle a small amount of powder into palms and rub through hair and lift into style, matte finish and natural touch. - It's talcum powder that you put in your hair, did not, okay, I'm not gonna do that. - What is this box? Health and sa-. - I know what this box is. - Safe and healthy, disinfecting UV light. How about Hershey's Hot chocolate (beep) - [Robot Voice] Device. - What the, what? What?! So it basically just shows you how to make little chocolatey (beep) - [Robot Voice] Devices. - And in fact, if this is not enough for you how about the world's greatest game? Tic-tac-toe. Matt, I challenge you to tic-tac-toe. - I'm gonna beat you. It, it literally doesn't work. - Does the UV light control Spider-Man? How did he just move? That's legit spooky. Aaron, you saw that, right? The controller was here. He moved from there to there. No one was anywhere near, right? You be Xs, I'll be Os. Let's go. (motorcycle toy revs) K, everyone saw that, right? Everyone saw that? - If this moves again, I'm outta here. - Okay. - [Matt And Austin In Unison] All right. (game pieces tap table) - Cool. Stalemate. (kids cheering sound effect) - [Matt And Austin In Unison] Moving on. - [Aaron} While I'm here. - Well, I've got a Hanes comfort soft T-shirt. That seems like- - I have some sort of blouse. - Blouse? - This a cloak? - Wait, is it though? - It's a dress? - Oh yeah. What? - Do you wanna put it on? - No. This is literally just a white T-shirt. - If you could figure out what's in here, you won't have to keep opening bottom things on this box. - I have no idea. - All right, let's keep going. - If you know in the comments, please let me know, and don't cheat and finish watching the video and then comment. More things? (crash sound effect) A book? Oh, good Lord. What is a book? - The book, Rogue. - There's no rhyme or reason to any of this. A dress. - Ember Hill left. (motorcycle toy revs) It did it. - Dude. - It did it! - It just did it. - You saw it, right? We're, literally no one's anywhere near it right now, okay? - The fact that you haven't figured this out. - Dude, why is it doing that? (beep) Here you go. - This is a melt - Belt, belt. (Matt laughing) - What is, what is that? - A denim jacket. - There's no theme to this. Okay. (motorcycle toy revs) It did it again. - This is a card. It's a card. (Matt and Austin laugh) - It's a birthday card, bro. - It's a happy birthday card. - I- - When I tell you what this is you're gonna be so mad at me. - This is the haunted box. (motorcycle toy revs) Bro. - I'm hoping there's at least one item in here that's okay. But its... - There's not. - I'm not feeling great about. (Matt laughs hysterically) This is so apropos. We're filming this on February 14th, a lovely Valentine's day, and here we have little heart-shaped mirrors, just dozens of them. - No! Matt, do not, do not. - Why is this even a thing? (wobbling sound effect) - Stop that, Matt. You stop that right now. You stop that right now. (Matt laughs hysterically) - It's just whole bunch of rhinestones. Happy birthday, you guys. What do you think is in this box? You're gonna get really pissed off. - Okay? Cause this is the most boring one. This is just Amazon returns. - Okay. That makes sense because I'm like, this is so much actual nonsense. - We can now assemble an outfit out of all the clothes and everything. - Dude, am I'm not wearing enough things? - I feel like you should wear the dress. - You can't see the dress. - Fine. Wear the halter top. (team laughs) - I'm gonna put it on over the jacket, though. So you're just gonna have to watch. - All right, great. Moving on. We're just gonna clear all of this into that other box. - K. (crash sound effect) - So that was an adventure. Now let's go on to the next mystery box. My breathing is constricted. Candy mystery box? Oh wait, this is actually a pleasant, not terrible, stupid thing. We got soda can fizzy candy. - Ooh. - We've got ice cream candy. - Ooh. - There's all kinds of stuff. Now I will say none of this looks, oh, wait, no, I lied. They got the best one. Peach gummies, Warheads Galactic Mixed Cubes. - Ooh. - It is mints or. Oh, it's fizzy. Oh, I see. - Oh. Kind of taste like Sprite, but not quite. But all right. Juicy Drop Gummies. Okay. - Yo, we should do more food videos. We should do like the actual fast food tier list. Subscribe if you want that. This is a bunch of really suspicious looking cubes. - That just looks like charcoal. While you're opening that, what do you think this was? This box was? - Oh, clearly the candy mystery box. - It was not. - Wait, what? - This was a TikTok-themed box. - What? - I swear to God. - There's nothing TikTok about this. - I swear. - Are you sure this is an actual correct box? - Yes. - Wow. Okay. So these could be black hole cherry, cosmic punch, or rocket raspberry. (chewing noise) - Ahhh. (Austin laughs) - Next up we have... - Suspicious. All my teeth are getting blue too. So there's a pile of discs. - Just loose discs. - Motocross Mania for the PlayStation One. Wild West Mini Golf Adventures, Taco Bell. - Which was a Taco Bell game. We've got Once Upon a Monster for the 360, specifically for Connect - Diablo III, baby. - Diablo III for PS3, actually pretty good. We got Jumpstart Numbers for CD-ROM, Windows 95. Daisy Fuentes Pilates. Madagascar Animal Trivia DVD game. I see the receipt here, so I'm just gonna read this. - No. - This is for 29.99, 10 random mystery video game bundle lot box grab bag surprise. - I'm pretty sure he just had like a video game shop that went out of business and it was just for 30 bucks, it's just, I'll give you a whole bunch of games from my collection. - It was also sold at one point at Goodwill for 3.99. I'll play Diablo III for PS3. Although this disc looks like it has been thrashed. Oh, good lord. (instrument chord) Can you see that on camera? - [Team Member] Yep. Okay. You know it's bad when it's scratched so much that the front label is scratched. - What do you think the theme of this one was? - I read it, it's random mystery box. - Okay. You know what? If you're just gonna take some of the fun outta the game, I'm gonna take away your Trolli's. - [Background Sound Effect] They ask you how you are. You just have to say that you're fine, when you're not really fine. - In the meantime, do you wanna guess how much that giant Amazon returns box was? - Oh my God. $100. - $66 - Not good, but actually not that bad. There's a lot of stuff for 66 bucks. - Next up we have, I may have started to open this one. - Hey, I put a lot of love in it. Happy days. The Babysitters Club. - Babysitters Club. Kristy's in for a big surprise in this one, for the record. - There's Aladdin on VHS. How Fetch 90s to Y2K mystery boxes. Post on hashtag, your purchase on Instagram and receive a free gift and shout out on Instagram, After posting and tagging our Instagram. Message with the saying, 'I made fetch happen' to get your free gift. Wow. That's- - Stop trying to make fetch happen. It's not going to happen. - All right, we got all kinds of stuff here. So we got, ooh, we got a little Chucky pen. A little acrylic pen. - They're in a little Toy Story bag, though. - We've got 90210 Beverly Hills Topps cards. - Is this a tr-, oh, we got a troll. We got a little troll toy. - Troll toy. Troll doll. - We got a finger trap. - Ooh. - Oh no, Matt. - We are joined together forever. - Happy Valentine's Day, Matt. - Now I. - You're too good at this. You're supposed to pretend you don't know how to get it out. - You think that's the first time I've been bound up? I know how to get out. This is my favorite though. - Okay. - Oh, do you know what this is? - Yeah. You can rotate it around. You have all the colored pens, all-in-one. - Every color. This right here is worth every penny that we spent on all of this. - Those are some Bottle Pop - Bottle Pop, baby Bottle Pop - This a little Hello Kitty. It looks like a stamper. Yeah. Stamp. Yep. (Matt gasps) Oh, hell, yeah. Let's go. - Fun Dip. - Ow. I wanna test something. - Okay. - I wanna test an urban legend. I'm gonna destroy this. - What? Why would you do that, Matt? - According to Miss on the internet, don't listen to those. If you take this off it is just a measuring tape under here. It's not. I ruined it for no reason. - We've got the Tasmanian Devil, who's very- - Looks like a- - Bobbly. Hair accessories. - [Matt] Oh, perfect. - Which are just How Fetched branded. Oh, also, is this Pinky and the Brain? Yeah, it is. Pinky and the Brain. I actually feel like I have one of these. - Fun Dip. This is, this is. - That's good. - This is the (man grunts) right here. What is this? - This is clearly a 90s/Y2K. It's really a 90s mystery box. - Yeah, this is 90s.You got it. You go one. - How much was it? - I wanna say that this one was like 40 bucks. - Fine. - But look it. I can hypnotize you. (toy spins) You will start making good content now. Oh, wait, you can't do things that are not in your ability. - Oh, okay. Well, we try. - Okay. It says it right here. - There's some good stuff in here. There's some good stuff. I would not be disappointed. Maybe not quite my MO for some of this stuff. Also, this is really uncomfortable on my neck. - Cool. - Ah. - Oh! - Is that a Pokemon theme mystery box? If this is not Pokemon, I'm gonna be very upset. This is literally, it says, Oh! When you stop your Pokemon egg hatches. Okay. - Yeah Pokemon! Yeah! - You thought I was gonna do this and not give you a Pokemon-themed box. - Ah, let's go. All right. All right. All right. So we got ourselves a Togepi. Very thematic, very accurate, but I will say that I am an expert, who is well positioned to determine the value of said box. So I can tell you with a high degree of certainty if this is good or not. You can see, I'll show you on the- - This presenta- This is the only one that's actually had a presentation. - We've got some cards, we've got some confetti, we've got some stickers. This seems very nice. Okay, so first of all, we have a little Poke ball, which I don't, I mean, something's inside. I don't actually, do I just open it? - I feel like the Pokemon chooses you. So. (whooshing sound effect) (punching sound effect) - Ah. - We also have a little horsey and a little Mr. Mime that are way more adorable than they have any right to be. And then we've also got, oh, this is cool. We got a little Pikachu popper. So you got a little popper guy. You can go back and forth. We also, oh, then we have a very cute little Chikorita, a very cute little Chikorita. (Matt gasps) Some cards, which looks like there's one Aerodactyl V, and I'm assuming a bunch of bulk behind it, but we can take a look. So far it's not bad. It's not bad. We also have some extra bits. So we have ourselves a large coin. We have some sleeves and we have two booster packs. One of Silver Tempest, one of Fusion Strike. - Ooh. - So these packs are, I'd say three to four bucks each. Bulk's worth maybe a dollar. It's worth another couple dollars. - Okay, but this Mr. Mime is worth at least $800 or something. - Oh wait, wait, I missed something. There's also a Yu-Gi-Oh! dice, die. So I will say, in my expert opinion, there is about $10 worth of actual stuff here. The box alone, I will say that presentation is pretty solid. I wish, maybe there's a few more packs or something, but this is 20 bucks. I'd say a very worth it 20 bucks, - [Kenzie] 27. - Not great, but not like terrible. At least they're trying to give you something. - But the Mr. Mime. - It's, look, I'm glad that there's a mystery box. This little bit right here. It's pretty good, but 27 bucks, a little bit steep. A little bit steep. I will say though, this Chikorita going on my (indistinct) right now. Just right here. - Right where your heart is. - That's the wrong side for sure. - Okay. Last, but probably least, we have one more box for your entertainment. And I'm gonna, I'm gonna spoil this one a little bit. The theme for this one is just Treasure Chest. - How much was this? And maybe we can determine. - This was a $100. - Woo. - The fact that this didn't come in a treasure chest. - Can I say that this is the exact same tape as the other one? Is this another Amazon return box? - They said it could be anything. - Yes, it is Amazon returns. There are Amazon returns. It is the exact same thing. It's in the same little plastic thing. All right. It's just Amazon returns, Matt. - Are you saying that I got scammed? - Yes. - Are you saying I got defrauded? - Yes, I am Matt. Yes, I am! - [Matt] No! - Frozen LED light, round two. - Are you kidding? Are you kidding me? - No. This came right off the top here. - Are you kidding me? - It's this thing too. (Austin laughs) - I'm just going through to see how many things are the exact same. This is the same as the first box, except there's almost nothing else in the box. Did you sure, you didn't mix up these mystery boxes? Maybe the other one was a hundred bucks and this is 65? - I am sure. - Earbuds, earbuds. $5 gaming glow-in-the-dark headphones. A hundred classic games. - A hundred of 'em. - It's literally the same brand as the tic-tac-toe. - The other box only had one game in it. And you're gonna tell me that this isn't worth more. - Grow your own crystals. - Hello? You can sell those to witches. Okay? - More birthday cards. - Are you sure it's a birthday card? - Yes. An 1884 coin? - 1884. That's vintage. We could go to a pawn shop right now and sell that for $9,000. Oh, this is more birthday cards. (Austin laughs) - You can spin this as hard as you can. - No. - This is literal garbage. - When you see what I have in my possession over here, you will immediately say, 'Matt, you can have another credit card'. Kenzie, how much is this coin and why is it $9,000? - An 1884 silver dollar? - [Kenzie] Well, someone has it on eBay for $950,000. - I was just off by a couple zeroes. - [Kenzie] But according to USACoinBook.com, estimated value, 1884 Morgan silver dollar is worth $33 in average condition. - Okay. I'll just pocket this one real quick. - You can have the $9,000 coin because I got the million dollar item here. - Okay. (boxes crash) - So we have, I'm gonna go through this with you. - Okay. - In the arms of an angel - Wrong, wrong charity. - Horse and dog. Dog and dog. - Pair of puppies - So Rick, and that's also Rick. Kittens, five of them, one's named Rick. Then one's named Rick, it's Clyde, it's Rick, and also Clyde. It's Clyde with a Rick under his paw. Rick and Rick, I know you'd think there would be a Clyde, but the pumpkin declined. We got one last one here in December. You guessed it guys. Jeremy. (Austin laughs) (crashing sound effect) - If you too, would like a million dollar Clyde calendar, subscribe to This Is. Not only can you see wonderful content like this for free, but also, who knows, maybe one day Matt will show up and give you a couple of Clydes and maybe a, what was the other one? - Rick? - Jeremy? - What a deal. I'm gonna subscribe right now. - Like, follow, subscribe and we'll catch you in the next one for more Etsy scam fraud, Clyde, Jeremy? - Yay. (lounge music)",
    "transcript_keywords": [
        "mystery box",
        "box",
        "mystery",
        "Matt",
        "Rick",
        "Yeah",
        "good",
        "Clyde",
        "worth",
        "Amazon returns",
        "Amazon",
        "Pokemon",
        "bucks",
        "Bottle Pop",
        "thing",
        "theme mystery box",
        "stuff",
        "cards",
        "Amazon returns box",
        "Pokemon theme mystery"
    ],
    "transcript_entity_values": [
        "Toy Story",
        "Jurassic World",
        "1884",
        "Aerodactyl",
        "Aaron",
        "the Tasmanian Devil",
        "every penny",
        "20",
        "Pokemon",
        "Y2K",
        "December",
        "One",
        "1884 silver dollar",
        "Mime",
        "Juicy Drop Gummies",
        "TikTok",
        "30 bucks",
        "Silver Tempest",
        "PlayStation One",
        "33",
        "February 14th",
        "Spider-Man",
        "a hundred",
        "Miles Morales",
        "at least $800",
        "this Pinky",
        "Clyde",
        "hundred bucks",
        "these like two months ago",
        "A hundred",
        "Connect - Diablo III",
        "Chucky",
        "40 bucks",
        "Matt",
        "Austin",
        "Daisy Fuentes Pilates",
        "The Babysitters Club",
        "100",
        "65",
        "another couple dollars",
        "just two",
        "27 bucks",
        "3.99",
        "just dozens",
        "first",
        "Instagram",
        "Taco Bell",
        "Pinky",
        "Valentine",
        "Peach gummies",
        "Sprite",
        "Hello Kitty",
        "Babysitters Club",
        "Rick",
        "10",
        "million dollar",
        "eBay",
        "5",
        "MO",
        "9,000",
        "Aladdin",
        "Hanes",
        "Morgan",
        "Kenzie",
        "five",
        "90210",
        "20 bucks",
        "Robot Voice] Devices",
        "66",
        "First",
        "PS3",
        "Etsy",
        "a Yu-Gi-Oh",
        "one",
        "Clyde",
        "Hershey",
        "Togepi",
        "66 bucks",
        "Jeremy",
        "VHS",
        "95",
        "Pikachu",
        "at least one",
        "90s",
        "two",
        "about $10",
        "950,000",
        "Amazon",
        "Best Plus",
        "29.99",
        "Pokemon",
        "Fusion Strike",
        "three to four bucks",
        "Madagascar Animal Trivia",
        "Kristy",
        "a couple zeroes",
        "Rogue"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "GPE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "FAC",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "GPE",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "FAC",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON"
    ],
    "vector": [
        -0.11086423695087433,
        0.03534523770213127,
        0.017456501722335815,
        -0.047776445746421814,
        0.04713503271341324,
        -0.028898682445287704,
        0.1023351401090622,
        0.007273840252310038,
        -0.028586488217115402,
        0.0002645268104970455,
        0.006134123541414738,
        0.03284873813390732,
        0.060002464801073074,
        -0.05193115025758743,
        0.0013246821472421288,
        -0.017720716074109077,
        0.10524152219295502,
        -0.03388933464884758,
        -0.07442771643400192,
        -0.00584539957344532,
        0.002766439924016595,
        -0.0513574443757534,
        -0.027143048122525215,
        0.044898830354213715,
        0.015470878221094608,
        0.08788643777370453,
        -0.028386231511831284,
        0.010381828062236309,
        -0.11824444681406021,
        -0.04669017344713211,
        -0.015746474266052246,
        0.07671897858381271,
        0.019851479679346085,
        -0.0017935337964445353,
        0.016068343073129654,
        -0.05154108628630638,
        -0.01854942925274372,
        -0.06922636926174164,
        0.003613932291045785,
        -0.05583509802818298,
        -0.011831803247332573,
        -0.04564203694462776,
        -0.051032885909080505,
        0.07851734012365341,
        -0.09925894439220428,
        -0.07630797475576401,
        0.032617464661598206,
        -0.02648835815489292,
        -0.00438696937635541,
        -0.011221303604543209,
        0.008920617401599884,
        -0.01478265505284071,
        0.0708870068192482,
        -0.01769493892788887,
        -0.07668115943670273,
        0.029690885916352272,
        0.0007913996232673526,
        -0.028481652960181236,
        0.07562194764614105,
        -0.02278476394712925,
        0.054944928735494614,
        -0.03842087462544441,
        -0.01456031110137701,
        0.036431580781936646,
        0.01859349198639393,
        -0.027768589556217194,
        -0.05823875218629837,
        0.0019055092707276344,
        -0.005876737181097269,
        -0.012750625610351562,
        0.10132412612438202,
        -0.054482895880937576,
        0.04173022508621216,
        0.07802999764680862,
        0.023538002744317055,
        0.009217374958097935,
        0.09405697882175446,
        -0.11782722175121307,
        -0.01371030043810606,
        0.04815381020307541,
        -0.0548953078687191,
        -0.07746785134077072,
        -0.029736075550317764,
        -0.034545060247182846,
        0.01905715838074684,
        0.021587634459137917,
        0.049450378865003586,
        0.072640061378479,
        -0.014202956110239029,
        -0.04279438033699989,
        -0.018044594675302505,
        0.0251607745885849,
        0.07280711084604263,
        -0.02942235767841339,
        0.05709487944841385,
        -0.011877546086907387,
        -0.04483695700764656,
        0.013760576955974102,
        -0.052560169249773026,
        0.06809052079916,
        0.04720953479409218,
        0.05643235146999359,
        0.017547618597745895,
        -0.03346152976155281,
        0.08726594597101212,
        -0.07044517248868942,
        -0.0683620274066925,
        0.04337635636329651,
        0.01069876179099083,
        0.05687691271305084,
        -0.07062895596027374,
        -0.01845666579902172,
        -0.0007428473909385502,
        -0.009990859776735306,
        -0.0005791837465949357,
        0.1147356703877449,
        -0.10085707157850266,
        0.0631033256649971,
        0.05185474455356598,
        -0.024173324927687645,
        0.12167497724294662,
        0.07579424232244492,
        -0.012536601163446903,
        -0.011286148801445961,
        0.039062317460775375,
        -0.0338018462061882,
        -0.03138081356883049,
        3.595912891614212e-33,
        -0.03449474647641182,
        0.10677451640367508,
        -0.04389966279268265,
        -0.02321114018559456,
        0.017082635313272476,
        0.019277147948741913,
        -0.003058865200728178,
        0.08799201995134354,
        -0.046110861003398895,
        0.06261074542999268,
        -0.06935786455869675,
        0.0643487423658371,
        -0.04494911804795265,
        0.049040790647268295,
        -0.06897599250078201,
        -0.004973785951733589,
        0.0037633401807397604,
        -0.021637048572301865,
        0.031968217343091965,
        0.044274475425481796,
        0.017976172268390656,
        -0.01878499798476696,
        -0.0037620041985064745,
        0.006834670435637236,
        -0.031521275639534,
        0.003614995628595352,
        -0.07346934825181961,
        0.0068489317782223225,
        0.14427927136421204,
        0.0234245415776968,
        -0.04271654784679413,
        -0.036650318652391434,
        0.0767706036567688,
        0.0074605075642466545,
        -0.04078328236937523,
        -0.02193441055715084,
        -0.011662868782877922,
        -0.10740114003419876,
        0.005537992808967829,
        -0.0032171551138162613,
        -0.045990899205207825,
        0.0690409317612648,
        -0.09329105168581009,
        -0.024989532306790352,
        -0.015737148001790047,
        0.10204518586397171,
        -0.00508264172822237,
        -0.05290371924638748,
        -0.01908661052584648,
        -0.010003983974456787,
        -0.062135081738233566,
        -0.0019863916095346212,
        0.05240056291222572,
        0.059764545410871506,
        -0.06086033582687378,
        -0.10767454653978348,
        0.036621030420064926,
        -0.047907669097185135,
        0.056220490485429764,
        0.021108470857143402,
        0.08810026198625565,
        0.010438633151352406,
        0.031045563519001007,
        -0.037299368530511856,
        -0.059506259858608246,
        0.0335269533097744,
        0.11296755820512772,
        0.00854024663567543,
        -0.07823722809553146,
        0.05160083249211311,
        -0.01617305912077427,
        0.050720468163490295,
        -0.017325522378087044,
        -0.009650570340454578,
        0.06244232505559921,
        0.01537475548684597,
        0.009554307907819748,
        0.02745981141924858,
        -0.03490245342254639,
        -0.010583056136965752,
        -0.0117736104875803,
        0.0033538041170686483,
        0.0745541974902153,
        0.02106243558228016,
        -0.012043598107993603,
        -0.022360123693943024,
        -0.05330244079232216,
        -0.04299187287688255,
        -0.01376968901604414,
        0.004475846886634827,
        -0.009878630749881268,
        -0.04241257533431053,
        -0.01398060005158186,
        -0.011321837082505226,
        -0.031569112092256546,
        -5.273711774248202e-33,
        -0.05881761759519577,
        -0.05013136938214302,
        -0.003743292298167944,
        0.0732538253068924,
        0.025782635435461998,
        -0.0070578306913375854,
        -0.05164603888988495,
        0.061642419546842575,
        0.04882572218775749,
        0.028483102098107338,
        0.01189796905964613,
        0.041574627161026,
        0.032265931367874146,
        -0.07053493708372116,
        0.06603215634822845,
        -0.05435560643672943,
        0.03660004958510399,
        -0.024262720718979836,
        -0.023479020223021507,
        0.0009364894940517843,
        0.05178547278046608,
        0.11503209918737411,
        -0.06099560484290123,
        0.008986110799014568,
        -0.04408176243305206,
        0.048627518117427826,
        0.03349108621478081,
        -0.053982894867658615,
        0.01216651126742363,
        -0.002353640738874674,
        0.019699400290846825,
        -0.018824748694896698,
        0.0030230353586375713,
        0.07774530351161957,
        -0.004196398425847292,
        0.02984348125755787,
        0.030711371451616287,
        0.008511282503604889,
        -0.02644691802561283,
        -0.07602407038211823,
        0.029855649918317795,
        0.0297926627099514,
        -0.037380948662757874,
        0.04450170323252678,
        -0.07945968955755234,
        -0.10169816762208939,
        -0.07206734269857407,
        0.005096872337162495,
        0.08125651627779007,
        0.03750636801123619,
        -0.05613557621836662,
        0.018958495929837227,
        -0.02404971793293953,
        -0.013774103485047817,
        -0.1253766566514969,
        0.04940228536725044,
        -0.0897165983915329,
        0.011572159826755524,
        0.09035641700029373,
        0.013343759812414646,
        -0.014484615065157413,
        0.04157088324427605,
        -0.05389300733804703,
        0.02157261036336422,
        -0.029427768662571907,
        -0.028527120128273964,
        0.061801500618457794,
        0.015568473376333714,
        -0.038046468049287796,
        -0.04518949240446091,
        0.03020140342414379,
        0.049508921802043915,
        -0.096332848072052,
        -0.03212963044643402,
        0.00618047546595335,
        0.10059918463230133,
        -0.004178999457508326,
        -0.04477739706635475,
        0.018254203721880913,
        0.013754930347204208,
        0.057250529527664185,
        0.02568662539124489,
        0.0721624568104744,
        0.043553389608860016,
        0.09849213063716888,
        0.01721082255244255,
        -0.007223347667604685,
        0.021093683317303658,
        -0.0459899865090847,
        -0.030917538329958916,
        -0.04286517575383186,
        -0.04698147997260094,
        -0.016164453700184822,
        0.11059772223234177,
        0.002185738878324628,
        -7.173151317374504e-08,
        0.027640778571367264,
        -0.04365253448486328,
        0.02500145137310028,
        0.007695237640291452,
        0.08930302411317825,
        -0.01859259232878685,
        -0.03932740166783333,
        0.07802987843751907,
        0.015257583931088448,
        0.05454230308532715,
        -0.015488691627979279,
        -0.02502470463514328,
        -0.17217831313610077,
        -0.047659311443567276,
        0.003718289313837886,
        0.0024428335018455982,
        -0.050133977085351944,
        -0.0013321578735485673,
        -0.02082039974629879,
        -0.06150214001536369,
        0.008200927637517452,
        0.06843888759613037,
        0.011458681896328926,
        -0.09605664014816284,
        -0.053257547318935394,
        -0.014265758916735649,
        0.006452448666095734,
        0.0722784772515297,
        0.0370318777859211,
        0.04862510412931442,
        -0.009662535041570663,
        -0.06534865498542786,
        0.008294323459267616,
        -0.02336660400032997,
        -0.05475172773003578,
        -0.05662107095122337,
        -0.009345296770334244,
        -0.0005749308038502932,
        0.03026191145181656,
        -0.023724226281046867,
        0.02430640533566475,
        -0.13228826224803925,
        -0.01603621616959572,
        -0.0097510339692235,
        -0.04941343516111374,
        -0.05028246343135834,
        -0.07657811045646667,
        -0.12861061096191406,
        0.03704356402158737,
        -0.08428265899419785,
        0.007175595033913851,
        -0.05487728491425514,
        0.02410528063774109,
        0.020817916840314865,
        0.06022436171770096,
        -0.05831646919250488,
        -0.008727437816560268,
        -0.009261736646294594,
        0.044838689267635345,
        0.006899971980601549,
        0.07438023388385773,
        -0.12523844838142395,
        -0.03220081329345703,
        0.0471348874270916
    ]
}