{
    "id": "vg5JtiC9vC8",
    "title": "The New MacBook Pro Has a NOTCH (Let's Talk) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-10-19T00:17:40Z",
    "video_url": "https://www.youtube.com/watch?v=vg5JtiC9vC8",
    "category": "Science & Technology",
    "tags": [
        "The New MacBook Pro Has a NOTCH (Let's Talk) - Krazy Ken's Tech Misadventures",
        "MacBook Pro",
        "2021 MacBook Pro",
        "M1 Pro",
        "M1 Max",
        "Apple Silicon",
        "Mac",
        "macOS",
        "MacBook",
        "MacBook Pro Notch",
        "Apple",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Computer",
        "Computer Clan",
        "iPhone",
        "Promotion",
        "Liquid Retina XDR",
        "First Impressions",
        "Reactions"
    ],
    "views": 32697,
    "likes": 1739,
    "comments_count": 512,
    "description": "Apple's new 2021 MacBook Pro has an all-new design, new (old) features, and a NOTCH?! Is that gonna be a problem? Let's talk Check out our rare tech playlist   Download our epic wallpapers   Watch our tech scam-busting episodes    Support our channel and get cool stuff   Follow us on Twitter   Like us on Facebook   Subscribe and listen to our podcast     Patrons got to see this episode early! They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   0:00 Introduction 0:47 Overview and Specs 2:15 New (and Returning) Features! 3:03 New Keyboard (No More Touch Bar!) 3:36 Visual Design Changes 4:45 Bad-Ass New Display 5:31 The Notch (The Elephant in the Room) 7:50 And the Rest!  Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan3zlKXX9",
        "https://thecomputerclan.com/wallpapers",
        "https://bit.ly/clan3o1EdZ2",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://applekeynotechronicles.transistor.fm",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- So Apple's brand new MacBook Pro has a notch. Let's talk about that. (upbeat music) Hey, guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And today Apple released the brand new MacBook Pro. I'm still using an eight-year old MacBook Pro. So as you could probably imagine, I've been waiting a long time for this. So let's talk about it. Talk about the features, and the specs, and that notch. That was kind of a last minute rumor that popped up yesterday and, well, it's real. Also, I did purchase the new MacBook Pro, so subscribe and stay tuned. I will test it out in person in a few days when I can get it. So the short of it is there's two sizes, 14-inch and 16-inch, and you can get them in space gray or silver, and they're not using Intel chips anymore. They are Apple silicon based. And with that, they're using the new M1 Pro and M1 Max, which are leaps and bounds faster than their previous generation Intel counterparts. But performance isn't the only thing that's important here. Steve Jobs talked about this a lot, it's performance per watt. So they can run with really great energy efficiency, which means less heat, less fan noise, and more battery life. So on the 16-inch, we're looking up to 21 hours of video playback in the battery life, which is way more than I thought it was gonna get. But we're also looking at 3.7 times faster CPU performance, and 13 times faster graphics performance than what it's replacing. A little more details on that. Here's the Pro, here's the Max. Love the purple colors. Steve Jobs would appreciate that. We have 7.4 gigabytes per second for the SSD speed. And with the memory bandwidth, we're talking 400 gigabytes per second. And it is unified memory, so data doesn't have to be copied through interfaces that could bottleneck things to other components and stuff like that. It's all grouped together in this Apple silicon chip. And in terms of cores, we're looking at up to 10 cores on the CPU side and 32 cores on the GPU side, up to 64 gigabytes of unified memory. And, again, that memory bandwidth is 400 gigabytes per second, really fast. So that's the barebones specs. You know, we'll test this in person soon, but on paper, that sounds pretty beefy, especially with that incredible battery life that you're getting. But the things I'm most excited about are the new design and features. Specifically Apple backpedaling a little bit, you know, with the ports, for example, Apple went all USB-C Thunderbolt 3 earlier. And I was a little disappointed about that, 'cause you need a lot of conversion technology to adapt all your stuff. But on my older system, I still have all the ports I know and love. And, thankfully, Apple went backward and did that with this new MacBook Pro. So not only does it have that newer design with the flat edges and all that, but MagSafe is back with MagSafe 3, and we get Thunderbolt 4, still got a trusty headphone jack on there. And SDXC, so the SD card slot is officially back. And HDMI, you ever plug it into a TV or an HDMI monitor, you don't need to carry around a dongle anymore. The HDMI port is built right in. So I'm super glad Apple put those ports back on there, thank you. And also no more Touch Bar. I know some people like the Touch Bar. Let me know if you guys did. Personally, I didn't really like the Touch Bar. I think it's something I could have gotten used to if I had to, but I prefer the physical keys. And in fact, they did go back to that, and they made the keys full height as well. So you have those traditional, familiar, physical function keys with the special media controls, and brightness controls on there, and Touch ID, which is super nice for me. That's not anything particularly new to a Mac laptop, but for me on this eight-year old system, I don't have Touch ID. So that'll be nice to have on there going forward. And looking at the front with the screen open, you can see it kind of looks thicker visually. But according to the specs, the 16-inch model is actually only .02 inches thicker than the one that's replacing. So it's not that thick. It's actually, just mental measuring in my head, it's not thicker than this. But the feet do look a little more pronounced, which I think is an interesting thing. I'm not 100% sure why they did that design change, I don't know, maybe it helps with thermal control air flowing underneath. But either way, I think it looks okay. Some people may be quick to judge the design like they were with the white bezels on the iMac. But I tell you, you gotta see this stuff in person to get a much better idea as to how it really looks. Because even I thought the new iMac was okay looking, but when I saw it in person I was like, \"Whoa, this is much cooler.\" And one way you can kind of get that experience, without physically going to get your hands on the product, is you can use the AR on Apple's website with your iPhone or whatever, and you can actually simulate what the product looks like in your house, which is pretty cool. So new design, the ports are back, the Touch Bar is gone, thank goodness. It's Apple silicon, so it's super fast, and incredibly efficient on the battery life. So now let's talk about the elephant in the room, the notch, and more specifically the display as a whole. So it is a Liquid Retina XDR display, which means it is HDR compatible. 1,000 nits sustained brightness. The iMac that I currently use has 500 nits, and this has 1,000. And it's using that mini LED technology like we see in the newer iPad Pro. And one thing I wasn't really expecting, but I'm really happy about is Pro Motion, so you can have a refresh rate up to 120 Hertz. Like this is currently 60. Now you're watching me at 24 frames per second, but the screen will actually refresh at 60 frames a second. This new one will refresh at 120. But it will adapt as necessary, so it's not killing your battery life. And Apple specifically mentioned, for video pros, you can set a manual refresh rate if you have to. So it's cool that they left that in there. And, yes, I've been putting it off enough, right? Okay, you want me to talk about the notch probably. So let's talk about that. What's the deal with the notch there? So this was kind of a last minute rumor. I mean, sort of. Other people, like Rene Ritchie, were saying, \"The notch is gonna come,\" for a while. But I don't think people were really, really, really talking about it until just super recently. And I wasn't sure if they were gonna do it or not, but they did just like on the iPhone 10. And, honestly, I use an iPhone and the notch does not bother me. I don't notice it's there. So I know some people are probably gonna think, \"Oh, that's crazy ugly. Why would you put a notch in the display?\" Well, I thought, \"Well, hey, it's nice for the Face ID and stuff, right?\" We thought maybe Face ID would be on there where it could scan and unlock your computer with your face. But actually that's not even on there, there is no Face ID. It is an upgraded webcam, which is nice, but there's no other features really in that notch other than just the webcam. So was it really worth it to put that notch there just for a camera? Well, maybe. So some people may initially say the notch is annoying or it looks kind of stupid. But here's the thing, it makes the product stand out more in my opinion, because most laptop displays are just a rectangle. So this I think helps it stand out a bit. It's the purple cow, if you will. But the other thing is too, you know, it's semi-controversial to some people so it's gonna get more people talking about this product, and that works to Apple's advantage. It's like all press is good press. So even if people are saying bad things about the notch, the thing is, they're still talking about the product, which for Apple is good news. But here's the more technical reason as to why I think the notch is great. It really hit me when I looked at these images side-by-side and I saw the previous generation compared to the newer ones. Yes, there's that notch in there, but you get so much more screen real estate. The bezels are so much thinner. So, yes, you have this little bit of space that's being taken up, but look at how much you used to have taken up with these thicker bezels and everything. You can now get so much more space on your screen just by sacrificing that notch, which in my opinion is totally worth it. And more importantly, if future technologies and features come out, like Face ID, now the space is there for Apple to put that in. So it's kind of like a future-proofing thing. Because this is a really rich display, when the pixels are off the blacks are really black. So when you take an app in full screen mode, you'll see that software wise, this area is just filled out with black and the notch essentially disappears. And then it kind of looks like a traditional bezel, but you still get those really thin bezels on the side. Also, another interesting thing I noticed is they went back to removing the MacBook Pro badge from the front it's now underneath on the bottom. Just kind of like what they did with this model, except it's bigger, so I thought that was an interesting design change. So let's talk about cost. In the US, the prices are 1999 for the baseline configuration for the 14-inch, and 2499 for the baseline configuration for the 16-inch. Which honestly, especially considering my laptop is eight years old, that was plenty for me. So now just for fun, let's max it out and see how much it costs. So the cool thing is all of the ports are available on both sizes, so Apple's not skimping out there. So we have all the ports. We have, let's go with the 64 gigabytes of memory. The most expensive part is gonna be the storage. I personally don't need more than a terabyte, but that is gonna be the most expensive part. So now we have 64 gigabytes of unified memory, eight terabytes of storage, the big display, all the ports, and 10-core CPU, with the 32-core GPU, and 16-core Neural Engine. So all together that's $6,099 before tax. That's the max price. But if you don't really need all that storage, you can get the fastest MacBook Pro, with all the features and one terabyte of storage, for 3899. I really think Apple brought the MacBook Pro back. It's been a little disappointing to me lately, and they really delivered here. They ticked all the boxes on my wishlist. I was thinking maybe Face ID would be nice, but I don't care that that's not in there. So, personally, they checked everything off and I think they just totally blew me away. The battery life lasted way longer than I could have hoped for. But let me know what you guys think about this new MacBook Pro. Let me know your thoughts, and if you're interested in buying one. And, again, stick around, 'cause I would love to test it in person and make a future episode when it arrives to my lovely lair. And feel free to subscribe for more tech episodes coming out all the time. I love doing episodes about rare and retro tech, new tech, and of course, scam tech. And, hey, if you liked this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "MacBook Pro",
        "Apple",
        "Pro",
        "notch",
        "Touch Bar",
        "MacBook",
        "thing",
        "Apple silicon",
        "Touch",
        "people",
        "MacBook Pro back",
        "battery life",
        "Face",
        "kind",
        "ports",
        "talk",
        "back",
        "gigabytes",
        "memory",
        "battery"
    ],
    "transcript_entity_values": [
        "Face",
        "13",
        "only .02 inches",
        "6,099",
        "eight-year",
        "32",
        "400 gigabytes",
        "the MacBook Pro",
        "3899",
        "Thunderbolt 4",
        "14-inch",
        "the AR on Apple's",
        "24",
        "10",
        "two",
        "Apple",
        "max",
        "Rene Ritchie",
        "SSD",
        "Touch ID",
        "1,000",
        "iPad Pro",
        "eight terabytes",
        "7.4 gigabytes",
        "16-inch",
        "up to 21 hours",
        "one terabyte",
        "GPU",
        "SDXC",
        "500",
        "Mac",
        "Krazy Ken",
        "Hertz",
        "Pro Motion",
        "100%",
        "M1 Pro",
        "64 gigabytes",
        "jack",
        "CPU",
        "SD",
        "webcam",
        "US",
        "one",
        "more than a terabyte",
        "Steve Jobs",
        "Max",
        "MacBook Pro",
        "the Touch Bar",
        "eight-year old",
        "60",
        "iMac",
        "2499",
        "iMac",
        "a few days",
        "3.7",
        "MacBook Pro",
        "16",
        "iPhone",
        "M1 Max",
        "yesterday",
        "120",
        "Intel",
        "second",
        "60",
        "eight years old",
        "MagSafe 3",
        "up to 10",
        "1999",
        "HDMI"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.08438585698604584,
        -0.06491005420684814,
        0.06569056212902069,
        -0.10543301701545715,
        0.0290986355394125,
        0.019171537831425667,
        -0.009617765434086323,
        0.014392000623047352,
        -0.03436603397130966,
        0.05291100963950157,
        0.03145765885710716,
        0.043005332350730896,
        0.013023143634200096,
        -0.08214335143566132,
        0.06815530359745026,
        0.04201194643974304,
        0.03786361962556839,
        -0.10124343633651733,
        -0.0011141874128952622,
        0.05538361519575119,
        -0.04632166773080826,
        -0.07499520480632782,
        -0.03994456306099892,
        -0.011132225394248962,
        0.008758630603551865,
        0.005057430360466242,
        0.02800641767680645,
        0.014767201617360115,
        -0.053614672273397446,
        -0.07750439643859863,
        -0.028575584292411804,
        0.006005587987601757,
        0.04692468419671059,
        -0.001356898108497262,
        -0.0015796192456036806,
        -0.07547062635421753,
        0.10701991617679596,
        -0.019255824387073517,
        -0.0790211632847786,
        -0.08559650182723999,
        -0.09102347493171692,
        -0.030713872984051704,
        0.0045041353441774845,
        0.10493442416191101,
        0.05667455494403839,
        0.006954818032681942,
        0.04183110222220421,
        -0.06915348023176193,
        0.017628783360123634,
        0.021018054336309433,
        -0.03172999247908592,
        -0.10331373661756516,
        0.040076639503240585,
        -0.016835056245326996,
        -0.004127142485231161,
        0.07407841831445694,
        0.03523649275302887,
        -0.04455181211233139,
        0.10087238252162933,
        0.029438190162181854,
        -0.0018656005850061774,
        -0.10052003711462021,
        -0.0403464175760746,
        0.047407012432813644,
        0.040735356509685516,
        -0.03693336620926857,
        0.022689368575811386,
        -0.006542292423546314,
        0.0031390993390232325,
        -0.010860871523618698,
        0.011980434879660606,
        -0.010080307722091675,
        0.05956166610121727,
        0.0164595078676939,
        0.0008950066985562444,
        0.007021886296570301,
        -0.019283846020698547,
        -0.0613948293030262,
        0.06130930036306381,
        -0.007658057846128941,
        -0.05768956243991852,
        0.013697214424610138,
        -0.03248203545808792,
        -0.0216823760420084,
        -0.018672533333301544,
        -0.03823399543762207,
        -0.03128766641020775,
        -0.09237450361251831,
        -0.07511746138334274,
        0.0007858647732064128,
        -0.01597241871058941,
        0.0044537317007780075,
        0.07513261586427689,
        0.013515490107238293,
        -0.008707065135240555,
        -0.035434335470199585,
        0.0017495577922090888,
        -0.054350078105926514,
        -0.020119965076446533,
        0.041350964456796646,
        -0.06145629659295082,
        0.0513542965054512,
        0.0751589760184288,
        -0.07743378728628159,
        0.04722156375646591,
        -0.008753137663006783,
        0.0154530955478549,
        0.03876236453652382,
        -0.028293617069721222,
        0.025208139792084694,
        0.014426770620048046,
        -0.01611890271306038,
        -0.011096461676061153,
        0.008620144799351692,
        0.05620292201638222,
        0.06257551163434982,
        -0.0288001149892807,
        -0.0005523475119844079,
        0.15011166036128998,
        -0.025744333863258362,
        0.046399060636758804,
        0.020158912986516953,
        -0.047818247228860855,
        -0.020009402185678482,
        -0.010366937145590782,
        0.045483872294425964,
        -0.028408346697688103,
        5.411771381700372e-33,
        0.03651605173945427,
        0.029451074078679085,
        -0.0991535559296608,
        0.0756174698472023,
        0.07444587349891663,
        0.014804943464696407,
        -0.041662413626909256,
        0.01680859923362732,
        -0.05256907641887665,
        0.00906817615032196,
        -0.034954238682985306,
        -0.02326647937297821,
        -0.03006158210337162,
        0.0381159745156765,
        0.06927385181188583,
        -0.0684962347149849,
        -0.019514473155140877,
        -0.028277559205889702,
        -0.050104133784770966,
        0.055866535753011703,
        0.03817809000611305,
        -0.03381151705980301,
        -0.002536601386964321,
        -0.03376409783959389,
        -0.005166932474821806,
        0.08084889501333237,
        0.06762494891881943,
        -0.03612886369228363,
        0.046379029750823975,
        0.031573593616485596,
        -0.16828128695487976,
        0.007073693443089724,
        -0.0087966313585639,
        -0.08913849294185638,
        0.00035269843647256494,
        -0.01697215624153614,
        0.0325736328959465,
        -0.046057943254709244,
        0.020738450810313225,
        -0.006758248433470726,
        -0.075238898396492,
        -0.004774052649736404,
        -0.0907573476433754,
        -0.06614866107702255,
        0.028500493615865707,
        -0.011554860509932041,
        0.05057240277528763,
        0.03516672924160957,
        -0.030357196927070618,
        0.026334960013628006,
        -0.04561659321188927,
        0.0057228258810937405,
        0.04945126548409462,
        0.029504459351301193,
        -0.08927758038043976,
        -0.07165692746639252,
        -0.03275550901889801,
        -0.002384043065831065,
        0.13197223842144012,
        0.06603848189115524,
        0.06914351135492325,
        0.06521466374397278,
        0.058551691472530365,
        0.0441749170422554,
        -0.006853031925857067,
        0.10847488790750504,
        0.08880120515823364,
        0.08005857467651367,
        -0.029733268544077873,
        0.012226349674165249,
        -0.030333254486322403,
        -0.05066397786140442,
        0.00873480923473835,
        -0.06768254190683365,
        -0.06457916647195816,
        0.0058621871285140514,
        -0.07860827445983887,
        -0.042865850031375885,
        -0.01050355564802885,
        0.02310044877231121,
        0.046408701688051224,
        0.03617485612630844,
        0.05584448575973511,
        0.036199599504470825,
        0.058303557336330414,
        0.0332849882543087,
        0.0550815686583519,
        -0.025367839261889458,
        -0.04125373810529709,
        0.011932912282645702,
        -0.030161038041114807,
        -0.019278017804026604,
        0.05677809566259384,
        0.0916118323802948,
        -0.06019476428627968,
        -6.518633392823946e-33,
        0.02768276073038578,
        -0.041532132774591446,
        -0.0013168283039703965,
        -0.010263984091579914,
        -0.015202166512608528,
        0.047779958695173264,
        0.039476778358221054,
        0.04296056553721428,
        -0.019679656252264977,
        -0.033500298857688904,
        0.050801247358322144,
        0.04866958037018776,
        -0.10669447481632233,
        -0.041106004267930984,
        0.03292318806052208,
        -0.02576744370162487,
        -0.10078944265842438,
        -0.019971927627921104,
        -0.06664231419563293,
        -0.03541933745145798,
        0.08576157689094543,
        -0.0353437215089798,
        -0.08414576947689056,
        0.04070986062288284,
        0.033566899597644806,
        0.006965254433453083,
        0.011074505746364594,
        0.020419010892510414,
        -0.02466971054673195,
        0.008933606557548046,
        0.00528071029111743,
        0.04172201082110405,
        -0.039524637162685394,
        0.0102987764403224,
        0.09401024878025055,
        -0.0002095742675010115,
        0.02713095396757126,
        0.0013022993225604296,
        -0.010023921728134155,
        -0.025838693603873253,
        0.10298088937997818,
        0.01764061115682125,
        -0.026740215718746185,
        0.005736711900681257,
        0.03360246866941452,
        0.02750113047659397,
        -0.026405049487948418,
        -0.012859046459197998,
        -0.01942216046154499,
        -0.0533151850104332,
        -0.026105346158146858,
        0.00558884022757411,
        0.03869400918483734,
        -0.05582381412386894,
        -0.09385088086128235,
        -0.007560469675809145,
        -0.04237477853894234,
        0.05593666434288025,
        0.06995707005262375,
        0.012595093809068203,
        -0.01575927436351776,
        -0.041382722556591034,
        0.04030981287360191,
        -0.07795344293117523,
        0.10872553288936615,
        -0.017605114728212357,
        0.016305726021528244,
        -0.003424304071813822,
        0.008206211030483246,
        0.03609039634466171,
        0.001190739800222218,
        0.019426921382546425,
        -0.0920821949839592,
        -0.11304968595504761,
        0.01838761940598488,
        0.0867823138833046,
        0.08496784418821335,
        -0.05601925402879715,
        -0.041019584983587265,
        0.05105245113372803,
        3.825733801932074e-05,
        0.03787527605891228,
        0.07018141448497772,
        0.01340397261083126,
        0.06058795377612114,
        0.07463274151086807,
        -0.007515545003116131,
        0.048899609595537186,
        -0.056413937360048294,
        -0.02009272389113903,
        -0.07276841253042221,
        -0.04669040068984032,
        -0.07701270282268524,
        0.02649996057152748,
        -0.07619022578001022,
        -6.194743917831147e-08,
        -0.028429623693227768,
        0.04495905712246895,
        0.019691498950123787,
        0.02813080884516239,
        0.028740040957927704,
        -0.06344044208526611,
        -0.04385751858353615,
        -0.05024212598800659,
        0.0415835827589035,
        0.030530912801623344,
        0.03667878732085228,
        -0.055020906031131744,
        -0.08980756253004074,
        0.041875697672367096,
        0.043248385190963745,
        0.062447018921375275,
        -0.05269360542297363,
        0.11349683254957199,
        -0.05981690064072609,
        -0.07007178664207458,
        0.026711050420999527,
        0.028656955808401108,
        0.09810562431812286,
        0.020649656653404236,
        -0.08206018060445786,
        -0.0293321181088686,
        -0.05217063054442406,
        0.07272868603467941,
        0.040813177824020386,
        -0.013554601930081844,
        -0.0651777982711792,
        0.001909857615828514,
        -0.02532603219151497,
        -0.02422645315527916,
        0.06604113429784775,
        -0.08084931969642639,
        -0.05227718874812126,
        0.08835791796445847,
        0.047710027545690536,
        0.03234513849020004,
        -0.03735382854938507,
        -0.14466194808483124,
        -0.017624381929636,
        0.02375122345983982,
        -0.06747609376907349,
        0.007486207876354456,
        -0.009438150562345982,
        -0.009498822502791882,
        -0.04837743937969208,
        0.026837293058633804,
        0.0013746622717007995,
        0.028295090422034264,
        0.017355237156152725,
        0.01202833279967308,
        -0.025260308757424355,
        0.09120450168848038,
        0.040377549827098846,
        -0.006675387732684612,
        -0.021972130984067917,
        0.014255478046834469,
        0.10051753371953964,
        -0.09680360555648804,
        -0.0685589462518692,
        0.04320060834288597
    ]
}