{
    "id": "vgG87eHstUc",
    "title": "Linux scripts on Cisco IOS?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-09-26T18:04:36Z",
    "video_url": "https://www.youtube.com/watch?v=vgG87eHstUc",
    "category": "Science & Technology",
    "tags": [
        "linux",
        "linux cisco",
        "ccna",
        "linux commands",
        "ccna study",
        "ccna training",
        "cisco ccna",
        "cisco ccna certification",
        "cisco training",
        "comptia linux plus",
        "comptia",
        "comptia it fundamentals",
        "comptia linux+",
        "comptia linux+ certification",
        "information technology",
        "kali linux",
        "linux for beginners",
        "linux tutorial",
        "linux+ exam",
        "lpic 1",
        "raspberry pi",
        "DevNet",
        "cisco devnet",
        "cisco ios",
        "cisco ios commands",
        "gns3",
        "gns3 2.2",
        "gns3 tutorial",
        "cbt nuggets",
        "ine",
        "ccnp",
        "10x engineer",
        "10x",
        "david bombal"
    ],
    "views": 15415,
    "likes": 789,
    "comments_count": 112,
    "description": "Did you know you could use these Linux Shell scripts directly on Cisco IOS! No need to use Python or use a Linux VM. Just run these directly on Cisco IOS! You can be a 10x Engineer!  Amaze others with your knowledge of the Cisco IOS. You don't need python for these scripts. Rock that job interview and show senior network engineers what you can do. Keep on learning and change your life. Get that good paying job by showing your skills.   ================================= Documentation: ================================= Cisco IOS Shell Configuration Guide:   ================================ Books: ================================= Cisco Press Book:  Good O'Reilly Book:   You don't need a linux shell or linux virtual machine to use these commands. You can use them directly in classic Cisco IOS!  ================================= Script 1: ================================= for xx in `interface Ethernet`; do echo $xx; done  ================================= Script 2: =================================  for xx in `interface Ethernet`; do echo $xx `show int $xx | inc input errors` ; done  ================================= Script 3: ================================= function shrun(){  n=-1  while true; do      let n++       if [[ $n -le 3 ]]; then          show run int g0/$n          echo $n      else  break;      fi  done  }    10x Engineer CCNA Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   #linux #cisco #DevNet",
    "description_links": [
        "http://bit.ly/2kwMyYN",
        "https://amzn.to/2LpaU1a",
        "https://amzn.to/2Lpbw6Z"
    ],
    "transcript": "- This is a continuation of a series of videos where I'm teaching you to become a better network engineer. And teaching you commands in the Cisco IOS that you may not have known about. (upbeat music) Please do me a favor. Put a comment below this video and let me know when you've learned something. So put a time stamp on the video. So how far did you get through the video before you learned something? Which command did you learn? If you know commands that I haven't used options that I haven't used please add them below this video. So that we can all learn from one another. I wish I knew everything, but I don't. I'm just sharing some tips and tricks that I know, but please also add your tips and tricks below this video. Because this is YouTube please, would you subscribe to my YouTube Channel? Please, would you like this video? If you find it useful. And please click on the bell to get notifications when I post a new video. In this video I'm going to show you some Linux commands you can run on Cisco IOS that will hopefully save you a lot of time. And hopefully surprise you with what's possible on the Cisco IOS. In this example I'm running a Cisco router. This is a traditional Cisco IOS. In other words, classic Cisco IOS Version 15.6(2)T This is a viral image that's running with InGenius 3. So, on this router what I'm going to do is enable shell processing full. This allows me to run Linux commands directly on the Cisco IOS. I could also just do it this way. If I only want to run it for my current terminal and not enable it globally on the router. Have a look at the series of videos if you are not sure about what this command does. I've discussed it in previous videos so I won't go through all the options here. Now shell processing supports quite a few commands. If I type show shell functions I can see that cat is supported as an example. Grep is supported. But not this option interface. Print interfaces that match the argument. I'm going to run a very basic scripture. Which is for X-X in interface Ethernet zero do echo done This is a very basic script. Paste that directly into privileged mode. Notice I see the interfaces on the router. Similar to show IP interface brief, but I'm only looking at Ethernet interfaces. So again, that's the script that I ran. I'll post all these scripts below this video. So don't worry trying to copy this down. Just get it from below this video. That's showing me the interfaces on the router. Now that may not be that interesting. So let's expand the script. I'm going to say for X-X in interface Ethernet do echo. Echo is one of the shell functions available. Notice over there. Echo arguments to the terminal. So I'm going to basically echo something to the terminal. Based on show interface include input errors. So this is going to show me not just the interfaces, but it's also going to show me any input errors. So this line input errors CRC frame overrun ignored is displayed in the output. So you may prefer doing that on a switch. See, here's my switch. Terminal shell to enable the shell. Paste that in. I see all the interfaces on the switch. And now I can see input errors CRC overruns, etc. I'll be able to see any errors on an interface by simply running a very basic two line script if you like. If you want more details this is available in the Cisco IOS Shell Configuration Guide. Again I've covered some of this in separate videos where I've talked terminal shell versus enabling this globally on a device. But if you scroll down, they start talking about scripts that you can run. So very basic script is echo here is a string with X-Y-Z in it where X-Y-Z is a variable. In my basic script this is my variable, X-X. So that's used in multiple places. Scrolling down a bit further we can use if statements. We can use for loops. So let's take a very basic for loop here. Directly from the documentation. On my switch, I'll paste that in. For X in one two three four five echo X so just print that out. That's what we get. One, two, three, four, five. Not very interesting, but let's do something with this by using a loop with a break statement. So I'll copy this exactly as it is. And I'll paste that in to switch. And we get numbers one, two, three, up to ten. Again, not that interesting. But what I've done is I've taken this exact script and then I've enhanced it slightly to do something useful. So, here's my script. I've created a function which means that it's a command that I can run multiple times. Rather than just pasting something into the C-L-I. So at the moment on the switch if I type shirun, that doesn't work. It's actually trying to do a domain lookup here on that. I'll speed up the video to break that. Notice that it's translating shirun. So config no IP domain lookup. If I type shirun, that command doesn't work. It's trying to do domain lookup on that. Obviously, shirun like that will do something so show space run, but S-H-R-U-N is not a valid command. But what I can do is paste my script in. So I've created this function called show run. Literally pasting that scripting that I've created. Now if I type show run it's doing a whole bunch of stuff. Actually, let me edit that down. What I've done here is create this function setting N to minus one and while something is true, do something. N is equal to itself plus one so while N is less than or equal to three type show run interface gigabyte zero something. I get rid of this show IP route because that just confuses the output. Paste that back in again. Show run. What this command has done is it's running a show run interface on specific interfaces. Notice gigabyte is zero zero. Gigabyte zero one. Gigabyte zero two. And gigabyte zero three. It's also printing out this number which came from our script that echo. Let's get rid of that. So I'm basically creating a function here that does a show run of interfaces on this switch. So show run first interface zero zero. And then zero one, zero two, zero three and so forth. So it's doing a show run on each interface. But you could type any command here. I've just done show run interface gigabyte zero and then a number. I could do show interface like that. So rather than show run, do a show interface on individual interfaces. So type that again. Show run. There's the first interface. There's the second interface. Third interface. Fourth interface. And done. Now there are more interfaces than that on this switch. A whole bunch of interfaces are available on this switch. But what I wanted to show you is that you can run Linux scripts directly on the Cicso IOS by simply enabling shell processing full either globally on the switch or just typing terminal shell. This document on Cisco's website which I'll link below, gives you more examples were you can do logical tests. If this equals this than echo something. There's a whole bunch of options that you can do. This is actually one of the commands I've just shown you. You can actually configure interfaces if you want to. Says an example set to the interface description to something. Okay, I don't want to turn this into a programming video because that will get too long. I just wanted to show you some basic scripts that you may find useful. Like this showing all interface errors. And then you can do basic or more complex scripting. Okay so I hope you found this video useful. I hope you've learned something. I'll continue creating additional videos showing you options in the Cisco IOS that perhaps you don't know about that can make you a better network engineer. Once again, if you don't mind please subscribe to my YouTube Channel. Please like this video and please click on the bell to get notifications. I'm David Bombal. I want to wish you all the very best. (upbeat music)",
    "transcript_keywords": [
        "Cisco IOS",
        "show",
        "Cisco",
        "interface",
        "show run",
        "run",
        "IOS",
        "video",
        "Cisco IOS Version",
        "interfaces",
        "script",
        "show run interface",
        "switch",
        "echo",
        "command",
        "basic",
        "classic Cisco IOS",
        "traditional Cisco IOS",
        "show interface",
        "commands"
    ],
    "transcript_entity_values": [
        "first",
        "YouTube",
        "ten",
        "two, zero",
        "Linux",
        "three",
        "15.6(2)T",
        "Cisco",
        "my YouTube Channel",
        "Ethernet",
        "five",
        "One",
        "two",
        "four",
        "InGenius 3",
        "zero",
        "Notice",
        "second",
        "N",
        "Ethernet zero",
        "IP",
        "Linux",
        "one",
        "CRC",
        "the Cicso IOS",
        "Fourth",
        "minus one",
        "S-H-R-U-N",
        "Third",
        "David Bombal",
        "Cisco IOS"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.04476305842399597,
        0.02169182524085045,
        -0.007918170653283596,
        0.0012260344810783863,
        -0.08181487768888474,
        -0.06074247136712074,
        -0.018446240574121475,
        0.0443507581949234,
        -0.1234695315361023,
        -0.06882794201374054,
        0.04445367306470871,
        -0.04621679335832596,
        -0.03313904255628586,
        0.007750013377517462,
        -0.007397651672363281,
        -0.02073022723197937,
        -0.018255308270454407,
        -0.03773337975144386,
        0.03390113636851311,
        -0.12353638559579849,
        0.059839192777872086,
        -0.006461323704570532,
        0.04793323203921318,
        -0.06684032082557678,
        0.004818610846996307,
        -0.057361628860235214,
        0.031062044203281403,
        -0.04768937826156616,
        0.029717275872826576,
        0.005412625148892403,
        -0.001225423184223473,
        0.10864381492137909,
        -0.026652108877897263,
        0.039281584322452545,
        0.0645456463098526,
        -0.012750153429806232,
        0.02962193265557289,
        -0.03796069324016571,
        0.027320118620991707,
        -0.03275328129529953,
        -0.015148607082664967,
        -0.00827347207814455,
        -0.05117348954081535,
        0.006154519040137529,
        -0.017870305106043816,
        -0.06713523715734482,
        -0.029287120327353477,
        0.01785261556506157,
        0.05669102445244789,
        -0.039165496826171875,
        -0.03663657233119011,
        -0.0029073061887174845,
        0.005783034488558769,
        -0.03959335759282112,
        0.00029498813091777265,
        0.02652224712073803,
        -0.005540615878999233,
        -0.05730081722140312,
        0.049398232251405716,
        -0.09336507320404053,
        -0.013208379037678242,
        0.035103097558021545,
        -0.00173315464053303,
        0.0929936096072197,
        -0.007997024804353714,
        0.05685780569911003,
        -0.055609457194805145,
        0.08283552527427673,
        0.010499965399503708,
        -0.06589765846729279,
        -0.09759689122438431,
        -0.08899333328008652,
        0.036945801228284836,
        0.07173917442560196,
        0.02102014422416687,
        -0.020248690620064735,
        0.04606541246175766,
        -0.04895807057619095,
        -0.03077089414000511,
        -0.06191524863243103,
        -0.014658446423709393,
        -0.024028250947594643,
        -0.049940500408411026,
        0.07243785262107849,
        0.06644411385059357,
        0.05686626583337784,
        -0.028863083571195602,
        0.06071200594305992,
        0.019092625007033348,
        -0.03193802759051323,
        0.02187134511768818,
        -0.0024798347149044275,
        -0.01674429327249527,
        -0.04865184798836708,
        0.03758440166711807,
        0.05773760378360748,
        0.01748616062104702,
        -0.02608751319348812,
        -0.07710936665534973,
        0.052440546452999115,
        0.008998875506222248,
        -0.08062636107206345,
        0.0054763066582381725,
        0.011356927454471588,
        -0.033858008682727814,
        0.0698016807436943,
        0.0861513614654541,
        -0.04699472337961197,
        0.04376262053847313,
        0.08679550141096115,
        -0.06398801505565643,
        0.0532817579805851,
        -0.06391439586877823,
        -0.07154260575771332,
        0.07802383601665497,
        0.06978259235620499,
        -0.009968644939363003,
        0.08885996043682098,
        0.04158516973257065,
        0.03525780886411667,
        -0.023265667259693146,
        0.005166512914001942,
        -0.11642340570688248,
        -0.020231803879141808,
        -0.03336164355278015,
        -0.0733742043375969,
        0.059737130999565125,
        3.431220255592255e-33,
        -0.04303889349102974,
        0.007803566288203001,
        -0.07574113458395004,
        -0.002971660578623414,
        0.12619708478450775,
        -0.048681557178497314,
        0.1549764722585678,
        0.04979163408279419,
        -0.07814167439937592,
        0.04707057401537895,
        -0.0729660615324974,
        0.062470443546772,
        -0.0802069753408432,
        0.019917592406272888,
        -0.07698817551136017,
        -0.02749670296907425,
        -0.0206199549138546,
        -0.030241623520851135,
        0.01853647455573082,
        -0.0082699591293931,
        0.044034238904714584,
        -0.09493646025657654,
        0.0018505507614463568,
        0.019187137484550476,
        0.07266402244567871,
        -0.00785151682794094,
        -0.03349844738841057,
        -0.039372801780700684,
        0.023790882900357246,
        0.010468020103871822,
        -0.03554488718509674,
        0.0027688401751220226,
        -0.051174912601709366,
        -0.081789031624794,
        -0.048375748097896576,
        -0.06471848487854004,
        -0.07095149904489517,
        -0.054942283779382706,
        0.04690685495734215,
        0.04209679737687111,
        -0.11008121073246002,
        -0.00040154607268050313,
        0.008890734985470772,
        -0.0342264249920845,
        0.006851350422948599,
        0.04725318029522896,
        -0.012007899582386017,
        0.02591862343251705,
        0.036041297018527985,
        0.029281049966812134,
        -0.02914433553814888,
        -0.07313156127929688,
        -0.04211088642477989,
        -0.07981952279806137,
        0.027768535539507866,
        -0.004319233354181051,
        0.02844606712460518,
        -0.01590590737760067,
        0.025025876238942146,
        0.03007151186466217,
        -0.07734882086515427,
        0.04775766655802727,
        -0.043630991131067276,
        0.03374331071972847,
        -0.04036051034927368,
        0.006240434944629669,
        -0.06951572746038437,
        -0.01832427829504013,
        0.012374664656817913,
        0.04589207470417023,
        -0.09627692401409149,
        0.014111398719251156,
        -0.007466444745659828,
        0.01710369810461998,
        0.033472027629613876,
        0.015641668811440468,
        0.017330152913928032,
        -0.07784781605005264,
        -0.01254331599920988,
        0.04646407812833786,
        0.03447865694761276,
        0.07359430193901062,
        0.028804829344153404,
        -0.026117293164134026,
        0.12219313532114029,
        0.016531914472579956,
        0.04599196836352348,
        -0.040199022740125656,
        -0.015482182614505291,
        0.08073817193508148,
        -0.02914874069392681,
        -0.05403443053364754,
        0.004527106881141663,
        0.04018610343337059,
        -0.013935759663581848,
        -8.62182053847549e-33,
        0.04220588505268097,
        0.029227780178189278,
        0.01191159151494503,
        -0.05906737223267555,
        -0.037126246839761734,
        -0.030467700213193893,
        0.0109943188726902,
        0.01947314850986004,
        0.0025553458835929632,
        -0.05660348758101463,
        -0.03460988029837608,
        0.01950865238904953,
        0.020382601767778397,
        0.006820714566856623,
        -0.028885692358016968,
        -0.0230803694576025,
        -0.0821540504693985,
        0.004530705977231264,
        0.015563500113785267,
        0.008545618504285812,
        -0.06111244112253189,
        0.08888759464025497,
        -0.04474784806370735,
        0.03915435075759888,
        -0.03566361591219902,
        -0.038139086216688156,
        0.05384058132767677,
        0.03770694136619568,
        -0.007624874822795391,
        0.015020916238427162,
        -0.047213114798069,
        -0.024884112179279327,
        -0.03667653352022171,
        0.02821926958858967,
        0.06554622203111649,
        0.054784249514341354,
        0.07280991971492767,
        0.03870108723640442,
        -0.055896081030368805,
        0.0019487618701532483,
        0.08730125427246094,
        -0.01868811994791031,
        -0.10027796030044556,
        -0.05676130950450897,
        -0.03299035131931305,
        -0.002087164204567671,
        0.014428531751036644,
        0.021062882617115974,
        -0.12035723775625229,
        -0.09092316031455994,
        0.023694423958659172,
        0.020586056634783745,
        -0.02474050782620907,
        0.005374479573220015,
        -0.04595239460468292,
        0.03654804825782776,
        0.05571672320365906,
        -0.06650479137897491,
        -0.036580584943294525,
        -0.07348668575286865,
        -0.034694839268922806,
        -0.06647375971078873,
        0.05895229056477547,
        0.022065697237849236,
        -0.05150764808058739,
        -0.17545399069786072,
        -0.06858166307210922,
        0.011586603708565235,
        -0.017078682780265808,
        -0.0266959760338068,
        -0.009665613994002342,
        -0.009667054750025272,
        0.045992106199264526,
        0.02073085866868496,
        -0.010344152338802814,
        0.01942410133779049,
        -0.02483648993074894,
        -0.021929025650024414,
        -0.026554541662335396,
        0.044919539242982864,
        0.012199819087982178,
        0.10402730107307434,
        -0.019226232543587685,
        0.11208583414554596,
        -0.03702592849731445,
        0.11856452375650406,
        0.0667782798409462,
        0.037842150777578354,
        0.08286299556493759,
        -0.016266269609332085,
        -0.06821724772453308,
        0.018973641097545624,
        0.04109084606170654,
        0.04833125323057175,
        -0.017756476998329163,
        -5.1611582563282354e-08,
        -0.004920519422739744,
        0.05165766924619675,
        0.03668038547039032,
        0.03185748681426048,
        -0.08599726110696793,
        0.031173191964626312,
        -0.025991689413785934,
        -0.11716777831315994,
        0.04173790663480759,
        -0.06189734861254692,
        -0.03529408201575279,
        -0.02495945803821087,
        -0.019977392628788948,
        0.1071222722530365,
        -0.04902667924761772,
        0.08890590071678162,
        -0.019344858825206757,
        0.013987547717988491,
        0.01265693549066782,
        -0.04703933373093605,
        0.0721094086766243,
        0.001826839754357934,
        0.06640857458114624,
        0.0808410793542862,
        -0.04586394503712654,
        0.05687053129076958,
        0.010018620640039444,
        -0.026854131370782852,
        -0.0777423083782196,
        0.02137000858783722,
        -0.041258495301008224,
        -0.06417416781187057,
        0.008227295242249966,
        -0.03288167715072632,
        0.11588632315397263,
        0.007298156153410673,
        0.025035444647073746,
        -0.07979191094636917,
        -0.04507312551140785,
        -0.030823806300759315,
        -0.05595548450946808,
        -0.027959754690527916,
        0.010188022628426552,
        -0.023862361907958984,
        0.048790689557790756,
        -0.05951147899031639,
        -0.0406668484210968,
        -0.016875943168997765,
        0.0895170196890831,
        -0.05190782621502876,
        0.040045205503702164,
        -0.05235651880502701,
        -0.04899250343441963,
        -0.04177214577794075,
        0.028531543910503387,
        -0.04390469938516617,
        -0.06329014152288437,
        -0.039622947573661804,
        -0.10415102541446686,
        -0.007207497954368591,
        0.030246594920754433,
        -0.0054281773045659065,
        0.0243725273758173,
        0.002588072558864951
    ]
}