{
    "id": "vh-jmvepDwA",
    "title": "Get an iPhone 14 or literally die.",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-09-08T06:27:52Z",
    "video_url": "https://www.youtube.com/watch?v=vh-jmvepDwA",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Far Out",
        "iPhone 14",
        "Apple Watch Ultra"
    ],
    "views": 2386540,
    "likes": 96191,
    "comments_count": 8098,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code LinusTechTips at   Get your Cablemod Keyboard cables today!  Amazon:  Custom:   Apple's Far Out event showed us why if you don't have an iPhone 14 and an Apple Watch Ultra you will die.  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Do you want to literally die? 0:41 - Cablemod! 0:55 - LTT Intro 1:03 - Dynamic Island 1:48 - Front facing camera 2:28 - Rear camera 3:32 - A16 4:52 - eSIM 6:00 - Satellite Emergency Messages 6:54 - Car crash detection 7:29 - Apple Watch Ultra 8:14 - Apple Watch Series 8 9:01 - AirPods Pro Gen 2 9:58 - Vessi!! 10:35 - Outro",
    "description_links": [
        "https://www.Vessi.com/LinusTechTips",
        "https://lmg.gg/CablemodKB",
        "https://lmg.gg/CablemodCustom",
        "https://linustechtips.com/topic/1454061-get-an-iphone-14-or-literally-die/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Do you wanna literally die? Buy an Android then. Seriously that's the takeaway of today's Apple Event. If you go to work, eat food, hike, drive a car, or ovulate without an Apple Watch Ultra and an iPhone 14, you are as good as dead. At least I'm pretty sure that's what Apple wanted to be the takeaway of their event today. Behind their appeals to war rewards and helicopter parents though, is some genuinely cool tech and of course a bunch of stuff that everyone else has had for years, that Apple has slapped a new name on and called it revolutionary. So what tech here is actually a step forward? And what's just a shiny new label? Let's have a look at this segue to our sponsor. - CableMod. CableMod's new keyboard cable configurator, say that five times fast, is the easy way to complete your keyboard look. Customize almost anything, and receive your handmade cable in two weeks or less. Check it out at the link below. (upbeat music) - In past years, Apple has shied away from calling attention to the notch, to the point where they got sued over it. But for the iPhone 14 pro, the notch is on full display. Now it's pill shaped and Apple calls it the dynamic island. Around the front sensors, the pill expands to show you useful information while you're in other apps. Things like timers, music, sports scores, flight information, maps, navigation, and more can go up here. I will personally need to actually use it for a bit before I decide if it's a gimmick or not, but what I know now is that it still looks bad while watching full screen video. And it also pretty much guarantees that you're gonna have fingerprints all over your front facing camera, every time you go to use it, which is too bad because the front facing camera now has auto focus which is pretty sweet. As far as I can tell, this is the first time a front facing camera has been able to properly focus. Typically front cameras have a fixed lens that is focused at roughly an arms length away with everything else being, I don't know, probably good enough. This saves on the space that's needed to have a movable focusing element, but completely eliminates any chance of natural bokeh. Both the base and Pro iPhone 14 models then now do have this feature and there's a good chance that these new front facing cameras will be better than many of the rear shooters from a couple of years ago. On that subject, around back on the iPhone 14 Pro, we get a new 48 megapixel Quad-pixel sensor that is 65% larger and has a cool trick up its sleeve. Pixel binning. When there's heaps of light, you get the full 48 megapixels but in low light, the iPhone 14 Pro is able to take four pixels, and turn them into a single better pixel. This does decrease the resolution of your photos from 48 to 12 megapixels, but it dramatically improves low light performance. To be clear this technology is nothing new. For instance the Samsung Galaxy S21 Ultra and S22 Ultra have a version of this that actually combines nine pixels together, but it is a very welcome addition to the iPhone 14 Pro. Along with the main camera on the Pro, we get a 12 megapixel 48 millimeter telephoto and a 12 mega pixel 13 millimeter wide, and every iPhone 14 camera benefits from Apple's new photonic engine which is basically their deep fusion photo AI but more better. And apparently it can nearly double their low light performance. While the base iPhone 14 gets the same A15 chip from the old iPhone 13 Pro, the 14 Pro gets a fancy new A16 chip. The A16 sounds similar to the A15. We still get two performance cores, four efficiency cores, and five GPU cores, but through the magic of four nanometer, it's able to reduce power consumption on the performance course by 20%. According to Apple, this is the most efficient mobile CPU in existence. And given that they've been crapping on everyone else in terms of performance, I'd say that's probably accurate and it's probably more power than you'll be needing in a smartphone for quite some time unless you're a very heavy user. The biggest advancement with the A16 though is the display engine, which brings better anti aliasing, the ability to reduce the screen refresh rate down to one hertz to boost battery life, and finally and always on display for the iPhone. I know, I know everyone on Android totally floored right now that Apple hasn't had it always on display until now but guys, credit. Credit where credit is due. They have finally done it. Only took them nine years. Three times as long as it took us to design our screwdriver which is available at lttstore.com. But Apple giveth and Apple taketh away. In this case takething the SIM tray. Actually in most of the world, you'll get a nano SIM tray. But if you buy an iPhone 14 in North America, you do not. Instead, you get two eSIMs. Now for the vast majority of users, this absence of a physical SIM tray is never going to be a problem. You disconnect your carrier to the eSIM, and you never think about it again. But if you're someone that regularly travels between continents, and doesn't have a travel plan, or you go places where it's not supported, then it's gonna be a bit of a change. See right now, if you wanna change to a local carrier when you're on the road, you go grab a SIM card, put it in your phone, and you're done. Going forward with a North American iPhone 14, you are gonna have to register that carrier to one of your two eSIM slots that assumes they even support eSIM. And then if you need a third carrier for some reason, you're gonna have to go through the rigmarole of removing one of your carriers and adding another one, switching it's just a giant wet fart. Anyway, if there was one thing that brought a sparkle to Apple's eye during the event, it was the thought of you being in grave danger. Like wow they laid it on pretty thick. They do have some pretty cool technology to show for it though. Previously, if you wanted to connect your cell phone directly to a satellite, you'd need a rod Jeremy spec antenna, and well you still do if you wanna have a proper conversation without involving a cell tower, but and this is really cool by having an app that shows you how to point your phone directly at a satellite, you can manage just enough of a connection to send out an emergency message and your location. To make this easier they have a form with typical emergency questions. So all the information a rescue team needs can be sent at once. And even if you're not in grave danger, you can use this feature to send location data to your loved ones, if you're the kind of person that goes on weeks long treks across the Yukon, or whatever the case may be. Also integrated into the iPhone 14, is new car crash detection. This is accomplished by using an improved gyroscope as well as a fancy accelerometer that can measure up to 256gs, at a 3000 hertz polling rate as well as data from the barometer and mic to tell if an airbag has gone off. Apple apparently recorded a thousand hours of crash tested data, and from that, they were able to tell what type of car crash you've been in, and automatically alert emergency services, if you don't respond to the prompt. Crash detection is also a feature on the new Apple Watch Ultra which frankly looks pretty sick. The case is titanium, the face is a sapphire crystal, and you get a new orange programmable button. I doubt the majority of Apple watch Ultra users will ever need it to function as a dive computer, a way finder, or to measure the length of their stride, but in addition to those, it has improvements for the rest of us. Like more battery life. The Watch Ultra can last for 36 hours of regular use, and up to 60 when it's in low power mode. It has dual frequency GPS for higher accuracy, and an all red night mode that looks sick. I think Anthony probably put it best when he said, \"This is the Apple Watch, that makes people that didn't want an Apple Watch, want an Apple Watch.\" The Standard Apple Watch Series Eight is largely unchanged compared to the series seven, except for two improvements that it shares with the Watch Ultra. The fore mentioned crash detection, and some really accurate thermometers, one on the outside and the other against your skin. These sensors were designed with women's health in mind specifically cycle tracking, and a retrospective analysis of ovulation. All of this information is encrypted on the device and not even Apple has a key to decrypt it which shouldn't be that big of a deal but unfortunately women's rights in the states recently took a huge hit and cycle tracking information could be weaponized against you if it falls into the wrong hands. Anyway the atrial fibrillation will be able to pick up your distress, when you find out the Apple Watch Ultra starts at 800 US dollars. Good gravy. While the series eight starts at 450, SE is starting at 250. Moving on there's a second generation of the AirPods Pro. That's actually the one I'm most excited about that features new H two Silicon that apparently has greatly improved spatial audio. Now you're able to use an iPhone camera to create a 3D model of your ear to better tune the spatial audio, for your specific ears. Something the likes of Sony have been doing for a while. Overall, the new AirPods Pros just seem to be like betterer than the old ones. More battery life, better active noise cancellation, and an improved transparency mode. The improvement I'm most excited for, concerns the case though. It finally has the ability to charge, with an Apple Watch charger, and also you can easily locate the charging case. Thank you Apple. Like you can already easily find the headphones, but I find that I constantly loose the charging case around the house 'cause I'll just leave it somewhere when I put my earphones in and forget where that happened. This is a segue to our sponsor. - Vessi. Vessi footwear is known for being lightweight, easy to pack, comfortable, and most importantly water resistant with its diamond techs technology. Their everyday move line is designed with added support at the midsole and better breathability to keep up with your active lifestyle. Take them off and put them on with ease thanks to handy pull tabs. I'd never screw with laces anymore, and they're also made creature free. So every stuff you take will be guilt free. And thanks to the dual climate knit material, your feet will stay warm during the winter and cool during the summer. So treat your feet with Vessi's everyday move shoes, and save 25 bucks with our offer code LinusTechTips at Vessi.com/LinusTechTips. - If you guys enjoyed this video, maybe you'll enjoy I don't know our review of the AirPods Pros? Sure. Yeah. I can't wait to get my new ones. My old ones are starting to have some problems. I'm getting the same, like kinda rattling in one of the drivers that I had with my old ones.",
    "transcript_keywords": [
        "Apple Watch Ultra",
        "Apple Watch",
        "Apple",
        "Watch Ultra",
        "Watch",
        "Apple Watch Series",
        "iPhone",
        "Standard Apple Watch",
        "pro",
        "Ultra",
        "today Apple Event",
        "Apple Watch charger",
        "front facing camera",
        "watch Ultra users",
        "Apple Event",
        "Watch Ultra starts",
        "literally die",
        "Pro iPhone",
        "camera",
        "front facing"
    ],
    "transcript_entity_values": [
        "nine",
        "SE",
        "250",
        "Sony",
        "14",
        "one",
        "weeks",
        "The Watch Ultra",
        "second",
        "four",
        "Apple",
        "48 megapixels",
        "first",
        "Vessi",
        "Apple Watch",
        "eight",
        "an Apple Watch",
        "AirPods Pros",
        "the AirPods Pros",
        "Silicon",
        "Eight",
        "Pro iPhone",
        "256gs",
        "North American",
        "the Apple Watch",
        "3000",
        "Vessi",
        "SIM",
        "65%",
        "GPU",
        "seven",
        "iPhone",
        "today",
        "12 megapixel 48 millimeter",
        "A16",
        "25 bucks",
        "five",
        "Three",
        "Apple Event",
        "Jeremy",
        "the Watch Ultra",
        "North America",
        "800 US dollars",
        "the AirPods Pro",
        "nine years",
        "two weeks",
        "450",
        "48 to 12 megapixels",
        "iPhone 13 Pro",
        "20%",
        "CableMod",
        "past years",
        "Yukon",
        "48",
        "CPU",
        "Anthony",
        "the Apple Watch Ultra",
        "12",
        "up to 60",
        "third",
        "Apple Watch Ultra",
        "a couple of years ago",
        "four nanometer",
        "36 hours",
        "13 millimeter",
        "the summer",
        "A15",
        "two",
        "a thousand hours",
        "years",
        "Android"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "NORP",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "MONEY",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.10901786386966705,
        -0.05757724493741989,
        0.053796228021383286,
        -0.06610191613435745,
        0.07212473452091217,
        0.060811810195446014,
        0.014909236691892147,
        0.0323529988527298,
        0.01956452615559101,
        -0.008654781617224216,
        0.10860665142536163,
        -0.017613952979445457,
        -0.052291397005319595,
        -0.03737526014447212,
        -0.0223948173224926,
        0.010098201222717762,
        0.043784692883491516,
        -0.015809642150998116,
        -0.09261368960142136,
        -0.005978853441774845,
        0.003314150031656027,
        -0.038214314728975296,
        0.009446939453482628,
        0.07742205262184143,
        0.012803464196622372,
        0.02052907459437847,
        -0.05323304235935211,
        -0.10259880870580673,
        0.0053710308857262135,
        -0.040359366685152054,
        -0.03780664503574371,
        -0.004147839732468128,
        -0.0414944589138031,
        -0.003471946343779564,
        0.003072975901886821,
        -0.07920440286397934,
        0.05052129551768303,
        -0.0398847833275795,
        -0.08817028254270554,
        -0.03767131268978119,
        -0.02739686146378517,
        -0.023788418620824814,
        -0.01850242353975773,
        0.032568711787462234,
        0.04459366574883461,
        -0.051547542214393616,
        -0.008190292865037918,
        -0.03597719594836235,
        0.015057643875479698,
        0.059984754770994186,
        -0.042417366057634354,
        -0.021647730842232704,
        0.03625842556357384,
        0.014630082994699478,
        0.02283606119453907,
        -0.0050559742376208305,
        -0.023710332810878754,
        0.018858997151255608,
        0.0963859036564827,
        0.011964650824666023,
        0.06404107064008713,
        -0.04756975919008255,
        -0.036724306643009186,
        0.006229227874428034,
        -0.02250394970178604,
        -0.004036468453705311,
        -0.044753629714250565,
        0.07635586708784103,
        -0.029391903430223465,
        0.02702905796468258,
        -0.048467278480529785,
        -0.05052422359585762,
        0.04060658812522888,
        0.08205583691596985,
        0.006578369997441769,
        -0.011677495203912258,
        0.04450925067067146,
        -0.08779297769069672,
        -0.06503104418516159,
        0.021698497235774994,
        -0.04953691363334656,
        -0.07089085131883621,
        0.036586545407772064,
        -0.03261629864573479,
        0.06466042995452881,
        0.013628370128571987,
        0.02910204604268074,
        0.036533184349536896,
        -0.045150987803936005,
        -0.07905153930187225,
        -0.07990372180938721,
        0.08907780796289444,
        0.03083798848092556,
        -0.0025888527743518353,
        0.0012922819005325437,
        0.05718698725104332,
        -0.0055053867399692535,
        -0.06524240225553513,
        -0.07440687716007233,
        0.08787132054567337,
        0.09524405747652054,
        0.021122116595506668,
        -0.05418224632740021,
        0.009852324612438679,
        0.024997755885124207,
        -0.09929066896438599,
        0.00594378262758255,
        0.04097277671098709,
        0.04988202080130577,
        0.05241409316658974,
        0.02340547926723957,
        0.023326968774199486,
        -0.0359458290040493,
        -0.09345021098852158,
        -0.0007380956085398793,
        0.05804431810975075,
        -0.047695498913526535,
        0.09770827740430832,
        0.1581965982913971,
        0.021754493936896324,
        -0.012434338219463825,
        0.017322557047009468,
        -0.03827754408121109,
        -0.0021007100585848093,
        -0.021515680477023125,
        0.022846853360533714,
        -0.00832467433065176,
        -3.749641471420858e-34,
        0.04747835919260979,
        0.011859975755214691,
        -0.0336146280169487,
        -0.056177135556936264,
        0.052159927785396576,
        -0.08934025466442108,
        0.0013298317790031433,
        0.055943187326192856,
        -0.015147079713642597,
        0.06461692601442337,
        -0.04225354641675949,
        -0.03608761355280876,
        -0.05840902030467987,
        -0.02409694902598858,
        0.029426544904708862,
        -0.06154278665781021,
        -0.020054683089256287,
        -0.040158431977033615,
        -0.02791432850062847,
        -0.08216986805200577,
        -0.0077428859658539295,
        -0.08149015158414841,
        0.002142104087397456,
        -0.010629016906023026,
        0.06295279413461685,
        0.037998609244823456,
        0.017142849043011665,
        0.030364854261279106,
        0.04357582703232765,
        0.03447704762220383,
        -0.05140376463532448,
        -0.02700614556670189,
        0.04252127185463905,
        -0.09953944385051727,
        -0.08119099587202072,
        -0.044977232813835144,
        -0.04249969497323036,
        -0.05632856860756874,
        0.034188587218523026,
        -0.028979379683732986,
        -0.00012310815509408712,
        -0.03140374645590782,
        -0.09277695417404175,
        -0.0842786505818367,
        0.04507604241371155,
        0.03750181570649147,
        0.11479533463716507,
        0.04833313077688217,
        0.02050587348639965,
        -0.02970031276345253,
        -0.039342816919088364,
        -0.018214430660009384,
        -0.07946084439754486,
        -0.06733273714780807,
        -0.05605611205101013,
        -0.00018215429736301303,
        -0.04091743379831314,
        -0.009743700735270977,
        0.07211458683013916,
        0.059091538190841675,
        0.007608682382851839,
        0.0013265807647258043,
        0.059854261577129364,
        -0.027857566252350807,
        -0.0970398485660553,
        0.04393444210290909,
        0.0334404818713665,
        -0.021018611267209053,
        -0.0743134468793869,
        0.01227892842143774,
        -0.05949854105710983,
        0.02313581109046936,
        0.042385052889585495,
        -0.0533035583794117,
        -0.045535508543252945,
        0.003990739118307829,
        -0.05542564019560814,
        -0.10437271744012833,
        0.014993946067988873,
        0.0007488145492970943,
        -0.018842410296201706,
        0.0007369813392870128,
        0.06450525671243668,
        0.0594971738755703,
        0.07804376631975174,
        0.007540090940892696,
        -0.019972601905465126,
        -0.10086914896965027,
        -0.05257917195558548,
        0.03805826976895332,
        -0.14018675684928894,
        -0.013684064149856567,
        -0.02317262999713421,
        -0.10962755233049393,
        -0.06230347603559494,
        -4.374100437434136e-33,
        0.0027365160640329123,
        0.034419022500514984,
        -0.008952303789556026,
        -0.013599797151982784,
        0.042053259909152985,
        -0.05317109823226929,
        -0.03782219812273979,
        0.025951117277145386,
        0.04309043660759926,
        0.01018176507204771,
        0.026588378474116325,
        0.022448517382144928,
        -0.06197604537010193,
        0.0009459529537707567,
        0.013253862038254738,
        -0.022185223177075386,
        -0.039836134761571884,
        -0.02744165062904358,
        0.013998650945723057,
        0.011407038196921349,
        -0.018749328330159187,
        0.004954302683472633,
        -0.027159828692674637,
        0.059949181973934174,
        -0.011348415166139603,
        -0.013899737037718296,
        0.06058654189109802,
        0.10337569564580917,
        -0.0089808888733387,
        -0.009033323265612125,
        0.11994019895792007,
        -0.053003568202257156,
        -0.07436557114124298,
        0.026697913184762,
        -0.017064513638615608,
        0.049357540905475616,
        0.010307085700333118,
        0.03097725659608841,
        -0.06352405250072479,
        -0.05585317686200142,
        0.06244564801454544,
        0.022119419649243355,
        0.05074542760848999,
        -0.013177881017327309,
        0.02001083269715309,
        -0.02540651336312294,
        -0.08044146746397018,
        -0.01207041461020708,
        -0.03874235972762108,
        0.011376786977052689,
        0.03637561947107315,
        -0.021053269505500793,
        0.008086727000772953,
        0.046096205711364746,
        -0.16210947930812836,
        -0.006711933296173811,
        -0.06477227061986923,
        0.06058650463819504,
        -0.03237425163388252,
        -0.016431864351034164,
        0.09148671478033066,
        -0.08534440398216248,
        -0.051564741879701614,
        -0.0074517689645290375,
        0.06245957687497139,
        -0.02813606709241867,
        -0.008508652448654175,
        0.01784074306488037,
        -0.0506955049932003,
        0.05862528085708618,
        0.0026540334802120924,
        0.012584468349814415,
        -0.035673242062330246,
        -0.00705040292814374,
        -0.022070400416851044,
        0.10468500852584839,
        0.014358500018715858,
        0.022821057587862015,
        -0.047664932906627655,
        -0.09239806979894638,
        0.033728085458278656,
        0.062417931854724884,
        0.07445670664310455,
        -0.019953465089201927,
        0.08018559962511063,
        0.09083778411149979,
        0.04572216793894768,
        0.03100622445344925,
        0.0084117716178298,
        0.023044761270284653,
        -0.09023319184780121,
        -0.01659688539803028,
        -0.07344907522201538,
        0.05830353870987892,
        -0.00464772991836071,
        -6.23700486812595e-08,
        -0.0022347811609506607,
        0.06696857511997223,
        -0.011941169388592243,
        -0.0336337573826313,
        0.01588786579668522,
        -0.018516995012760162,
        0.0008957794634625316,
        -0.01873236894607544,
        0.05408827215433121,
        -0.013347819447517395,
        -0.04216446727514267,
        -0.07010361552238464,
        -0.05127526447176933,
        0.06221546232700348,
        0.04319528117775917,
        0.026601647958159447,
        -0.0570605993270874,
        0.03340918943285942,
        -0.02711322531104088,
        -0.05808734521269798,
        -0.05895231291651726,
        0.042895685881376266,
        0.08246999979019165,
        -0.037980128079652786,
        0.05402042716741562,
        0.01238952111452818,
        0.04018426686525345,
        0.08790532499551773,
        0.1047726646065712,
        -0.045786019414663315,
        0.012827040627598763,
        -0.029799075797200203,
        0.012684524990618229,
        -0.06432388722896576,
        -0.016408301889896393,
        -0.014878719113767147,
        -0.03990059345960617,
        0.0023374243173748255,
        0.030479345470666885,
        0.022025620564818382,
        -0.005660197231918573,
        -0.048794496804475784,
        0.0026226125191897154,
        0.010424747131764889,
        -0.045186255127191544,
        -0.06973909586668015,
        0.04733935743570328,
        -0.09005330502986908,
        0.010587471537292004,
        0.06788609176874161,
        -0.030831025913357735,
        -0.07552644610404968,
        0.0034189012367278337,
        -0.03931809216737747,
        0.11807139217853546,
        -0.037036776542663574,
        -0.031553715467453,
        0.05829990655183792,
        -0.061685409396886826,
        0.06273545324802399,
        0.1352449357509613,
        -0.0866389200091362,
        -0.050766315311193466,
        0.07537557929754257
    ]
}