{
    "id": "vhV5yeXehbc",
    "title": "My Electric Hummer is Bulletproof!? (Kinda) - 450 Volt Charger Install",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-11-24T14:45:04Z",
    "video_url": "https://www.youtube.com/watch?v=vhV5yeXehbc",
    "category": "Howto & Style",
    "tags": [
        "Electric Hummer",
        "Hummer EV",
        "Jerryrig Hummer",
        "ev conversion",
        "hummer",
        "rivian",
        "cybertruck",
        "electric truck",
        "EV Humvee",
        "tesla",
        "j1772",
        "Onboard charger",
        "DC/DC converter",
        "electric vehicle"
    ],
    "views": 890997,
    "likes": 48215,
    "comments_count": 1689,
    "description": "Time to Bullet Proof my Hummer EV - Right now, for a limited time, save 60% on your first 3 months of Audible. Thats only $5.95 a month. Give yourself the gift of listening. For more - go to  or text jerryrig to 500 500. Today we will be installing the On Board charger to my Electric Hummer conversion. As well as the DC/DC converter which will supply power to the 12v system when the high voltage pack is installed.   Watch all the EV Humvee build videos in order HERE:    Get my Shirts or Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://audible.com/jerryrig",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "This video is sponsored by Audible and today we're going to be installing the onboard charger underneath the Humvee, as well as putting in the DC to DC converter, which is the bridge between the high and low voltage systems. And just for kicks and giggles, we'll be building the charger mount out of bulletproof metal. The only way to prove that the piece of metal holding up my onboard charger is bulletproof is by shooting it with a bullet. Let's get started. [Intro] Here in the United States and on planet earth, electricity is everywhere in the power lines, coming from the sun, in the lightning up in the sky. But we need to find a way to get that electricity into these batteries because the only way to make that energy useful is if it's stored somewhere. Laid out in front of us right here I have about 100 kilowatt hours worth of batteries. These are Tesla battery modules and all added up at the end of the day is going to be around 450 volts. We know, however, that electricity coming out of the wall, at least here in the United States, is usually about 110 or 220. That's the electricity flowing from this charger to the Humvee. So there needs to be something on the Humvee that can change it from 220 all the way up to 450, which can then fill up the batteries. The component that can do that is this guy. This is called an onboard charger. This can take the AC power coming in from the wall and convert it into DC power for the batteries. And it has special water cooling inlets and outlets so that it can stay cool during that whole process. You've probably heard the phrase level one and level 2 charging. Level one charging is where it's coming from just a regular 110 volt outlet and you will get anywhere from 2-3 miles of range per hour of charging. Pretty darn slow. This guy right here is a level 2 charger and will be able to give me anywhere from 20-25 miles of range for every hour that it's plugged in. And the nice thing about this is that right now in the United States, there's about 40,000 chargers spread out all over the continental U.S., and I'll be able to use those chargers if I ever decide to take a road trip. So I'm going to stick the charging port right back here where the fuel input used to be. First I need to do some modifications to this funnel, which used to take the diesel and put it into the fuel tank. I need to cut off this lip right here and clean it out because it still smells like a combustion vehicle. [Sawing sounds] [Water sounds] So this is where the old fill spout lines up and we want the J1772 to sit right about here. I mentioned that there was about 40,000 chargers spread out over the United States. The two most common charging ports are, of course, the Tesla port which is proprietary, and the other one is the J1772, which is what we see on the Rivian and like the Ford Mustang Machi. The nice thing about level 2 charging though is that Tesla owners can use this plug if they have an adapter. And J1772 owners, like this, can use Tesla destination chargers also with an adapter. So everyone's playing nice so far. It's only when we get to level 3 charging that things start to differ. Tesla calls it supercharging and everyone else calls it DC fast charging. DC fast charging would allow us to dump about 100 miles of range into the battery in about 15 minutes. Now I won't be able to do that with my Hummer as of right now because we need something called active cooling. My plan right now is to just put passive cooling in here with just a radiator and some fans. Active cooling requires a chiller to make sure that the batteries stay at the optimal temperature while they are getting that much energy dumped into them. Maybe down the road if I find that I do want to take longer road trips, I will add DC fast charging, but as of right now I don't think this is going to be my road trip vehicle. So I won't be adding DC fast charging just yet. So we know we want the charging port right here where the diesel used to flow into, and let me show you where we're going to put the onboard charger. [Motor sounds] It's going to sit right under here above the rear drive shaft. It'll be supported on one side with what was previously holding up the exhaust, and supported on the other side with a small little bracket. It'll make more sense when we finally get it connected. And what is the easiest way to do this again? With lasers. So for the charging mount we're going with a sandwich design. On the top we will have 3/8ths regular steel. And on the bottom we will have one quarter inch AR500 bullet proof steel. This baby will stop armor piercing rounds which might be a little overkill for the underside of a Humvee, but we really don't want any rocks or debris ever hitting the charger. So having a bulletproof shield on the bottom side will go a long way. It might be bulletproof, but it's not laser proof. The laser will slice through both of these as if they were melted butter. And just like everything else we've laser cut, we are here at Osh Cut where we can take our design, upload it to their website and print it out and get our parts shipped to us the very next day. Since we're using the mounting point where the muffler previously used to be, our top slab of 3/8th steel doesn't need to be super heavy. So we'll use the laser to cut out and reduce some of the weight using the same hexagon pattern that we have underneath our inverter...which just so happens to be the same hexagon pattern we have in the JerryRig knife. The science behind the laser cutting this piece of steel and AR 500 is that the laser itself is heating up the surface of the metal, and then a stream of pure oxygen hits the metal and burns it away. One of the reasons why Osh Cut is so cost effective is that they are able to combine my order, which is this AR 500 bottom plate, with other customer's orders at the same time to save on the laser cutting cost. Plus, you can see that they sliced the metal here so they can reuse the pieces of metal that I didn't need for my project. This is still radiating heat from that laser. Woo! Before we get this installed on the Humvee, I want to show you the difference between bulletproof AR500 and regular metal. The only way to prove that the piece of metal holding up my onboard charger is bulletproof is by shooting it with a bullet. Here we have a green tip that goes inside of an AR-15, and we're going to shoot a piece of aluminum, a piece of mild steel, and then a piece of the AR-500. At first glance, metal might all appear the same, but they all react very differently when shot with a bullet. Here we have the piece of scrap aluminum, this is the piece of mild steel, and this is the actual plate that's going to be mounted underneath the Hummer. This green tip extreme penetrating bullet shouldn't go through the AR500 but we'll see what happens. [Music playing] Alright we're going for aluminum first. [Music playing] Mild steel in three...two... [Music playing] AR 500 in three...two... Nice. [Music playing] Let's go check it out. So here are our shots. Wow, this is amazing. Alright, so here's the piece of aluminum. Bullet went straight through. Easy. Piece of mild steel...bullet went straight through, easy. Piece of AR bulletproof 500...there's a little bit of a mark, but that baby is bulletproof. And there we have it. At least one portion of my military Humvee turned electric is now bulletproof. Now let's get that charger mounted. AR 500 is still made out of steel though. And since it's going to be living underneath the Humvee as we're driving around on regular roads, there's a chance it could get wet and rust. So I'm going to hit it with some self etching primer, and once that's dry I can hit it again with some undercarriage paint, which is some thick durable black paint that will keep the metal from rusting as it lives underneath the vehicle. Fun little not-so-fun fact, we forgot to laser out one of the mounting holes in the bottom of the AR 500, the super super hard stuff. So we burned through 5 different drill bits on this drill press trying to drill out that hole until we got a solid carbide bit that was able to finally drill through the solid AR 500. So if you ever do plan on working with AR 500, make sure you get all the laser holes in the right spot the first time around. That stuff is difficult to work with. We've gone with a sandwich approach to the onboard charger mount, with the piece of AR 500 protecting the bottom side against any rocks or debris that might pop up from the road or the tires. And then on the top we have the piece with the hexagons cut out that's being supported by the already existing exhaust mount underneath the truck. The previous exhaust mount was supporting about 65 pounds worth of weight while this charger, including all the metal supporting it, is only 27. And with the supports on both sides, it should be plenty strong. And so you can get a better view of what's going on, we have the charger itself mounted right here on the exhaust bracket. I'll get some more bolts in there in a second. And then we have this little bracket right here supporting the other end. And the bulletproof metal is keeping it protected right above the driveshaft. With the charger mounted up into place with this bulletproof plate on the bottom, we can start feeding the wires up through where the diesel used to flow out through the top where the diesel cap used to be. I think it will appreciate the upgrade from running on recycled dinosaurs to now running on lightning. It lines up kind of ridiculously well almost like it was designed for it. So we have this plastic protector on the inside. Even though these cables are insulated, we don't want them rubbing up against the metal interiors. You'll notice that we have 5 wires coming out of this, and that's because there are only 5 connectors inside the J1772. If we take a look at the wires we can see it has the two hot, the proximity, pilot, and a ground wire. And those 5 wires are what make up the charging. What's interesting though is that if you look at the Tesla plug, it's the exact same wires, just in a different form factor, which is why you can use an adapter and charge with either plug, as long as it's not the DC fast charging or the Tesla supercharging. Very different scenarios when we're talking about those. Now that we have the charger all installed, we have to install the component that keeps the 12 volt system topped off, and that happens with this guy. It's called a DC to DC converter, and it takes that 450 volts coming from the high voltage battery pack and changes it to 12 volts for the 12 volt battery underneath the passenger seat. We have a couple different options for mounting. Initially I thought that we might put it right here inside of the air filter container, just tucked up right inside of that. But then I realized that the DC to DC has a fan on top and we might need some air flow. So over here there's a nice wall of real estate underneath the coolant tub where we can just mount the DC to DC converter there, run the wires into the battery chamber underneath the passenger seat, which would be right here, keeping the battery topped off. Just like we're doing right now with the wall. The piece that we cut out is actually really simple, just a small rectangle with some corners cut off and some holes lasored out in the middle to perfectly match the bottom of the DC to DC converter. We'll take the 1/8th inch plate, mount it up to the firewall, mark where the holes are, and drill through. Kind of the same thing we did with the power steering. The metal plate and bolts add more meat for the converter to grab onto while we're driving down the road. And I promise I'll clean up these wires at some point. We have the thick red wire going to the 12 volt battery underneath the passenger seat, then we have the thinner red and blue wires headed to the battery pack, which will eventually be in the two seats behind the driver and passenger. For those of you keeping track at home we go from AC power in the wall, through that onboard charger which changes it to DC power for our batteries, and then gets changed once again into AC for that electric motor that we installed previously. And it's rather fascinating to learn how these types of electricity were invented, or discovered I guess. Huge thanks to Audible for sponsoring this video. Over the summer I listened to an audiobook called The Savage of the First Standards War, and it talks about the discovery of AC and DC electricity and all of the crazy things that Edison, Westinghouse, and even Tesla went through as they were trying to figure out which type was best for the world. It's a super interesting bit of history that's definitely worth a listen. They did a lot of weird things back in the 1800s, like electrocute an elephant. As you can see I use Audible a lot. You can listen to this audiobook for free with your 30 day trial of Audible. And for a limited time you can save 60% on your first three months of Audible. Just head to Audible.com/JerryRig and you can start listening for just $5.95 a month. They also have podcasts, guided fitness, and even meditation programs. I think my next audiobook is going to be Dune so I can catch up on the series before the rest of the movies come out. But yeah, Audible.com/JerryRig. Or text the word JerryRig to 500-500. Links are down in the description. Hit that subscribe button if you haven't already. Turn on notifications so you don't miss when we finally get this thing rolling. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "charger",
        "onboard charger",
        "charging",
        "piece",
        "United States",
        "metal",
        "Tesla",
        "bulletproof",
        "fast charging",
        "Humvee",
        "laser",
        "underneath",
        "cut",
        "steel",
        "wires",
        "battery",
        "chargers",
        "onboard",
        "onboard charger underneath",
        "electricity"
    ],
    "transcript_entity_values": [
        "AR-15",
        "the summer",
        "about 40,000",
        "next day",
        "Edison",
        "Rivian",
        "12 volts",
        "30 day",
        "Humvee",
        "Hummer",
        "Twitter",
        "around 450 volts",
        "The Savage of the First Standards War",
        "one quarter inch",
        "Instagram",
        "60%",
        "two",
        "about 100 miles",
        "At least one",
        "AR500",
        "three",
        "Humvee",
        "about 110",
        "about 15 minutes",
        "the 1800s",
        "the 1/8th inch",
        "one",
        "AC",
        "Humvee",
        "DC",
        "JerryRig",
        "110 volt",
        "3/8ths",
        "about 65 pounds",
        "AR 500",
        "Westinghouse",
        "220",
        "just $5.95",
        "U.S.",
        "Audible.com/JerryRig",
        "Osh Cut",
        "12 volt",
        "the United States",
        "about 100 kilowatt hours",
        "the end of the day",
        "5",
        "450",
        "only 5",
        "Tesla",
        "first",
        "500",
        "Ford",
        "second",
        "your first three months",
        "500-500",
        "First",
        "today",
        "3/8th",
        "Osh Cut",
        "every hour",
        "hexagons",
        "3",
        "One",
        "Dune",
        "450 volts",
        "Audible",
        "2-3 miles",
        "20-25 miles",
        "only 27",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "NORP",
        "QUANTITY",
        "DATE",
        "FAC",
        "PERSON",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "FAC",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.058226313441991806,
        0.1283797174692154,
        -0.0029221687000244856,
        -0.0922262966632843,
        0.060428764671087265,
        -0.0016782842576503754,
        0.032894935458898544,
        0.0003508600639179349,
        -0.05977511778473854,
        0.012639084830880165,
        0.06760940700769424,
        -0.020256878808140755,
        0.005708992015570402,
        0.029426466673612595,
        -0.055302683264017105,
        -0.010757112875580788,
        0.06965989619493484,
        0.0033555016852915287,
        -0.04097171500325203,
        0.06481460481882095,
        -0.001505066524259746,
        0.029932737350463867,
        0.05176146700978279,
        -0.05104255676269531,
        -0.0304411631077528,
        0.0036687972024083138,
        -0.0037838288117200136,
        0.041506823152303696,
        -0.11238164454698563,
        -0.12111150473356247,
        0.03864169120788574,
        -0.055098239332437515,
        -0.023127559572458267,
        0.0017420256044715643,
        0.043548621237277985,
        0.0737651064991951,
        0.05780211091041565,
        -0.0012692780001088977,
        0.029360080137848854,
        -0.03676125779747963,
        0.03891744837164879,
        -0.10783187299966812,
        -0.002395140938460827,
        -0.06928768008947372,
        -0.07498183101415634,
        -0.009067402221262455,
        0.047147486358881,
        -0.059666916728019714,
        0.0403301864862442,
        -0.00918179377913475,
        -0.029483716934919357,
        -0.05764775350689888,
        0.051783863455057144,
        -0.017530247569084167,
        -0.05295756459236145,
        -0.004284559283405542,
        0.038385652005672455,
        -0.002626206027343869,
        -0.01756545715034008,
        -0.12379500269889832,
        -0.07602491229772568,
        0.017269302159547806,
        0.006650660652667284,
        0.03848923742771149,
        -0.026065947487950325,
        -0.07062466442584991,
        0.04182881489396095,
        -0.020870398730039597,
        -0.10276181995868683,
        0.009616026654839516,
        -0.03147335350513458,
        -0.02395624853670597,
        -0.07770995050668716,
        -0.034589983522892,
        -0.03617968410253525,
        0.09314770996570587,
        0.023624597117304802,
        -0.013364464975893497,
        0.014455106109380722,
        0.0635175034403801,
        0.02052748203277588,
        0.028789490461349487,
        -0.07412903755903244,
        -0.024664999917149544,
        -0.012727616354823112,
        0.015173729509115219,
        0.018029462546110153,
        0.029122449457645416,
        -0.03562473878264427,
        -0.08772674202919006,
        0.04617676883935928,
        -0.022994743660092354,
        0.03111443854868412,
        0.018738863989710808,
        -0.003992767538875341,
        0.0457921102643013,
        -0.08075656741857529,
        -0.028927301988005638,
        -0.030176855623722076,
        0.036468926817178726,
        0.007070277351886034,
        -0.028056230396032333,
        -0.04471690580248833,
        -0.19439710676670074,
        -0.012566431425511837,
        0.006748570594936609,
        -0.05506717786192894,
        0.03451280668377876,
        0.02818744070827961,
        -0.03081681951880455,
        -0.002073240000754595,
        0.009233363904058933,
        -0.08132372796535492,
        -0.029728243127465248,
        0.07785176485776901,
        0.04297903925180435,
        -0.10852330178022385,
        0.09147237241268158,
        0.055859118700027466,
        -0.012003296986222267,
        0.08689408004283905,
        0.04175553843379021,
        0.05041863024234772,
        0.06633885204792023,
        0.08389664441347122,
        0.012254538014531136,
        -0.014846106991171837,
        5.762080085846937e-33,
        -0.007928775623440742,
        0.03274790570139885,
        0.02981778420507908,
        0.03259832039475441,
        -0.022284848615527153,
        0.02348274365067482,
        -0.018674403429031372,
        0.11982814967632294,
        0.03420405834913254,
        0.04772557318210602,
        0.011723916977643967,
        -0.005349450744688511,
        0.01572779193520546,
        0.055927250534296036,
        -0.05101582035422325,
        -0.08495403081178665,
        -0.022280219942331314,
        -0.09718317538499832,
        0.0026571033522486687,
        -0.05852138251066208,
        -0.05454440787434578,
        -0.02783389762043953,
        0.07944086194038391,
        0.08419996500015259,
        0.03559248521924019,
        0.03061353787779808,
        0.08628785610198975,
        -0.03077666275203228,
        0.07684578746557236,
        0.02929614670574665,
        -0.01729855313897133,
        0.02174222655594349,
        0.05401374027132988,
        0.013300136663019657,
        -0.07941849529743195,
        0.06608908623456955,
        -0.03326785936951637,
        -0.030501481145620346,
        -0.047905370593070984,
        -0.049112237989902496,
        0.03359496593475342,
        -0.01793646812438965,
        -0.07059978693723679,
        -0.03174431249499321,
        -0.001031532883644104,
        0.008049757219851017,
        0.008384495042264462,
        -0.08457544445991516,
        0.038617994636297226,
        0.012875407934188843,
        -0.05738662928342819,
        -0.10516464710235596,
        0.023365208879113197,
        0.036784347146749496,
        -0.04613236337900162,
        0.013507789932191372,
        -0.029445357620716095,
        -0.058315832167863846,
        0.04937348514795303,
        0.0010541528463363647,
        -0.005064044147729874,
        0.011409846134483814,
        0.04199308529496193,
        -0.02808145061135292,
        -0.07131323963403702,
        0.021552182734012604,
        0.004360226448625326,
        -0.002575888764113188,
        -0.05289744213223457,
        0.03569243475794792,
        0.05740248039364815,
        0.06316693872213364,
        0.04266639053821564,
        -0.062134750187397,
        0.008534328080713749,
        0.06692662090063095,
        -0.0532630980014801,
        0.03926901891827583,
        0.07684248685836792,
        -0.09648940712213516,
        -0.07524168491363525,
        0.02949594520032406,
        0.0414590984582901,
        0.019282255321741104,
        0.04622424393892288,
        -0.061192866414785385,
        -0.04405751824378967,
        0.05854971334338188,
        0.024614155292510986,
        0.03147730976343155,
        0.04930129647254944,
        0.004509124904870987,
        -0.05985408276319504,
        -0.08686449378728867,
        -0.0013649414759129286,
        -7.73810886478225e-33,
        0.056969307363033295,
        0.06354167312383652,
        0.032313600182533264,
        0.023356927558779716,
        0.04061530530452728,
        -0.017148643732070923,
        0.04958256334066391,
        0.09469866007566452,
        -0.020048122853040695,
        -0.050850771367549896,
        -0.08714675158262253,
        0.038360416889190674,
        0.005740300752222538,
        -0.01622726023197174,
        0.07456941157579422,
        0.008625095710158348,
        -0.059383682906627655,
        0.0057946667075157166,
        0.023505080491304398,
        0.00044441380305215716,
        0.03284534439444542,
        0.1076965257525444,
        0.07498252391815186,
        0.04791542887687683,
        0.01497327908873558,
        -0.0077329883351922035,
        -0.02852792851626873,
        -0.020542798563838005,
        0.08456923812627792,
        0.036556802690029144,
        -0.017968110740184784,
        0.005798651836812496,
        0.0016671511111781001,
        -0.009731292724609375,
        -0.05035488307476044,
        -6.943581684026867e-05,
        0.033293284475803375,
        0.0559188574552536,
        -0.048001110553741455,
        -0.07540089637041092,
        -0.046779610216617584,
        -0.005373240448534489,
        -0.05390860140323639,
        -0.08849845081567764,
        -0.07236316800117493,
        -0.0898846983909607,
        -0.008022943511605263,
        -0.007013402879238129,
        0.06497979909181595,
        0.11811864376068115,
        -0.06331709027290344,
        -0.05789955332875252,
        0.03611726313829422,
        0.033470269292593,
        -0.026615817099809647,
        -0.037386707961559296,
        0.05817904695868492,
        -0.01925061084330082,
        -0.051460400223731995,
        0.00649548415094614,
        -0.0258297361433506,
        0.05831176042556763,
        0.05986521393060684,
        -0.014500794000923634,
        -0.006547930184751749,
        -0.0049507408402860165,
        0.02201787754893303,
        0.01036454364657402,
        0.018797382712364197,
        0.032566532492637634,
        0.030531087890267372,
        -0.05769963935017586,
        0.014287282712757587,
        -0.09620077162981033,
        -0.05443183705210686,
        0.0029916653875261545,
        0.002865496091544628,
        0.00715008657425642,
        0.029390987008810043,
        -0.07280047982931137,
        -0.02592373639345169,
        -0.027637271210551262,
        -0.03923430293798447,
        0.013182779774069786,
        0.0666532814502716,
        -0.006684428546577692,
        0.045272573828697205,
        -0.011384648270905018,
        0.038202185183763504,
        0.04193708300590515,
        -0.03711051121354103,
        0.025492241606116295,
        -0.0003402726142667234,
        0.07929427921772003,
        -0.04255915433168411,
        -6.181734590882115e-08,
        -0.04166358336806297,
        0.10709071904420853,
        -0.0041632456704974174,
        0.016487624496221542,
        0.08012557029724121,
        0.04168282449245453,
        0.017136098816990852,
        0.01208384707570076,
        0.014104544185101986,
        0.0015048565110191703,
        0.08216027915477753,
        -0.06574810296297073,
        0.07104559242725372,
        0.032003145664930344,
        -0.05683078244328499,
        -0.011545203626155853,
        -0.010474013164639473,
        0.09556956589221954,
        -0.03504044562578201,
        -0.00646602176129818,
        -0.11687462776899338,
        0.020304303616285324,
        -0.006767957005649805,
        -0.003147176466882229,
        0.039872556924819946,
        0.04809870570898056,
        -0.07566236704587936,
        0.00521070696413517,
        0.025094354525208473,
        -0.015848224982619286,
        -0.10499919950962067,
        0.045644521713256836,
        -0.05363946035504341,
        -0.0420752614736557,
        -0.006442722398787737,
        -0.019780728965997696,
        -0.07796269655227661,
        -0.04755333811044693,
        0.07904358208179474,
        0.03509116172790527,
        -0.013211912475526333,
        -0.12208399176597595,
        0.0035208624321967363,
        -0.02950334921479225,
        -0.04293885454535484,
        -0.045918114483356476,
        -0.014027086086571217,
        -0.14992117881774902,
        -0.0533721037209034,
        0.0976850762963295,
        -0.037532590329647064,
        0.0578048937022686,
        -0.05207022279500961,
        -0.004455019719898701,
        0.03618231415748596,
        0.055322110652923584,
        -0.01525148469954729,
        0.02734278328716755,
        0.031065547838807106,
        -0.006593553815037012,
        0.0861886590719223,
        -0.08903540670871735,
        0.009809230454266071,
        0.04300973191857338
    ]
}