{
    "id": "vJEbP2Vdq2U",
    "title": "What's going on with Windows Laptops?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2024-08-03T02:13:54Z",
    "video_url": "https://www.youtube.com/watch?v=vJEbP2Vdq2U",
    "category": "Science & Technology",
    "tags": [
        "Surface laptop",
        "Microsoft Surface",
        "Windows laptops",
        "MKBHD",
        "ARM laptops"
    ],
    "views": 3897937,
    "likes": 114517,
    "comments_count": 4551,
    "description": "Windows ARM laptops are finally having a moment and I'm loving it.  See inside your smartphone or laptop with dbrand at   Microsoft Surface Laptop 7:   MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   Surface provided by Microsoft for review.  ~",
    "description_links": [
        "https://dbrand.com/xray",
        "https://geni.us/r9SOB1B",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(Windows chiming) - Okay, I've been waiting for this for a while. As someone who's been on the sidelines of the Windows game for a little while now and seeing all this hype and this new matte black laptop that's supposed to be generational, it's got me thinking, is it legit? Like have Windows laptops actually caught up to the Apple Silicon leap from a couple years ago? Because this is a new Microsoft Surface laptop and it doesn't have an Intel chip inside, it doesn't have an AMD chip inside, this laptop has a Qualcomm Snapdragon X Elite chip inside, meaning it is an ARM laptop. Now, years ago, Apple went through this transition from Intel chips to ARM chips and it was crazy successful, like, no one could really match their efficiency and seamless integration, the vertical integration, the overall package of their laptops just took a quantum leap forward. Now Windows laptops around the same time, actually, if you remember kind of tried the same thing, I don't know if you remember the Surface Pro X, that didn't go so well and so we've continued to have Intel and AMD laptops since then. But it seems like this one has gone way better. So I've been using this laptop for the past couple weeks, you might have seen me with it on the Waveform Podcast, and I've got a pretty good idea now of what's gone well and what is still a trade off. So the big advantage, the mega quantum leap forward was inefficiency, which in a laptop with the same size battery means a dramatically improved battery life, and this laptop absolutely got a big bump up. So I remember reading reviews of the last Surface laptop with an Intel chip, which already had a pretty solid battery life, and the Microsoft quote was 19 hours. This one's quote is 23 hours, but what that's translated to for me, basically, is all day battery life for mixed use with no worries, like, that's high brightness, web browsing, email, watching videos, research type activities, and then, ending the day at like 40% easily. So I just really don't think about charging much, which is awesome for a 14-inch laptop. On paper, it's getting compared a lot to the M3 13-inch MacBook Air and it even outlasts it on some synthetic benchmarks, which is awesome. So that's one success, definitely check the box, great battery life, love that. And then, the other second success that we were looking forward to was just a well optimized performance. And it's not like the super high end gaming performance, I'm not talking about that type of performance, but I just mean like a general smoothness and consistency and rock solid performance across all your everyday regular tasks, that sort of performance. Now I'm gonna get into app support in a minute, but I basically found this to be a very capable laptop. Now again, I've been on the sidelines from Windows for a bit, so I don't have as many reference points, but this is a $2,000 14-inch laptop that can basically do anything I ask of it without breaking a sweat. Photo editing in Affinity, not a problem. Literally anything in the Microsoft Office Suite, no problem, whether you're plugged in or not. You know, I found the track pad gestures are pretty smooth, the graphics of the whole UI in general are consistent from full battery to nearly dead. So using a software that runs natively on it is snappy and a great experience. But that very quickly gets you into the conversation about the downside of switching to ARM. This is what I was curious about repeating from last time, and this actually happened in the Mac world too when they made this transition, the number one difficulty to changing the entire architecture of your computer is actually app compatibility. So I remember, when the Mac went through this, there were basically three types of apps. There's obviously optimized apps at the top of the list, like that's the ideal, obviously, all the first party apps are optimized off the bat and Apple did a lot of work trying to get as many developers onboard as possible to get their apps optimized on ARM. But then there were apps that were built for x86 but would still work on ARM through emulation. So they'd not perform necessarily as well as they could, but at least they worked anyway. And then, there were apps that just didn't work at all. So right now for Windows on ARM, you have these three types of apps again, and my assessment is that, at this very moment, there's pretty good support for native apps as far as things people use every day. But it's definitely still not perfect. So, okay, Photoshop and Lightroom CC run native, Chrome, Spotify, Prime Video, Dropbox, Zoom, like there's a lot of popular apps across the board that just run natively and they're super smooth and they're great, they don't hit battery hard at all, love that. So then there are some apps that I used that don't support Windows on ARM but do get emulated, so they still work technically. So Lightroom Classic is a big one, my to-do list app of Choice is TickTick, you might have heard of it, I've referenced it a few times and it's a great example. If you go to their website, they only have x86 versions of the app and I downloaded and ran the 64 bit version and it works, but it doesn't actually run very well. I actually notice some real chop and some lag with certain parts of the UI, and it's not even that heavy of an app, it's just a to-do list app. And there's a long list of apps in this sort of limbo phase where you don't necessarily know if there's going to be an ARM native app around the corner or not 'cause adoption's not super high, it's not really a huge incentive for them to make one yet, but you can still use it, it's just not gonna be the ideal experience. It might churn through battery a little bit quickly, but it still works. But then there are just apps that straight up don't work at all yet. Arc browser, Google Drive on desktop, I rely heavily on that, that does not have any compatibility at all with Windows on ARM, VMware doesn't work, a lot of VPNs don't work, and a lot of games straight up don't run, like some of 'em are uncompatible, but also a lot of them which might have ordinarily run have anti-cheat software that doesn't run on Windows on ARM so the game just doesn't work at all. And there's even some apps that actually now that I think about it are compatible, but their websites for the companies that make them don't actually highlight or prominently show the download for the ARM version, so it's kind of confusing and it's hard to find. So it's just kind of all over the place right now. So my take here is, look, if you are at all considering a Windows ARM laptop, specifically, look up the apps that you have to use and make sure they're at least compatible, at least emulatable 'cause there might be some promises of ARM versions coming soon, or just statements from a developer, I've seen lots of those. But just check the programs that you know you're gonna need to work because, depending on who you are, you could be totally covered and fine or totally outta luck. So there are a couple Windows ARM laptops out there, this is the one I obviously chose to mess with, the premium matte black one with the Snapdragon X Elite. So here's a couple more of my observations scattered from my couple of weeks of using it. I gotta say the build quality is pretty awesome, as they have been with Surface for a little while now. I love the all metal design, the keyboard's rock solid, big track pad with excellent haptics, and just really good fundamentals all around. The port selection is all right, it's still got that full size USB-A and then there's two USB-C with the headphone jack. My only real downside I would say with it getting as pricey as it can get is that there is no OLED option. So instead it's a 2304x1536, 120 hertz LCD touchscreen with that 3x2 aspect ratio, and I love that it's tall, it's just, it can't quite match the deep blacks and contrast of an OLED, obviously, even though it's a pretty good LCD. So I just feel like I basically traded the OLED for a high refresh rate here, but I would've liked to have seen an OLED option. And then just know that it's not, like, it's not like a super high-end gaming PC. It's very strong in performance across the board, it'll do all the other things. But similar to Apple's M Series laptops, like it's a built-in GPU, it's not gonna be as powerful as a dedicated GPU. So don't expect, I mean, you can still play some games, sure, but you're not getting this laptop to max out frame rates in \"Elden Ring\" or something. If you study the benchmarks enough, you'll find that these chips have a lot of cores, but weaker individual performance on like a single core basis. So it's good at throwing a lot of cores at tasks and getting things done and that's nice, just note that. And it's generally pretty good at staying cool and not spinning up the fans, which I also think is great. And then, of course, this is also one of the very first copilot PCs, so it's got the dedicated copilot button on the keyboard. And so, yeah, this chip has an NPU, which does specific AI related processing. Things like the studio camera effects that are built into the camera or the forced artificial eye contact in the camera, and it'll do it without pulling anything from the CPU or GPU. And, of course, you can always hit that copilot button to talk to Microsoft Copilot, ask it anything, the same way you'd talk to Bing or ChatGPT or Gemini. But overall, this laptop is a good start, I think. I mean, I've been waiting personally for a premium built matte black Windows laptop for a while on ARM and this is that, it's actually what we've been waiting for. I think the question really is, does the software you use work on ARM? Like, that's the main question you should be considering when thinking about if you're gonna buy one of these things. Now, before you go, here's a question. Have you ever looked at a laptop or a smartphone and wondered, what's going on inside it? Because channel sponsor dbrand has your answers. Now you've seen, for years now, one of my favorite party tricks has been this sheet of magnet paper. You just lay it down on any device to see where a few of the internals are, like the MagSafe magnet array or the speaker. dbrand's x-ray line takes that magnet paper experience to a whole nother level, letting you see basically every single component inside your device, and yes, this is an actual legit X-ray of that device. Yes, dbrand took hundreds of devices to a metrology lab and literally shot each one of them with a special X-ray machine for maximum accuracy. And they also made a light mode version of every x-ray. So personally, I am into the dark mode version, but hey, if you don't wanna have to choose, if you buy any X-ray skin, you'll get the other colorway for free with your order. So if that sounds like a good deal to you, I'll leave a link for you to check 'em out below, it's dbrand.com/ x-ray. But yeah, that's been it, let me know what you think of the Surface laptop, of the whole Windows on ARM thing. I'll check out the comments, but either way, let me know. Catch you guys on the next one, peace. (upbeat music)",
    "transcript_keywords": [
        "Windows ARM laptop",
        "ARM",
        "laptop",
        "Windows",
        "Windows ARM",
        "apps",
        "couple Windows ARM",
        "Surface laptop",
        "Microsoft Surface laptop",
        "ARM laptop",
        "Windows laptops",
        "Windows on ARM",
        "work",
        "black Windows laptop",
        "app",
        "laptops",
        "Intel chip",
        "ARM native app",
        "Surface",
        "battery"
    ],
    "transcript_entity_values": [
        "120",
        "14-inch",
        "Qualcomm",
        "MagSafe",
        "Apple",
        "three",
        "2304x1536",
        "Photoshop",
        "Spotify",
        "Dropbox",
        "one",
        "AMD",
        "dbrand",
        "LCD",
        "years",
        "my couple of weeks",
        "Windows",
        "64",
        "the day",
        "3x2",
        "2,000",
        "M3",
        "MacBook Air",
        "the Microsoft Office Suite",
        "Prime Video",
        "Intel",
        "Gemini",
        "Lightroom Classic",
        "UI",
        "hundreds",
        "Affinity",
        "the past couple weeks",
        "VMware",
        "first",
        "USB-C",
        "13-inch",
        "a minute",
        "23 hours",
        "Microsoft",
        "40%",
        "GPU",
        "all day",
        "Microsoft Surface",
        "Windows",
        "Apple's M Series",
        "second",
        "max",
        "Chrome",
        "a couple years ago",
        "years ago",
        "Mac",
        "Google Drive",
        "Elden Ring",
        "NPU",
        "CPU",
        "the Surface Pro X",
        "Apple Silicon",
        "AMD",
        "Lightroom CC",
        "two",
        "Microsoft Copilot",
        "19 hours",
        "USB",
        "Surface"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "TIME",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.11466174572706223,
        0.02684701979160309,
        0.055523891001939774,
        -0.01296973880380392,
        0.028232594951987267,
        -0.023170890286564827,
        0.011221732012927532,
        -0.022831793874502182,
        -0.017915023490786552,
        -0.019802145659923553,
        0.027919121086597443,
        0.017443394288420677,
        0.04680970311164856,
        -0.028509652242064476,
        0.02058897167444229,
        0.024286769330501556,
        0.050918590277433395,
        -0.12290449440479279,
        -0.057044729590415955,
        0.03335713967680931,
        -0.06936820596456528,
        3.8218979170778766e-05,
        -0.006033861543983221,
        -0.01423097774386406,
        0.08397186547517776,
        0.01555836945772171,
        0.06964769214391708,
        -0.027950214222073555,
        -0.07650265097618103,
        0.02719786763191223,
        0.009184028953313828,
        0.0878651961684227,
        -0.027169089764356613,
        0.019222255796194077,
        0.04782747104763985,
        -0.0728173777461052,
        0.04329456388950348,
        -0.002508891513571143,
        -0.01619677245616913,
        -0.1616523563861847,
        -0.05247832089662552,
        -0.0661282166838646,
        0.05374741926789284,
        0.023255541920661926,
        0.04216183349490166,
        0.009124483913183212,
        0.060506176203489304,
        -0.053708452731370926,
        -0.0613686703145504,
        0.025697750970721245,
        -0.03648920729756355,
        -0.07957170158624649,
        0.06237391382455826,
        -0.07521598786115646,
        -0.03707088530063629,
        0.028589261695742607,
        0.06398869305849075,
        0.027744023129343987,
        0.01187681220471859,
        0.014072836376726627,
        0.08704568445682526,
        -0.11708196252584457,
        -0.016744304448366165,
        -0.004396824166178703,
        0.00788170751184225,
        -0.054937150329351425,
        0.017453325912356377,
        -0.06350506842136383,
        0.05843142047524452,
        -0.037269581109285355,
        0.03285977244377136,
        -0.02370622009038925,
        0.010385371744632721,
        0.01858682557940483,
        0.03557673841714859,
        -0.0033833517227321863,
        0.04212565720081329,
        -0.00933558214455843,
        0.01849830336868763,
        -0.044436775147914886,
        -0.01356388721615076,
        0.02378500998020172,
        0.05422331020236015,
        -0.01600753329694271,
        0.031075960025191307,
        -0.009009825065732002,
        -0.030770011246204376,
        0.004257502965629101,
        -0.05710162594914436,
        0.0003555376606527716,
        -0.03160382807254791,
        0.060085996985435486,
        -0.04340473562479019,
        -0.03324368596076965,
        0.06283816695213318,
        -0.021379027515649796,
        0.01855025812983513,
        -0.06423581391572952,
        0.0063927676528692245,
        0.031160838901996613,
        -0.02334439381957054,
        0.06721295416355133,
        0.08176902681589127,
        -0.057343319058418274,
        0.0005008921725675464,
        -0.06486912071704865,
        -0.003420518711209297,
        0.04523659497499466,
        -0.03429203853011131,
        -0.02339201420545578,
        0.005436952691525221,
        -0.01667870208621025,
        -0.01801648736000061,
        0.044964082539081573,
        0.016704462468624115,
        0.010038959793746471,
        -0.012494035996496677,
        0.0249318890273571,
        0.04501474276185036,
        0.05548025667667389,
        -0.023979712277650833,
        0.025462737306952477,
        -0.050702858716249466,
        -0.00018143349734600633,
        -0.016200926154851913,
        0.06455716490745544,
        -0.07973215728998184,
        2.7458559885269976e-33,
        0.023271242156624794,
        0.009240493178367615,
        0.005507768597453833,
        -0.005630304105579853,
        -0.025008806958794594,
        -0.09491350501775742,
        0.023554246872663498,
        -0.024859154596924782,
        0.04376273974776268,
        0.008485892787575722,
        -0.08506985753774643,
        0.003587292041629553,
        -0.019357508048415184,
        0.002138972282409668,
        0.09392742812633514,
        -0.0379447303712368,
        -0.09284892678260803,
        -0.04171147570014,
        -0.03305443376302719,
        0.01999591290950775,
        0.05437716096639633,
        0.04122418165206909,
        -0.013631856068968773,
        -0.11158805340528488,
        0.0025626858696341515,
        0.08650971949100494,
        0.0007816660800017416,
        0.05001150816679001,
        0.0751558169722557,
        0.03253886103630066,
        -0.05676044523715973,
        -0.015366865321993828,
        -0.07389958202838898,
        -0.15229949355125427,
        -0.061491094529628754,
        0.04424603655934334,
        -0.011502787470817566,
        -0.07132133841514587,
        0.0728997215628624,
        0.014239287935197353,
        -0.07602983713150024,
        0.0343942753970623,
        -0.03201879933476448,
        -0.03271753713488579,
        0.025862369686365128,
        0.030409187078475952,
        0.0007982815732248127,
        -0.013101937249302864,
        -0.04487396031618118,
        0.0023101598490029573,
        -0.04869100823998451,
        0.04762183874845505,
        0.0812048614025116,
        0.02684452198445797,
        -0.03815973550081253,
        0.00498855160549283,
        0.05724293738603592,
        0.00842974428087473,
        0.08782108128070831,
        0.14146822690963745,
        0.06413033604621887,
        -0.015664884820580482,
        -0.05749426409602165,
        0.03154842182993889,
        -0.04553602635860443,
        0.07688629627227783,
        0.1554771065711975,
        0.06969273835420609,
        -0.09361036866903305,
        0.06224192678928375,
        0.03308085352182388,
        -0.08117429912090302,
        -0.057549089193344116,
        -0.05706501752138138,
        -0.010742943733930588,
        -0.07873136550188065,
        0.0077378349378705025,
        0.002395317191258073,
        -0.021445462480187416,
        -0.03436064347624779,
        0.035292718559503555,
        0.07651461660861969,
        -0.009277044795453548,
        -0.05571454390883446,
        -0.07565618306398392,
        0.02126210369169712,
        -0.013161507435142994,
        -0.08500026911497116,
        -0.02355331741273403,
        0.03728916123509407,
        -0.04425046965479851,
        -0.004281538538634777,
        -0.05924573168158531,
        0.04446462541818619,
        -0.041484981775283813,
        -4.529314180884649e-33,
        -0.012334425933659077,
        -0.052074216306209564,
        -0.01933157630264759,
        -0.013302356004714966,
        -0.08000636845827103,
        0.026697341352701187,
        -0.0328039787709713,
        0.011662770062685013,
        -0.09121862798929214,
        -0.03985104709863663,
        0.030637765303254128,
        0.06887207180261612,
        -0.008977481164038181,
        0.028878558427095413,
        -0.017162881791591644,
        -0.039775967597961426,
        0.02415355108678341,
        -0.012538855895400047,
        0.08384614437818527,
        0.006163972895592451,
        0.09515652805566788,
        0.06769805401563644,
        0.017455395311117172,
        -0.024716392159461975,
        -0.06104021146893501,
        -0.023866163566708565,
        -0.08896283805370331,
        0.003776517463847995,
        0.03139614313840866,
        0.06121427193284035,
        0.022084305062890053,
        0.0017193969106301665,
        0.044404927641153336,
        -0.008943790569901466,
        0.11200428009033203,
        -0.03627104312181473,
        -0.012206390500068665,
        -0.0892307311296463,
        -0.008969807997345924,
        -0.012473749928176403,
        0.057626113295555115,
        0.024063430726528168,
        -0.057471394538879395,
        0.03672994673252106,
        0.07092601805925369,
        0.04641884192824364,
        -0.07924637943506241,
        0.0018422557041049004,
        0.020609330385923386,
        -0.04021920636296272,
        0.022020529955625534,
        0.001117622829042375,
        0.0033054344821721315,
        -0.05161025747656822,
        -0.06676017493009567,
        -0.050295863300561905,
        -0.03430461138486862,
        0.01563333347439766,
        0.0069557237438857555,
        0.039230674505233765,
        0.00312739796936512,
        0.015372006222605705,
        -0.003427264280617237,
        -0.12688405811786652,
        0.001951463520526886,
        0.07205794006586075,
        0.09078091382980347,
        0.01648765429854393,
        -0.0020964094437658787,
        -0.05497937276959419,
        -0.016667434945702553,
        -0.0477200523018837,
        -0.06901344656944275,
        -0.02320740930736065,
        -0.009974753484129906,
        0.039763640612363815,
        0.06133182346820831,
        -0.025521069765090942,
        -0.07384822517633438,
        -0.024156704545021057,
        0.03414493426680565,
        0.02591618336737156,
        0.09415768086910248,
        0.006418998818844557,
        0.0580916628241539,
        -0.005111756268888712,
        -0.010183315724134445,
        -0.0020728781819343567,
        -0.08645321428775787,
        0.022061359137296677,
        0.012717307545244694,
        -0.02700251340866089,
        -0.04155314341187477,
        0.12192940711975098,
        -0.04839280992746353,
        -4.898702243849584e-08,
        0.04071824625134468,
        0.015996232628822327,
        0.0671253353357315,
        0.014069348573684692,
        -0.07495452463626862,
        -0.005535101518034935,
        0.021678118035197258,
        -0.018855109810829163,
        0.07093870639801025,
        0.006695292890071869,
        -0.022292742505669594,
        -0.09054453670978546,
        -0.0348442867398262,
        0.06580349802970886,
        0.00999330822378397,
        0.11181928962469101,
        -0.06372242420911789,
        0.028708860278129578,
        -0.007245534099638462,
        -0.026403838768601418,
        0.004011601209640503,
        0.0704135149717331,
        0.14242294430732727,
        -0.05347265303134918,
        0.01183005515486002,
        0.022369468584656715,
        -0.08447083085775375,
        0.016046568751335144,
        0.05006929114460945,
        0.006983740720897913,
        -0.09745313227176666,
        -0.014143980108201504,
        0.08396738022565842,
        0.04119303449988365,
        0.013041742146015167,
        -0.0606570765376091,
        0.02067890577018261,
        0.049041952937841415,
        0.08901277184486389,
        -0.007954305037856102,
        -0.06414227187633514,
        -0.05191165953874588,
        -0.08926240354776382,
        -0.024056820198893547,
        0.003914171829819679,
        -0.01115406583994627,
        -0.046691782772541046,
        -0.061727385967969894,
        -0.0192277655005455,
        0.07388720661401749,
        0.004841320216655731,
        -0.018244637176394463,
        0.05278557166457176,
        0.06184069439768791,
        -0.02530703879892826,
        0.026916658505797386,
        -0.07766346633434296,
        -0.017879808321595192,
        0.03732992708683014,
        0.045758116990327835,
        0.11734499037265778,
        -0.08035265654325485,
        -0.01331302523612976,
        0.08641394227743149
    ]
}