{
    "id": "vkBggN9uqfs",
    "title": "How Many Batteries Does It Take To Power A Desert Island?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-07-05T15:26:40Z",
    "video_url": "https://www.youtube.com/watch?v=vkBggN9uqfs",
    "category": "Science & Technology",
    "tags": [
        "jackery explorer 240",
        "anker powerhouse 200",
        "anker powerhouse review",
        "jackery explorer review",
        "biggest battery banks",
        "biggest battery pack",
        "portable battery packs 2019",
        "mrmobile",
        "michael fisher"
    ],
    "views": 103568,
    "likes": 5727,
    "comments_count": 306,
    "description": "When I found two huge batteries totaling 440 Wh of power in my mailbox, I thought that deserved more than your typical battery test. So I packed up every piece of tech I brought with me for my Fourth of July weekend, and then I asked my friendly neighborhood boat captain to give me a ride to a different kind of testing lab: an island that would only give me four hours before it sank beneath the waves. Watch the MrMobile Island Battery Test to see how much luck I had draining these monster batteries before the tide came in!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S ISLAND BATTERY TEST]  MrMobile's Island Battery Test was produced using review samples of an Anker PowerHouse 200 and a Jackery Explorer 240, on loan from Anker and Jackery respectively. Other review samples featured in this video were subjects of prior MrMobile reviews, or will be the subject of future content. No manufacturer was given editorial input or an advance copy of this video.   [PRODUCTS IN THIS VIDEO]  Anker PowerHouse 200:  Discount code: MOBILEPW ($50 off through July 14)  Jackery Explorer 240:  Discount code: THEMRMOBILE (15% off through July 15)   [SOCIALIZE]        [MUSIC]  Used To It, by Luciano Music Co., available at Premium Beat:   What You Got by Luciano Music Co., available at Premium Beat:    [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #anker #jackery #battery #batteries #tech #powerhouse",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1IE",
        "http://mrmobile.tech/1ID",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.premiumbeat.com/royalty-free-tracks/used-to-it",
        "https://www.premiumbeat.com/royalty-free-tracks/what-you-got",
        "http://www.mobilenations.com/external..."
    ],
    "transcript": "- When I opened my mailbox to find a 440 watt-hours of power, I thought that deserved more than your typical battery test. So I packed up every piece of tech I brought with me for my 4th of July weekend, and then I asked my friendly neighborhood boat captain to give me a ride to a different kind of testing lab, an island that would only give me four hours to deplete these batteries before it sank beneath the waves. (classy electronic music) Safety first. I'm gonna share plenty more nature shots with you as we go on, but first let me tell you about the products we're testing. The stars of the show are these big car battery-looking things, the Anker Powerhouse 200 and the Jackery Explorer 240. Those numbers denote the watt-hours of stored energy when these are fully charged. And to put that in context, Anker says the Powerhouse can inflate an air mattress 18 times, while Jackery promises 40 hours of power for a five-watt lantern, the kinda things that matter when you're going camping for a weekend. But I don't have that kind of time. It's nearly four o'clock by the time I get everything set up. By 8:00 p.m. the tide will have come in enough to put the island tip of this peninsula underwater. So I plug in everything I can, my half-charged MacBook Pro, the Blackberry that's giving me my internet hotspot, the Pixel 3 that's controlling the 360 camera, that's the Insta 360 One X up here on its mast at land's end. Keeping time for us is the Casio Pro Trek F30, also at about half a charge and now also plugged in. And of course no beach visit is complete without an Amazon Kindle to read, so we'll top that up too. And to make sure I don't get blinded by that hot light in the sky, I'm wearing Focals by North smart glasses. I'll get into these in a future video, but for now all you need to know is they need charging too. And it gets lonely on a desert island, so at my feet, to keep me company, AIBO the robot dog. I'm about 3/4 charged and drawing power from the dock in his protective little pen here. (classy electronic music) About an hour after I started with seven devices pulling power from both packs, let's check to see how much charge I have left. And I'm still over 80% on both batteries. So yeah, I'm pretty sure I'm not gonna be able to run them dry before my feet get wet. But I'm giving it my best shot, so let's put more load on. I've brought along a personal cooler in the form of the Evapolar 2 review device, and after filling it with water its fan is blowing cool, moist air that's immediately swallowed up by the hot, moist air blowing in from the bay. I also ran out of charge on my camera battery about this time, so I took the opportunity to plug that in too. Actually, let's make a point here. This is a great example of why having an AC inverter on a battery pack is useful. Not all chargers are USB. Of the tech I brought, that Fuji battery charger, the Aibo dog, and my drone charger all bore two-prong wall plugs. There's a downside to this I'll touch on at the end, but it's still important to have and I'm glad both of these batteries are so equipped. Even so, I wanted more USB ports. Anker has the edge with a USB-C that can kick out 30 watts, in addition to its two USB-As. Jackery only has the latter. Approaching the six o'clock hour, my Insta 360 was running low, so I unplugged the now full Kindle and popped that in in its place. Then I checked out the wind forecast on my MacBook, which told me the breeze was just about to lie down. So as the power level fell to below 80 and 70% on the Jackery and Anker respectively, and as the tide finally started to make its presence felt, I took to the sky with the DJI Mavic Air to burn some more milliamps. (downtempo music) While we're in the air, let's talk about flying with these batteries. In short, you can't. In the United States, for safety reasons, the maximum size of battery you're allowed to carry on a flight is 100 watt-hours, or in some cases 160. Drones are great at burning through power, and after just 10 minutes flying in this wind I have another battery to plug in. But this will turn out to be the last load I put on these packs because the tide and my ride has come in. As you can probably see, my hair's a disaster. I didn't know that. But also more importantly my island is just about gone. So I've got my rescue lifeboat waiting for me. Why don't I check to see what levels I've managed to get these batteries down to? On the Anker I was able to get down to 52%, still more than half a charge remaining on the smaller of the two battery packs, if I'm remembering my specs right. And on the Jackery 74%, more than 3/4 power left after charging every single thing I brought with me which was, frankly, for a beach trip. Wait, where's the dog? Okay, dog is safe. Don't go anywhere, dog, we're about to, we gotta get off this thing. Which is too much for a beach trip but that was kinda the point. Now, I'll be honest with you, folks, I did not expect that I would be successful in draining these dry in less than four hours. I've tested Anker's previous Powerhouse. I tested a huge KaliPAK a couple of years ago. But these are just massive batteries, and as many devices as I was charging, I knew I wasn't quite pushing them to their limits. As the tide finally reclaimed my temporary office, I thought of the notion of using the packs to power my laptop while I wrote and edited this video, which I did, back on dry land. Oh, and here's that pro tip about AC. Any time you're using the AC plug, you're losing a ton of power because it's very inefficient. The inverter inside the battery first has to convert the battery's direct current to alternating current, and then that's immediately converted from AC back into DC by your device's wall plug so your laptop or whatever can use it. So after just 60 minutes of writing and rendering 360 video in my MacBook, I was able to pull the Jackery down by 25%. On a similar test with the Anker Powerhouse, an hour of editing in Final Cut dropped its charge by 16%, and this yet another reason all battery packs should have USB-C power delivery. It skips this conversion. So if you're convinced you need this kind of power, which of these is the better buy? Well, the Jackery is the better value, from a power density standpoint. It's got a 25% bigger power reserve and it's a full hundred bucks cheaper than the Anker. But if, as Jack Shephard says, I had to go back to the island with only one of these, I think I'd buy the Anker. I like that it's the smaller of the two and I like that I have the option of USB and USB-C, in addition to DC and AC. Each of these is available now and each is available in several sizes. I'll link here to those products in the description, and Anker and Jackery have also provided a discount code should you want to purchase. I'll include those down below as well. This video was made possible by a literal boatload of tech, including review samples. No manufacturer paid a fee for inclusion in this video nor were they given an advance copy or editorial input. And as for all the other products I brought to the island, if they haven't been reviewed already, they'll be featured in upcoming review videos this month. So be sure you don't miss that. Subscribe to theMrMobile on YouTube and Instagram. Until next time, thanks for watching and stay mobile, my friends. (downtempo music)",
    "transcript_keywords": [
        "Anker",
        "power",
        "Jackery",
        "battery",
        "Anker Powerhouse",
        "opened my mailbox",
        "mailbox to find",
        "time",
        "island",
        "batteries",
        "kind",
        "Powerhouse",
        "air",
        "typical battery test",
        "plug",
        "typical battery",
        "brought",
        "Jackery Explorer",
        "charge",
        "packs"
    ],
    "transcript_entity_values": [
        "watt-hours",
        "AC",
        "80 and 70%",
        "360",
        "Instagram",
        "Anker",
        "half",
        "this month",
        "Aibo",
        "USB-C",
        "hundred bucks",
        "Evapolar 2",
        "some more milliamps",
        "more than 3/4",
        "160",
        "Insta 360",
        "just 10 minutes",
        "AIBO",
        "MacBook Pro",
        "an hour",
        "Anker",
        "four hours",
        "YouTube",
        "Final Cut",
        "USB",
        "200",
        "74%",
        "DC",
        "Jack Shephard",
        "30 watts",
        "less than four hours",
        "25%",
        "MacBook",
        "first",
        "18",
        "40 hours",
        "the six o'clock hour",
        "two",
        "more than half",
        "MacBook",
        "about 3/4",
        "a couple of years ago",
        "Kindle",
        "the Anker Powerhouse",
        "440 watt-hours",
        "just 60 minutes",
        "16%",
        "five-watt",
        "4th",
        "52%",
        "the United States",
        "Anker Powerhouse",
        "Blackberry",
        "about half",
        "About an hour",
        "Powerhouse",
        "seven",
        "only one",
        "Jackery",
        "nearly four o'clock",
        "a weekend",
        "8:00 p.m.",
        "Amazon",
        "100 watt-hours",
        "80%"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "LAW",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "TIME",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "PERSON",
        "QUANTITY",
        "TIME",
        "PERCENT",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "TIME",
        "PERCENT",
        "QUANTITY",
        "ORDINAL",
        "PERCENT",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "TIME",
        "ORG",
        "QUANTITY",
        "PERCENT"
    ],
    "vector": [
        -0.004962465725839138,
        0.0747743472456932,
        -0.036771126091480255,
        0.013517224229872227,
        0.0028237763326615095,
        -0.08778288960456848,
        -0.04989372566342354,
        0.004575227852910757,
        -0.004284989554435015,
        0.05771736800670624,
        0.011548133566975594,
        -0.009421602822840214,
        0.06591963022947311,
        0.05313995108008385,
        0.027026206254959106,
        0.09355275332927704,
        0.022058622911572456,
        -0.08855856955051422,
        -0.030995739623904228,
        0.06655245274305344,
        0.13074563443660736,
        -0.03196023777127266,
        0.0488690584897995,
        -0.06096307933330536,
        0.033231817185878754,
        -0.007080727256834507,
        -0.07178350538015366,
        0.011929171159863472,
        -0.09607220441102982,
        -0.028300896286964417,
        -0.05493592470884323,
        0.06929636746644974,
        0.03008980304002762,
        -0.030173150822520256,
        0.0892612561583519,
        0.04461301118135452,
        0.01306973583996296,
        0.039834532886743546,
        0.04534692317247391,
        -0.002231159247457981,
        -0.05706674978137016,
        -0.04053445905447006,
        0.09269610047340393,
        0.039957720786333084,
        -0.009755796752870083,
        0.03275121748447418,
        -0.02361861802637577,
        -0.044153325259685516,
        0.012103899382054806,
        -0.02115362323820591,
        0.005932569969445467,
        -0.0439794547855854,
        0.02786409854888916,
        -0.05142756924033165,
        -0.06307739019393921,
        -0.09357145428657532,
        -0.03759944066405296,
        0.025519276037812233,
        0.0685250386595726,
        -0.0220036618411541,
        0.006737664807587862,
        -0.018661873415112495,
        -0.024300621822476387,
        -0.006347151007503271,
        0.03306278586387634,
        -0.01246251817792654,
        -0.07730009406805038,
        -0.05445128679275513,
        -0.0801602154970169,
        -0.05310956388711929,
        0.015310713090002537,
        -0.04332447424530983,
        0.07906948775053024,
        -0.07252850383520126,
        -0.08972802013158798,
        0.026736441999673843,
        0.002571304328739643,
        0.02412497065961361,
        0.046378958970308304,
        -0.005381706170737743,
        0.033500928431749344,
        -0.05281691625714302,
        0.02157462015748024,
        -0.011506862938404083,
        0.10083867609500885,
        0.06551539152860641,
        0.09013007581233978,
        0.0068482933565974236,
        -0.034205202013254166,
        0.018186228349804878,
        0.022343197837471962,
        0.028651313856244087,
        0.01542259007692337,
        0.05512312054634094,
        -0.014720193110406399,
        0.04126002639532089,
        -0.06978893280029297,
        0.006634687073528767,
        -0.021606069058179855,
        0.009782116860151291,
        0.12160765379667282,
        0.06096243858337402,
        0.04312625899910927,
        -0.08266528695821762,
        0.0032213907688856125,
        -0.014739868231117725,
        -0.04293157160282135,
        0.01629268191754818,
        0.12541404366493225,
        0.005587536375969648,
        -0.0068974569439888,
        0.039502017199993134,
        0.020775392651557922,
        0.04152954742312431,
        -0.04136601835489273,
        0.050845127552747726,
        -0.09831865131855011,
        0.06742538511753082,
        0.10207585990428925,
        -0.0006064603221602738,
        0.04041389003396034,
        -0.04715579003095627,
        0.034560054540634155,
        -0.02069873921573162,
        0.06285015493631363,
        0.10672888904809952,
        0.0015326443826779723,
        4.3161140357920415e-33,
        -0.049381788820028305,
        0.04726306349039078,
        0.021069413051009178,
        0.04755115881562233,
        0.03763612359762192,
        -0.07279027253389359,
        -0.05768462270498276,
        0.0216722022742033,
        0.040189582854509354,
        0.06635607033967972,
        -0.0022850928362458944,
        0.06562770158052444,
        -0.005807943642139435,
        0.012062575668096542,
        -0.007714829407632351,
        -0.02811119146645069,
        0.05252518504858017,
        -0.1437414437532425,
        -0.014798246324062347,
        -0.04583771899342537,
        0.001089789904654026,
        -0.052076999098062515,
        0.018683020025491714,
        -0.020315391942858696,
        0.02687082625925541,
        -0.0127255292609334,
        0.07035253942012787,
        -0.05735740810632706,
        0.05086386203765869,
        0.05827442184090614,
        0.00022505634115077555,
        -0.024262478575110435,
        -0.02741173468530178,
        0.020056212320923805,
        -0.035778164863586426,
        -0.01634429767727852,
        0.038120292127132416,
        -0.0751880556344986,
        -0.10156334191560745,
        -0.06455086916685104,
        -0.053469784557819366,
        0.025983668863773346,
        -0.04244672879576683,
        0.035781245678663254,
        -0.03724787011742592,
        -0.11844096332788467,
        -0.004886150825768709,
        0.02835412137210369,
        0.0001324138866038993,
        0.050044164061546326,
        -0.11306001991033554,
        -0.029347620904445648,
        -0.04118916764855385,
        -0.00424051471054554,
        -0.07488764822483063,
        0.03413620591163635,
        0.00769596453756094,
        -0.004291837569326162,
        0.044662825763225555,
        0.07713659107685089,
        0.02252321131527424,
        0.018769510090351105,
        0.02207694575190544,
        -0.03832235932350159,
        -0.02239321731030941,
        0.034018516540527344,
        -0.015859993174672127,
        0.006769202183932066,
        -0.05605785921216011,
        0.014540649950504303,
        0.09717809408903122,
        -0.12102402746677399,
        0.03456225246191025,
        -0.09362352639436722,
        0.004378878511488438,
        -0.02762516587972641,
        0.08684071898460388,
        0.08140888065099716,
        -0.036511942744255066,
        -0.05505118891596794,
        -0.026365118101239204,
        -0.03453380987048149,
        0.012073016725480556,
        0.001448397058993578,
        -0.014307034201920033,
        -0.07341290265321732,
        -0.024465639144182205,
        -0.0308820977807045,
        0.0007471052231267095,
        0.06267762929201126,
        0.017825040966272354,
        -0.07663357257843018,
        -0.0030103109311312437,
        -0.009473510086536407,
        0.0602869875729084,
        -5.077122833700652e-33,
        -0.02415246143937111,
        0.05580856651067734,
        -0.013658021576702595,
        -0.04909421503543854,
        0.03605806827545166,
        -0.01933913864195347,
        0.013868735171854496,
        -0.042918458580970764,
        -0.04269279167056084,
        -0.06796204298734665,
        -0.11485561728477478,
        0.03914043679833412,
        -0.0045426287688314915,
        -0.06861844658851624,
        0.003410769160836935,
        0.037192706018686295,
        0.03077389858663082,
        -0.0608048290014267,
        0.013949338346719742,
        0.03348490595817566,
        0.04912307485938072,
        0.09473709017038345,
        0.04104424640536308,
        0.09388459473848343,
        0.03467178717255592,
        0.08499204367399216,
        0.039802152663469315,
        -0.02275240607559681,
        0.0635848119854927,
        -0.08232662826776505,
        0.054639920592308044,
        0.057929668575525284,
        0.002724739722907543,
        0.08887720853090286,
        -0.08244037628173828,
        -0.04828772321343422,
        0.058548733592033386,
        0.06306267529726028,
        -0.012798797339200974,
        0.033335208892822266,
        0.04917234554886818,
        -0.04090488329529762,
        -0.05555868148803711,
        -0.039968881756067276,
        -0.04281887412071228,
        -0.00304725905880332,
        -0.055125556886196136,
        -0.011998296715319157,
        0.0812918171286583,
        -0.01109918300062418,
        -0.02152247540652752,
        0.016241632401943207,
        -0.07671540975570679,
        0.020208902657032013,
        -0.02374480664730072,
        -0.03341176360845566,
        0.07053103297948837,
        0.02098350040614605,
        -0.07188591361045837,
        -0.05654636397957802,
        -0.0194411538541317,
        -0.0003565752413123846,
        -0.013310366310179234,
        0.03624013438820839,
        -0.0751773789525032,
        0.032589055597782135,
        0.03593967482447624,
        -0.025409560650587082,
        0.05865735188126564,
        -0.006745193153619766,
        -0.11465314775705338,
        0.023515861481428146,
        0.01229117065668106,
        -0.08459820598363876,
        -0.04705064371228218,
        -0.007204912602901459,
        -0.04228448495268822,
        -0.09370153397321701,
        -0.013851179741322994,
        -0.14267094433307648,
        -0.030925657600164413,
        0.005932170432060957,
        0.0018594235880300403,
        -0.024867666885256767,
        -0.008705703541636467,
        -0.06470060348510742,
        0.1115097925066948,
        -0.021630750969052315,
        -0.01682157628238201,
        0.027032244950532913,
        0.08172930777072906,
        -0.013276996091008186,
        -0.08229301124811172,
        0.029474174603819847,
        -0.05070304870605469,
        -5.314885243024037e-08,
        0.05548837408423424,
        0.03393353521823883,
        0.05510744825005531,
        -0.06772046536207199,
        0.020686231553554535,
        -0.031535662710666656,
        0.03069494292140007,
        0.14043250679969788,
        -0.045722153037786484,
        -0.01338367722928524,
        0.04754633828997612,
        -0.016777098178863525,
        0.036565303802490234,
        -0.02275359258055687,
        0.012472023256123066,
        -0.009832527488470078,
        0.04878934100270271,
        0.05836239457130432,
        -0.03494638949632645,
        0.025432901456952095,
        -0.05163757875561714,
        -0.025414608418941498,
        -0.010031698271632195,
        0.03724882751703262,
        -0.0058531248942017555,
        0.08733465522527695,
        -0.0440751351416111,
        -0.025079241022467613,
        0.042320676147937775,
        -0.04131503775715828,
        -0.011489261873066425,
        0.06588621437549591,
        -0.07785223424434662,
        -0.049310408532619476,
        -0.026825515553355217,
        -0.027995897457003593,
        -0.009872875176370144,
        -0.04980965331196785,
        -0.0016860532341524959,
        0.034448180347681046,
        -0.018755899742245674,
        -0.11145398765802383,
        -0.01242617517709732,
        0.051683325320482254,
        -0.015475266613066196,
        -0.024616455659270287,
        -0.10517366975545883,
        -0.0597471185028553,
        0.02139105275273323,
        0.08900229632854462,
        0.01989755593240261,
        -0.0046569351106882095,
        -0.029205841943621635,
        0.011502915993332863,
        -0.021232903003692627,
        0.06510833650827408,
        -0.031791962683200836,
        -0.025632331147789955,
        -0.05821109190583229,
        -0.00942139606922865,
        0.08530290424823761,
        -0.04190477728843689,
        -0.02242719754576683,
        -0.06298264861106873
    ]
}