{
    "id": "VLw5rIRgZUE",
    "title": "The WEIRDEST Pharmacy Tech",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-07-19T19:05:01Z",
    "video_url": "https://www.youtube.com/watch?v=VLw5rIRgZUE",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo",
        "cvs",
        "walgreens",
        "pharmacy"
    ],
    "views": 323292,
    "likes": 8319,
    "comments_count": 350,
    "description": "Legitimately can't believe we found half of this at a drug store. Tech We Wish Would Come Back:  The WEIRDEST Custom Keyboards:  Ranking the WORST Controllers of All Time:  Shark Tank Scams Tested!  I got SCAMMED on Instagram:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Assault by bug 0:08 We went to CVS 0:58 It comes with ammo 1:58 Austin assaults some bugs 2:52 Move over Salt Bae.. 3:38 Fast-Charge Batteries 4:46 CD Player (it has anti-skip) 5:38 A Mighty Wind 6:36 Fashion Headphones 7:34 GabaGoods Earphones 8:32 Pro Gaming Mouse and Pad 9:21 Austin Smells It (Who would have guessed) 10:29 Mace (Not that though) 11:28 Speaker Diffuser 12:40 UV Scrub 13:38 Hand Massager (Mega Buster?) 14:40 Full Intensity Massage",
    "description_links": [
        "https://youtu.be/zIj2tK2lJOI",
        "https://youtu.be/hzX6AOx0Pk8",
        "https://youtu.be/xJBcNbS-uTM",
        "https://youtu.be/w1-NoqAL5fE",
        "https://youtu.be/5dd1GmKPsIw",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Wait, there's a bug. - It's on your finger! It's on my finger! No, man! (laughs) - Hello and welcome! - Hello and welcome! - To \"This Is.\" No, no, no, no, no, no. Hands up, hands up. (parcel thuds) - I don't know how to categorize this video. What we did, is we went to a bunch of- - Are we demonetized? - Drug stores. - Matt. - And pharmacies. - We might be demonetized right now. - Yeah, I know. - We could- - We went- - Blur this. - I can rip this open with, I can Lamarr this. - Then Lamarr it. Almost, all of these was at the Consumer Value Store. - CVS? - Yeah! - You didn't go to the corner of Happy and Healthy, Matt? - I did go to the corner of Happy and Healthy. Unfortunately, I am neither of those things. (Austin laughing) But we also went to, like, a Walgreens. We went to a Rite Aid. - In the United States, pharmacies are a little different because it's almost a lot of like Walgreen, CVS, these kind of stores. Are typically filled with obviously you know, medication- - [Matt] Yeah! - That kinda stuff. But also they usually have a decent size of the store which has, like, cosmetics, also, just random gadgets and gizmos and stuff. - So this is the Bug-A-Salt. You load it up with salt - [Austin] What? - High performance salt. - They just took a normal salt thing and put a different label on it. - [Matt] Yeah. - And probably charged you twice as much. - Oh yeah, that was $15 for that. But it's coarser. - [Austin] \"Treat gun as a loaded firearm at all times. By removing this tag and using the Bug-A-Salt 3.0, you are assuming full responsibility and liability for any direct consequential or indirect damages whether foreseen or unforeseen that may arise.\" I don't think this is legally binding, when I take off the sticker, but nice try. Hey, treat it like a loaded fire arm- - It's not loaded. - At all times. - Look at my trigger discipline. - You just pointed it at my face! (lens clicks) - There's a safety. - Yeah, don't shoot and face your eyes. (gun clicks) - This is basically a Nerf that shoots salt. - You're pointing that gun in all kinds of ways that are literally directly at me and Kinsey. - My trigger discipline- - You just stop doing that! I'm in charge of this. You stay away. - Look down the barrel of the gun real quick. - Absolutely not, sir. So, all right, we spent $50 (till chings) on the gun. - Woo. - $15 (till chings) on the salt. And that brings us to our first- - Oh good Lord. - [Matt] The Bug-A-Salt, Bug-Beam Adapter Kit. Attaches to the barrel, and it's a laser sight. - I'm gonna try to shoot off camera, near literally no-one. - You're gonna, he's gonna shoot either a monitor or a camera. - I'm gonna aim for that chair. And I'm gonna see, I'm gonna try to hit it right in the top. So ready and, (gun clicks) oh! I'm gonna stop shooting this in the studio. This seems highly dangerous. - This is not safe at all. But you know what it is safe? Pointing laser beams at things, and then shooting 'em. - First of all, I just wanna, like- It's just salt. There's nothing unique about the salt. - No, this is in fact coarser salt. This is larger. This is large caliber salt. - Just showing you the laser is- - That is a great way- - Totally functional. - To ruin our camera sensors. (Austin laughing) - I'm gonna step off the set. Can you follow me with your phone? And let's show everyone what this looks like? - Yeah. - [Austin] Okay, you ready? I might be out of ammo though. (gun clicks) - [Matt] Can't see anything. (breech thuds) (gun clicks) It's meant for bugs. Not blasting through walls. - Okay, Bug-A-Salt is weird. I guess it kind of works if you're wanting to hunt bugs. The problem is that you're gonna have a very salty house. - You know what I think this is better for? Tactically seasoning your food. Oh, these mashed potatoes are pretty good, but, bam! Now they're great. Move over Salt Bae. Let the bugs know that we are stocked for the the bug-pocalypse. So, we just did our little episode about our controller tier list and- - Yeah? - We dinged the Xbox controllers. We didn't like that they had to use double A batteries - Double A's. - And everyone's like, \"Well you don't know how batteries work. You could just get some rechargeable double A's.\" That annoying commenter was right. We could just get some rechargeable double A's. - We could, yeah. - So, I present to you, Eallpha? - Fast charge lithium-ion batteries. So, it's four lithium-ion batteries in a double A wrapper. And this was at a drug store? - Yes, those were $20? (till chings) You probably could get it cheaper on Amazon. But, when- - Wait. - You know, you're on vacation whatever, this is a pretty good thing. - So, this is a double A battery that has a USB type C port. Okay, you know what? That is actually awesome. Seeing a little double A battery with a USB C port for charging, that is a stunningly good idea. I'm legitimately impressed. - Here we have our Amish technology, You know, double A batteries. Just- (whistle/crash) - What, you want to run that one back? - Toss those out. - The fact that this was 20 bucks at a drug store, I am immediately gonna say it is totally worth it. If these batteries are remotely okay. - I think it's genius. - This is incredibly cool. If a battery, a rechargeable double A battery from a drugstore has a USB C port, you have no excuse companies- - Apple - For not giving me a USB C port in whatever it is that I'm buying on- - Apple. - Amazon, or whatever. This is rad though. I am fully in favor of this. I am- - This right here- - Two thumbs up. - For 20 bucks. Go out, get a pair. Look, we got all this power, but what do we use with all this? This is a modern miracle. But you know sometimes the modern miracles make old miracles even better. Which is why I was able to get us a nice- - Oh my goodness, is that- - Coby CD player. - Portable, compact CD player, and with super bass as well as the world's cheapest headphones. How much did the CD player cost? - The CD player was 29.99. (till chings) - 29.99? - It's reasonable for a CD player. This on the front, advertises the digital one-bit DAC. Now I'm not sure how many bits you need for a DAC, but I think it's more than one. - It's definitely more than one. (Austin laughing) I just love that this came, like, in the the blister pack- - Yeah. That we've kind of all universally agreed, should go away. - I'm not having a good time right now, but I think I got it, there we go. I like how I took off the little plastic off of it. - It somehow looks- - It doesn't look- - More plastic. - It looks worse. - Yeah, like. One of the things that I have to boast about all these pharmacies and convenience stores is just how good their music selection is. Apple music? On the rocks right now. Because if you can go into a convenience store, that's on every corner of Happiness and Healthy, and pick out bangers such as \"A Mighty Wind\". (both laughing) Songs by \"The Folksmen\", Mitch and Mickey, 17 new songs. If you can just go pick up bangers like this, what do you even need Spotify for? Let me give you \"The Mighty Wind\" - We're gonna close it. - Do you remember when CDs had these amazing booklets? (light music) \"Old Joe's Place\". \"It's Just that Kind of Day\". \"Never Did no Wandering\", by \"The Folksmen.\" - Let's see how good the anti-skip is. Matt, would you like to experience some one bit action? Okay, to be fair, \"Mighty Wind\" kind of slaps. - Let me tell you, \"Mighty Wind\", they slap, but you know what doesn't slap? These God awful headphones. These are not doing the \"Mighty Wind\" justice. (whistling) - They're actually not that bad. - So- - They're okay. - Here's what we got for you. (container bangs) (Austin gasps) - Are these, my Sony MDR-E9LP fashion earbuds? How much were these? - $17.99. (till chings) - Whoa! - That's about $7 too expensive, I think. - Okay. (Matt grunts) Nope. - There you go. If I close my eyes, these feel exactly the same. (Austin laughing) I don't know if this is the upgrade you think it is. No, they're worse. Ow. Turn down, turn down, turn down. - Oh, wow, that is very loud, I hear that. - Those sound actually worse. I'm telling you, the ones that came with this are better than they look. Like, they're not good, but they're not terrible. Those are just bad. - These actually suck. These, like, literally are terrible. I had a whole, like, fun segue, but like, these are just bad. Don't get 'em. Don't don't buy 'em. (whistle/crashing/cat shrieking) Get those outta here. Those were \"fashion headphones\", but that's not the fashion you should be rocking because everyone knows the real high end fashion comes from panda bears. - Oh my God. Pandas are the dumbest animals on earth. Gaba Goods - Gaba Goods! (Hands thump) We got the Gaba Goods here on \"This Is\", so make sure you're liking and subscribing. - How much were these, for context? - The Gaba Goods were $10.99. (till chings) - Much more stylish than the Sony's. - And it's got a mic! - I will say they do feel cheap, but having a microphone and having pandas on the side- - [Matt] Pandas. - If you wanna try to perpetuate the dumb animals that don't need to exist anymore. Why does anyone care about pandas besides the fact that they're mildly cute? I don't think so because- - They're majestic creatures. (Austin chews) - Okay, I don't like that you're impersonating me right now. (Austin laughing) (lens clicks) - They fit okay, although I will say, the size of the panda- - You're gonna have people booping your ear snoot. Boop. - I mean, it doesn't sound terrible, but- - I will say this is the height of fashion. Maybe it's time to move on to the modern times. - You know what, Matt? I need a banger right now. Do you got a banger in that box? - I think I know the problem that you have right now. - I have a lot of problems but go ahead. - You're a gamer and you don't compromise. Well, CVS has it covered. (Boxes thump) The Pro Gaming mouse with a DPI switch and an LED mouse pad. - All right, ready for the first flap? - The first flap. (Mouse pad thuds) Oof! - I mean, it feels fine. It definitely has got the same kind of LED strip. Although, I would be curious if the quality is remotely decent. That's not on, is it? - Ah, it's on. - Why does half of it not work? - Yeah, half of. (Austin laughing) - This side kind of works. (Matt laughing) And this side doesn't. Let me hit some buttons. - Ooh. - Why's it smell like sushi? (Austin sniffing) - I like that you just really dove into that one. - Oh my God, I just realized the mouse looks stupid. - First of all, it's the lightest, like, this is gonna float away. (punch/mouse clangs) - Wow, it flew really far for one little tap. - If you're in a pinch and you know, oh, you're traveling, whatever, and you forgot your mouse. - If you're buying gaming gear at a pharmacy, then you're probably- - Yeah. - Not gonna have super high standards. - Kinsey, what did we pay for these? - The mouse pad was $5.99. (till chings) - Okay. - Okay, fine. - And the mouse was $10.99. (till chings) - You could do worse. For 16 bucks if I'm at great grandma's apartment in the middle of Kentucky. - Duluth, Minnesota. - And I can't go home for four days because my mom is a tyrant and I'm just forced to be here, and to pretend to spend time with my cousin who smells a little weird. What I really want to do is play Overwatch. - Is that where Austin's smell tips came from? You just sniffing cousins? - I can spend $16 and have a great gaming time by locking the door to my room and telling everyone to go (beep) themselves. - Are you sniffing cousins? - I gotta be careful. No, no, this is a theoretical thing. But some cousins you don't have to sniff for them. You can smell them. - My cousin definitely watches the channel. Chris, if you're watching this, I'm not gonna sniff you, but- - How does he smell though? - Smells like lilacs and- - What's a lilac? (mousepad clattering) - So look, if you got a cousin that you don't wanna sniff- - Have we stopped? - Go ahead and use this on 'em. Only in America, right next to the Bug-A-Salt, can you get a thing of mace. So, here's the fun thing. It's not mace, it just called mace. - Oh! - All it is is an alarm. - [Austin] The thing is called mace, but it's not actually like pepper spray like you'd normally think about. It's just an alarm and- (alarm blaring) - Oh my God! (alarm blaring) - Got it. - It works - So, that ringing in my ears is gonna be here for a while. - It works. - Can I, wait, wait, wait. It's also a whistle. (Whistle squeaks) - It's somehow louder. - How much was this? - The mace personal alarm was $13. (till chings) - Besides the fact that they obviously click baited with an inaccurate title. You're trying to alarm and whistle. This'll do it. - Look, I think that's gonna get rid of your stinky cousin. (Austin laughing) He just kind of stinks up the room and you gotta- - Literally not true. Literally not true. - Like it just lingers, it lingers. (Austin and Kinsey laughing) So, what do we have here is our next product? - The Wireless Speaker Diffuser. That's a three in one, which means that I have not only supreme audio, but also it's a nightlight, and it gives me soothing mist. How much- - Now- - Was the Zen Rox? - The Zen Rox speaker diffuser was $24.99. (till chings) - All right, you know what? I'm fine with that, I'm fine with that. While you unbox that, I'm gonna bring up another product here. - Another one? - Because you're vibing. - How much- - You're vibing. While you're vibing there, chilling with your diffuser, you don't wanna be holding the phone, like some sort of you know, poor person. You know, and here's something that I think we've had on the channel before, but it's always a goodie. Adjustable little neck. - Oh, good Lord, are you serious? - Contraption. (Austin Gasps) They did add some essential oils. - Finally, I could do this for real. (Austin sniffs) Woo, hoo, hoo, hoo! - So now, I don't have to hold this. I got my hands free to do whatever I want. Again, you can get a POV shot, oh, there's my microphone, of what we see here. You know, you're just vibing out. You could be watching \"Game of Thrones\", do people still watch that? - No. - And then you just have your aromatherapy thing there. - Matt, at some point, do we have anything that's actually from a pharmacy? - We do. - This is- - We have one item. - [Austin] Okay. - I'll give you this one first. You look dirty. You know what you need to do? Is clean up a little bit. - Okay. With my UVC micro sterilization unit, zap germs with your phone. So, you plug this into your phone, and then it UV sterilizes. - We've had some weird health products on here. - Yeah. - We had the char- - The FDA does not certify any of these things to be actual, real authentic things. (Matt laughing) It's literally a lightning port and a tiny little LED. - Sanitize me. Oh, I can feel me getting clean. - Goodbye, COVID. We've solved the world's problems. - Here, do that on my kidney stone. What did we pay for this? - That thing was $9.99. (till chings) - Look- - This is dumb. - I know. (Zen Rock thuds) Yep, That's gone. I know that after a long day of unboxing things, sometimes you're sore. - You know what, I'm sore right now. Oh, ah, Matt, my back! - Oh, why would your back be hurting? (Austin groans) What are you unboxing? - My shoulder, ow! (Austin groaning) - What did you unbox with? - With my strength? - What strength? (Austin moans) You unbox with your hands. - Ah, my hands are, look, they're, they're, Matt, fix my hands. (laughing) - We have (box thuds) the Cordless Hand Massager. \"Hello, health and relaxation enthusiast. (Austin laughing) Did you know that 90% of the world's population use their hands daily?\" - Wait, wait. Who's the 10% who don't use their hands every day? - This was by far the most expensive thing we bought. - I believe it, it's the biggest box. I feel like I'm about to turn into Megaman over here. (imitating blasting) - For the record, this is why we bought it. (Austin inhales) (Austin exhales) - Smell my finger. (laughing). - Oof, oof. - That's a strong off-gassing, my friend. I'm gonna do my left hand 'cause I need my right hand. Okay, activate. Oh, oh. - Oh? (device beeps) - I'm going full intensity, vibration and heat. My hand is being smashed, squished. Matt, would like to try? I turned the intensity all the way up. - Ooh. - And it actually, like, squeezed my hand almost a little too hard. Describe to us what you're feeling right now, Matt? - It's like one of the blood pressure tests. - Oh my God, look at my hand. (Matt laughing) Can you see that? - Oh, I don't like that. This is nice. Kinsey, what did we pay for this? - $124.99. (till chings) - A $125 dollars at a pharmacy? - I'm actually okay with this purchase that we made. It does make nice noises, and it does look like a Megaman blaster. I am actually in favor of this. (Matt imitating blaster) - Like, subscribe, follow us for more items. We have more things from other stores that you shouldn't buy tech from, but we're gonna find anyway. - And until next time friends, let the big wind be with you.",
    "transcript_keywords": [
        "Yeah",
        "Mighty Wind",
        "Matt",
        "good",
        "salt",
        "Gaba Goods",
        "double",
        "thing",
        "kind",
        "Hands",
        "things",
        "Wind",
        "Goods Gaba Goods",
        "Hand",
        "Wait",
        "Mighty",
        "God",
        "Goods",
        "Happy and Healthy",
        "Store"
    ],
    "transcript_entity_values": [
        "Chris",
        "three",
        "digital",
        "13",
        "Eallpha",
        "a long day",
        "Overwatch",
        "16 bucks",
        "the Zen Rox",
        "Two",
        "One",
        "Salt Bae",
        "USB C",
        "Kentucky",
        "UVC",
        "Duluth",
        "Mickey",
        "four days",
        "A Mighty Wind",
        "Walgreen",
        "USB",
        "15",
        "90%",
        "10.99",
        "$125 dollars",
        "Matt",
        "daily",
        "Austin",
        "Happiness",
        "Megaman",
        "Amish",
        "16",
        "Xbox",
        "first",
        "Lamarr",
        "Walgreens",
        "Kinsey",
        "The Mighty Wind",
        "9.99",
        "20",
        "17.99",
        "24.99",
        "Boop",
        "50",
        "about $7",
        "The Folksmen",
        "5.99",
        "Zen Rox",
        "CVS",
        "POV",
        "Mitch",
        "FDA",
        "20 bucks",
        "124.99",
        "Coby",
        "Minnesota",
        "one",
        "Apple",
        "four",
        "Gaba Goods - Gaba Goods",
        "10%",
        "Spotify",
        "Mouse",
        "17",
        "Zen Rock",
        "Sony MDR-E9LP",
        "half",
        "America",
        "the United States",
        "Amazon",
        "29.99",
        "the Consumer Value Store",
        "Sony",
        "Nerf",
        "more than one",
        "Bug-Beam Adapter Kit",
        "Game of Thrones"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "MONEY",
        "PERCENT",
        "MONEY",
        "MONEY",
        "PERSON",
        "DATE",
        "PERSON",
        "FAC",
        "PRODUCT",
        "NORP",
        "MONEY",
        "ORG",
        "ORDINAL",
        "PERSON",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "GPE",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.12841889262199402,
        0.017958777025341988,
        0.05434885248541832,
        -0.07497433573007584,
        0.003924441523849964,
        -0.06042419373989105,
        0.13803458213806152,
        0.05935462936758995,
        0.0023330585099756718,
        0.024305501952767372,
        0.09545359015464783,
        0.050165388733148575,
        0.13696591556072235,
        0.001693525817245245,
        -0.08861184865236282,
        -0.025939472019672394,
        0.08433428406715393,
        -0.0664990246295929,
        0.004214489366859198,
        0.0400228276848793,
        -0.06522165983915329,
        0.0914660319685936,
        0.05193992331624031,
        0.042466118931770325,
        -0.06805916130542755,
        0.13535372912883759,
        -0.05546128749847412,
        -0.06437800079584122,
        -0.08192650228738785,
        -0.09348390996456146,
        -0.027981629595160484,
        0.07905452698469162,
        0.010202725417912006,
        -0.07876412570476532,
        0.024829333648085594,
        -0.03511963412165642,
        -0.03379795700311661,
        0.038884107023477554,
        0.037802159786224365,
        0.049919493496418,
        -0.023372231051325798,
        -0.04476747661828995,
        0.009110159240663052,
        0.06804085522890091,
        -0.007217652630060911,
        -0.07794123142957687,
        -0.02056858502328396,
        -0.05117177590727806,
        0.026372859254479408,
        0.04606849327683449,
        -0.04746566340327263,
        -0.07387558370828629,
        0.06993702799081802,
        -0.0019372034585103393,
        -0.007766552269458771,
        -0.04517005383968353,
        -0.0354781374335289,
        0.01847226358950138,
        0.008126413449645042,
        0.04842262715101242,
        0.004323139321058989,
        -0.00336070847697556,
        -0.033783797174692154,
        0.03531692549586296,
        -0.05392729863524437,
        0.07762990891933441,
        -0.030162395909428596,
        0.034188251942396164,
        0.02340691164135933,
        -0.05186731368303299,
        -0.02525392547249794,
        -0.039417564868927,
        0.0500900074839592,
        0.12924082577228546,
        0.05946456268429756,
        0.019102372229099274,
        0.05207805708050728,
        -0.020237555727362633,
        -0.011290726251900196,
        -0.0006188427214510739,
        -0.012495890259742737,
        -0.08595044165849686,
        -0.02102380432188511,
        -0.013975926674902439,
        0.07567048072814941,
        -0.0065894098952412605,
        0.026121284812688828,
        0.019722722470760345,
        0.027742335572838783,
        -0.01827288791537285,
        0.01882893219590187,
        0.0272984616458416,
        0.033731501549482346,
        -0.09357881546020508,
        0.02038985677063465,
        -0.06726747006177902,
        -0.011127865873277187,
        0.003725980408489704,
        -0.052739184349775314,
        0.06369676440954208,
        -0.004218447487801313,
        0.005321949254721403,
        0.04668696969747543,
        -0.03684674948453903,
        0.05383415147662163,
        -0.07653331011533737,
        -0.0035242061130702496,
        -0.03367429971694946,
        0.01914241723716259,
        -0.0032259111758321524,
        -0.040945082902908325,
        0.019160615280270576,
        -0.033352214843034744,
        -0.03031800128519535,
        -0.018787432461977005,
        0.03720474615693092,
        -0.0018824898870661855,
        0.05611690506339073,
        0.050991181284189224,
        -0.01902223937213421,
        0.001026717945933342,
        0.023851796984672546,
        -0.02492612786591053,
        -0.07762718945741653,
        0.004634310025721788,
        0.08572056889533997,
        -0.03424583747982979,
        2.2334328380776152e-33,
        -0.056802306324243546,
        0.07117428630590439,
        0.009011817164719105,
        3.475103585515171e-05,
        0.03878576681017876,
        -0.010054382495582104,
        -0.03959006443619728,
        0.030044633895158768,
        0.011585371568799019,
        0.058852262794971466,
        -0.05718907713890076,
        0.029170693829655647,
        -0.017321951687335968,
        0.06674829125404358,
        0.008767575025558472,
        -0.024991130456328392,
        -0.033475857228040695,
        0.013104504905641079,
        0.0021801157854497433,
        -0.05690215155482292,
        0.03216296061873436,
        0.02285277657210827,
        0.020428523421287537,
        -0.004958008415997028,
        -0.02687237039208412,
        0.07709532231092453,
        -0.0674050897359848,
        0.03507580608129501,
        0.1287226676940918,
        0.020328357815742493,
        -0.038884855806827545,
        0.007821587845683098,
        0.03118526190519333,
        -0.02860335074365139,
        -0.05305399000644684,
        0.004356119781732559,
        0.008957377634942532,
        -0.12739433348178864,
        0.005342621821910143,
        -0.06467162817716599,
        -0.09340681880712509,
        0.05534064397215843,
        -0.03799746185541153,
        -0.02502085082232952,
        0.03480000048875809,
        0.053990233689546585,
        -0.0597061887383461,
        -0.007974606938660145,
        0.0010857826564460993,
        -0.03434383124113083,
        -0.10874639451503754,
        0.01527662854641676,
        0.086156465113163,
        0.07885529100894928,
        -0.054288893938064575,
        -0.06267298012971878,
        -0.0029406535904854536,
        -0.015875086188316345,
        0.04170862212777138,
        0.09677180647850037,
        0.0403994619846344,
        0.07465760409832001,
        0.0029898788779973984,
        -0.05038277059793472,
        -0.003375658532604575,
        -0.034319836646318436,
        0.0300719253718853,
        -0.04279308766126633,
        -0.00032332484261132777,
        0.003489147173240781,
        0.013658212497830391,
        0.00789627805352211,
        -0.00023006804985925555,
        -0.01919318176805973,
        0.03988087549805641,
        0.00961708091199398,
        -0.019572488963603973,
        -0.02357148565351963,
        -0.04809878394007683,
        -0.11266446858644485,
        -0.023324105888605118,
        -0.03308188170194626,
        0.07258568704128265,
        0.10768140852451324,
        -0.005617089569568634,
        -0.011374371126294136,
        -0.01861548237502575,
        -0.04161791875958443,
        -0.0630638375878334,
        0.007597702089697123,
        -0.04506460949778557,
        -0.02510092779994011,
        -0.015606455504894257,
        0.040590204298496246,
        -0.010279640555381775,
        -4.466789269022427e-33,
        -0.024673204869031906,
        -0.023874495178461075,
        0.05466999113559723,
        0.049342356622219086,
        0.045893486589193344,
        -0.011648864485323429,
        0.03922342509031296,
        0.049354493618011475,
        0.003843104001134634,
        -0.01851932518184185,
        0.05671554058790207,
        0.02563025988638401,
        -0.004996965639293194,
        -0.050012823194265366,
        0.05757089704275131,
        0.011455521918833256,
        -0.007435475941747427,
        -0.0056335232220590115,
        0.013237794861197472,
        -0.02218588814139366,
        0.09042864292860031,
        0.04613596200942993,
        -0.006808589678257704,
        0.09135036915540695,
        -0.05507705360651016,
        0.06824500858783722,
        0.020175160840153694,
        -0.032346975058317184,
        0.024498403072357178,
        0.03315246105194092,
        -0.026191137731075287,
        0.06775084137916565,
        0.019671868532896042,
        0.03954038396477699,
        -0.013148600235581398,
        -0.015618845820426941,
        -0.04816388338804245,
        0.004676529206335545,
        0.0008507950697094202,
        -0.08411811292171478,
        0.06479012966156006,
        -0.008682356216013432,
        -0.00926055945456028,
        0.01935792900621891,
        0.00505256000906229,
        -0.04361029714345932,
        -0.06280729919672012,
        -0.06067289412021637,
        0.06174526736140251,
        -0.026568813249468803,
        -0.0236459132283926,
        -0.019500410184264183,
        -0.02117227576673031,
        0.0008368483977392316,
        -0.0794234648346901,
        0.011622386984527111,
        -0.056454163044691086,
        -0.034040793776512146,
        0.031887296587228775,
        -0.0008145758183673024,
        0.04816050082445145,
        0.01541971880942583,
        -0.04862354323267937,
        -0.04717329144477844,
        -0.019791830331087112,
        -0.012211017310619354,
        0.1109471544623375,
        0.0838514119386673,
        -0.008951407857239246,
        -0.07076214998960495,
        0.07915949076414108,
        0.0176883265376091,
        -0.005357421934604645,
        -0.06386946141719818,
        0.0348297543823719,
        0.05319647863507271,
        -0.03980650380253792,
        -0.10434814542531967,
        -0.06953033804893494,
        -0.02544403076171875,
        0.05840224400162697,
        -0.04566846415400505,
        0.026341864839196205,
        0.0377664789557457,
        -0.012651481665670872,
        0.03326890990138054,
        0.022895202040672302,
        -0.030989695340394974,
        -0.0599447563290596,
        0.01837635412812233,
        0.02938430942595005,
        -0.009585052728652954,
        -0.07947684079408646,
        0.12305890768766403,
        0.03550012782216072,
        -6.538257935062575e-08,
        0.06464401632547379,
        0.01924084685742855,
        0.0603853203356266,
        0.0008898689411580563,
        0.02555980533361435,
        -0.031074417755007744,
        -0.028483936563134193,
        0.03910110890865326,
        -0.04811461269855499,
        0.018173174932599068,
        0.01315361075103283,
        0.008821625262498856,
        -0.06352590024471283,
        0.018765868619084358,
        0.024180302396416664,
        0.06383993476629257,
        -0.12444056570529938,
        0.09919887781143188,
        -0.06843867897987366,
        -0.10792656242847443,
        -0.07193867862224579,
        0.06415126472711563,
        0.07065171748399734,
        -0.13802430033683777,
        -0.013956897892057896,
        -0.039000384509563446,
        -0.04832670837640762,
        0.04192096367478371,
        0.11179997026920319,
        -0.03636246174573898,
        0.007242921274155378,
        -0.04364205524325371,
        0.005442533176392317,
        -0.04314592480659485,
        -0.0837746113538742,
        -0.05915626510977745,
        -0.021755576133728027,
        -0.05580909550189972,
        0.013421101495623589,
        -0.003702466143295169,
        -0.08850938826799393,
        -0.14763684570789337,
        -0.05018346756696701,
        0.05218900367617607,
        -0.07945837080478668,
        -0.09493856132030487,
        -0.01132243312895298,
        -0.008876423351466656,
        0.0003673311148304492,
        0.03441603481769562,
        0.04773698002099991,
        -0.00021458062110468745,
        0.037823013961315155,
        -0.050824832171201706,
        0.008467581123113632,
        0.011716480366885662,
        -0.01969979889690876,
        -0.045149821788072586,
        -0.025404738262295723,
        -0.030953222885727882,
        0.050119318068027496,
        -0.13407538831233978,
        0.035827916115522385,
        0.07139308750629425
    ]
}