{
    "id": "vnHokyczh6w",
    "title": "The Ultimate Gaming Mystery Tech",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-12-27T16:05:19Z",
    "video_url": "https://www.youtube.com/watch?v=vnHokyczh6w",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "mystery",
        "tech",
        "gaming cup noodles",
        "gamer cup noodles",
        "gaming",
        "gamer",
        "analogue",
        "analogue duo",
        "duo",
        "turbografix",
        "pc engine",
        "fpga",
        "console",
        "game console",
        "pokemon",
        "pokemon card",
        "psa",
        "psa slab",
        "8bitdo",
        "8 bit do",
        "8bitdo keyboard",
        "8bitdo mechanical keyboard",
        "mechanical keyboard",
        "keyboard",
        "canon transformers",
        "canon",
        "transformers",
        "canon r5",
        "optimus prime",
        "naruto",
        "hyperx",
        "hyperx naruto",
        "go blu",
        "blu",
        "headphones",
        "austin",
        "austin evans"
    ],
    "views": 402600,
    "likes": 12548,
    "comments_count": 270,
    "description": "Try Acronis Cyber Protect Home Office (formerly Acronis True Image), the most reliable home backup and security on the market   Use our special code AustinEvans2023 and get 40% off your new license.  Analogue Duo:   Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Gamer Cup Noodles 1:59 Acronis 3:00 Analogue Duo 6:22 Pokemon Card Display 8:16 8BitDo Mechanical Keyboard 10:23 Canon Transformers Optimus Prime R5 13:11 HyperX Naruto Headphones",
    "description_links": [
        "http://go.acronis.com/austinevans",
        "https://www.analogue.co/duo",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- [Producer] Oh. - [Ken] We give him presents and he just drops them on the floor. - Okay. Gaming cup noodles. What makes these gaming? - [Ken] So, it has like caffeine and a bunch of other things in it. - Oh, you know what? It's shrimpy. It's super shrimpy. - It's garlic and shrimp, I believe it. - It is. Matt, you're gonna get high smelling this. - [Producer] Yes, the- - Oh, let's go. Oh, that's smells so good. - [Producer] It's literally called energy garlic. - I love how you just glide over to Matt like here Matt sniff this and he's the one that's allergic. - I'm allergic, he just like- - You'll give the best reaction to it. Cooking is activated. I'll be right back, once I've poured them into the sink. - There's like a 70% chance he's gonna set the building on fire. - [Producer] By the way, that has 41 grams, milligrams of caffeine. - Okay, grams and milligrams are two very different numbers. - So basically half a cup of coffee in your cup noodle. So actually not like an insane amount of caffeine, I'll say. But I know the caffeine's bitter. So if you add a lot of caffeine to something, that's why coffee tastes the way it tastes, is like you've got that sort of flavor in it. - Oh yeah, I know. I experience bitter every day when I talk to Matt. - [Austin] That's fair, actually that's, he has a lot of regrets. - Wait, that's not where they were connected, why are you doing it that way? - No, I do it this way anyway just to make sure that there's nothing on the ends. Just a warning for headphone users that, it's coming your way? - That's about as good as cup noodles can get it. - Yeah, I agree with that, I agree with that. - Now the fact that's got caffeine in it is a little bit of fine, I would say I would rather have caffeine with like coffee or something, but I mean it's not bad. I will say I don't usually like the garlicky flavors. It's fine. But if you like garlic, I mean this is actually quite nice. - Did you just say you don't like garlic flavors? - No, not really. - [Producer] You've just insulted his entire heritage. - Mm, I don't like it. - Don't bother touch my Spaghetti. - A huge thank you to the sponsor of this video, Acronis. Acronis' Cyber Protect Home Office is still one of the best data backup and cyber protection personal solutions on the market, but now, with identity protection. Cyber criminals are getting smarter and even using AI to enhance their attacks. In 2022, over $10 billion has been stolen through identity theft. Think it won't happen to you? You're vulnerable even when ordering food online, shopping or booking a flight. Don't let that happen to you. Acronis provides real-time monitoring and alerts for identity theft attempts. But just in case anything does happen, Acronis' certified experts are available to help you restore your losses and identity 24 hours a day, seven days a week with up to a million dollars of identity fraud insurance. So if you need award-winning backup software, malware protection, and now identity theft all in one easy to use dashboard, Acronis has your back. Just use code Austin Evans 2023 for a 40% discount, which we use for all home office products. And thank you very much to Acronis for supporting the channel and protecting us all. What is inside of here? - [Matt] Bubble wrap? - Yeah. Well, it's something that's nicely packaged. Okay. The Analogue Duo, now hold on a second. - [Ken] Ah. - So if you're not familiar, Analogue is a company who do retro gaming right. So this is a care package from Analogue I'm guessing. - [Producer] Yes. Especially considering it is still on pre-order and, so, we got this super early. - Well, thank you Analogue for hooking us up. So we have a couple of 8BitDo controllers which are quite nice, and they are micro USB. Well, immediately we'll say wonderful packaging and that- - [Ken] That's it? - Yeah. This looks dope. So it's got a CD-ROM drive. It also, I assume is where, this is where the cards would go in. You can run the majority of TurboGrafx games using this device. It does look kind of like metal, but it is plastic. However, it feels really nice. They also have this like lovely like sort of like rubber texture on the bottom. First impressions is based on what Analogue have done in the past, there's a lot of care, love, and attention that has gone into this. So, let us start by turning on the unit and hoping that it works. Aye! So we are using this with a plasma, which obviously, this is meant to be used with modern television since it has an HDMI. But this is, this is an HDMI plasma. So we're kind of splitting the difference here. So this is one of the areas I think Analogue does a really good job of. Essentially, all of their hardware allow you to customize the display. So for example, when it comes to Analogue Pocket, you can change the actual RGB values of the screen. So if you want it to be original like green, like the original Game Boy, you wanna have different color palettes or whatever. And it seems like much the same thing here where they allow you to change, I'm sure like scan lines, the actual scaling, like typically they do a pretty good job of giving you a good level of customization, especially if you're trying different types of hardware. So, let us start out with PC Circus '91. Oh, I mean, immediately that HDMI looks terrific. Now if I press select and then left and right, I can change the modes. System, Headphones, HDMI, I'm gonna just play it as it is for now. So I've played this game a little bit before, it is really fast. Now the advantage of the Duo being an FPGA is that it's not really emulating, it's running the actual games, the actual cards, and it is doing it the exact same way that the original hardware would do it. And it'll say that, as far as I'm concerned, this looks exactly the same. And now, we're gonna try a Super CD-ROM game, which is a gorilla playing baseball. I'm ready to baseball it up. So do I wanna play manual, auto catch, simulation, or auto? Ha, ha, ha, auto, please. So this is a sprite based game. I think that pretty much everything PC Engine was pixel based. It's not actually gonna be 3D stuff, but this is like sort of the era where sprite and pixel based content was kind of at its peak, right? 'Cause I think after this people moved to 3D and sort of, it's a different sort of era, but like look at like the fidelity of these graphics. Like it's cool. Auto is like literally I'm not playing the game. So I will say that the Analogue Duo is a niche product, but that's what I love on Mystery Tech, something weird, something unusual, clearly a labor of love on behalf of Analogue. So it's not for the vast majority of you, I'll say. If you see this, you think this thing looks dope, check it out the link description, I'll drop there. I don't know, when you're watching this I think the pre-orders are still probably gonna be live. From everything I'm seeing here, did a really good job of bringing an old series of consoles back to life in a very modern way. Coming in hot. Oh it's actually very light and it's a Union Jack. - [Matt] Hello Governor. - [Austin] Sure, sure. - [Matt] Wow, Austin Evans disrespects the Union Jack. Oh, caught in 4K. - Okay, so it's just some box stuff and there's a letter inside, should I read the letter or no? - [Ken] Yeah. - \"Hey Austin, my son and I are long-term fans of you in the channel. We live in Manchester, England.\" Oh, I'm sorry for slicing the Union Jack open my friend. - [Joanna] Oh gosh, don't you feel bad now? - I do feel bad. - [Matt] What a jerk. - Sorry, I just, I was opening a box. Okay. \"We saw your recent studio tour video and your PSA graded Pokemon cards on the stands on your shelf, and we heard that you like to swap them around. So we sent you one of our graded card slab storage boxes, we put a generic geometric shaped circle on top. If it resembles anything familiar, it must be a coincidence.\" Yeah, surely not a Poke Ball or anything. Jack and Chris, thank you very much. I, in fact, do keep a rotating selection of PSA grade slabs in my office and this looks quite exciting. Oh, you already grabbed my slabs. Let's see what we've got here. Oh yo, wait, wait, wait. Yo, this actually looks really cool. Look, I see what you mean about the generic geometric shape. Can't imagine what that could possibly be. Oh, oh, oh, I get it, I get it. So you're supposed to put the slabs along the side. Oh that actually looks really cool, that is very cool. And you can put this on top. I see what they mean about like if you actually put on like a rotating stand so you can just sit there and watch your card spin. This is really neat, and it really fits those slabs well. You can tell it's definitely made for PSA. It's not literally wobbling around or anything. I wouldn't necessarily notice that this is 3D printed unless I actually took a little bit of a closer look, like it's actually really nicely done. Chris and Jack, thank you very much, I will gladly use this to display some of my cards in my office. Shout out to Chris and Jack. They didn't even like plug their like store or whatever, I don't even know where you could buy this. This is very, very nice. Aha. The 8BitDo retro mechanical keyboard. So 8BitDo are typically known for their Bluetooth controllers, they have a large range. And honestly, most of them are pretty solid. What I don't like is the fact that nowhere on this box does it say what kind of switches. It just says mechanical, which is probably not gonna leave you a lot of confidence. That's like saying your car has engine not a V8 or something. It has all the gamer stickers I need like, - [Matt] Emo! 'Cause tonight will be the night That I'll fall for you - [Austin] I don't know if I love it. So, USB-C on the back, but it also have a A, B, X, Y like little like AUX connectors. What? - [Ken] Huh? - [Austin] What? - [Ken] Huh? - Okay, this makes a little bit more sense now. So you're not just getting the keyboard, you're getting the chunky buttons where you can- - [Ken] That's so you can play Family Feud with a- - [Producer] Yeah, that's what those stickers are supposed to be for. - Oh. - [Ken] Get the hell out. - [Matt] What's the emo button then? - The problem with this board, how much is it? - [Producer] A hundred dollars. - Okay. - Oh actually- - I feel better at a hundred, I was assuming it's like 200 bucks, okay. - Dude it has, it has a power light. - Nevermind, nevermind. Let me do a little typing test here and see. That was actually my very first run, 92 words per minute, 100% accuracy. It is rare for me to land on a keyboard and not have a little bit of an adjustment period. I will say my favorite part of this by far are the actual switches. I think that, I like the clickiness of them, the keys themselves, I like the actual key caps. It, this is solid. Like honestly, I think I was a little bit negative on it 'cause I assumed it was gonna be way more expensive than it is. At a hundred bucks very little to complain about. I wish that they had maybe spent a little bit more money on like the build quality and some little fit and finish things to just kind of take it to that next level. And honestly, I kinda wish that they just put some weights in it just to make it feel a little bit heavier. 'Cause like very sort of hollow on the bottom, but at a hundred bucks, I cannot complain, this is neat. - Oh please don't throw that one. - Oh, no. Okay. Nondescript brown box. I see Japanese characters. A Canon Transformers Optimus Prime R5. And also it comes from someone who's given me a five Yen coin, which is worth, oh. - [Ken] Half of a penny. - Yeah. That's very nice though, that's very, you know, thoughtful of them to give a neat little five Yen. Here, don't spend it all in one place. - Oh, geez! - This is Optimus Prime who turns into a Canon R5, which is kind of great. I'll admit, this is kind of great. And then you said this goes with it. - [Matt] Well, what does every Transformer need? - [Ken] An SD card? - A nemesis to make the episode really entertaining. Oh wait, it's a USB. He sprouted a USB port. I don't see a face or anything anywhere. I'll let you do this while I try to build the Canon. - I love how there's no assembly required, yet it's still a challenge for him. I can't wait for you to unbox the real thing. - Yeah, I'm a little afraid of this next one. 'Cause like, here's the thing, I am zero for zero for building these things correctly. Well, can I just ask, why does his USB stick out of this? What? What? What is it? - [Matt] Does your USB not stick out your butt? What do you do? Oh my god. - Oh, we got to censor that, sorry, sorry. - [Matt] Offending the entire '80s. - Oh, this is cute. Lens cap and our 24 to 105, oh, that's that. Oh look, wait, I see legs inside. I see legs inside, okay. So this is gonna pop out of there, yep. And then we've also got our Canon R5 itself, which obviously is much smaller than the real thing, but. - [Ken] This is- - [Matt] Also, this went, this went rear window real fast. - Yeah, POV you're in the bathroom and you see Austin Evans. - We also have a baby model of the camera, which is adorable and just really, really little, really, really little. Oh yeah! Yeah, I got that, that's fine. - [Ken] It's all pictures, you should be able to get it. - Okay, that's already things are happening. So his legs are supposed to spread now. - [Matt] Well. - So on this step where... - Okay, I'm willing to admit this is a little bit complicated. - And there we go. After a mere three minutes of building our Transformer has rolled out and assembled into a 93% correct implementation of Optimus, the Canon R5 camera. - [Matt] And now he's can take pictures of the wildlife with the other one. - Yeah, exactly. - [Ken] Dattebayo. - Is it time? Is it time? (upbeat music) - [Matt] Wow, is that the One Piece? - Don't you do it. - [Ken] Boogie water. - I don't have the headband, but I feel ready for this next item. - [Matt] I still like the sexy Magikarp on pin. - Oh! For that, dude, that was a Mystery Tech from like four years ago. I forgot about that. I'm assuming that this is a Naruto-themed HyperX item? What is this? - [Matt] You don't need the headband when. - Is it a headband built into some headphones? I'm a little rusty on Naruto, I haven't seen it in a long time, so. - [Matt] Just all you gotta do- - My references aren't good. I don't know my sexy clone jujitsu, I lost it. That just looks offensive Matt, that just looks offensive. Oh, you can't show that, oh my god, oh. Inside we have HyperX has you covered. I'm sure you do. Wait, wait, these are just orange headphones. What? I mean they're kind of cool. Wait, this is just a regular 3.5 mil headset? And it does have the detachable boom. So I just attached this here. This is the normal HyperX Cloud Alpha headset just with a Naruto colorway. It actually, you know, I mean, this metal feels pretty nice, very plush headband. I will say the orange and the black stitching looks nice, this looks a little like cheapy to me. It's just like sort of screen printed on. Where's my Bluetooth? This is... Go blu mobile bluetooth headphone amp. Okay. So, I'm guessing I just plugged this in and then it will mobily bluetoothsized my headset. - [Ken] Yeah, in theory. - Okay, all right. Inside we have an instruction. Oh, that's really tiny, oh, you know what? Okay, now I get it. That is- - [Ken] That's cute. - [Matt] So much smaller than I thought it was gonna be. - Yeah, that's really good. So we got USB-C on the bottom, we have a microphone. Oh listen to this. Nice tactile response. And we have ourselves, oh look at that, a little leather bag. This thing is actually really like legit. My problem with these, traditionally, it's just been, I don't wanna carry it around. Like honestly I'm lazy, like I'm not gonna do it, but this is small enough. If it has remotely decent battery life that's actually like, I mean, that's not bad. So just playing around this, there's a lot of stuff going on here. So you can not only have it call out to you what kind of Bluetooth you're getting. So it's aptX right now, 44.1 kilohertz. USB-C socket isn't just a charging port, it also plays up to 24 bit 96 kilohertz directly from USB. - [Ken] Let's go. - So if you want to, you could use it for Bluetooth or as an actual little DAC, this is neat. I feel like, how much is this? 'Cause I feel this is gonna be expensive. - [Producer] $200. - So the DAC this little guy cost $200, whereas my headphones cost 75, so my problem here is I just can't really fully judge the quality of this just because these headphones are fine. I mean, I'll listen a little bit more, but like they're not, they're not blowing me away over here. I'm cranking up to almost full volume and it's still not- - [Matt] Are the headphones cranked? Yeah, like or the... - Oh my god, there's an inline control for the headphones. Ah! Ah! I hear the headphones clipping 'cause it's so much power. Okay, nevermind, this little guy packs one hell of a punch. - What is this? - [Ken] Jesus. - [Matt] Oh god. - [Ken] Oh. - They don't sound great even with a absolute badass DAC. And honestly given how loud that was and how many different features, like this thing actually does seem to be pretty legit. Now, to give it a proper go, I would need to not only try it via USB-C, connect it to some headphones that are actually worthy of being driven by something like this, but this thing seems neat. It was easy to set up. It's super tiny, which I appreciate. I'm just not gonna carry something big and bulky. Like I just don't care enough about a Hi-Fi audio experience to carry a bunch of nonsense, right? Like I want something that's super thin, super lightweight, super portable, this is actually cool. (thunder rumbling)",
    "transcript_keywords": [
        "yeah",
        "Analogue",
        "bit",
        "kind",
        "Headphones",
        "Wait",
        "thing",
        "Union Jack",
        "good",
        "Analogue Duo",
        "USB",
        "Jack",
        "nice",
        "caffeine",
        "Matt",
        "Austin Evans",
        "super",
        "feel",
        "sort",
        "actual"
    ],
    "transcript_entity_values": [
        "half",
        "Chris",
        "milligrams",
        "first",
        "two",
        "Matt",
        "2023",
        "seven days",
        "one",
        "Circus",
        "3.5 mil",
        "Analogue Pocket",
        "Analogue",
        "Family Feud",
        "40%",
        "Spaghetti",
        "Canon",
        "70%",
        "Austin Evans",
        "Acronis",
        "91",
        "England",
        "USB",
        "Ken",
        "Naruto",
        "Austin",
        "24 bit 96 kilohertz",
        "the night",
        "a mere three minutes",
        "Bluetooth",
        "Manchester",
        "the Analogue Duo",
        "four years ago",
        "Ken]",
        "Joanna",
        "FPGA",
        "a hundred bucks",
        "zero",
        "2022",
        "TurboGrafx",
        "Jack",
        "Yo",
        "92",
        "tonight",
        "DAC",
        "200 bucks",
        "Magikarp",
        "a hundred",
        "Cyber Protect Home Office",
        "Naruto",
        "Acronis",
        "RGB",
        "Cloud Alpha",
        "HDMI",
        "100%",
        "The Analogue Duo",
        "AI",
        "Pokemon",
        "Game Boy",
        "200",
        "every day",
        "SD",
        "Optimus",
        "One",
        "Mystery Tech",
        "41 grams",
        "Acronis",
        "First",
        "Transformer",
        "Canon R5",
        "44.1 kilohertz",
        "PSA",
        "Naruto",
        "USB-C",
        "a Poke Ball",
        "second",
        "up to a million dollars",
        "V8",
        "five",
        "24 hours",
        "93%",
        "$10 billion",
        "Ken] Jesus",
        "Ken] Boogie",
        "Japanese",
        "24",
        "75",
        "105",
        "'80s"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "QUANTITY",
        "TIME",
        "TIME",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "FAC",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "MONEY",
        "PERSON",
        "PERSON",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.1645161360502243,
        -0.019749142229557037,
        0.01964513398706913,
        -0.06127530708909035,
        0.03371496871113777,
        0.0014246118953451514,
        0.14028312265872955,
        -0.021961143240332603,
        0.03132149577140808,
        -0.016741661354899406,
        -0.02118074893951416,
        -0.04164697602391243,
        0.02973976358771324,
        -0.049699876457452774,
        0.0021599121391773224,
        -0.050684817135334015,
        0.1693006008863449,
        -0.0037334912922233343,
        -0.023219235241413116,
        -0.052275706082582474,
        0.011288749985396862,
        -0.04653822258114815,
        0.05045422911643982,
        -0.010370668955147266,
        0.04638119414448738,
        0.0805334821343422,
        0.0032079119700938463,
        -0.05894341319799423,
        -0.1044241264462471,
        -0.0507659837603569,
        -0.00842818059027195,
        0.03825214505195618,
        -0.003077711910009384,
        -0.00576497009024024,
        -0.06370905041694641,
        0.012899013236165047,
        0.0020482465624809265,
        -0.04479154571890831,
        0.016214841976761818,
        -0.01931419037282467,
        -0.08955399692058563,
        0.0016988319111987948,
        0.07582280784845352,
        0.03409852460026741,
        -0.008453929796814919,
        -0.07268205285072327,
        -0.05339277163147926,
        -0.08522536605596542,
        0.03615882992744446,
        0.022764507681131363,
        -0.07402369379997253,
        -0.02890777215361595,
        0.09245344251394272,
        0.01896321214735508,
        0.024830257520079613,
        0.012805130332708359,
        -0.008774654008448124,
        0.0049195741303265095,
        -0.0014464438427239656,
        0.07333075255155563,
        0.005562164355069399,
        -0.05746396258473396,
        -0.039023928344249725,
        0.09548894315958023,
        -0.061243683099746704,
        0.02470012567937374,
        -0.03922153264284134,
        0.0461152046918869,
        -0.04898109659552574,
        -0.04025084525346756,
        -0.012111734598875046,
        0.011026866734027863,
        0.04711387678980827,
        0.004108833149075508,
        0.07857178896665573,
        0.03701560199260712,
        0.0056412434205412865,
        -0.11118772625923157,
        0.030050387606024742,
        0.0308611411601305,
        -0.0077473814599215984,
        -0.017034348100423813,
        0.009305572137236595,
        0.03822169825434685,
        0.014295680448412895,
        0.014963068999350071,
        0.027732061222195625,
        -0.017332773655653,
        -0.05076707899570465,
        -0.01068256888538599,
        -0.06089136749505997,
        0.021092945709824562,
        0.09134654700756073,
        -0.0008165129693225026,
        0.024566464126110077,
        -0.026886891573667526,
        -0.020235834643244743,
        -0.06556668877601624,
        -0.08563580363988876,
        0.08377551287412643,
        0.008248494938015938,
        0.06310610473155975,
        0.07552658766508102,
        -0.018174756318330765,
        0.031237449496984482,
        -0.03867293894290924,
        -0.012209336273372173,
        0.07163017988204956,
        0.06108727678656578,
        0.06373801082372665,
        -0.08503423631191254,
        -0.04703070595860481,
        -0.09354574978351593,
        -0.049273911863565445,
        -0.003243100829422474,
        0.06049183011054993,
        -0.02844560518860817,
        0.03275351971387863,
        0.039869725704193115,
        -0.020037898793816566,
        -0.007045389618724585,
        0.017872245982289314,
        -0.07170245796442032,
        0.007853169925510883,
        0.0681060180068016,
        0.017159227281808853,
        -0.05961200222373009,
        5.194072766663961e-33,
        -0.020861061289906502,
        0.04539037123322487,
        0.044375382363796234,
        0.018435433506965637,
        0.06657298654317856,
        -0.014659956097602844,
        -0.04984636977314949,
        0.006135453004390001,
        0.012927627190947533,
        0.11136974394321442,
        -0.06791777163743973,
        0.11564584821462631,
        -0.13400688767433167,
        0.06889699399471283,
        0.09351002424955368,
        -0.09112945944070816,
        -0.08664374053478241,
        -0.03072860836982727,
        0.02005639486014843,
        -0.006904173642396927,
        0.017855560407042503,
        0.018561195582151413,
        0.04337058588862419,
        -0.003980523440986872,
        -0.052368856966495514,
        0.008396715857088566,
        -0.07035447657108307,
        -0.007356049958616495,
        0.042869728058576584,
        0.05109944939613342,
        -0.1056770458817482,
        -0.02397628128528595,
        -0.015089289285242558,
        -0.013118889182806015,
        -0.0777597650885582,
        -0.015607021749019623,
        -0.06799176335334778,
        -0.0774451494216919,
        -0.024762462824583054,
        0.057901203632354736,
        -0.017734287306666374,
        0.09415952861309052,
        -0.12871181964874268,
        -0.011814497411251068,
        -0.02152116410434246,
        -0.012137395329773426,
        -0.01160814706236124,
        0.023918597027659416,
        0.0029496450442820787,
        0.056898802518844604,
        -0.07753897458314896,
        0.038708098232746124,
        0.0871860682964325,
        0.01648828200995922,
        -0.05456196889281273,
        -0.07814102619886398,
        0.016972903162240982,
        0.019499532878398895,
        0.11251653730869293,
        -0.010482811369001865,
        0.013713287189602852,
        0.08540799468755722,
        0.04788913205265999,
        -0.01373935304582119,
        -0.06318604946136475,
        0.07246200740337372,
        0.06338644027709961,
        -0.047934532165527344,
        -0.02742956019937992,
        -0.0027092965319752693,
        0.0011312889400869608,
        -0.006694762501865625,
        -0.012031120248138905,
        -0.054285209625959396,
        0.06266774982213974,
        0.003534252755343914,
        -0.04901014268398285,
        -0.08101695030927658,
        -0.06350228935480118,
        -0.0654682070016861,
        0.0007810374954715371,
        -0.0938442051410675,
        -0.006556999403983355,
        0.038436610251665115,
        -0.04906725138425827,
        0.008307100273668766,
        0.019413908943533897,
        -0.0492161400616169,
        0.01981581188738346,
        0.020399238914251328,
        -0.09206389635801315,
        -0.05187991261482239,
        0.057801418006420135,
        0.006757351569831371,
        -0.02630947344005108,
        -5.134734546518421e-33,
        -0.022991372272372246,
        -0.11267904937267303,
        -0.05568501353263855,
        0.02590700425207615,
        0.0298890583217144,
        -0.05569421499967575,
        -0.010318928398191929,
        0.026366958394646645,
        0.04158217832446098,
        -0.01775488071143627,
        0.01059658918529749,
        0.07051629573106766,
        -0.04639691486954689,
        -0.027293210849165916,
        0.01137014850974083,
        -0.04009121283888817,
        0.03200757876038551,
        0.04724913462996483,
        0.01628921367228031,
        0.023004749789834023,
        0.052242279052734375,
        0.03600955009460449,
        -0.044554296880960464,
        0.04522841423749924,
        -0.015217619016766548,
        0.10406859219074249,
        0.026232821866869926,
        0.010992040857672691,
        -0.004177492577582598,
        0.050717294216156006,
        -0.005941198673099279,
        -0.0017536536324769258,
        0.03389773517847061,
        0.04183180630207062,
        0.0403200164437294,
        -0.026135241612792015,
        0.03302169218659401,
        -0.029708100482821465,
        -0.08398662507534027,
        -0.06551862508058548,
        0.08294667303562164,
        0.005961192771792412,
        -0.007090986240655184,
        0.08154956996440887,
        0.051314108073711395,
        0.013115260750055313,
        -0.14022597670555115,
        -0.05336843430995941,
        -0.05455433204770088,
        -0.01277085393667221,
        0.08617433905601501,
        -0.046916551887989044,
        -0.0235582422465086,
        -0.052554383873939514,
        -0.07352496683597565,
        -0.00033553066896274686,
        -0.060561973601579666,
        0.045306336134672165,
        0.04480210691690445,
        0.004404624458402395,
        0.024657143279910088,
        -0.01068983692675829,
        -0.06328293681144714,
        0.01034253928810358,
        0.011290512047708035,
        0.02180825173854828,
        0.03397587314248085,
        0.06030614674091339,
        0.03770329803228378,
        -0.019030502066016197,
        0.016347279772162437,
        0.04557446762919426,
        -0.05319325998425484,
        -0.03399837762117386,
        -0.04391986131668091,
        0.059547215700149536,
        -0.0017741098999977112,
        -0.055451780557632446,
        -0.011865422129631042,
        -0.028399569913744926,
        -0.013927933759987354,
        0.010956731624901295,
        0.04105648770928383,
        -0.015342848375439644,
        0.026436926797032356,
        0.051773201674222946,
        -0.026366744190454483,
        0.05429689213633537,
        -0.061443641781806946,
        0.038256172090768814,
        0.05140914395451546,
        0.04803038015961647,
        -0.043850742280483246,
        0.10356191545724869,
        0.013720941729843616,
        -7.356100439892543e-08,
        0.044594407081604004,
        0.003859318094328046,
        0.021547041833400726,
        0.0318208672106266,
        0.016387805342674255,
        -0.04560194909572601,
        -0.023013031110167503,
        -0.039913736283779144,
        0.056270532310009,
        -0.07068924605846405,
        0.05887741968035698,
        0.023728955537080765,
        0.01438900176435709,
        0.05743188038468361,
        0.08166895806789398,
        0.09994439780712128,
        -0.038204677402973175,
        0.07395625859498978,
        -0.04948396980762482,
        0.011076766066253185,
        -0.01959458738565445,
        0.02771538496017456,
        0.06294064223766327,
        -0.07830116897821426,
        -0.03681591525673866,
        -0.036412179470062256,
        0.019668009132146835,
        0.013889391906559467,
        0.05251382663846016,
        0.017378313466906548,
        -0.03431878611445427,
        -0.017243312671780586,
        -0.033839162439107895,
        -0.06548640877008438,
        0.040294960141181946,
        -0.017480704933404922,
        0.015481315553188324,
        -0.0817258358001709,
        0.03641350194811821,
        -0.037465885281562805,
        -0.11090843379497528,
        -0.12614265084266663,
        -0.05882586911320686,
        0.019460557028651237,
        -0.04952372610569,
        -0.0409407839179039,
        0.06191899999976158,
        -0.07838704437017441,
        -0.007227412424981594,
        0.07882058620452881,
        -0.016654808074235916,
        0.03908957168459892,
        0.0180173572152853,
        -0.003891804488375783,
        0.07254474610090256,
        -0.015588312409818172,
        -0.0199529230594635,
        0.04398418590426445,
        -0.009860343299806118,
        -0.023366382345557213,
        0.07234390079975128,
        0.04047507792711258,
        0.020415373146533966,
        0.05527454987168312
    ]
}