{
    "id": "VSJqkrazDjA",
    "title": "Tate McRae Interview and Sony's Spatial Reality Display!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-03-31T17:47:18Z",
    "video_url": "https://www.youtube.com/watch?v=VSJqkrazDjA",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 105558,
    "likes": 4633,
    "comments_count": 304,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And, today we are going on a field trip. My sister and I are getting a chance to demo the all new Sony Spatial Reality Display. A huge thank you to Sony for sponsoring this video, and also hooking us up with this incredible opportunity to view this thing in person. We got a chance to interview Tate McRae, who worked with Sony to produce an amazing 3D version of her hit song, \"You broke me first\". This was the music video that we're actually watching in this video, on the Spatial Reality Display. (slow electronic music) [Justine] It's 3D, but I'm not wearing any glasses, so, it's just like, it's just happening right in front of me. [Justine] The Spacial Reality display is an entirely different experience. You don't even need glasses at all. You just look at it and it works. The display itself is a 15.6 inch LCD display that's covered with a micro optical lens that divides the image into the left and the right eyes, allowing for stereoscopic viewing. And, this is happening without glasses. With Sony's proprietary, high-speed vision sensor, that's built right into the top of the display. This will follow your eye movement down to the millisecond, sensing your pupil position through space vertically, horizontally, and even the depth. [Justine] It's really hard to even explain. So, when I move around from side to side, it's kind of tracking my face. So, it's also moving. So, when you're looking at the screen and you're physically kind of moving around it, the display will sense your movement and adjust the content accordingly. And, this all happens with a real-time rendering algorithm that processes real time in each eye. It's really kind of fascinating to just be sitting there and staring at a display, and, it's popping out at your face. It's almost like you can actually reach out and touch it. But I don't really care how bad it hurts When you broke me first You broke me first - [Justine] It starts out in her bedroom. And it's cool because they completely did this entire thing in 3D. So, they re-rendered her entire room. They didn't even use motion capture for this. She basically filmed this on her phone and they redid it in 3D. I know you, you're like this - [Justine] It's so hard to even show you guys what we were seeing on the Spatial Reality Display, because obviously, you guys are watching this here on YouTube, It's 2D. You're not seeing the 3D experience that we were witnessing, but trust me when I say that I was so impressed and just shocked. And I see so much tech on a day-to-day basis that sometimes it's really hard to feel excited and super impressed by something. And, this was honestly kind of mind blowing to really experience this in person. So, for creators who are already kind of creating this type of 3D content, it's very easy to integrate into your workflow. It's compatible with Unity and Unreal Engine 4, and you can just export your existing 3D content using Sony's SDK. The music video that we are watching for this demo is by an incredible artist, Tate McRae. Now, what kind of made this even more interesting is we actually got a chance to talk to Tate, to see what the whole process was like in creating this music video in collaboration with Sony. Now, suddenly you're asking for it back Could you tell me, where'd you get the nerve? Yeah, you could say you miss all that we had But I don't really care how bad it hurts When you broke me first - Oh my gosh, Tate, I'm so excited that you're hanging out with us here virtually. [Justine] How are you? - I'm great, how are you? - Doing well. - Yeah, doing well, can't complain. - So, okay. [Justine] When they told me that this project was happening, I thought it was so cool, because I loved how in your music video, you said you shot it on your phone, taped to your mom's car. Like that is, that is just... that's talent right there. - It was a process. I got, I got sent home from New York [Tate] and I had to be home in two hours, whatever, and I was releasing my song in like a week. And they basically said, \"Tate, (chuckling) you got to film a music video,\" but, I was like, uh, (chuckling) what? [Tate] So, we literally just had to work with what we got and it ended up looking actually really cool. But, it was a process for sure. - Yeah, I was so impressed because actually I watched it then, I was like reading the description. I was like, oh my gosh, she shot this on her phone. Like, that's incredible. - Yeah, it was cool, it was with my friend, and he was driving backwards the entire time. I was like, \"Don't look at me, please.\" Like, I can't, \"You can't look at me as I'm singing.\" - [Justine] Yeah (chuckling) What was that kind of, like, going from taping a phone to a car, to now doing this crazy 3D project? - Well, I mean, the thing about this music video was that it was, it was really cool, it was on my phone, but I felt like there was also like a missing piece. When Sony presents me with this idea, where they just literally wanted to bring me to 3D. I was like, \"Ah, sure... I dunno how you're gonna do that, but sure.\" [Tate] And it was crazy. I had no idea with this Spatial Reality Display that they could take a mini Tate and like literally sculpt her into like this little avatar. It was the craziest thing to see. I had, I honestly had no idea what they were going to put me into. I was just more honestly curious of how they were gonna take my dancing and, you know, make it into this 3D thing. [Tate] They made me do full body scans. Like I had to sit there for like 20 minutes scanning my face. - That's just crazy too thinking about the technology, like, you were doing that from a phone and sending that to them and they were able to make this happen. - Yeah, it doesn't, it doesn't seem possible. I mean, I used to edit all my YouTube videos and everything on Final Cut Pro, and I thought that was the extent of editing. - Oh my gosh, she's a Final Cut editor. - I think we just became best friends. - We are, so, I've been editing Final Cut, I mean, for a very long time, so, like, whenever I find another Final Cut editor, I'm like \"Oh my heart.\" - Final Cut is the best. - That's awesome. That's so cool though, that you've also have like, an editing background and stuff like that, too. - Yeah. I used to edit all my videos and I used to really- I was like, \"Oh, I'm so techie\", whatever. And then, once I actually saw Sony do their thing, it kind of blew my mind. - Basically, you're gonna be one of the first people kind of doing this. Like, this is, this is exciting. - It is exciting. And honestly, I'd never really thought that I would be collaborating with Sony. It's just, like, a huge honor. So, it's really cool. (giggling) - Did you always want to do music or was it more like dance focused? - I always thought I was gonna be a dancer, like a backup dancer or something. I really just genuinely thought I was going to be a professional dancer, because I had no idea how to get into the music industry. I loved writing and I loved singing, but I, you just, there was no, I, you know, you don't know how that works. I don't know how to... I didn't know how to put myself out there. And then, I think when I started my YouTube channel, it started to, obviously, shift over a bit. - Well, you're definitely not a backup dancer anymore. You're like, \"I am the dancer. I'm just doing it all.\" (laughing) I feel like for a lot of, I mean, 'cause like we also have like a big female audience and I feel like you also have a lot of girls that probably, obviously, looking up to you and like, \"man, I really want to do that,\" or, maybe not this specifically, but something else, like, do you have any advice for them? 'Cause like, even when I was growing up, I never really had like, a role model that liked tech and stuff like that. So, now I feel like there's so many, like, young girls that are just, like, going for it. - Yeah, I think that's the biggest thing is not doubting yourself and just putting yourself out there. And that's what I had to do. Just take a leap of faith and you know, fingers crossed, see how it goes, see how people are gonna react. And then, after that, just work as hard as you can and speak up. That's all you can really do. - You're so young and you've accomplished so much so far. So, I just want to say congratulations. And I'm just looking forward to, you know, watching, watching you blossom even more on your upcoming career. - Thank you, that means so much. - This is so great, and I just think that you're a really great inspiration too for, you know, like our next kind of future generation of girls. 'Cause, like, we really do need people like you that, you know, these girls can look up to, so. Keep being awesome. And we're gonna- we are gonna be right there in front of the line. Actually, we might even, like, crowd surf. Can we do that? - Well, I don't know, I don't know how, we don't know how things work yet, but we'll figure it out. Whatever we can do, we'll will be there doing it, [Jenna] loud, loudly. - Well, thank you so much for hanging out with us. - So nice meeting you both. [Justine] After talking with her and viewing the final music video for \"You broke me first\", I was so blown away with the production and the final music video. I also really loved talking to Tate and hearing her story. If you guys want to get more info about the display, I'll put the link in the description. But, this is really a first look at the future of viewing content this way. There are a few of these displays out in the wild, and one of the places that you can check it out in real life, in person, to see really what it's all about, is it B&H retail stores. I definitely look forward to the future iterations of this, because this really is just the beginning. If you guys haven't subscribed to my channel, be sure to hit Subscribe. Make sure you guys like this video, and, I will see you guys in the comments below and in my next video. (\"You broke me first\" instrumental music)",
    "transcript_keywords": [
        "Spatial Reality Display",
        "Reality Display",
        "Spatial Reality",
        "Sony Spatial Reality",
        "music video",
        "Display",
        "Final Cut",
        "Sony",
        "video",
        "final music video",
        "Tate",
        "kind",
        "music",
        "Reality",
        "Final",
        "Yeah",
        "thing",
        "Cut",
        "cool",
        "Justine"
    ],
    "transcript_entity_values": [
        "this Spatial Reality Display",
        "New York",
        "20 minutes",
        "the Spatial Reality Display",
        "Justine",
        "15.6 inch",
        "Sony",
        "4",
        "LCD",
        "YouTube",
        "Tate McRae",
        "Final Cut Pro",
        "two hours",
        "Tate",
        "today",
        "YouTube",
        "Final Cut",
        "first",
        "SDK",
        "Jenna"
    ],
    "transcript_entity_types": [
        "LAW",
        "GPE",
        "TIME",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PERSON"
    ],
    "vector": [
        0.019585637375712395,
        -0.09295773506164551,
        -0.03669667989015579,
        -0.11133301258087158,
        0.03342999145388603,
        0.00664721941575408,
        0.03520921245217323,
        0.0435270220041275,
        -0.00415973924100399,
        0.039372917264699936,
        -0.007150538731366396,
        -0.013790205121040344,
        -0.017317986115813255,
        0.013696539215743542,
        0.0036534874234348536,
        0.01466614194214344,
        0.03454049304127693,
        -0.020829249173402786,
        0.010939465835690498,
        0.06717926263809204,
        -0.01050534751266241,
        -0.07427114993333817,
        0.009777991101145744,
        0.03280963748693466,
        -0.030132288113236427,
        0.07455368340015411,
        0.039867497980594635,
        0.016067560762166977,
        -0.10301345586776733,
        -0.08969518542289734,
        -0.050391990691423416,
        0.040739502757787704,
        0.11295156180858612,
        0.009184751659631729,
        -0.005639937240630388,
        -0.033266764134168625,
        0.047586727887392044,
        -0.0013267294270917773,
        -0.09060706198215485,
        -0.07162965089082718,
        -0.04055558890104294,
        -0.07410052418708801,
        0.035724714398384094,
        -0.027431504800915718,
        -0.04596460610628128,
        -0.09970377385616302,
        0.005919952876865864,
        -0.03744477406144142,
        0.09146140515804291,
        0.05248618498444557,
        -0.09934313595294952,
        -0.08511439710855484,
        0.06408140808343887,
        0.019388219341635704,
        -0.05256466194987297,
        0.039913374930620193,
        -0.0812988430261612,
        0.02570154331624508,
        0.07074657827615738,
        -0.09803661704063416,
        0.08518539369106293,
        -0.03510865196585655,
        -0.005810336209833622,
        0.07263892143964767,
        -0.0457102432847023,
        -0.04383321851491928,
        0.013699693605303764,
        -0.02254827506840229,
        0.002330496907234192,
        -0.043623004108667374,
        -0.08162923157215118,
        0.029196765273809433,
        -0.027352290228009224,
        -0.038856472820043564,
        -0.0005841342499479651,
        0.08835513889789581,
        0.003942281007766724,
        -0.11465916782617569,
        0.03383500128984451,
        0.07977025210857391,
        0.058828119188547134,
        -0.06381741166114807,
        -0.10262399166822433,
        -0.033745888620615005,
        0.05268806964159012,
        0.029751373454928398,
        -0.004125343635678291,
        0.001675089355558157,
        -0.052804745733737946,
        -0.06790059059858322,
        -0.06781840324401855,
        -0.0012588895624503493,
        -0.07591497898101807,
        -0.01044502854347229,
        -0.025999778881669044,
        -0.0882212221622467,
        -0.040043145418167114,
        -0.06008853390812874,
        -0.03439820557832718,
        0.08474189788103104,
        0.04795215651392937,
        -0.034884221851825714,
        0.037796467542648315,
        0.0026832271832972765,
        -0.0443974994122982,
        -0.11972134560346603,
        -0.01068071834743023,
        0.03152187168598175,
        -0.01065260823816061,
        0.026126351207494736,
        -0.060060255229473114,
        0.04144169017672539,
        -0.06747802346944809,
        -0.020146146416664124,
        0.03023686073720455,
        0.126073956489563,
        -0.029884809628129005,
        0.09098696708679199,
        0.07727756351232529,
        -0.031639374792575836,
        0.01094925869256258,
        -0.028809847310185432,
        -0.020429596304893494,
        0.07589700818061829,
        0.012677821330726147,
        0.017725327983498573,
        -0.06398206204175949,
        1.382078960645261e-32,
        -0.05167746916413307,
        0.057329826056957245,
        0.040098756551742554,
        0.01986677013337612,
        0.015811504796147346,
        -0.030157683417201042,
        -0.01578363962471485,
        0.07350431382656097,
        0.044806964695453644,
        -0.00346149830147624,
        0.010200852528214455,
        0.051808588206768036,
        -0.007580963894724846,
        0.026733221486210823,
        0.05135735496878624,
        -0.06268474459648132,
        -0.017901482060551643,
        -0.025193823501467705,
        -0.06031285226345062,
        0.05478140711784363,
        -0.012855255976319313,
        -0.015033997595310211,
        -0.023118823766708374,
        0.07476438581943512,
        0.08926256000995636,
        0.09981796890497208,
        0.0308412853628397,
        0.003714559366926551,
        0.05423091724514961,
        0.027755776420235634,
        -0.09577731788158417,
        -0.0645124763250351,
        -0.01082304585725069,
        -0.11781059205532074,
        -0.03299811854958534,
        -0.02004263550043106,
        -0.030588367953896523,
        -0.042788065969944,
        -0.061717838048934937,
        -0.010513484477996826,
        -0.04397466406226158,
        0.02836061269044876,
        -0.03864961117506027,
        -0.04111742600798607,
        0.009735509753227234,
        0.08380477875471115,
        0.04589147865772247,
        0.09288022667169571,
        -0.02492004632949829,
        0.032314687967300415,
        -0.04516887664794922,
        -0.019550137221813202,
        -0.07335775345563889,
        -0.055449724197387695,
        0.03740647807717323,
        -0.07131930440664291,
        -0.04432964324951172,
        0.009393269196152687,
        0.04644782096147537,
        0.029937759041786194,
        0.04317333921790123,
        0.0019960736390203238,
        0.006806389428675175,
        -0.023292485624551773,
        -0.0501910001039505,
        0.0872359424829483,
        0.0551828108727932,
        -0.024424267932772636,
        0.027918409556150436,
        0.06538983434438705,
        -0.019680870696902275,
        0.017195429652929306,
        0.06032672896981239,
        0.009161346592009068,
        0.03565492108464241,
        0.05051378905773163,
        -0.09459898620843887,
        -0.03285058215260506,
        0.01615632139146328,
        -0.016965476796030998,
        -0.07594779133796692,
        0.055267054587602615,
        0.039385270327329636,
        0.08927624672651291,
        -0.039460450410842896,
        -0.03277670964598656,
        0.03595530986785889,
        -0.04587268456816673,
        -0.05524219945073128,
        0.008280213922262192,
        -0.0007864804356358945,
        0.05353313684463501,
        -0.06185954064130783,
        -0.02657068707048893,
        -0.06286676973104477,
        -1.3454194060733418e-32,
        0.050928372889757156,
        0.012790377251803875,
        -0.02196219190955162,
        -0.031047644093632698,
        0.0431593619287014,
        -0.01166761014610529,
        0.03221651539206505,
        0.06060747802257538,
        0.059055548161268234,
        -0.10245365649461746,
        0.028497708961367607,
        -0.05678106099367142,
        -0.11490729451179504,
        -0.017415503039956093,
        -0.031489428132772446,
        -0.016990233212709427,
        -0.005595743656158447,
        -0.05365162342786789,
        0.0523512065410614,
        0.002453008433803916,
        0.08242009580135345,
        0.11708395183086395,
        0.04902207851409912,
        0.009953740052878857,
        -0.015259970910847187,
        0.002214686246588826,
        0.05155477300286293,
        0.06460202485322952,
        0.0061434791423380375,
        0.0456094928085804,
        -0.013324122875928879,
        -0.05939774215221405,
        -0.01842385344207287,
        0.02412569709122181,
        0.02316899783909321,
        0.0649469643831253,
        0.035867780447006226,
        -0.014539383351802826,
        0.02383255772292614,
        -0.027152687311172485,
        0.0577925480902195,
        0.020455164834856987,
        -0.02366803213953972,
        0.01575692556798458,
        -0.03577499836683273,
        -0.05281780660152435,
        -0.02299685962498188,
        0.015891751274466515,
        0.022322403267025948,
        -0.05546704679727554,
        -0.08197111636400223,
        -0.0434449277818203,
        -0.04099966213107109,
        -0.02764323726296425,
        -0.0256755743175745,
        -0.00024307009880430996,
        -0.08078041672706604,
        -0.013106820173561573,
        0.05281027406454086,
        -0.009426169097423553,
        -0.005116753745824099,
        -0.01628943718969822,
        -0.1170768216252327,
        -0.07870049774646759,
        0.008026739582419395,
        -0.013918876647949219,
        0.044339023530483246,
        0.021204935386776924,
        -0.031701911240816116,
        0.04078874737024307,
        -0.03644563630223274,
        0.012061347253620625,
        0.04983694478869438,
        0.050836123526096344,
        0.01489529013633728,
        0.01222605537623167,
        -0.027820996940135956,
        0.020788531750440598,
        0.1131853386759758,
        -0.03961502015590668,
        -0.060242149978876114,
        -0.019297415390610695,
        0.032507624477148056,
        0.07972034066915512,
        0.13315346837043762,
        0.11115515232086182,
        0.03241564333438873,
        -0.03464239463210106,
        -0.027789318934082985,
        0.07445821911096573,
        0.049777690321207047,
        0.06763865053653717,
        0.044063910841941833,
        0.0784929171204567,
        -0.02296879142522812,
        -6.977780486749907e-08,
        0.03855668008327484,
        -0.01494083646684885,
        -0.021597247570753098,
        -0.04775209724903107,
        0.0005818261997774243,
        -0.05366033688187599,
        0.004278674256056547,
        -0.0058929044753313065,
        0.04747988283634186,
        -0.05515923351049423,
        0.02876543253660202,
        -0.0344715341925621,
        -0.012305147014558315,
        0.10968034714460373,
        0.04358512535691261,
        0.03117314912378788,
        -0.07560542225837708,
        0.10204774886369705,
        -0.0563700795173645,
        -0.03628615662455559,
        -0.035832323133945465,
        0.053074274212121964,
        0.022277384996414185,
        -0.06687593460083008,
        0.03285389766097069,
        0.042460471391677856,
        -0.02953941561281681,
        -0.042779017239809036,
        0.02027267962694168,
        0.017790576443076134,
        -0.0357593409717083,
        0.011031529866158962,
        -0.0195145346224308,
        -0.03358978033065796,
        -0.05522814765572548,
        -0.034377485513687134,
        -0.04707181081175804,
        -0.01485120877623558,
        0.0212395116686821,
        0.026590213179588318,
        -0.03650188818573952,
        -0.10865726321935654,
        -0.07740163058042526,
        0.010182108730077744,
        0.06428563594818115,
        -0.0509173683822155,
        0.017132513225078583,
        -0.08333305269479752,
        -0.04751187562942505,
        0.009482554160058498,
        -0.04654892161488533,
        0.050696272403001785,
        0.05027450993657112,
        -0.009597841650247574,
        0.0788121297955513,
        0.00375143950805068,
        0.07106045633554459,
        0.039617639034986496,
        -0.03035598248243332,
        0.015045111067593098,
        0.06891823559999466,
        0.01879546232521534,
        -0.08256951719522476,
        0.048130717128515244
    ]
}