{
    "id": "Vt1EmsvEyd4",
    "title": "The Biggest Upgrade for Windows PCs in YEARS - Snapdragon X Elite",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-10-28T17:02:37Z",
    "video_url": "https://www.youtube.com/watch?v=Vt1EmsvEyd4",
    "category": "Science & Technology",
    "tags": [
        "qualcomm",
        "snapdragon",
        "snap dragon",
        "x elite",
        "snapdragon x elite",
        "snapdragon elite",
        "8 gen 3",
        "snapdragon 8 gen 3",
        "windows",
        "android",
        "laptop",
        "intel",
        "apple",
        "m2",
        "m3",
        "snapdragon summit",
        "hands on",
        "benchmark",
        "vs",
        "amd",
        "graphics",
        "cpu",
        "gpu",
        "npu",
        "ai",
        "neural",
        "austin",
        "austin evans"
    ],
    "views": 278063,
    "likes": 5390,
    "comments_count": 381,
    "description": "Between the Qualcomm Snapdragon X Elite for Windows laptops and Snapdragon 8 Gen 3 for Android flagships Snapdragon Summit 2023 had a lot to talk about.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:",
    "description_links": [
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- This is the Snapdragon X Elite, and it is the biggest thing to come to Windows in a very long time. So Qualcomm were very gracious to invite me out to the Snapdragon Summit in Maui this year and sponsor this video. The flagship is certainly the Snapdragon X Elite. What you're looking at here is a chip which can go head to head with any other laptop chip on the market. We're talking about on the PC side, we're talking about on the Mac side, and that's an impressive accomplishment. So not only are you looking at these incredibly powerful Orion CPU cores, so the Snapdragon X Elite is going to have 12 CPU cores, two of which can boost up above four gigahertz. So to put a lot of this in the context, let me read you some of the benchmarks that Qualcomm are claiming for this X Elite, because it is truly impressive stuff, especially considering we're talking about a processor which is not going to be shipping until the middle of 2024. so keep that in mind, we are very early here. So going against Intel, they took the Orion CPU versus a Core i7-1360P, and they delivered twice the CPU performance at the exact same power, and it doesn't stop there. They also put it head to head with Apple's M2. So for multi-threaded, we've got 50% higher peak multi-threaded performance compared to the standard M2, and when you look at the single-threaded performance, it is significantly better than even the M2 Max. We're talking about 3,227 versus 2,841. So again, not only single thread is significantly better, at least according to Qualcomm, than anything Apple's shipping right now, but it also beats the standard M2 in multi-threaded benchmarks. Now, the main caveat here would just be that they're comparing it to the currently available M2. Even so, that is a large gap in performance, and it is significant, because those M series processors have really been touted as such a huge leap over the existing competition, and they are, and this is basically claiming to be a almost equally huge leap over that. Probably the most interesting one here is the comparison with AMD's Ryzen 9 7940HS, a chip that has quite good integrated graphics. Here, we're talking about 80% more performance at the same power level. So I mean, how you're gonna use that graphical power is gonna be a little different, since this is, of course, an ARM-powered device, so gaming is not really going to be the strong suit. Now, the only downside I can think of here is the app compatibility. So of course, not all Windows apps are compiled for Snapdragon and for ARM. It's getting better, so they announced a few things here at the summit, including DaVinci Resolve is actually getting updated for Snapdragon support. There is a compatibility layer for apps that are not fully optimized, much like which we saw on the Apple side, where they had the Rosetta layer to do the same thing, and theoretically, it's getting improvements. They were a little bit vague. I don't have the exact details on how much better it's getting, but even for apps that are not optimized, they should be running better, and then there's just the sheer brute force of having a processor and GPU that is this powerful. They'll be able to push through some of that. But the real story here is going to be apps that are being developed specifically for Windows on ARM. And when you talk about these Snapdragon processors, there's gonna be a whole lot of people, I think, who are gonna be buying these expecting not only the 5G, but that great performance and that great battery life. I mean, if you're waiting for a catch, keep waiting. I don't see a whole lot of things that are gonna go wrong here. Now, of course, I still wanna get hands on final shipping hardware to see what these devices look like, but they should be targeting quite thin form factors. In fact, there actually are some that will theoretically be available in fanless configurations, so it's rare to see in the PC industry, something hit all of them, right? We're talking about great CPU performance, great graphics performance, great neural performance for AI tasks, and great battery life. And you can get it with 5G. So let me talk about AI. Now, that might be a phrase that you are tired of hearing about, but believe me when I say that it is not going anywhere, and there actually are some legitimately cool, exciting announcements about it here. So first and foremost, on-device AI. Almost every AI chatbot and image generation tool that you're using right now is running in the cloud. Now, there are advantages to that. Obviously, you can have as much horsepower in the cloud as you want, but the downsides there is that anything you're sending to the cloud is gonna be shared with whatever company you're using and whatnot, there could be some concerns. And also the speed. If you've ever used something like ChatGPT or Bing or whatever, you can know that's a little bit slow. Well, what's nice about this newest generation of Snapdragon, and this is both on the actual mobile side with 8 Gen 3 as well as on the PC side when it comes to X Elite, is the fact that you can actually do AI generation of images, you can do chatbots and stuff locally on your device. Something you're gonna be hearing a lot about in the next few years is an NPU, a neural processing unit. Now, a lot of these Qualcomm slides and stuff they're talking about, they put it right alongside your CPU, your GPU and your NPU, but what is an NPU? Well, put simply, it is a neural processor that is specifically meant for AI-related tasks. So while your CPU has its place, while your GPU has its place for graphics, the neural processor is used for a lot of things already on your device. Certain tasks like helping you, you know, figure out the autocomplete on your keyboard or helping to tune the video as you've got a very bright background, you gotta reign the highlights in and you're sort of processing multiple frames and whatnot. Like, there's certainly uses for an NPU today. On top of that, you can use it for creation. So using Stable Diffusion, for example, you could generate an image in less than a second. You know, this is stuff that, when I was playing around with Stable Diffusion on a PC even like, six months ago, it would take me sometimes 20, 30 seconds to get that same image. It all feels ethereal. I'll completely admit, it's one of those things that just you're like, oh, AI this, AI that, but it's here, it's coming, it's not going anywhere. And that's actually one of the big takeaways from the Snapdragon Summit, something that really has been an an eye-opener. It's one thing to see all these announcements and see how quickly that the AI revolution has been moving, but it's another thing to see the practical benefits. It's another thing to see what you can do today, what you'll be able to do tomorrow with the device that you already carry with you all the time. It's a value add, it's something additional that you can do, and I think that that's a really powerful thing. There's also Snapdragon 8 Gen 3, which is the SoC that you're going to find in pretty much all the major Android flagships in 2024. We're talking about a 30% faster CPU, 25% faster GPU, and a 98% faster NPU compared to the Snapdragon 8 Gen 2. Now, this might not be as exciting as X Elite, but for everyone who uses a flagship Android device, this is a very healthy improvement. There's some cool demos here, including using 200 megapixel sensors to do on-sensor cropping, as well as being able to zoom out of an image after the fact. This would be using Stable Diffusion to essentially generate what would be on the outside of an image directly on your phone. Something that you could do with, say, Photoshop today, but being able to do it on your device is very cool. This is coming soon. We're talking about Snapdragon 8 Gen 3 devices that have already been announced here at the Snapdragon Summit and will start shipping here later this year and certainly into next year. So expect a healthy improvement for Android flagships in 2024. Put all this together, and it has been a very exciting Snapdragon Summit. To summarize all of this, what we're looking at is Snapdragon X Elite, a significant step up when it comes to the competition in the Windows laptop space. Snapdragon 8 Gen 3, which is going to be a very welcome improvement on the mobile side, and a ton of AI improvements that are coming to both platforms, Windows, Android, like, it's an exciting time. So I wanna give a huge thank you to Qualcomm for inviting me out here and sponsoring this video, and let me know in the comments below what you think about the announcements, because to me, I feel like we're gonna be looking back at this moment much the way that we looked back on a certain other development in the PC space a couple years ago and go, oh yeah, remember before we had ARM everywhere? See you next time. I'm gonna go appreciate the beach.",
    "transcript_keywords": [
        "Snapdragon",
        "Snapdragon Summit",
        "Elite",
        "Snapdragon X Elite",
        "CPU",
        "talking",
        "performance",
        "Orion CPU cores",
        "Orion CPU",
        "CPU performance",
        "Qualcomm",
        "exciting Snapdragon Summit",
        "CPU cores",
        "Windows",
        "Stable Diffusion",
        "NPU",
        "great CPU performance",
        "Gen",
        "thing",
        "Summit"
    ],
    "transcript_entity_values": [
        "next year",
        "Bing",
        "98%",
        "this year",
        "5",
        "AMD",
        "Snapdragon Summit",
        "M2",
        "about 80%",
        "the middle of 2024",
        "50%",
        "first",
        "Core",
        "Snapdragon",
        "30%",
        "Qualcomm",
        "3,227",
        "two",
        "Apple",
        "Windows",
        "Snapdragon",
        "12",
        "SoC",
        "20, 30 seconds",
        "8",
        "one",
        "the next few years",
        "2,841",
        "AI",
        "Orion",
        "Snapdragon 8 Gen 3",
        "Rosetta",
        "Intel",
        "a ton",
        "less than a second",
        "Mac",
        "this X Elite",
        "CPU",
        "tomorrow",
        "2024",
        "25%",
        "later this year",
        "Snapdragon X Elite",
        "a couple years ago",
        "Stable Diffusion",
        "the AI revolution",
        "six months ago",
        "Orion CPU",
        "Snapdragon 8",
        "the Snapdragon Summit",
        "DaVinci Resolve",
        "Maui",
        "GPU",
        "X Elite",
        "today",
        "200 megapixel",
        "Windows,",
        "NPU",
        "Android"
    ],
    "transcript_entity_types": [
        "DATE",
        "WORK_OF_ART",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PERCENT",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "LAW",
        "NORP",
        "ORG",
        "QUANTITY",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "EVENT",
        "DATE",
        "PRODUCT",
        "LAW",
        "FAC",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.05399445816874504,
        0.014317027293145657,
        0.006646954454481602,
        -0.037914495915174484,
        -0.0019427756778895855,
        -0.06333918124437332,
        -0.032346174120903015,
        -0.007493415381759405,
        -0.06697829812765121,
        -0.0249625276774168,
        -0.04464472830295563,
        -0.003770299255847931,
        0.021838244050741196,
        -0.041182685643434525,
        0.04446699097752571,
        0.07427995651960373,
        0.07640845328569412,
        -0.1013156920671463,
        -0.06956793367862701,
        0.015456100925803185,
        -0.00815320760011673,
        -0.12158693373203278,
        0.003681693458929658,
        -0.005624121055006981,
        0.10107315331697464,
        0.027228208258748055,
        -0.011946296319365501,
        -0.03140144422650337,
        -0.04253833740949631,
        0.03070513904094696,
        -0.005745973903685808,
        0.06945021450519562,
        0.003894571913406253,
        0.04748346284031868,
        0.02704351209104061,
        -0.02347426302731037,
        0.0203012116253376,
        -0.041406676173210144,
        0.013498414307832718,
        -0.0906897708773613,
        -0.034180477261543274,
        0.01098973024636507,
        0.009138396009802818,
        0.02324170246720314,
        0.02536063827574253,
        -0.010048555210232735,
        0.03519216924905777,
        -0.0012522888137027621,
        -0.04607825353741646,
        0.020408399403095245,
        -0.07691576331853867,
        -0.0811195895075798,
        -0.02808574214577675,
        -0.005543001927435398,
        -0.06831324845552444,
        0.027694281190633774,
        -0.003320522839203477,
        -0.05693512037396431,
        0.019463954493403435,
        -0.014751181937754154,
        0.03746435046195984,
        -0.12857802212238312,
        0.0016982705565169454,
        0.037932004779577255,
        -0.024706408381462097,
        -0.06942187249660492,
        0.03216126561164856,
        -0.023884199559688568,
        0.04920262098312378,
        0.029588744044303894,
        0.025679482147097588,
        -0.052584968507289886,
        -0.004496951121836901,
        -0.036310259252786636,
        -0.008355444297194481,
        -0.027640052139759064,
        0.049303896725177765,
        -0.004955369047820568,
        0.011128772050142288,
        -0.039075613021850586,
        0.03066891059279442,
        0.004045706242322922,
        -0.007047635968774557,
        -0.05301453918218613,
        0.054009728133678436,
        -0.0061492715030908585,
        -0.0773567333817482,
        0.02388884872198105,
        -0.09316323697566986,
        -0.04326535761356354,
        0.04022404924035072,
        0.033738091588020325,
        0.01115378737449646,
        -0.0031291309278458357,
        0.08023597300052643,
        0.03413594141602516,
        -0.022901782765984535,
        -0.09900384396314621,
        -0.04395737126469612,
        0.028270704671740532,
        0.03151944279670715,
        0.027026988565921783,
        0.0813927948474884,
        -0.0819007158279419,
        0.014202306047081947,
        0.005679265130311251,
        -0.0025766000617295504,
        0.049191929399967194,
        -0.030966080725193024,
        -0.03171994164586067,
        -0.029657505452632904,
        0.03284578025341034,
        -0.03447757288813591,
        -0.014861316420137882,
        0.002848669420927763,
        0.018201999366283417,
        0.037359073758125305,
        0.0654599741101265,
        0.046815481036901474,
        0.031795401126146317,
        -0.0451345294713974,
        -0.028170868754386902,
        -0.03439686447381973,
        -0.03380841389298439,
        -0.015508310869336128,
        0.0598255880177021,
        -0.17362971603870392,
        5.931237029008126e-33,
        0.01998934894800186,
        0.05950021743774414,
        0.0034721731208264828,
        -0.009994205087423325,
        -0.010517124086618423,
        -0.06324909627437592,
        0.07446745038032532,
        -0.05875757709145546,
        0.0157991424202919,
        0.038910236209630966,
        -0.08580252528190613,
        -0.02239522710442543,
        -0.014635981991887093,
        0.05200318992137909,
        0.08930514007806778,
        -0.08363011479377747,
        -0.08140541613101959,
        -0.01587817445397377,
        -0.003495272947475314,
        0.025912869721651077,
        0.07487377524375916,
        -0.010261613875627518,
        -0.026013711467385292,
        -0.044853921979665756,
        0.021700182929635048,
        0.008093197830021381,
        0.07397058606147766,
        0.012243795208632946,
        0.010870997793972492,
        0.024239109829068184,
        -0.05335216224193573,
        -0.03165743127465248,
        -0.045525118708610535,
        -0.08843916654586792,
        -0.018901346251368523,
        -0.03053700551390648,
        -0.0076915607787668705,
        -0.10169137269258499,
        0.0826815813779831,
        -0.013609149493277073,
        -0.07420624792575836,
        0.010957332327961922,
        -0.0175087358802557,
        -0.10156150162220001,
        0.0009872455848380923,
        0.014417593367397785,
        -0.04923931509256363,
        0.02062862180173397,
        -0.025904841721057892,
        -0.031515564769506454,
        0.014792177826166153,
        0.02897065505385399,
        0.0826401337981224,
        0.017641177400946617,
        -0.01661820337176323,
        -0.0388520285487175,
        0.11037323623895645,
        0.03964609652757645,
        0.08749723434448242,
        0.14045816659927368,
        -0.04718942940235138,
        -0.11253396421670914,
        -0.01382126659154892,
        0.026289327070116997,
        -0.03234123811125755,
        0.07962814718484879,
        0.0823526531457901,
        0.06443778425455093,
        -0.09595141559839249,
        0.1320049911737442,
        0.02028159238398075,
        -0.047500040382146835,
        -0.030414968729019165,
        -0.09291794151067734,
        0.100313201546669,
        -0.039522625505924225,
        -0.03661506995558739,
        0.03406023606657982,
        -0.04271847382187843,
        0.05795762315392494,
        0.002941303653642535,
        0.06448183208703995,
        0.03605891391634941,
        -0.02616686001420021,
        -0.017103929072618484,
        0.005354833789169788,
        0.009872188791632652,
        -0.0354299433529377,
        -0.0022374179679900408,
        0.07380787283182144,
        -0.038991715759038925,
        0.004572426434606314,
        0.027608441188931465,
        0.042033497244119644,
        -0.05519429221749306,
        -5.363883578557795e-33,
        0.018164407461881638,
        -0.030751502141356468,
        0.03425415977835655,
        0.07263834029436111,
        0.013360855169594288,
        0.00588876660913229,
        0.0018582605989649892,
        -0.028155731037259102,
        -0.09332767128944397,
        -0.08666134625673294,
        0.005472411401569843,
        0.05116606876254082,
        0.06086994335055351,
        0.017307551577687263,
        0.009884420782327652,
        0.009068656712770462,
        0.033689048141241074,
        -0.1058243066072464,
        0.030437014997005463,
        -0.04878031834959984,
        0.018682049587368965,
        0.005602742079645395,
        0.021514620631933212,
        -0.010162114165723324,
        -0.02652640827000141,
        -0.018002824857831,
        -0.08494752645492554,
        -0.014947270974516869,
        0.09233760833740234,
        -0.03024177998304367,
        -0.0007254857919178903,
        -0.02105187252163887,
        0.03515811637043953,
        0.06348464637994766,
        0.1092085987329483,
        0.0011596870608627796,
        0.03899550437927246,
        -0.04439482465386391,
        -0.025730298832058907,
        0.09112803637981415,
        0.0698297843337059,
        -0.03678447753190994,
        0.05588375777006149,
        0.05833874270319939,
        0.10226816684007645,
        0.05223734676837921,
        -0.05475926399230957,
        -0.02798740193247795,
        -0.027090247720479965,
        0.0017896806821227074,
        -0.006376604549586773,
        0.02185050956904888,
        0.03379733860492706,
        0.08221849054098129,
        0.02657889574766159,
        -0.031865403056144714,
        -0.047819484025239944,
        0.018254678696393967,
        -0.009283252991735935,
        -0.05350874736905098,
        0.027941249310970306,
        -0.004980886355042458,
        -0.01992211677134037,
        -0.02048238180577755,
        0.02327311970293522,
        0.06340110301971436,
        0.028948288410902023,
        0.0083784069865942,
        -0.12812674045562744,
        -0.003563729813322425,
        -0.020071541890501976,
        -0.06282342970371246,
        -0.04747506603598595,
        -0.041020963340997696,
        -0.08107022941112518,
        0.09251034259796143,
        0.08724652230739594,
        -0.009076063521206379,
        -0.0018354749772697687,
        -0.05228766053915024,
        -0.03050936385989189,
        0.018719790503382683,
        0.018469160422682762,
        -0.0024787276051938534,
        0.028073780238628387,
        -0.021971434354782104,
        0.07428641617298126,
        -0.019901974126696587,
        -0.04276419058442116,
        -0.07544777542352676,
        -0.044445108622312546,
        -0.024608368054032326,
        -0.013166689313948154,
        0.008086064830422401,
        0.00242571416310966,
        -5.183687079579613e-08,
        0.04510272294282913,
        0.0022711199708282948,
        -0.061797525733709335,
        0.0066824001260101795,
        0.009411907754838467,
        -0.014564634300768375,
        -0.05243978276848793,
        0.005924733355641365,
        0.08302608132362366,
        0.0602291077375412,
        0.07291807979345322,
        -0.10614673048257828,
        -0.006523649208247662,
        0.04041958227753639,
        0.028455490246415138,
        0.045985493808984756,
        -0.055734895169734955,
        0.008680622093379498,
        0.06251894682645798,
        -0.047961775213479996,
        -0.025121178478002548,
        0.08074161410331726,
        0.11548814177513123,
        0.012660762295126915,
        -0.03500255197286606,
        0.04888255521655083,
        -0.01430108305066824,
        -0.00845353677868843,
        0.08142323791980743,
        0.022722817957401276,
        -0.07466424256563187,
        -0.019535444676876068,
        0.06347182393074036,
        -0.023692652583122253,
        0.04081221669912338,
        -0.0034204621333628893,
        -0.007704918272793293,
        0.06832797825336456,
        0.16652069985866547,
        0.0542265959084034,
        0.0038834442384541035,
        -0.0827295258641243,
        -0.023534035310149193,
        -0.016393622383475304,
        -0.006002404727041721,
        -0.0429082065820694,
        -0.09069421142339706,
        -0.08465706557035446,
        -0.011407901532948017,
        0.0759873315691948,
        0.012397977523505688,
        0.03421797975897789,
        0.028628380969166756,
        0.00881877914071083,
        -0.029211148619651794,
        0.07329940795898438,
        -0.07250288128852844,
        -0.009805546142160892,
        0.06227372586727142,
        0.05017700791358948,
        0.11193668842315674,
        -0.08989638090133667,
        -0.028768179938197136,
        0.1034196987748146
    ]
}