{
    "id": "vZtOl2f8SYc",
    "title": "iPad 2020 review: here we go again, again",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-09-23T17:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=vZtOl2f8SYc",
    "category": "Science & Technology",
    "tags": [
        "ipad 2020",
        "apple ipad 2020",
        "ipad 2020 review",
        "review",
        "ipad review",
        "apple",
        "ipad",
        "8th gen ipad",
        "ipad 8",
        "8 gen",
        "new ipad 2020",
        "iPad review",
        "dieter bohn",
        "tablets",
        "tablet",
        "amazon fire",
        "fire tablets",
        "split screen",
        "multiuser",
        "multi-user",
        "multi user",
        "app library",
        "apps",
        "families",
        "kids",
        "education",
        "how to buy",
        "price",
        "school price",
        "storage",
        "usb c",
        "charger",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "verge",
        "the verge"
    ],
    "views": 765044,
    "likes": 15795,
    "comments_count": 1004,
    "description": "Apple's 8th-gen iPad for 2020 continues to be one of the best deals in tech: a stupendous tablet for less than $500. But there are things that grate: the lack of multi user, the low base storage, and no USB-C. In this review, Dieter Bohn looks at the very good and increasingly annoying aspects of the new iPad.  Read the full review:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the new iPad from Best Buy:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/302wzmQ",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3cmQHoL",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Yep...it's an iPad. It is the 8th generation of the basic iPad, in fact. It still starts at 329 dollars and it is identical to last year's iPad in literally every way but one: the processor. It now has an A12 bionic chip in it, which is faster. But this thing in my hand hasn't changed much since last year. And the last one was great for the price, which means that this one is great for the price. But see, there really isn't any good competition for tablets at this price point. There's the iPad, which is pretty amazing, and there's stuff like Amazon's Fire tablets, which are fine. And I think that's part of the reason why Apple just hasn't had to change the iPad that much. It's still great, but some of the things about this iPad are really starting to grate on me. Oh, that's a pun. Let's review the iPad. It is an iPad, which means that it runs iPad OS which is fast and fluid and has nice multi-tasking capabilities. Even the app support for the iPad's multi-tasking is getting better. Most apps that I use now are able to do split screen. Plus, the fact that it's an iPad means you also get a vast, huge library of apps. There are more games, more educational apps, just more. So as a tablet OS, iPad OS has a lot going for it. But there's still one thing it can't do, and I'm tired of having to bring this up all the time, but here we go: multi-user. Windows computers, Mac computers, Linux computers, a bunch of Android phones, hell even the Apple TV, they all support multiple users. You can set up an entirely separate account for your kids or somebody else in you household. You don't have to worry about your work stuff living next to your kid's personal stuff, or vice versa. I mean Amazon makes these Fire tablets which are based on Fire OS and they're slower and they're cheaper feeling, and they're generally kinda meh compared to the iPad, but they have incredible family support. Now I know that there is a way for schools to set up iPads as multi-user, but that's just not enough. Sorry, this rant has been in me for a very long time. Actually, you know what? I'm not sorry. Apple, you need to fix this. Not everybody can afford to buy every person in their house their own iPad. Now speaking of price, 329 bucks is a really good deal. And for schools, it's just 299. But that is the starting price, and the starting price only includes 32 GB of storage. That's just not enough. I mean, my basic storage on my old iPad was over 40 GB. And yes, I'm a power user, but at 32 GB you're going to be doing a lot of memory management, deleting apps, and getting rid of movies, and making sure that you've got enough space just to keep this thing running. I think 64 should be the minimum now. To upgrade this, you have to go up to 128, which costs 100 dollars more. That's still a pretty good deal. You're getting a very fast, high quality iPad that will last you for years, for less than 500 bucks. Now I suspect I know what a bunch of you are thinking. There are a bunch of Chrome Books at 3, 4, 500 bucks and most of those only have 32 GB of storage. So what's the problem? Well, remember Chrome OS is a cloud based OS. All those great iPad apps I mentioned, they're stored locally. So iPad OS, by design, it really needs more than 32 GB to not feel cramped. I'm on a tear now, but let's keep going. Let's talk about Chrome Books. In this price range, they are slower, they have worse hardware, but they do have stellar multi-user support and they include a keyboard at no extra charge. Whereas this thing is 160 bucks. Plus, all Chrome Books charge via USBC. And this thing, still charges via lightening. Is USBC kind of a hassle sometimes? And would switching from lightening to USBC be disruptive for some iPad users? Yes, yes it would be. Is USBC also the thing that can charge almost every single phone and computer that isn't an iPad or an iPhone? Also, yes. If Apple really wants to get more of these iPads into classrooms, maybe they should charge using the same cables that the classrooms already have for Chrome Books. But maybe your kid can't go into the classroom right now. Maybe they're at school from home because of the pandemic. So their in Zoom school. This iPad though, it's not a good Zoom school device because Zoom and almost every other video conferencing app except for FaceTime is bad on this iPad. It has to run in full screen and as soon as you multi-task away or do a slide over window, your video goes away. Plus, in landscape your camera's on the side, not on the top, which means that you're always looking off to the side when you're doing a video conference. Okay, that was a lot of bad things. I want to remind you about the good things about this iPad, because again, it really is great. It has a very nice screen, although I have to admit even at this low price, it's starting to feel just a little bit small, these bezels are pretty big. But no, good things. It has a regular smart keyboard connector, but it is the old style origami smart keyboard and it still costs 160 bucks. But I really do like this origami keyboard because you can flip it around to the back and it feels nice to hold in your hand when you do. So, I don't know, I kind miss the origami keyboard. Also, this iPad is fast. It has an A12 bionic chip and it is really solid and it should cause you no problems. Maybe here and there you run into a tiny bit of a lag compared to a more powerful iPad, but that shouldn't put you off. Touch ID is still here on this classic home button. You can still do all the swipey, swipey navigation things but there's something really satisfying with the whole clicking that home button. It also has a headphone jack, hooray! Seriously though, headphone jacks are actually really useful. I'm glad it's here. The cameras are fine other than the fact that the front camera is on the wrong side. They can take pictures and scan things. I do love that there's no camera bump here. I'm also getting exactly the battery life that you'd expect, which is to say that it's pretty good. If you really use this thing as your main computer all day, you will drain it down in a full day. But I expect that most people will find that they can go much longer than a single day. It also works with the Apple pencil, but unfortunately it only works with the older style Apple pencil which has got this cap which is easy to lose, and which charges in this silly weird way via lightening. Also, there's nowhere to store it. You've got to make sure that you don't lose the Apple pencil. But hey look, again, it's an iPad. It's still one of the better deals in tech, even if you upgrade to the 429 dollar version with 120 GB of storage. It is fast, it runs all of the iPad apps. It's thin and light. And it has a battery that lasts all day. In a vacuum, just considered on its own merits, the 8th gen iPad really is great. But if you start to consider it in a larger computing context, you can start to see how its shortcomings are becoming a little grating. And I think that comes down to the fact that it hasn't been redesigned in a very long time. And I don't think this is just me griping about not getting a fancy new design or whatever. I think that it's time to start holding even this inexpensive iPad to a somewhat higher standard than just doing traditional iPad things like watching video or reading or browsing the web. iPad things now include Zoom calls for school. iPad things include joining the rest of the computing world and getting a better charger. iPad things includes being shared among family members. And of course, iPad things means loading up more than 32 GB of apps and content. If you can afford the 600 dollar price, I would wait to see what the reviews for the new iPad Air look like. It's gonna have a nicer screen, USBC for charging, and compatibility with Apple's new, modern pencil and keyboard accessories. Or, you know maybe next year this iPad will get those things. When the iPad first launched the knock against it was that it was just a big iPhone. But it turns out that having just a big iPhone is kinda pretty great. Plus, Apple has mostly put that criticism behind it. But if I'm being honest, it's still a little bit true. At least for this 8th gen iPad. Hey everybody, thanks so much for watching. Let me know what you think of this iPad, or if you're waiting for the iPad Air, down in the comments. And if you're looking for something that is 10 out of 10 a perfect product, you know what it is? It's a mask, it's wearing a mask when you're out in public.",
    "transcript_keywords": [
        "iPad",
        "Apple",
        "things",
        "iPad things",
        "Chrome Books",
        "price",
        "thing",
        "Chrome",
        "USBC",
        "apps",
        "great",
        "good",
        "Apple pencil",
        "Books",
        "Zoom",
        "keyboard",
        "iPad Air",
        "iPad apps",
        "Fire",
        "bucks"
    ],
    "transcript_entity_values": [
        "329 bucks",
        "last year",
        "next year",
        "USBC",
        "Android",
        "one",
        "Mac",
        "Apple",
        "the iPad Air",
        "329 dollars",
        "128",
        "a full day",
        "429 dollar",
        "iPad Air",
        "Linux",
        "FaceTime",
        "A12",
        "120",
        "3",
        "Chrome Books",
        "iPads",
        "years",
        "iPad",
        "GB",
        "160 bucks",
        "less than 500 bucks",
        "Apple TV",
        "iPads",
        "Fire",
        "jack",
        "64",
        "8th",
        "4",
        "Amazon",
        "iPad",
        "all day",
        "100 dollars",
        "Chrome",
        "a single day",
        "32",
        "500 bucks",
        "first",
        "iPhone",
        "Fire OS",
        "Zoom",
        "last year's",
        "600 dollar",
        "299",
        "32 GB",
        "10"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "MONEY",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.060760803520679474,
        -0.03488452732563019,
        0.022030435502529144,
        -0.054463617503643036,
        0.04749968275427818,
        -0.028568828478455544,
        -0.057440198957920074,
        0.050145089626312256,
        0.08950208872556686,
        0.03769216313958168,
        0.05893511325120926,
        0.08503968268632889,
        -0.07937215268611908,
        0.01842225342988968,
        0.025097940117120743,
        -0.01372221577912569,
        0.07067521661520004,
        -0.08355351537466049,
        -0.045164089649915695,
        -0.03730979561805725,
        -0.0436415895819664,
        0.022165272384881973,
        0.06202942878007889,
        -0.026618603616952896,
        0.006811690516769886,
        0.015611034817993641,
        -0.006504629272967577,
        -0.06664367020130157,
        -0.027758393436670303,
        -0.00018520589219406247,
        -0.03480266034603119,
        0.06005065515637398,
        -0.011565684340894222,
        0.056627288460731506,
        -0.05994216725230217,
        -0.06970161199569702,
        0.03831596300005913,
        -0.0028469348326325417,
        0.01989799179136753,
        -0.08856694400310516,
        -0.009940865449607372,
        -0.06110324710607529,
        -0.05883128196001053,
        0.058748990297317505,
        0.04179852455854416,
        0.03406228870153427,
        0.017696112394332886,
        -0.04494418948888779,
        0.04787366837263107,
        0.01770898886024952,
        -0.016480891034007072,
        -0.06802277266979218,
        -0.008425435051321983,
        -0.0849575474858284,
        0.013855916447937489,
        -0.01749550551176071,
        0.06019432097673416,
        0.01546658668667078,
        0.08330873399972916,
        0.05636776238679886,
        0.05614638328552246,
        -0.08345640450716019,
        0.06485205888748169,
        0.003048517508432269,
        0.04231622442603111,
        -0.05992498621344566,
        0.030431034043431282,
        -0.089725062251091,
        0.01482396014034748,
        -0.008982478640973568,
        0.00760149909183383,
        0.006381262559443712,
        0.09860420227050781,
        0.016402047127485275,
        0.013898433186113834,
        0.010079232044517994,
        0.048178158700466156,
        0.018063964322209358,
        0.037522900849580765,
        -0.024645958095788956,
        0.06867702305316925,
        0.0001762557221809402,
        0.005499840248376131,
        -0.02381807751953602,
        0.011336316354572773,
        -0.029304826632142067,
        -0.014009242877364159,
        0.018803272396326065,
        -0.022417867556214333,
        -0.04400031268596649,
        0.03001551330089569,
        0.10232901573181152,
        0.023165926337242126,
        0.003954138141125441,
        0.009280526079237461,
        0.019245291128754616,
        0.028435802087187767,
        -0.023701215162873268,
        -0.10087932646274567,
        0.005494839046150446,
        0.0022921899799257517,
        0.06717398762702942,
        0.0787716656923294,
        -0.018198223784565926,
        -0.03341915085911751,
        -0.08451494574546814,
        0.02829051949083805,
        -0.0379347950220108,
        -0.012214692309498787,
        0.034907806664705276,
        0.041107501834630966,
        -0.005260294768959284,
        -0.07066713273525238,
        -0.011458095163106918,
        0.03211541101336479,
        -0.034899331629276276,
        -0.03550165146589279,
        0.06114112585783005,
        0.14255329966545105,
        0.0601220428943634,
        -0.04664701595902443,
        0.0686073750257492,
        -0.039586376398801804,
        -0.08470570296049118,
        -0.07204160839319229,
        -0.018099229782819748,
        -0.056734852492809296,
        1.4924910144344877e-33,
        -0.058041464537382126,
        0.1319599151611328,
        -0.11718381196260452,
        -0.08227535337209702,
        -0.03668149560689926,
        -0.08440151810646057,
        0.002087151166051626,
        0.10184788703918457,
        0.010672714561223984,
        0.01713482290506363,
        -0.014054601080715656,
        -0.03360100835561752,
        -0.07638905197381973,
        0.07560784369707108,
        0.08447690308094025,
        -0.08555302023887634,
        -0.06763725727796555,
        -0.03970184177160263,
        -0.015164813958108425,
        -0.0005460459506139159,
        0.017662672325968742,
        -0.023089904338121414,
        -0.00758585799485445,
        -0.013597027398645878,
        0.0069035557098686695,
        -0.016321808099746704,
        0.03740459680557251,
        -0.03867729380726814,
        0.03232951834797859,
        -0.009045145474374294,
        -0.09097282588481903,
        0.022027134895324707,
        -0.04184594005346298,
        -0.1308060735464096,
        -0.023413149639964104,
        -0.062108077108860016,
        -0.02624533139169216,
        -0.08930076658725739,
        0.059573929756879807,
        -0.018652847036719322,
        -0.09517183154821396,
        0.042879700660705566,
        -0.051734086126089096,
        0.0028286899905651808,
        0.044039126485586166,
        0.04250532016158104,
        0.015361987985670567,
        0.03381155803799629,
        0.019154883921146393,
        -0.01147906482219696,
        -0.08186978846788406,
        -0.007371802814304829,
        -0.003594574984163046,
        -0.011470266617834568,
        -0.07242286950349808,
        -0.08153438568115234,
        -0.002866207854822278,
        -0.040538184344768524,
        0.0837467834353447,
        0.021748825907707214,
        0.0210103876888752,
        -0.0012322468683123589,
        -0.0660579651594162,
        0.040525734424591064,
        -0.11592154204845428,
        0.0872483029961586,
        0.018188878893852234,
        0.06327536702156067,
        -0.027467524632811546,
        0.011647072620689869,
        0.019366689026355743,
        -0.023593755438923836,
        0.008065502159297466,
        -0.07776261866092682,
        -0.02320343814790249,
        -0.003141320077702403,
        -0.021733300760388374,
        -0.004536293912678957,
        -0.03967894986271858,
        -0.06586924940347672,
        -0.022610235959291458,
        0.04326581582427025,
        0.037680733948946,
        0.05068051815032959,
        -0.05399472638964653,
        0.03500358387827873,
        0.007214928511530161,
        -0.013222640380263329,
        0.0040623098611831665,
        -2.2621999960392714e-05,
        -0.0010716423857957125,
        0.017657293006777763,
        -0.0046325442381203175,
        0.02985931746661663,
        0.04414346441626549,
        -2.8374978954590878e-33,
        -0.009169417433440685,
        -0.005643394310027361,
        -0.06153760477900505,
        0.0006001333822496235,
        -0.05349162593483925,
        -0.018165184184908867,
        0.026171837002038956,
        0.002644921187311411,
        -0.01960602030158043,
        -0.04861512407660484,
        -0.0011179291177541018,
        0.08025209605693817,
        0.05194278433918953,
        -0.014588974416255951,
        0.016904670745134354,
        0.01984267123043537,
        -0.1087769940495491,
        -0.08627967536449432,
        0.0994546040892601,
        -0.060596123337745667,
        0.05905720219016075,
        0.08499866724014282,
        0.0278845876455307,
        0.006795147433876991,
        0.011787047609686852,
        -0.0013253133511170745,
        -0.03188975900411606,
        0.016529010608792305,
        0.026323776692152023,
        0.027130328118801117,
        0.04505017027258873,
        -0.078367680311203,
        0.026216065511107445,
        0.06678980588912964,
        0.06301244348287582,
        0.031958095729351044,
        0.07459656149148941,
        -0.0674528032541275,
        -0.0624670572578907,
        0.022291025146842003,
        0.0797899067401886,
        0.03675557300448418,
        -0.019091002643108368,
        -0.007968745194375515,
        0.021761611104011536,
        0.057166192680597305,
        0.010056637227535248,
        0.0009790187468752265,
        0.05794310197234154,
        -0.024349376559257507,
        0.0063852895982563496,
        0.07180726528167725,
        -0.0534420944750309,
        -0.034030731767416,
        -0.0811471939086914,
        -0.019097181037068367,
        0.0012400454143062234,
        0.010675621218979359,
        -0.0244864784181118,
        -0.02082093618810177,
        0.017990045249462128,
        0.0185538362711668,
        0.03013535588979721,
        -0.03760119155049324,
        -0.004117688164114952,
        0.02497638389468193,
        0.03136908635497093,
        0.020542912185192108,
        -0.013005002401769161,
        0.021060587838292122,
        -0.008654057048261166,
        -0.04520920291543007,
        -0.018166882917284966,
        -0.07726579159498215,
        -0.004388310946524143,
        0.12260720878839493,
        0.07943037152290344,
        -0.057045139372348785,
        -0.052509408444166183,
        -0.01721298322081566,
        0.007900775410234928,
        0.05897368863224983,
        0.019431086257100105,
        0.0025676744990050793,
        0.045856673270463943,
        -0.022816115990281105,
        -0.01499767042696476,
        -0.04130534082651138,
        -0.11807595193386078,
        0.08089876919984818,
        -0.03607088699936867,
        -0.0389665924012661,
        -0.07303909957408905,
        0.06578289717435837,
        0.020465994253754616,
        -5.1813252355259465e-08,
        0.028564278036355972,
        0.04560331255197525,
        0.09558064490556717,
        -0.0030643679201602936,
        0.056577008217573166,
        -0.09120310097932816,
        0.05066681280732155,
        0.07557685673236847,
        0.08870936930179596,
        0.03593287989497185,
        -0.04072559252381325,
        -0.11606736481189728,
        -0.05653202533721924,
        0.0666019469499588,
        0.03991580754518509,
        0.08805765956640244,
        -0.04778013378381729,
        0.01490099634975195,
        0.0022426978684961796,
        -0.07085756212472916,
        -0.01596246287226677,
        -0.011833932250738144,
        0.017352351918816566,
        -0.08643512427806854,
        -0.043012529611587524,
        0.023697352036833763,
        -0.06112164631485939,
        0.018840869888663292,
        -0.0006479283911176026,
        0.026090256869792938,
        -0.019067032262682915,
        -0.03418818488717079,
        0.10596253722906113,
        -0.03515133634209633,
        0.03466983884572983,
        -0.07733885198831558,
        -0.03335044905543327,
        0.04238835722208023,
        0.03024563565850258,
        0.011354281567037106,
        0.0007766048074699938,
        -0.10134511440992355,
        -0.07917217165231705,
        0.03800928592681885,
        0.04815034195780754,
        -0.0439666323363781,
        -0.060988541692495346,
        -0.07175739854574203,
        0.017034273594617844,
        0.11685124784708023,
        0.05945923551917076,
        0.007652943022549152,
        0.047987546771764755,
        0.05265731364488602,
        0.041264962404966354,
        -0.03609447181224823,
        -0.033397261053323746,
        0.0012821592390537262,
        0.012625244446098804,
        0.08492913097143173,
        0.12387966364622116,
        -0.12412147969007492,
        0.048887331038713455,
        0.06376954168081284
    ]
}