{
    "id": "w1-NoqAL5fE",
    "title": "Shark Tank Scams Tested!",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-06-24T18:08:57Z",
    "video_url": "https://www.youtube.com/watch?v=w1-NoqAL5fE",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 241774,
    "likes": 7401,
    "comments_count": 220,
    "description": "Part 2 of testing out the WORST products from Shark Tank  Buy This Instead - Razer Blade 14 (2022):  I got SCAMMED on Instagram:  The Smallest Xbox Yet:  I Bought the WORST Shark Tank Products:  PS5 Pro:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:42 The Qball 1:40 Cursed Sniffing 2:22 The Hicc Away 3:06 Adult Setting 3:47 The Love Button 4:41 The only thing the Sharks WOULDNT invest in 5:30 Button Testing (Gone Sexual) 6:30 The Hug Sleep 7:32 Austin Gets in the sack 8:26 SomniFix Mouth Strips 9:30 RokBlok 10:37 Some cursed music (Mouth Organ) 11:30 Does it work? (no) 11:58 RockIt Vibration Speaker 13:00 What do you think?",
    "description_links": [
        "https://youtu.be/BonHexL4AYU",
        "https://youtu.be/5dd1GmKPsIw",
        "https://youtu.be/iw4gjl2aako",
        "https://youtu.be/QxsClxIo6fI",
        "https://youtu.be/f9KdYp0upfE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Hello. Welcome back to, This Is. Last time we left you on a cliff hanger of us rupturing a banana in spectacular fashion. Thanks to our good friends over at Shark Tank, who make lots of weird and interesting items. Matt, I'm gonna eat a banana now. This seems like a lot of work considering you just put the Nutella on the outside of the banana. - This is so gerthy now. - Stop! Stop it Matt! No, no, no, no, no, no more. (Matt laughs) Get this foot out of here. We have lots more shark tank items to look at. Ahhhh! (Austin laughs) For this episode of This Is, we're gonna be evaluating Shark Tank items, Part two. On the first episode, we made a lot of bad decisions. Today, we're gonna continue those decisions. - Do you ever wish that we didn't have these mics in front of us? - No, I actually like the microphone quite a lot, Matt. - Well, I have one for you here. We have the Qball. Do you ever wish you could just kind of toss the microphone to your friend over there? Ready? - Yeah. Okay. So it's very like rubbery. - It's a ball with a microphone in it. So the whole idea of this is for like large groups of people at like an event, or like an auditorium, or whatever. - Oh yeah, yeah. Toss the mic. - You toss the mic to me. So like there's a little magnet in here, and when it senses that's upside down it should not be giving any signal to the mic whatsoever. - This seems like it's gonna break. - Yeah. So when we tip it upside right? It should be able to hear myself now. So if we cut to the audio, I think this is fragile as hell. I think this is just gonna break immediately. - Yeah. Why would it just not work upside down? I don't know. It seems way too complicated - Because it's for when it's in motion, it's not picking up. - That seems needlessly complicated. Let me see this. I'm gonna sniff this too, because it's on bread. - We were this close to getting a 'Hey guys\". Can we get one? - Hey guys. - No. Can we a real one? - Hey guys, what's going on? - No! What a tease. Speaking of teases. - Wait, how much is this? - How much do you think this is? - $79. (Matt laughing) - And this was what? - 240 - $240. - What? - This is heavy. I just don't understand that this should be so expensive, and sound bad. - I'll tell you what, it is fun to play catch. - Yeah. You know what doesn't cost $240? A ball, Matt. - You know what does cost $240? (glass breaking) Do you have the hiccups? (Austin hiccups) - Boo! - Ahh! - Did that cure 'em? - It did actually. - Oh, then I guess we don't need the next item. - Okay, cool. Moving on. - If those didn't cure it, here we have the Hicc Away. I know you're from Missouri. So this works two ways. I won't have the hiccups and I can get rid of you. - Hicc Away is an easy to use device that immediately stops the hiccups. Put the cap on the desired setting, child or adult, place into a glass of ice cold water, forcibly sip from the mouthpiece, and immediately swallow in one breath. Open up the hole. (Matt giggles) Okay. I gotta say this is incredibly hard to do. And it's like really sharp plastic. So like just twisting this feels very much like I'm breaking it and also it hurts. - Do you need an adult right now? - There we go. Okay. I'm in the adult setting. So I'm going to suck. I'm gonna forcefully sip the way I always like to drink my drinks. Everyone ready for this? - Sip it with force. - Forceful! - Ah. I just feel like I just really sucked hard to drink some water. And that's it. - Would you back this product? - I don't know. I mean, I guess if I had hiccups maybe, but like I just sucked really hard. And then my throat feels exactly the same. How much is the Hicc Away? - $14. - Okay. That's fine-ish. I mean, it should not cost that much. I'm not big fan of that one. - Speaking of family friendly products, you and I are both looking - Go ahead. - quite, quite seductive. How do I know if you think I look seductive - We tell each other, we use words. - What if we didn't need to use words? What if we had the LoveSync button? I built this entire episode, like all of these around this one product. - Okay. So let me put you in the mood friend. Imagine that you're chilling with your significant other, and you want to ask a question. You want to know is the time right? But the problem is you don't wanna ruin the mood by asking. No, no. Instead, you have the LoveSync button. All you gotta do, just reach over give it a little tap. And if nothing happens, we're fine, baby. It's no worries. But if it goes off, that means that they also hit the loves sync button, meaning that you're both ready. Setting the time period of your desire, the first tap sets out 15 minute window, additional taps increase the time up to 24 hours. If you tap seven times, it'll pulse the globe from both buttons, meaning it's a direct signal to your partner as to what's on your mind. - We're so sexually repressed and awkward. - You don't wanna get shut down, Matt. You wanna hit the button. - It's Tinder for couples that already exist. - And if I remember correctly, with this episode of Shark Tank, they were trying to pivot it into an app, and they're like, \"That's an even dumber idea go away.\" And I don't think they got a deal. - But here's the thing. The app makes more sense to me than the actual button. - How about use your damn words! Matt, you could ask me anytime. I'm never gonna tell you no. - When you have a physical button it has to be manufactured. Someone has to go on a lunch break, a union mandated lunch break. (repeatedly tapping button) It's like the faintest light ever. - It's a supposed to be a swirling glow. Matt talk to me now. - Why are we not having hot sex right now? (repeatedly tapping button) - I'm not in the mood anymore. - That immediately turned me off. - This is the dumbest thing. - Wait, wait. No! - Oh, it's time! - Legally, We have to have sex now. (Austin laughs) You cannot see these. I want my love button to be big, pulsing, and red. - Can you please Kinsey, please remind me how much do they charge for this terrific product? - 72.99. But Matt got it on sale for $65. - It's not $69? $72. Who charges someone $72 when there's $69 available? Take your love buttons. (Matt laughs) You know, sometimes I just sit up at night, and I wonder what's the video that's gonna get us canceled. And then some days I don't have to think about it. It just kind of falls into my lap. - I mean, I didn't even have to tell you to take your shirt off. Now that we've properly love buttoned each other. - Nope. Can you rephrase that please? - We are ready to prepare for - One more time. We love buttoned each other? Could you just try that one more time? - Now that we've expressed our energy, and we're ready for bed, I feel like it's time to move out of our oversized hoodie, and move into something a little bit more comfortable. - Look away, kids. - You look like a turtle that's coming out of its shell. - Cool. Whew. Wow. - Don't worry. I know that you're still shivering right now. And I know that you're still feeling loved, because your love button is still going off right now. - 24 hours, baby. - So now I can't be there to give you the love that you need. But what we can do is give you the Hug Sleep. - Sleep like a baby. You mean wake up and cry every four hours wanting to have milk. A tween? See Matt, that's just rude. Are you trying to call me a tween right now? - Tween definitely seemed the most appropriate for Austin Evans. - Oh, is this a sleep sack? It's a sleep sack. Isn't it? Right? - You keep saying sack way too much. - You're Santa. - Am I gonna have to carry around Austin in the sleep sack? If you're a new parent, - This is for ages 10 to 14, by the way. Fuck you, Matt. - If you're familiar with a new parent, you know you need to swaddle a child, where you wrapped them up like a little burrito. So someone took that idea and said, \"Look, wow. Those babies are sleeping like a baby.\" So someone brought up this little, just undersized piece of fabric here, which is supposed to perfectly contour. Here, let me get your Here. Oh, oh, here. For the record, I think you have it on upside down. - Is there supposed to be like a face spot? - If in case anyone's wondering my sleep paralysis demon looks like. - Wait. - Oh wait - Help me, Matt. I'm stuck. Help me. - How much was the sleep hugger? - How much does Austin think it should be? - I think it should be $30 - $70 - $70? - [Matt] For $70 do you not feel so hugged and loved? - [Austin] I don't know. - Are you ready for bed yet? The answer's no. I happen to know that you have a bad snoring problem. - That's an absolute Goddamn lie. - No, no, no, no, no, no, no, no. - I do not snore. - No, no, no, no, no, no, no. So what we have here is the SomniFix mouth strips. - Mouth strips? I've seen the nose strips before for snoring, but not mouth strips. - These faux lips keep your mouth shut at night. Like a big ole Band-Aid. Just pucker up. No, no, no. Yep, yep, yep. - Mmm. Mmmmm. - Are you not ready for the most sleep that you'll ever get? - Please help. (Matt laughs) - Here we have the best night's sleep that you're ever gonna get. - It's in my mouth. - He did pretty good by himself. - You act like that's the first time he been tied up. Matt. - It's so horrifying to look at. Do you feel like that improved your breath? - Ah. Much better. Hey Matt, can I take this off yet or no? - No. Well here what we can do. We can. There we go. - Thanks man. I appreciate - So what we can do is the love button, we all know, worked great. You know what else gets me in the mood? - I don't actually. - It's some music. Here's an item that was on Shark Tank. However, it has since gone out of business. - Great sign. What is a RokBlok? - This is the actual size. No, seriously. And they were correct. What do you think this is? Besides a Bluetooth speaker. - A radio? A music player of some variety? - So this here, is a record player. - Oh, it's one of these things. It drives around your record and destroys them. - Yeah. - Okay. - I know your record collection is valuable to you. You have like your first edition Logic album. And so I wanted to destroy that, but I figured that's mean, even for Matt. I made Kinsey go out and find a lovely selection of records to put you to sleep and get you in the mood, so you'll hit that love button. The first one is Fun on the Farm. - [Austin] Classic. - A handful of children's songs. I didn't like this one. So instead we have got Johnny Puleo and His Harmonica Gang. - [Austin] Yo. - The only instruments used on this recording are harmonics or mouth organs. For you youngsters who don't know, this here is a vinyl. - Wow! That smells like 1960. Woo. - [Matt] Basically what we do. - So instead of spinning a record, scratching a disc, instead this just drives around in a circle, and reads the little grooves on the actual album. Is that correct? - Well, theoretically. I like how much dexterity you're getting out of your face today. - Not the first time I've been tied up. It's working, it's working. It's working. - And immediately, just immediately destroyed this record. - Yeah. Yeah. Yep, yep, yep. That ain't right. (record player zipping across the vinyl) Maybe just sucks. (record player zipping across the vinyl) - Listen to that mouth harmonica There's a reason that this was discontinued immediately. While the RokBlok was rock blocked, the Rock-it is gonna be the one that actually puts you to sleep with vibes - With vibes? That's a different item, man. - So this here is the largest speaker that we have ever tested on this channel. So if we play a little unassuming (soft quite music) - I'm feeling the vibes. - What happens when I put it down. - Is it just supposed to use the thing? (soft music gets louder) Oh, actually sounds a lot better. Okay. That's legitimately impressive. I don't know how well you can tell on camera, but when you put it on that, (soft music gets louder and more clear) Whoa! Put it on me, Matt. - Open your mouth. The idea of these vibrating speakers is that, theoretically, you could turn (soft music gets louder again) - Whoa! - anything into a speaker, And the larger it is, the more sound you'll get from it. - Matt. - You gonna use the foot? Here on This Is we often ask the question, \"How well does a foot sound?\" (soft music) Wow. Listen to that kick. - Thank you very much for watching. Subscribe to the channel for more sweet, sweet vibes like this. And until next time please Shark Tank, stop making episodes, and I don't wanna ever have to do this again. (soft music)",
    "transcript_keywords": [
        "Matt",
        "Shark Tank",
        "Sleep",
        "time",
        "shark tank items",
        "button",
        "Yeah",
        "Shark",
        "Tank",
        "love",
        "love button",
        "mouth",
        "put",
        "Ready",
        "immediately",
        "Yep",
        "record",
        "tank items",
        "lot",
        "mood"
    ],
    "transcript_entity_values": [
        "14",
        "Santa",
        "24 hours",
        "Today",
        "Austin Evans",
        "one",
        "the Hicc Away",
        "Kinsey",
        "Shark Tank",
        "SomniFix",
        "today",
        "ages 10 to 14",
        "240 - $240",
        "the Hug Sleep",
        "RokBlok",
        "15 minute",
        "Fun on the Farm",
        "Matt",
        "Austin",
        "69",
        "72",
        "night",
        "Austin",
        "65",
        "70",
        "LoveSync",
        "Missouri",
        "two",
        "240",
        "Austin] Yo",
        "$30 - $70 - $",
        "1960",
        "One",
        "79",
        "up to 24 hours",
        "Johnny Puleo",
        "first",
        "the Hicc Away",
        "every four hours",
        "seven",
        "Qball",
        "72.99"
    ],
    "transcript_entity_types": [
        "MONEY",
        "GPE",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "GPE",
        "MONEY",
        "MONEY",
        "TIME",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORG",
        "GPE",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "TIME",
        "PERSON",
        "ORDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "LOC",
        "CARDINAL"
    ],
    "vector": [
        -0.10915163159370422,
        -0.017648743465542793,
        0.02943962626159191,
        -0.04312216863036156,
        -0.011451617814600468,
        0.016874993219971657,
        0.041303861886262894,
        -0.020091326907277107,
        -0.017119279131293297,
        -0.05490817129611969,
        0.0054341573268175125,
        -0.04219869524240494,
        0.04429362714290619,
        0.023016734048724174,
        -0.007027322892099619,
        0.03814089298248291,
        0.12421992421150208,
        0.022343192249536514,
        -0.038902558386325836,
        0.05736936256289482,
        0.035858117043972015,
        0.05412764847278595,
        -0.035917025059461594,
        0.04708883911371231,
        -0.07600004971027374,
        0.095717653632164,
        -0.11253540962934494,
        0.020159350708127022,
        -0.053137414157390594,
        -0.03645307570695877,
        0.005773195065557957,
        0.04395714029669762,
        0.08282427489757538,
        -0.11263949424028397,
        0.05556260794401169,
        -0.06417036056518555,
        -0.013000035658478737,
        -0.0293483454734087,
        -0.06670184433460236,
        0.015959568321704865,
        -0.018937401473522186,
        -0.015217362903058529,
        -0.014425406232476234,
        0.06635213643312454,
        -0.07324844598770142,
        -0.061346571892499924,
        -0.066544309258461,
        -0.007303802762180567,
        -0.04155953228473663,
        -0.02275415137410164,
        -0.08383410423994064,
        -0.15427696704864502,
        0.12401122599840164,
        -0.02459757961332798,
        -0.03720175102353096,
        -0.0054246168583631516,
        -0.041517503559589386,
        -0.0011737918248400092,
        0.07571274787187576,
        0.017536642029881477,
        0.06060415133833885,
        -0.03686320036649704,
        -0.037005528807640076,
        0.03769418224692345,
        -0.019705316051840782,
        0.009201277047395706,
        -0.03232097625732422,
        0.03776346892118454,
        -0.021084364503622055,
        0.013558018021285534,
        -0.01869417540729046,
        -0.05255909636616707,
        0.04557773843407631,
        0.06523106247186661,
        0.031778592616319656,
        0.05162113532423973,
        0.04177136719226837,
        -0.0912288948893547,
        0.0237274132668972,
        0.010905570350587368,
        -0.002840095665305853,
        -0.13900941610336304,
        -0.0407160185277462,
        -0.08137284964323044,
        0.03614284098148346,
        0.006926662754267454,
        0.04823004826903343,
        -0.018017306923866272,
        -0.04331101104617119,
        0.01679135300219059,
        -0.03679824247956276,
        0.015305323526263237,
        0.0554971843957901,
        -0.08686450868844986,
        0.07332897931337357,
        -0.06480662524700165,
        -0.06760057806968689,
        -0.004624440334737301,
        -0.038536153733730316,
        0.08239509910345078,
        -0.020011356100440025,
        0.022615285590291023,
        0.009882506914436817,
        -0.09136375784873962,
        0.14572283625602722,
        -0.06797606498003006,
        -0.08923842757940292,
        0.06616983562707901,
        0.022957224398851395,
        -0.019673552364110947,
        -0.03726683929562569,
        0.03271735832095146,
        0.03968791291117668,
        0.02960880659520626,
        0.05306292325258255,
        0.04501953721046448,
        -0.0769215077161789,
        0.018162082880735397,
        0.0455327145755291,
        0.007080960087478161,
        0.06763733178377151,
        -0.019853392615914345,
        -0.0037521985359489918,
        -0.0231658723205328,
        0.04403179511427879,
        0.032657042145729065,
        -0.026626858860254288,
        8.07211823772871e-33,
        0.0369669571518898,
        0.004925927612930536,
        -0.046256329864263535,
        -0.0003942092298530042,
        0.08132971078157425,
        0.00041703900205902755,
        -0.06531009078025818,
        0.08643517643213272,
        0.013030176050961018,
        0.06907496601343155,
        -0.04014447331428528,
        0.019813090562820435,
        -0.01642550341784954,
        0.047463834285736084,
        0.007302056532353163,
        0.0379086397588253,
        0.01798183098435402,
        -0.018398499116301537,
        -0.05818844214081764,
        -0.06073347479104996,
        0.028264373540878296,
        -0.004769435152411461,
        0.061404649168252945,
        -0.05908792465925217,
        -0.03818964213132858,
        0.030154766514897346,
        -0.058472104370594025,
        -0.09416385740041733,
        0.13075579702854156,
        0.032764654606580734,
        -0.12864641845226288,
        -0.03200582042336464,
        0.0012270123697817326,
        0.016295723617076874,
        0.015099477022886276,
        0.027295148000121117,
        -0.010547121055424213,
        -0.07457448542118073,
        -0.0844217985868454,
        -0.055835459381341934,
        -0.020176604390144348,
        0.05096547678112984,
        -0.08219011127948761,
        -0.0007720956928096712,
        -0.021609671413898468,
        0.021307218819856644,
        -0.04001115262508392,
        -0.007522641681134701,
        0.04097876325249672,
        0.013240005820989609,
        -0.00859272014349699,
        0.050563570111989975,
        -0.03975467383861542,
        0.09413763135671616,
        -0.05455108359456062,
        -0.01545710675418377,
        0.06848980486392975,
        0.012760408222675323,
        -0.04038724675774574,
        -0.0022359350696206093,
        0.03287670388817787,
        -0.004884861409664154,
        0.056673288345336914,
        -0.030092284083366394,
        0.01876307651400566,
        0.04999447986483574,
        0.1072995662689209,
        -0.053780440241098404,
        -0.008456811308860779,
        -0.07373093068599701,
        -0.01817570999264717,
        0.00721633480861783,
        0.020319022238254547,
        -0.03698050230741501,
        -0.033379312604665756,
        -0.009791642427444458,
        0.03485535830259323,
        -0.01724705658853054,
        -0.020443350076675415,
        -0.03793683648109436,
        0.04108254611492157,
        0.05869918316602707,
        0.026256203651428223,
        0.0230086799710989,
        -0.0014482210390269756,
        0.02303585782647133,
        0.05471324175596237,
        -0.11193205416202545,
        0.0370011180639267,
        -0.0081552192568779,
        -0.08561494946479797,
        -0.08048536628484726,
        0.0763789638876915,
        -0.020237106829881668,
        -0.008843723684549332,
        -7.422038270313306e-33,
        0.0024911323562264442,
        -0.04011988639831543,
        0.05747076869010925,
        0.08771314471960068,
        0.053676966577768326,
        0.007270652335137129,
        0.047307420521974564,
        0.07007583975791931,
        0.0314306877553463,
        -0.014435687102377415,
        0.01186266727745533,
        0.008568675257265568,
        0.028736406937241554,
        0.004698387812823057,
        0.09474465250968933,
        -0.020624544471502304,
        0.030779385939240456,
        -0.020063698291778564,
        -0.01910305581986904,
        -0.033799804747104645,
        0.07237432897090912,
        0.041412949562072754,
        -0.047530289739370346,
        0.08514844626188278,
        -0.07008495926856995,
        0.07721390575170517,
        0.0303887277841568,
        -0.020291825756430626,
        0.07091841846704483,
        -0.02838865853846073,
        0.017889171838760376,
        0.15229085087776184,
        -0.05416392162442207,
        -0.020926667377352715,
        -0.02895880490541458,
        0.06104598566889763,
        0.009441827423870564,
        0.059843990951776505,
        -0.06598759442567825,
        -0.05764682590961456,
        0.026814136654138565,
        -0.015056916512548923,
        -0.047477565705776215,
        -0.009261121042072773,
        -0.06318376213312149,
        0.010316435247659683,
        0.02664145454764366,
        0.015325845219194889,
        -0.0291479229927063,
        -0.00016044205403886735,
        0.031466078013181686,
        -0.010595167055726051,
        -0.026176411658525467,
        0.01423049345612526,
        -0.11182055622339249,
        -0.005340618081390858,
        -0.0045343502424657345,
        -0.05878976359963417,
        -0.034121498465538025,
        0.023485247045755386,
        -0.01548992283642292,
        0.029994549229741096,
        -0.0811375081539154,
        -0.016400301828980446,
        -0.01543793361634016,
        0.06835291534662247,
        0.10381518304347992,
        0.060087259858846664,
        0.0051814718171954155,
        -0.011651351116597652,
        -0.0014694752171635628,
        0.06998035311698914,
        -0.0028055564034730196,
        -0.03128885105252266,
        0.004493392072618008,
        0.033335838466882706,
        -0.11408503353595734,
        -0.1084185242652893,
        -0.032656703144311905,
        -0.001281379139982164,
        0.019469473510980606,
        0.008460239507257938,
        0.04211699217557907,
        0.03167285397648811,
        0.0901082381606102,
        -0.006113206967711449,
        0.05282357335090637,
        0.011796592734754086,
        -0.018987180665135384,
        0.014626906253397465,
        -0.02389426901936531,
        0.0028422765899449587,
        -0.05047275125980377,
        0.07054343074560165,
        0.09944254904985428,
        -7.14075127916658e-08,
        0.034011535346508026,
        0.01913977973163128,
        -0.012864222750067711,
        0.040692299604415894,
        0.03023914434015751,
        -0.047882795333862305,
        -0.028549741953611374,
        0.035720113664865494,
        -0.025724897161126137,
        0.02567712962627411,
        0.02216022089123726,
        -0.008225842379033566,
        -0.039192620664834976,
        0.009730079211294651,
        -0.05785901099443436,
        0.04695291444659233,
        -0.024790074676275253,
        0.00878902617841959,
        -0.04696144163608551,
        -0.1199771985411644,
        -0.017511259764432907,
        0.07448746263980865,
        0.037968020886182785,
        -0.09837832301855087,
        -0.06207937374711037,
        -0.0412956178188324,
        -0.04814979434013367,
        0.10165805369615555,
        0.0623493492603302,
        0.026766270399093628,
        0.04246539622545242,
        -0.01420821063220501,
        -0.04916881024837494,
        0.007882355712354183,
        0.011940657161176205,
        -0.0225449837744236,
        -0.008718443103134632,
        -0.028264295309782028,
        -0.023823171854019165,
        0.036746058613061905,
        -0.0016220866236835718,
        -0.04960007593035698,
        -0.09299378842115402,
        0.03647929057478905,
        -0.09787868708372116,
        -0.07384058088064194,
        0.009136208333075047,
        -0.06667469441890717,
        -0.004204536322504282,
        0.03485396131873131,
        -0.024288011714816093,
        0.021003728732466698,
        -0.024309616535902023,
        0.01421851385384798,
        0.07892107963562012,
        0.02730303816497326,
        0.009280197322368622,
        -0.008075220510363579,
        -0.063173808157444,
        0.08371087908744812,
        0.056442998349666595,
        -0.11560333520174026,
        0.018304232507944107,
        0.022346271201968193
    ]
}