{
    "id": "W1fAwkfHtTU",
    "title": "YOU built this PC and I gave it away - Corsair 2000D",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-10-07T18:58:41Z",
    "video_url": "https://www.youtube.com/watch?v=W1fAwkfHtTU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "corsair",
        "gaming",
        "micro center",
        "PC",
        "PC Build",
        "PCMR",
        "Shopping",
        "sc",
        "computer",
        "computer case"
    ],
    "views": 159117,
    "likes": 6234,
    "comments_count": 274,
    "description": "Thanks Micro Center for sponsoring todays video! New Customer Exclusive - $25 off your purchase of $100 or more: Check Out Micro Center's New Charlotte Store Opening by 2025:  We're on-location at Micro Center's new store in beautiful Indianapolis, Indiana, for an unboxing on Corsair's 2000D case and got some help from customers along the way.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 This looks promising 0:47 Time to unbox! 4:31 Shopping for hardware 5:45 Micro Center haul build 8:18 Back for a different GPU 9:11 Airflow Tips with Adam 9:46 Cable Management + AIO install difficulties 11:47 She posts!",
    "description_links": [
        "https://micro.center/b11273",
        "https://micro.center/6c6934",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "We're at the brand new Micro Center in Indianapolis. Micro Center sponsored us to come all the way down here to check out the new Corsair 2000D. But if we're going to look at a case, we need computer parts. I wonder where we'll get them. This looks promising. Let's go this way. The Corsair 2000D is Corsair's first mini ITX case in like a long time. And a lot of people were really excited when they heard that Corsair was releasing a new enclosure. I'm thankful that they went for the vertical style enclosure. I really liked that. You have a limited amount of space on your desk. So having this kind of like vertical thing instead of doing something horizontal, saves you a ton of room. But the mini ITX market is getting more and more competitive. So the question is, will this be able to keep up with the competition? Only one way to find out. Let's build in it. Before we take a look at the case, let's take a look at what was in the box. Just this, it got some zip ties, some fan screws and motherboard mount. That's it, pretty bare bones. Taking a look around the case. The bottom of the case, we got some rubberized feet. Down here, we have a bottom access. It's gonna let us access our GPU, all of our ports basically. So you're gonna be running your cables down the bottom of the case, going around the side. This is a cable run for, I'm gonna assume a power supply extension. We'll find out in a bit. And on the front, we have our front IO, nice big power button with the yellow Corsair accents. For front IO, we have two USB-A ports and a USB-C that runs at 10 gigabit per second, as well as a combo headphone microphone jack. Looking at the design of the case, I do like the triangle pattern that they have continued. This is more of the mesh format as opposed to like a larger triangle metal grid. I will say it feels like a lot of plastic. Like that's very lightweight. Also weird that it's a mesh fan filter that leads to nowhere. But hey, better to have and not need than to need and not have. But yeah, every side panel is this perforated mesh. It is very dense, which makes me wonder a little bit about Airflow. They have this triangle pattern as well as further mesh on the inside all over the case. But they do this annoying thing where these aren't easily removable mesh filters. They're not magnetic. You can see that they're bent into the case. So if you wanna take these out to really give them a good thorough cleaning, you have to like bend the metal out. It's really inelegant. And then also this mesh doesn't have an easy way to come out. Maybe if I take the screws off and do that, it's a whole lot of work. One thing I do love is that we have captive thumb screws, which is always nice to have. I just realized on the back, we do have a magnetic filter. This is exactly what I'm talking about. That's so much easier to clean. I'm not sure the front panel comes off. Oh, it looks like it's just detents. I just wasn't giving her, so. We can see our three included slim 120 millimeter fans. Oh, and that's actually really nice. This is something that not enough case manufacturers do. They have included cable guards, which is really nice so your wires don't accidentally hit the back of your fans and make a bunch of noise. That's a really, really great detail. There's a lot going on inside. So we're gonna have to take this thing apart a little bit further to talk about it. Luckily, I have all of my tools in my tech sack from lttstore.com. You know, Corsair, I'm gonna call you out. I would have liked thumb screws for this. We have room for three 120 millimeter fans or for two 140 millimeter fans, as well as we have options to mount some fans at the back here. So airflow and radiator supports actually gonna be really good because you could put a 320 here, a 320 here, or a 280, or you could even put one at the front. And depending on the GPU you have, you can fit up to a 240 millimeter radiator in the back. Being a larger ITX case, we have a little bit more room for compatibility. For example, the case supports triple slot GPUs at 365 millimeters in length, up to a 90 millimeter CPU cooler height, not super tall, but this is an AIO focused case, as well as SFX and SFXL power supplies, no ATX sadly. Now that we can actually see inside the case, there's a lot of bundled cables. We have a ton of cables just for the RGB, you know Corsair and their RGB, they're all about it, as well as long IO cables. Honestly, confusingly long since they only need to get to like here-ish, that's a lot of slack. And here's the extension cable for your power supply. So it'll plug in up here, you'll run it all the way down the back. You couldn't run it inside the case Corsair? Who knows, it's hiding in the back of the case. Maybe it won't be as ugly as I'm imagining. There's a power supply bracket that comes out to make your power supply installation that much easier. Apparently this can support up to three, two and a half inch drives. You can do two with drive caddies, but we only got one. Not sure if that's a mistake or not. And you can also mount one to the top right here. There's also no removable motherboard tray, which is okay, but it is gonna be a little cramped building around this side. There's only one way to figure out if this is gonna be fun to build in, but to do that, we'll need some hardware. Excuse me, do you know what power supply I should get? What would you recommend? Corsair's good. Corsair's good? Hey, that's perfect, because I'm building in a Corsair case. SFXL, 1000 watts. Would you guys help us by choosing a AIO cooler? So you wanna, the Galahad? Okay, we're going with the Lian Li Galahad. What's the next thing? Video cards, do you have a recommendation? 7900 XTX. 7900 XTX, we're going AMD today. Okay, which one though? I'd go with this Asus one. Excuse me, you look like somebody who knows a thing or two about computers. I can tell by the way you're dressed. I need a CPU for a computer, but I'm not sure which one. Could you recommend one for me? Yeah, so I was thinking of going 7,800 X3D. Oh, okay, sweet, that's a banger of a CPU. Let's get that one. I need a motherboard for AMD, and I need it to be Mini-ITX. What about that ROG Strix X670? Oh, you chose the big money one. It's got the alarm on it. What SSD should I get? The EVO's a good choice. Okay. That would probably be my choice, actually. The EVO? And what about one of these gum sticks? Probably the P5. The P5? Yeah. Okay, sweet, thank you very much. I need RAM for my system, I need it, it's DDR5. DDR5. Can you recommend me a kit? 64 gig. Okay, sweet, the Dominator? Cool, awesome. Thank you so much. All right, we got all our stuff, and now we can get to building. We got the ROG Strix X670Ei Gaming Wi-Fi, a heck of a motherboard, if I do say so myself. It's got pretty much everything you could want from a Mini-ITX board, including an incredibly tall daughterboard scenario thing. This thing's really weird. You have one chipset on the motherboard, and then one chipset right here, specifically so that you can have a PCIe Gen 5 drive here. Let's get our CPU installed. Let's start there. At 5,200 megatransfers per second, this isn't the best selection of RAM we could have had. Ideally for Ryzen 7, you want something that's at 6,000 megatransfers per second to line up with your Infinity Fabric. I just realized, I don't know if I wanna put this RAM in yet, because it's so tall that it might make putting the cooler in kind of a pain. So we're gonna set this aside for now, and we're gonna go for our SSD. The Crucial P5 Plus is a really just solid SSD. It's a great selection, reliable. Crucial's awesome, we love them. We have two terabytes on our boot drive, so we'll have lots of space for games and stuff like that. And it's crazy how cheap these drives are getting these days. A two terabyte SSD is like $100 in these days. Like, it's pretty wild. Now that we're at this point in the build, I do kind of wish I could take one more side panel off. One of the worst parts about building in any PC is having to like go deep into it, and when you're in an ITX PC, you don't got much wiggle room, right? Like, you take this motherboard, and even then, we don't have a ton of extra space. Oh, that's interesting, okay. It looks like you would be able to fit full-size 25 millimeter fans, but because of the IO shield, it's gonna force you to have to put in a slim fan, at least in the top portion. Up next, we're gonna mount our power supply into the bracket, and because it's, of course, our power supply, we really get to keep the triangle theme going. Our power supply bracket goes in here, which gives us two options with the power supply. We can mount it like this, with the fan getting fresher from the outside, but what I'm gonna do is I'm gonna mount it like this, and that way, it's gonna be taking air away from our components and blasting them out at the top. If you want to use this as an exhaust, you will have to route your power cable like this, which isn't exactly pretty. I'm still gonna do it. So now that I'm putting this power supply in, things are looking like they're gonna get a little crowded. We chose an SFX-L power supply, so it's a bit longer than your typical SFX power supply, which means you could probably make do with the world's shortest 24-pin cable. It's just gonna go from here to here. You could hard-line cable it. I am curious if this GPU's actually gonna fit, so we're gonna check right now, because we might have to resort to getting the new one. Why is it so big? Is this a force-lock card? This legit might not fit. We gotta get a new GPU. So we need any GPU. The only thing, the only requirement is that it has to be smaller than this. How about just like a 4070? Okay, a 4070, which one should we choose? There's a Spider-Man one. I'm not, no influence. Don't listen to me. No, it looks good. I think the Spider-Man one, I think you should go with that one. That's the Spider-Man 4070? Yeah. Okay, cool. Awesome, thank you very much. Absolutely. So we've swapped from Team Red to Team Green, and we're now using the GeForce RTX 4070. Hopefully it's a little bit smaller, fits in the case a little bit nicer. So, oh, look at that. Spider-Man stickers? A thing? Oh, it's a magnetic backplate. It's swappable. And this is a much more logically-sized card. Thank you, ZOTAC, for going the more compact route. That's gonna fit in there much nicer. So I guess I don't need to do the test fit anymore, which is why I opened the GPU in the first place. What we should get to next, putting our AIO in and then wiring up the power supplies. I'm gonna be set to exhaust because I don't want to change out the front fans. We would have, if this was an intake, we would have all of this air just kind of rushing in and then all trying to exhaust through our power supply, which is not ideal. What I would do if I had more time, and if I was Corsair, I would actually switch these front fans to an exhaust, and then you can have an actual reasonable flow path with fresh air going into your CPU. Your GPU is right up against the side, pulling in cool air, and then you're exhausting it out the front. I get why they didn't do that because RGB make computer look good, and if you put them as exhausts, they have this stick in the way. If you're somebody who prefers function a little bit more than form, then maybe you'd turn around. We're like mostly wired up at this point. I'm gonna put in my RAM finally, cause I got the cooler in, and then I think it's time for the GPU, and I think we're almost there. I will say for the amount of space it has, it doesn't really have a good solution for cable management. You're really kind of on your own here. You're gonna be wanting to zip tie a lot of things, bundling them together, cause there's not much by the way of mounting points. This is like the shortest cable in the case, and they know I need to plug it in over here. I have not tested any of this yet. We also have to get this guy in there, and all of these cables out of the way. This is a nightmare. What a mess we've made for ourselves. GPU goes in. This back plate's making things harder to put in, cause it's like slides around a little. I really do think this build would have been a little bit easier if I could have had access from one more side panel. I like taking the front out would have made my life a lot easier. There's a light, so it's getting power, but the power button isn't causing it to turn on, which means that it probably just isn't plugged in on the IO board, on the front panel IO. I did plug it in, but did I plug it in wrong? We've had a big struggle trying to figure out why this thing wouldn't turn on. We're seeing lights on the motherboard, but there's not any sort of life when we press the power button. But we just realized that by trying to move all these cables around and manage stuff, we accidentally unplugged the 24 pin from the power supply. So if I plug this in, we should, this is hard. Okay, okay. Oh, we had it. Let's go. We're on, we're good. Okay, I'm good. Honestly, I'm not gonna say that this was the best building experience I've had in a small form factor case, but it is far from the worst experience I've had building a form factor case. The extra space allotted for part compatibility does kind of help you out, but still it just feels a little restrictive because you can't take off a lot of the side panels. Also something that's gonna be a little bit inconvenient is that your motherboard IO is all at the bottom. So if you have like a USB key or something that you need to plug in, that can be a little bit hectic and problematic, especially if it's a longer device. You would probably want to consider getting like a USB hub if you were gonna use this kind of case. Hey, there we go. We posted everybody. We did it. We did it. We did it, we did it. That was a close one. This case comes in at 200 US dollars, but it's entering into a pretty competitive market where there are great alternatives. It's a good looking case, even if it's missing a few of the creature comforts that have been found in other cases. But I'm just glad to see Corsair embracing the ITX community again, and I really hope to see what they do next in the space. Thanks so much to Micro Center for sponsoring this video. Fun fact, they're opening a store in Charlotte in early 2024. And if you sign up at the link below in the description and then you go there, you'll get a free 128 gigabyte flash drive. And if Charlotte's a little too hard to get to, you can visit any Micro Center for $25 off your purchase of $100 or more. And if you just saw me build this computer and you went, oh, that doesn't look like a ton of fun. Well, good news. Micro Center can build it for you at their knowledge bar. Now check it out in the link below. So we have to go back to Canada. So I guess we don't wanna take this. Should we give it away? I think we should. Thankfully, we've had so many wonderful people join us for this build that we've been doing live in the Indianapolis store. But I think I know who I'm gonna give this to. We're gonna give it to the guy who's wearing short circuit merch right now. So here you go, sir. This entire computer is yours. Congratulations. Thank you. I hope you enjoy your new computer. And yeah, have fun. Do you wanna shake it? Do you wanna shake it? Be like.",
    "transcript_keywords": [
        "power supply",
        "case",
        "power",
        "Corsair",
        "supply",
        "GPU",
        "good",
        "thing",
        "bit",
        "Micro Center",
        "front",
        "lot",
        "fans",
        "cable",
        "ITX case",
        "back",
        "Corsair good",
        "motherboard",
        "ITX",
        "millimeter fans"
    ],
    "transcript_entity_values": [
        "4070",
        "24",
        "Only one",
        "25 millimeter",
        "GeForce",
        "Mini-ITX",
        "ROG Strix",
        "IO",
        "a ton",
        "10 gigabit per",
        "One",
        "three",
        "RAM",
        "200 US dollars",
        "one",
        "USB",
        "1000 watts",
        "Corsair",
        "X3D.",
        "about one",
        "Team Red to Team Green",
        "128 gigabyte",
        "Lian Li Galahad",
        "25",
        "Micro Center",
        "The Crucial P5",
        "320",
        "280",
        "120 millimeter",
        "Dominator",
        "two 140 millimeter",
        "second",
        "7,800",
        "EVO",
        "P5",
        "AIO",
        "6,000",
        "IO",
        "two terabytes",
        "Indianapolis",
        "90 millimeter CPU cooler",
        "ZOTAC",
        "DDR5",
        "like $100",
        "2000D.",
        "early 2024",
        "100",
        "ROG Strix",
        "SFXL",
        "first",
        "AMD",
        "Galahad",
        "these days",
        "240 millimeter",
        "Asus",
        "Infinity Fabric",
        "two",
        "Charlotte",
        "5,200",
        "Ryzen 7",
        "Canada",
        "GPU",
        "Charlotte",
        "ITX",
        "RGB",
        "only one",
        "three 120 millimeter",
        "CPU",
        "jack",
        "365 millimeters",
        "2000D",
        "today",
        "ATX",
        "SSD"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.0037750217597931623,
        0.04670419171452522,
        0.001797730685211718,
        -0.04516160115599632,
        0.09533686935901642,
        0.04602630063891411,
        -0.054580386728048325,
        -0.005385431926697493,
        0.016884852200746536,
        -0.007585661485791206,
        0.03242254629731178,
        0.0052503859624266624,
        -0.02172226645052433,
        -0.08735647052526474,
        -0.010498345829546452,
        -0.031621698290109634,
        0.009699349291622639,
        -0.05712644383311272,
        -0.05777628719806671,
        -0.015508081763982773,
        -0.06823964416980743,
        -0.13247498869895935,
        -0.08473022282123566,
        -0.0025528527330607176,
        -0.03954736888408661,
        -0.025251876562833786,
        0.05701950192451477,
        0.043910425156354904,
        -0.01673547923564911,
        -0.05854230374097824,
        0.04123969376087189,
        0.06436541676521301,
        0.021079059690237045,
        0.02922063134610653,
        0.07327673584222794,
        0.0017048086738213897,
        -0.0491504929959774,
        -0.10908675938844681,
        -0.08426856994628906,
        -0.07825810462236404,
        0.023191949352622032,
        -0.050450392067432404,
        -0.002478198613971472,
        0.12211761623620987,
        0.0375528484582901,
        0.07738233357667923,
        -0.008264802396297455,
        -0.013929467648267746,
        0.016954205930233,
        -0.01223976444453001,
        -0.004429514054208994,
        0.015165090560913086,
        -0.015089735388755798,
        -0.03142537549138069,
        -0.1004643514752388,
        0.04382391646504402,
        0.0220422875136137,
        -0.0306436475366354,
        0.09148356318473816,
        -0.03664863109588623,
        0.1089332103729248,
        -0.07021778076887131,
        -0.00180081557482481,
        0.0513337068259716,
        0.05690436810255051,
        0.007721991743892431,
        -0.08391839265823364,
        0.07255667448043823,
        -0.027921857312321663,
        0.012912601232528687,
        0.07292534410953522,
        -0.03664153441786766,
        -0.0311159398406744,
        0.058631327003240585,
        0.011378157883882523,
        -0.024627380073070526,
        0.05267763510346413,
        -0.04903864115476608,
        0.003213360207155347,
        0.0460430346429348,
        0.008487656712532043,
        -0.08442992717027664,
        0.015982476994395256,
        -0.013617453165352345,
        -0.02281787432730198,
        0.010427474975585938,
        0.021367743611335754,
        0.01290737185627222,
        0.007151699624955654,
        -0.09466226398944855,
        -0.035282865166664124,
        0.04487856104969978,
        0.059535130858421326,
        0.00804494321346283,
        -0.04581292346119881,
        -0.07202696800231934,
        -0.05054490268230438,
        -0.019606882706284523,
        -0.08122628182172775,
        0.0709620788693428,
        -0.006941834930330515,
        0.04863617941737175,
        0.04730833321809769,
        0.05700303614139557,
        -0.0505698025226593,
        -0.0956578403711319,
        0.036181047558784485,
        0.0870109423995018,
        0.0017298862803727388,
        0.030137695372104645,
        -0.11724565178155899,
        0.03478678688406944,
        -0.10454968363046646,
        -0.0006499712471850216,
        -0.008340840227901936,
        -0.017508868128061295,
        -0.03093738667666912,
        0.06780868768692017,
        0.10839274525642395,
        -0.05829557403922081,
        0.057693373411893845,
        0.0021071385126560926,
        -0.039120864123106,
        -0.01421582605689764,
        -0.05990489572286606,
        0.002859736094251275,
        -0.024304622784256935,
        7.313391368228633e-34,
        -0.03680552914738655,
        0.03193674236536026,
        -0.0436718612909317,
        -0.03882542997598648,
        0.09094604104757309,
        0.04084412008523941,
        0.053810447454452515,
        0.02032235451042652,
        -0.06169138476252556,
        0.009715458378195763,
        0.03849799558520317,
        -0.014041393995285034,
        -0.0418451726436615,
        0.1029721349477768,
        -0.043329644948244095,
        -0.11749981343746185,
        0.025871742516756058,
        0.03465561196208,
        -0.03638569265604019,
        -0.015511719509959221,
        -0.014109634794294834,
        0.007641995791345835,
        -0.013064656406641006,
        -0.0429464653134346,
        0.02946031466126442,
        -0.030718201771378517,
        -0.03835630789399147,
        -0.005459576845169067,
        0.05625125393271446,
        0.014950454235076904,
        -0.018562907353043556,
        0.0039969682693481445,
        0.054358597844839096,
        -0.05880371853709221,
        0.02044755220413208,
        0.028528468683362007,
        -0.05313398316502571,
        -0.08265122771263123,
        0.02627924084663391,
        0.0739971250295639,
        -0.02417251653969288,
        -0.034779034554958344,
        -0.04930967837572098,
        -0.09155739098787308,
        -0.03804870322346687,
        0.002658103359863162,
        0.02764280140399933,
        -0.029774632304906845,
        0.0660553053021431,
        -0.06313285231590271,
        -0.008675861172378063,
        0.03173716366291046,
        -0.13205944001674652,
        -0.08441030979156494,
        -0.02764510177075863,
        -0.1536380499601364,
        -0.03792480751872063,
        -0.051998578011989594,
        0.11241672188043594,
        -0.00301369815133512,
        0.0303545780479908,
        0.07079397886991501,
        0.01255352795124054,
        -0.010607501491904259,
        -0.06673339754343033,
        0.034344349056482315,
        -0.014784548431634903,
        0.012078696861863136,
        -0.044984620064496994,
        -0.034389931708574295,
        -0.04821990057826042,
        -0.03424578905105591,
        0.08320886641740799,
        -0.02564866840839386,
        0.00360403792001307,
        0.07203792780637741,
        -0.10110978037118912,
        -0.1082170158624649,
        -0.006128248758614063,
        -0.019916528835892677,
        -0.014048601500689983,
        -0.012628676369786263,
        0.06949039548635483,
        0.016732316464185715,
        0.04564128443598747,
        -0.05573837086558342,
        -0.0463092178106308,
        -0.04330553486943245,
        -0.05185379087924957,
        -0.01380253117531538,
        -0.030786124989390373,
        -0.0068240961991250515,
        -0.04420575127005577,
        0.03840482234954834,
        -0.012729606591165066,
        -3.925565588622937e-33,
        -0.025369027629494667,
        0.01172151230275631,
        -0.03778991848230362,
        0.023392334580421448,
        0.04268767684698105,
        0.08231872320175171,
        0.023896537721157074,
        0.005584388040006161,
        0.07642035186290741,
        0.051952213048934937,
        0.011843368411064148,
        0.012737578712403774,
        -0.10248226672410965,
        -0.041683048009872437,
        -0.02710087224841118,
        0.02055096998810768,
        0.04899124428629875,
        -0.02049044333398342,
        -0.021107977256178856,
        -0.0364692397415638,
        0.042069967836141586,
        0.04243207350373268,
        -0.04417632892727852,
        -0.003282328136265278,
        -0.0032348353415727615,
        0.02462700568139553,
        0.10889483243227005,
        0.028037140145897865,
        -0.001079005072824657,
        0.01741018146276474,
        -0.06433992832899094,
        -0.06919398903846741,
        0.008210417814552784,
        0.0930507481098175,
        0.057452015578746796,
        -0.0037148352712392807,
        -0.003362985560670495,
        0.012736544944345951,
        -0.007881584577262402,
        -0.03551051765680313,
        0.007304887752979994,
        -0.014555700123310089,
        -0.06332159787416458,
        0.04836859554052353,
        -3.4441276852703595e-07,
        -0.04912837594747543,
        0.014805692248046398,
        -0.043135229498147964,
        0.10806047916412354,
        0.06914821267127991,
        -0.05506882444024086,
        -0.005675619468092918,
        0.07225966453552246,
        0.01457001268863678,
        -0.05588805302977562,
        0.03809318691492081,
        -0.011940312571823597,
        0.09245263040065765,
        0.07363182306289673,
        -0.04973365366458893,
        0.05623367056250572,
        0.029253102838993073,
        -0.015675833448767662,
        -0.04814615473151207,
        0.05747123062610626,
        -0.034690290689468384,
        0.07892504334449768,
        0.08416011929512024,
        -0.06147291511297226,
        -0.02241148240864277,
        -0.0528932623565197,
        0.07893285900354385,
        -0.006807668134570122,
        -0.12482868134975433,
        -0.027698026970028877,
        0.0494072251021862,
        0.03223004564642906,
        0.03323851153254509,
        0.06739559769630432,
        -0.02119523473083973,
        -0.054466672241687775,
        0.009982501156628132,
        0.046154629439115524,
        0.004652871284633875,
        0.09480864554643631,
        -0.06055071949958801,
        -0.01607254147529602,
        -0.013857116922736168,
        -0.020507777109742165,
        0.0067582991905510426,
        -0.0645834282040596,
        0.028973091393709183,
        0.07721440494060516,
        0.02277032658457756,
        0.04647975042462349,
        -5.783102352552305e-08,
        -0.0033885177690535784,
        -0.045463256537914276,
        -0.018009847030043602,
        0.022944465279579163,
        0.0533955954015255,
        -0.04976780712604523,
        0.02664143405854702,
        0.010731637477874756,
        -0.001967273186892271,
        -0.055711302906274796,
        -0.035081155598163605,
        -0.10549627989530563,
        -0.08036866784095764,
        -0.010241280309855938,
        0.005095246713608503,
        -0.00919982697814703,
        -0.05067557096481323,
        0.032151833176612854,
        -0.009706211276352406,
        0.012037288397550583,
        -0.03423837944865227,
        0.06772276759147644,
        0.11156852543354034,
        -0.04679551348090172,
        -0.09573176503181458,
        0.03963504359126091,
        0.0018348271260038018,
        0.0674431324005127,
        0.071683868765831,
        -0.053211767226457596,
        -0.041658807545900345,
        -0.0020480602979660034,
        0.028890028595924377,
        -0.004174049012362957,
        -0.022371267899870872,
        -0.03638676553964615,
        0.0015414453810080886,
        0.08652941882610321,
        -0.013568416237831116,
        0.0019056982127949595,
        0.0017296494916081429,
        -0.0197944026440382,
        -0.021186500787734985,
        0.0259535014629364,
        0.05744345486164093,
        0.008374214172363281,
        -0.016733678057789803,
        -0.0720968097448349,
        -0.023595161736011505,
        0.03967161104083061,
        -0.04970305785536766,
        -0.0378316193819046,
        -0.05369140952825546,
        0.07742010056972504,
        0.06371384114027023,
        -0.01182324718683958,
        -0.06309312582015991,
        0.06684239208698273,
        0.0056948247365653515,
        0.1097007617354393,
        -0.004886896349489689,
        -0.08380395174026489,
        -0.05874355137348175,
        0.06648227572441101
    ]
}