{
    "id": "w1K4ro4z__g",
    "title": "Sneaker Culture Explained with @kustoo",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-11-22T21:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=w1K4ro4z__g",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "jacques slade",
        "jacques",
        "sneaker shopping",
        "kustoo",
        "sneakers",
        "complex",
        "nice kicks",
        "sneaker collection",
        "sneakerhead",
        "sneaker",
        "kicks",
        "nike",
        "jordan 1",
        "adidas",
        "entertainment",
        "nike pigeon dunk",
        "pigeon dunk riot",
        "pigeon dunks",
        "hypebeast",
        "sneaker video",
        "jordan 1 high",
        "hype sneakers",
        "air jordan",
        "shoes",
        "air jordan 1",
        "michael jordan",
        "shoe",
        "jeff staple",
        "basketball",
        "air jordans",
        "nba",
        "sneakerheads",
        "nike sb dunk",
        "black pigeon",
        "travis scott air force 1",
        "jordan 1 fearless",
        "nike dunk"
    ],
    "views": 67795,
    "likes": 1806,
    "comments_count": 127,
    "description": "Do your shoes cost more than a car?   Huge shoutout to @kustoo for guest hosting The Pokmon Sword & Shield Controversy, Explained!:  Apple TV+ Has ALREADY Failed:  How China  Gaming:  The ORIGINAL Console War:  Nintendos Mobile $trategy :   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/mFx2scjbUHs",
        "https://youtu.be/OIyl0e_MAVk",
        "https://youtu.be/xsLAY8qqvvY",
        "https://youtu.be/kvVq3p-qr5E",
        "https://youtu.be/66Qh7qRu0rE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- How did get into sneakers? - So I got into sneakers through basketball. I played basketball a lot as a kid and obviously shoes are a big part of the world of basketball because you gotta have good shoes, you feel like the good shoes make you a better player, so that kind of thing, so that's how I kinda started learning about sneakers, just because I was so. (laughter) For those listening to the podcast, that was Ken running into a light. - His head just crashed straight into the light. - Just straight into. So how I got into sneakers was again, from basketball and having a love of. - I'm done, I'm sorry, I'm out, man. It's out, I'm out. - Naw, it's good. It was great, it was a good moment. It was a good moment. - [Ken] It didn't hurt, it just. - It just. - It hurt your pride. - More pride, it was more pride than it was actual injury. That's good. - Sorry, sorry, go ahead. - No, no, it's good. It was entertaining. So yeah, from just being in love with basketball and everything about the sport of basketball, you want to do everything to help you get better with your game and obviously, you see the big players in your neighborhood, you're seeing the shoes that they wear so you want to wear the shoes that they wear because they're the older guys and you see them dunking and you're like, oh, one day I'm gonna dunk and that's the shoe that's gonna make me dunk because you see those kind of guys in it. So it's like that kind of thing is kinda what got me into the world of sneakers. - And you just were hooked? - And I was kinda hooked. I would say it was definitely through basketball. It wasn't sneakers first, it was basketball first. But sneakers were like, okay that's an integral part of me being a basketball player back then, I would think, so that was always like, that was the avenue that brought me into the world. - How much do you think, and I know this is probably a loaded question, but how much do you think the difference in like, does a pair of shoes make a huge difference? Is it like the difference between an average person can actually see a huge game, jump to their game? Or is it more of like, you gotta be like pro level to see the real subtle differences between like, this shoe and that shoe? How much does it actually matter? - Well, that's a great question because it's like one of those things that I forgot, it's the diminishing returns. - Law of diminishing returns? - Law of diminishing returns kind of thing. There's getting the Payless shoes that are slippery and hard and that's not gonna help your game, as opposed to getting something like, you can get a $100 shoe or an $80 shoe and play just as well as you play in an $180 shoe. At that point, once you get a basic, solid basketball shoe that has great traction and has an upper that can move with your foot or your style of play, that's really all you need. Anything above that is all just small incremental changes. It's more like, okay this feels better under my foot, or this allows me to cut a little bit, that much faster because it has an outrigger that goes up on the lateral side so my foot doesn't roll over that extra little bit, like that's how the Jordan 11 actually came about, the patent leather Jordan. It has a patent leather rand on it around the upper, and Tinker Hatfield, the designer, the reason he put that patent leather on there is because he would watch Michael Jordan play and he said he would watch Jordan play and when Jordan would cut, he would see his foot kinda roll off the side just because the power of cutting. And so, he would put that patent leather there because one, it's a thicker leather material and it's not as forgiving on that turn so it's not gonna roll over as much. - [Austin] More support. - Yeah, so it gave him more support, and so, things like that are implemented but that rolling of the foot, that's watching slo-mo tape to see Jordan's foot roll over the side as opposed to it being like real-time and you go, oh his foot's about to fall off his shoes. It's not like that sort of big of a change. - It makes sense. I feel like it's similar in a lot of places. You look at headphones. You can get a kinda crappy pair of headphones for 10 bucks, get good stuff for 50, 100, but then once you start getting into the upper echelons, it's like, okay unless you're like a real audiophile, you're getting two percent better here, three percent better there, so that makes sense. So when did you actually go from kind of being interested in basketball and sort of interested in shoes to being like, okay, you know what, I want to make this more of a serious thing? When was that kind of, when did the sneakerhead bug really bite you? - The sneakerhead bug? I think it was the, the first shoe that I really wanted to get was the Jordan 11 I was just talking about. And then the Air Max 95. - Okay. We're just gonna, something just sounds like it just exploded outside. - [Man] That's on film. - Someone. - Hopefully someone didn't fall. - [Man] That wasn't Ken this time. - That wasn't, that was not Ken this time, yes. We're here for this. So I would say the first shoe that really got me into it was the Air Jordan 11. That's a shoe that I bought, first shoe that I bought with my money that I really wanted. And then there was like the Air Max 95, which is like the first shoe that I saw in the store, and it was just like, (angelic song), like that kind of thing. But then, over the years, it was just like collecting, I'll get a shoe here, get shoes there, some basketball shoes here, there, but I wasn't really into it, into it until I started working in the sneaker arena and that was in 2009. So 2009, I started writing about sneakers online, and then that's when it just like went up like 10 levels and was really. - So it pretty much went from being your hobby to your job? - To my job, yeah, yeah, yeah, yeah. And then once it was my job, it was like, all right, gotta get this sneaker, gotta get this sneaker, gotta get this sneaker, like that kind of thing. Once you're immersed, really immersed in that world, it was like a world I knew about and a world I participated in, but once I started working in it, I felt like I was immersed in that world and that changes your perspective obviously. - So this was a written? - Yeah, I was writing. - You were doing written articles? So what was the difference between the written articles and when you finally evolved into video? Was that like a smooth transition or did you one day go, you know what, I'm out, I'm making YouTube videos now? - I'm making videos now. So, actually I was writing for this company, writing about sneakers for them, and at the time, this was back in 2009, 2010, no one was really doing videos about sneakers, not on YouTube. Well, I shouldn't say that. No, they were doing videos about sneakers, but they were like somebody kinda like in their bedroom kinda thing, like the early. - Yeah, very early days. - The very early days. And because I had done some previous stuff, like from television and film previously, I was like, oh let's do like a higher quality sort of video sneaker experience. And so, I started doing it for that company, and this was in April of 2010 is when I started doing stuff for them. And it just kinda grew because no one at that time, there was no Complex doing it about sneakers, there was no, none of these big blogs that were, none of them were really diving into the video world like that. And so, it allowed me to kinda really just kinda flush it out and make mistakes and learn about it on my room just to kinda make it better. - Dude, that's exactly the way it went for me. In fact, it was almost the exact same on the written side too. I literally, before I even started making videos, I started doing app reviews for a website that a friend of mine was doing. And he's like, oh you should do video. At the time, he had like 2000 subscribers, which was like a big deal in 2008, 2009. And so, literally, it was just like going from writing about the stuff to like, you know what, I think video would be a better medium, and I just switched over. It was the same thing. It was such a wild west time. Everyone sucked. I was really bad. But I felt like it was like more of a, it was easier to get started because the bar was so low, so few people were doing it. And you could make tons of mistakes because whatever. That was what everyone was doing. - Did you just decide to go into video? Or was it just like, you saw something and was like, we should do that too? - He was pushing me. So he's a friend of mine. Again, so I was writing for his site, and he was basically like, yo dude, you should try video. It seems like kinda where it's at. YouTube's so big and stuff. At the time, yeah. It was still absolutely tiny compared to what it is today, but sort of the potential was there. And I was like, oh sure, you know, I'll give it a try because at the time I was writing out these reviews anyways. I was like, oh I'll just record the voiceover and kinda use screenshots and everything in the video. My first videos were terrible, but it was like almost immediate. I was like, oh this is something cool, something different. I'm gonna make another one, another one, and another one. I feel like the first year I started making videos, I made 100 videos. - Oh wow. - I was all about it. But it felt fun. It was such a new cool thing, like aw, people watch YouTube. It was different. But I'm sure the shoe world and obviously tech has exploded, but I think almost more so with the shoe world. There's probably a massive difference in the last 10, 15 years of just the evolution of stuff. Is there anything like, can you name one specific thing that to you is kinda like a turning point? I know in the tech space, it's almost always everything is compared to before and after the iPhone, right? Because that just was such a huge shift. Was there ever like a moment like that in shoes, or was it kind of a little more gradual change? - I think there's a couple of different moments in the sneaker world. So one is the launch of the Air Jordan One. This was back in 1985. That really, I think that's the shoe that really kinda sparked the sneaker culture and started to get people really into sneakers. And then, back I would say the 90s was like a huge time for sneakers, especially for basketball, like big, bulky basketball sneakers. It was also kinda like the golden age of hip-hop in a sense. It was like where hip-hop really kinda became pop culture and really exploded was during the 90s. And that culture was all about sneakers. So a lot of those guys wore sneakers. They wore Jordans, they wore Iversons, they wore Nikes, they wore Adidas. That was all kinda in that moment, and everybody wants to be a rapper when they're younger or a pop star in a sense. And so, that culture was so big that that helped grow sneakers in a way that people really got attached to them, and that generation really, I think, bonded with sneakers. And then in the early 2000s, sneakers started to become bigger and bigger, and people started to notice there was like a resell market. Different countries were looking for old stuff from the 90s, and so, you started to see the resell culture really start to emerge in the 2000s. And then, the Pigeon Dunk happened in 2005, which was kind of. - What's the Pigeon Dunk? - So the Pigeon Dunk is a Nike SB shoe. It's a shoe designed by Jeff Staple. And it is like, it's like the apex of hype culture or the apex of what can happen when hype culture kinda all comes together at the right moment. So everyone wanted to get these Nike SB shoes, the Pigeon Dunk. It was inspired by New York, or the pigeons in New York City, like working and grinding all day, like that kind of, it had that sort of theme and feel to it. And everybody wanted to try and get their hands on a pair. And that had had happened before with other sneakers, but for some reason with this one, it just kept building, like the energy around it just kept building and building. And people were going to forums and message boards and finding out information, finding out when shoes were shipped from the factory, when they were, it was just one of those things that kinda just got to that point. And then, kids started camping out at the store, I believe it was three or four days before the shoes actually even released. Again, just that culture and so like. When people, it was kinda like one of those things where, it was like, okay these are going to release. Oh, those are dope. Oh, those are really dope. Oh, we found out they shipped from the factory. Oh, they shipped from the factory? And it's like, oh, they landed it. Oh, they landed it at the store? Oh, there's kids, oh, there's kids camping out? And so, that just kinda kept building and building and building, and then, they were there for like four days. And then, people knew that people were there, like, oh, they have a lot of money because they're waiting for these shoes. So people were showing up to like kinda, like that day of the release to rob them. And it was just like so much energy building around it, and that's what kinda caused the riot. And so, that helped spark, really introduce the resell culture into the sneaker world, and that grew, grew, grew until there was another moment a couple years ago at All Star. There was a Galaxy Foamposite. Nike had been releasing these galaxy-themed shoes, sneakers, and then they would do this galaxy foam over All Star. So Pigeon Dunk was the SB skater kind of niche. And then the Foamposite was like the bigger, broader, pop culture because everyone was reselling sneakers at this time. The hype around sneakers had grown and grown and grown again and then that's when the bubble just burst again. There was riots and people stomping through the mall trying to get their hands on the shoes and a lot of it's just based on the resell part of the sneakers. - So the resell is really interesting because generally speaking, I know it sounds kinda crazy to say but a lot of shoes top out 180-200 dollars. But then almost the second you buy them, you can turn around, and a lot of cases, sell them for significantly more, which feels like it's unlike most other sort of industries or anything because most of the time, if something's really expensive and there's a lot of demand, you crank up the price until it kinda equalizes. But sneakers have kind of avoided that. Is it because there's some kind of stigma around, oh, I don't want to spend $500 on a new pair of shoes. Because obviously right now, it feels like Nike's putting all this work, all this effort into building this awesome new shoe, they sell it for $180, some guy picks it up who's been camping at the mall and flips it for double that price. It seems like, where did that actually, that culture come from? Is it just kinda like because of all the hype, they were trying to kinda tamp it down? - I think a lot of it is kind of, it's because of the hype. Nike's great at marketing, and a lot of their marketing is keeping things super limited. It's like imagine if the next iPhone comes out and they only make 10,000 of them. Think about how the resell for the next iPhone would be. - It would be insane. - It would be crazy, right? And people would be lined up for days if they found out Apple's only gonna make 50,000, or even if they made 100,000 of the next iPhone. It would be insane. Look how crazy people get on pre-order day for the next iPhone. If they don't get in or their ship date is like two weeks later than someone else's, people get crazy, they're like, I'll just go to the store. People sit at the store. So it's like that same sort of thing. So Nike's been able to master that with certain sneakers, and it's really caused the value of some of them to go up and go down. - It makes sense. I guess, from their perspective, we know we're gonna sell all these, but we want to make sure the resell is still there and we want to importantly make sure that people are still excited for the next limited edition, to keep that kind of excitement up. It's such an interesting space. So you obviously have been covering shoes for a while. So what are some of the more interesting, rare, cool shoes? I know you actually had your own shoe that you did with, was it Adidas or Nike? - I made a shoe with Adidas, which looked terrible, so we won't talk about that one. - Oh no, what, what, we have to talk about this now. What was it like to? - No, it was like putting, like cobbling together. I was more of a cobbler than a designer, I would say. - That sounds like everyone. That sounds like everything that has ever been designed, it's like, oh I took a piece from this, a piece from that. Come on, no, tell me more. - Yeah, yeah, it was a piece of this, a piece of that, so they had this new, called the Pod System. And so, they gave us all of these pieces and kinda let us build, basically build a shoe. It's like a one of one. No one will ever get versions of this shoe that I made. But it was cool. And then I've also done stuff with Nike on Nike ID, where they allow me kinda to customize a shoe, like I've done one for my grandfather, done one for my mom, and I made one for one of my good friends, a filmer. - That's awesome. So what's it like, obviously as someone who reviews this stuff, you're always into it. What's it like to be on the other side? Because I've always wondered that. It's easy for me to be like, this laptop sucks, blah blah blah. But then like, you give me the tools, you give me like a room full of designers, I'm like, uh, make it bigger, I don't know. What's that like? - It's a lot different being on the design side, and I think that gave me a little more empathy for the designers of shoes because I'm not even technically designing the shoes. I'm just doing cutaways and changing the way certain things look. A designer is drawing out the lines of how it goes up and down the sides, is implementing technology, whether it needs to be a three millimeter bag or a five millimeter Zoom bag, where to place it. Is there going to be a carrier? Is it going to be in the forefoot or is it going to be in the heel? Is there going to be an outrigger? Is there going to be a heel cup? I didn't have to worry about any of that kind of stuff. - I understood four of those words. (laughter) - Where it's like all of those things that go into a design and the designer has to think about all of that sort of stuff and still make the shoe look good. I was already with a preset design. I was like, I'll just add these colors and materials. That will be, that's my contribution to this world. But even just doing that gave me a lot more empathy for the guys that are actually sketching stuff out with pencil and getting ideas or they're looking at a building and going, oh I like the way the glass looks on that building. Oh those windows are open, so I'm gonna make an open air bubble on the Air Max One and that's how we learned, that's how we started to see the air bubble on Nike shoes because. - Really? - Tinker saw, there's a building in France, I think it's in France, I can't think of the name. It's like a museum, it's like this open air building and the windows are pretty open and it's wide. That's where he got the idea of showing the air bubble because up until then, the air bubble was inside the shoe. You couldn't see it, it was encapsulated. But that was the first, yeah, he saw a building and. - That was it. - It inspired him, yeah. - That's crazy. Obviously things have come so far from those Jordan Ones. But I know that they're still, they still make Jordan Ones today. Did it go out of production at some point? - They did, so they made the Jordan One, it went out of production for a while. It came back in 94 or 95. And they've been making them off and on since then and up until probably 10 years ago, when they just started making them every year since then. - There's tons and tons and tons of different models. But I'm sure that the original is probably the most valuable? - Depending. - Or there's probably some weird. - The originals, yeah. If you have one from 1985 that's like deadstock, that hasn't fallen apart at this point, yeah. - Oh, that's a good point. - Those are definitely, those are definitely valuable, but then there's pairs from 94 that are valuable just because that was the first retro, so people are excited about those. And then there's pairs that are collaborations. There's one with Fragment that's really highly hyped and that was really expensive. The Union Jordan Ones that just came out a few years ago, those are really hyped and those are really expensive. So it kinda just depends on the shoe and who worked on it. The culture really decides which ones have a resell value and which ones don't, and it feels random at times. Sometimes you think, oh that one's gonna be crazy, and then it ends up being a dud. Or that one, you're like, eh. And it also ends up selling for thousands of dollars. - Well, yeah, that's the thing. Especially for someone who's really new to this stuff, I spent a very, very long time wearing $15 Walmart shoes, lik my whole childhood, it was like every year, I'd get another pair of $20 shoes, whatever. And so, it's only been in the last few years, mostly thanks to you and Jon and stuff that kinda really got me on board. But I look at some of the stuff and it's just like, you look at a shoe and it's like, oh this is $100, $200. You go, oh wait a minute, this shoe is now $1000, oh this shoe sold for three or $5000. I think to me, as much as I'm like, that's dope, I love it, but I'm also like, $5000 for a shoe? - Yeah. - It's gotta get crazier. And I guess it's the market, right? - It's just the market. - People are super excited about it. - Yeah, super excited about it. I like to think of it in the same way that people think about comic books. There are certain comic books where, if you weren't in a part of that world, you'd pick it up and go, oh that's cool, it's a cool comic book. - Spider-Man number one, whatever, it was an okay story. - Great, yeah, you'd be like, all right. I would have changed a few things. - This guy might have a future. - Yeah, yeah, yeah. But you don't pay any attention to it. But then someone that's in the culture is like, oh my god, you held the Spider-Man number one, you held issue number one, and they'd be blown away by it. So it's like that same sort of dynamic, where if you're in the culture, you know, and if you're not, then you don't get it. - This is probably a dumb question, but when it comes to these older shoes, something that's been sitting, like those Jordan Ones have been sitting in the box, 20, 30 years, as a collector, does that make you a little nervous? I bought these amazing shoes. I'm never gonna wear them. They're sitting in the box. Oh, you pull them out and like, the sole fell apart or something. Is that like a real problem? - That is a real problem. I've been places where you'll see someone bring out an old pair just to kinda flex, and you'll see literally the outsole come off the bottom of their shoe, like they'll be walking around and the outsole just separates from the upper. Yeah, exactly. - [Matt] Help me out with this. Was the glue dissolved? - It's like, I think it's the glue is breaking down over the years. And so. - Probably the heat. - Yeah, with heat, depending on where you keep the shoes. A lot of people, there's a lot of speculation about it because no one knows exactly what's causing it, but it seems to be that the pairs that were actually worn aren't falling apart as fast as the pairs that weren't worn. - Yo, so is it maybe because they were broken in a little bit? - Yeah, no one knows exactly what it is, but most of the time when you get those old shoes and you find somebody that has a pair, it's because they've worn them over the years as opposed to them just having been sitting in a box in their closet or in their room. - That's like too perfect. That's like literally like a perfect analogy of like, don't buy this brand new perfect thing and never use it. Just enjoy it. - Yeah, it's definitely one of those enjoy it things. There's guys that probably have pairs from back then that are wearing them now every once in a while. But if you literally had a pair from back then that you never wore, you probably can't wear them now just because they'll fall apart. You can keep them in the box or leave them as displays, but once you put any pressure or putting impact on them, they'll crumble, they'll just crumble and fall away. - That's brutal, man. Well, it almost kinda reminds me a little bit of the car scene because there's a lot of people who bought super limited edition, there's a McLaren f1 which is like this car from the early 90s, the fastest car for 10, 15 years. It was such a huge, huge thing. They only made like a hundred of them or so. And the thing was that obviously, they're all like, this is the car that Elon Musk bought when he first cashed out, when he first got his money. This is like the car for a long time. And the problem is obviously, it's super limited. They only made so few of them. And a lot of people, you have to do all this maintenance. But I know that they found one that some guy literally bought it, he parked it, he literally pulled all the fluids out, bubble wrapped the whole thing, and just left it there. And even doing that, things start seizing up and everything. It's probably like, I don't know how much it was, but there's quoted this astronomical figure just to get this perfectly pristine car actually drivable again. But I wonder is there that same thing being said, you can rebuild, you can restore old cars and stuff, if you found, if I have a pair of original Jordan Ones that are kind of crumbling, can I send it in to Nike? Is there some way to restore it or is it pretty much it is what it is? - There are customizers that can restore them for you and bring them back, where they'll put a new outsole on it, they'll take out the stitching and restitch it for you and glue it back in with a new outsole. But there's no official place for it. - And I'm sure it's way less, that's more for you, for your state of mentality. - Yeah, that's more of you just being like, this is the up. Because at that point, it's like. - It's not original anymore. - Yeah, it's not the original parts anymore, you know what I mean. It's like that getting McLaren and now you have like Pirelli tires on it. - It's interesting because there's definitely a split in the car space between cars that are original are obviously worth a lot, but there's also a real market for cars that have been fully restored. You see some junkyard barn find. It's like a shell and you fully redo it, and yet, it's still worth tons of money. So it's interesting to see that the shoe space hasn't really hit that. But maybe, 20, 30 years from now as the stock gets smaller and smaller, maybe that becomes more of a market. - I think that will definitely become more of a market, especially with the classic stuff, like the Jordan Ones or old Air Force Ones or the old Dunks and stuff like that. You put that new outsole on there and have it restitched and everything, they kinda almost look brand new. It's like, I think at that point, people will start to kinda appreciate it, and obviously, it will have its audience because I'm sure just like the car world, there's people like, oh this is original. This is original. - Yeah, of course. The scratches. - This is original, these are all original parts versus this is restored, and they're like, ah, ah. It's a Volkswagen but it's restored, like that kind of thing. - It's fine, it's fine. - Yeah, it's fine, no it's good, that's your car. I was just watching an article about there's this company that puts electric engines into Volkswagen Bugs. - [Austin] Oh, that's awesome. - It was really, I was like, oh that's really cool. But one of the, they did an interview with a guy that has an automobile museum, and he was just like, oh that's very cool that they put electric engines in there, that's great, but I imagine a collector would want the rumble of an engine or the feel of a ride of a classic Volkswagen Bug. So that's for some. - It's like you have this amazing painting and then you draw like a little attachment on the side of like, oh it's Mona Lisa with a smile. (laughter) I think it's super interesting to think about how the shoe space has evolved. But like you were saying at the very beginning, it hasn't evolved in a bubble because there's also this whole other genre of streetwear which is kind of evolving at that same time. And you look at some of these brands. Again, when you look at the money aspect of things, Off-White and Supreme, like what? From the outside, you look at it and you're like, oh, they're selling that for how much? That's a T-shirt for what? Are you serious? But it's interesting to see kinda how it's all evolving together. - Yeah, and a lot of it is their, the look for individualism. Oh I'm going to be an individual if I get this super expensive thing. And streetwear has almost kinda take on, it's almost like the luxury for the street kid or the skate kid, you know what I mean. It's like that's their luxury wear. So instead of getting Louis Vuitton, they'll get a Supreme. Or instead of getting Gucci, they'll get Hundreds. Or instead of getting Balmain, Balmain or whatever it is, they'll get something from Off-White. That's kinda like their luxury lifestyle, and that's how they choose to, I guess, express themselves in the world is through that streetwear, through their sneakers. And even like streetwear is really an extension of sneakers. Sneakers had got to the point where they'd gotten so big that it was like a fundamental part of your wardrobe, and people had to find a way to how do I dress with these sneakers and that's kinda, that's where streetwear came into play. - Yeah, that's crazy. But I guess it makes sense, right? Because you look at an LV bag. At the end of the day, is it really worth $5000 or is it really worth like the $200 it actually took to make it? So there's obviously a markup and you're buying the brand. - Buy the brand, yeah, yeah. - The fact that it's more about the individuality makes sense because I mean, obviously, there are hundreds, thousands of sneakers out there, different types, different colors. But at the end of the day, there's still trends and there's still only so many cool things you want to do a video on in a year. You're gonna see someone walk around with that cool pair of Yeezys, you're like, oh great, I'm not cool anymore. You put that Supreme hoodie on, you're like, can't copy me now. - Yeah, yeah, now I'm cool. Now I'm cool. And that's part of it. I think a lot of people, sneakers has gotten to the point now where people are getting into sneakers just because they want to be cool as opposed to making it authentic to them. - That's me, I just want to be cool. (laughter) - But you buy sneakers that you actually like. When the team surprised you with that sneaker, it was like, oh this is something that I think would work with Austin, I think it kinda reflects his personality a little bit. I don't expect you to have 500 sneakers, but your team, they knew, this would be cool for Austin to have this cool shoe. And so, that worked for you. So I don't think you're trying to be cool in that sense. I think it's just like, this is just who you are, so you buy the things that you want, like you just bought the 270 Reacts. - [Austin] So good, it's so good. - See? - It's so exciting. - And that's the response that I think I look for more, for like, I'd be like, oh you got that sneaker? You're like, yes. That's the way you should feel about the shoes that you pick. They should reflect you in that sort of way and that you get excited about. - Dude, that is so cool. So to wrap this whole thing up, we've talked about all this cool stuff. What do you see as the worries, the downsides? Are you afraid there's gonna be like a bubble? Obviously there's some of these things, like the. What's the stock market thing? - [Jacques] StockX. - StockX. You see they had this huge data breach, but also you see these inflated prices. Is there anything that concerns about being in this space and sort of living in it? Any dark clouds on the horizon? - I would say the only dark cloud really is just the, how out of control the resell market can get and the sort of characters that brings along with it. But then there's also the extension of, the culture kinda losing that touch and it becoming very corporate, of like the sneakerheads. A resell used to happen you to me, or at a store, something like that. And now it's like, you go to this internet website to buy the shoe. So it's kinda like these middlemen have kinda gotten into it and I think it breaks up that community aspect of sneakers. That's something that I love. When I started watching you and TLD and MKBHD on YouTube, I felt like there was a community between you three and it was like a genuine friendship between you three that made me like, go from him, he's really cool with Jon, he's really cool with Austin, they're really cool. So that made it fun for me to watch all three of you because I felt like you guys had this relationship. And I feel like with sneakers, because you have this middlemen with StockX or these other places that resell sneakers, you lose a little bit of that community aspect and it's not there as much anymore. So that's the only downside, but I guess that's because I'm a little bit older and so I kinda grew up in that world where that community was a big thing. - It makes sense though. - So I miss that. - Who is excited about a company who goes in and buys a $200 pair of shoes, throw a $1000 markup, and turns around and resells it, right? That's just like, I get it, make your money, that's awesome, but it's hard to be like, cool, good job dude. It's just like, it kinda feels like, you're kind of extracting value from really nothing. And I don't know. To me, that part of it is like, I totally agree. Especially with the characters that kinda come along with that, it's like, not a huge fan. But then again, it's ultimately your call. And if you walk in a store and you're like, you know what, those are awesome, I don't care that you're charging me twice as much, that's what I want? More power to you. But it's like. - But it also fosters entrepreneurship and kids thinking about business in a way that they maybe not wouldn't have if they weren't selling shoes. So you kinda also, you get both sides of it. There's a good and a bad with everything. So you hope, you just hope that the good comes, that the good overrides the bad part of it, and people get excited about it. For me, I just want people to love sneakers. It's something that I'm obviously passionate about, it's something that I love. I love the tag, I love the design, and I love to run and play basketball. So all that's a part of my world, so my hope is that that passion that I have for it, it boils over or spills over to those that are just kinda coming into it. And I don't expect everyone to be as passionate as me, but getting into that, the fringe part of it, it's like, to go back to the comic book analogy, it's like back in the 80s and the 90s, there were comics that everybody knew about. We all knew about Superman, we all knew about Spider-Man, we all knew about Batman basically. Those were the guys. And even with sneakers, everybody knows about the Air Force One, everybody knows about the Adidas shell toe, everybody knows about Jordans. But now, everybody knows about Iron Man, they know about Black Panther, they know about all these random comic book characters that no one knew about in the 90s. And I feel like sneakers is that same way. Now people are starting to know, they know about Yeezys, they know about Stan Smiths, they know about the Jordan 11, they know about all of these different shoes. And so, that world is expanding. So, as there's the negatives of, it's losing that community touch but it's also like, now everyone's kinda gonna experience the same joy and passion that I do. - I can't imagine a better way to end it on that. Seriously, thanks so much. - No problem. Thank you. - You guys should absolutely, that was the worst thing ever. - Appreciate you. There it is, there it is. - Let's do it. - I didn't know if you were going for the cool handshake or if we're doing a handshake. - I was like, I thought about it but then I was like, we're so low here. - Yeah because I was like, yeah, I was like, I didn't know. - This is my worst nightmare in person right now. You guys should absolutely go subscribe to Jacques. Absolutely the best sneaker videos on the internet, I'll just say it right now. - Thank you, thank you. - You can see the passion, you can see everything. Thank you so much for being on. - No problem, thank you for having me on. I love this. - Of course, man.",
    "transcript_keywords": [
        "kind",
        "shoe",
        "shoes",
        "sneakers",
        "yeah",
        "people",
        "Jordan",
        "thing",
        "cool",
        "make",
        "things",
        "lot",
        "world",
        "stuff",
        "started",
        "sneaker",
        "good",
        "Nike",
        "kind of thing",
        "Air"
    ],
    "transcript_entity_values": [
        "New York",
        "30 years from now",
        "the 90s",
        "Payless",
        "two weeks later",
        "three",
        "Iversons",
        "Gucci",
        "the last few years",
        "20, 30 years",
        "270",
        "the end of the day",
        "the 80s and the 90s",
        "hundreds, thousands",
        "Nike",
        "every year",
        "one day",
        "50",
        "Pigeon Dunk",
        "MKBHD",
        "thousands of dollars",
        "YouTube",
        "Jeff Staple",
        "80",
        "500",
        "Jordan Ones",
        "5000",
        "Louis Vuitton",
        "Spider-Man",
        "the Jordan 11",
        "a hundred",
        "France",
        "Air Force Ones",
        "2010",
        "2000",
        "Fragment",
        "the early 2000s",
        "the 2000s",
        "Air Max 95",
        "Matt",
        "Hundreds",
        "Pirelli",
        "Austin",
        "April of 2010",
        "Jordan",
        "YouTube",
        "2008",
        "two percent",
        "100",
        "2009",
        "Volkswagen Bugs",
        "New York City",
        "10 bucks",
        "Foamposite",
        "LV",
        "Stan Smiths",
        "All Star",
        "first",
        "TLD",
        "Black Panther",
        "10 years ago",
        "early days",
        "Nike SB",
        "10",
        "180-200 dollars",
        "three percent",
        "Jordans",
        "slo-mo",
        "94",
        "20",
        "a couple years ago",
        "Tinker Hatfield",
        "Jacques",
        "Balmain",
        "Dunks",
        "the Jordan 11 I",
        "Nikes",
        "10,000",
        "three or $5000",
        "Off-White",
        "pre-order day",
        "200",
        "second",
        "Iron Man",
        "Complex",
        "Batman",
        "three millimeter",
        "lik",
        "the Pigeon Dunk",
        "the Pod System",
        "Air Max One",
        "the early 90s",
        "Jon",
        "a minute",
        "McLaren",
        "Supreme",
        "Elon Musk",
        "Galaxy Foamposite",
        "one",
        "Apple",
        "500",
        "Off-White and Supreme",
        "four",
        "days",
        "Volkswagen",
        "today",
        "Superman",
        "100,000",
        "2005",
        "three or four days",
        "the Pigeon Dunk",
        "180",
        "1985",
        "20",
        "a few years ago",
        "Mona Lisa",
        "the years",
        "YouTube",
        "95",
        "a year",
        "90s",
        "Yeezys",
        "1000",
        "Walmart",
        "all day",
        "50,000",
        "Michael Jordan",
        "the last 10, 15 years",
        "Jordan",
        "Air Force One",
        "the first year",
        "10, 15 years",
        "Ken",
        "100",
        "iPhone",
        "Adidas",
        "SB"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "FAC",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "PERSON",
        "DATE",
        "PERCENT",
        "MONEY",
        "DATE",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "PERSON",
        "FAC",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "EVENT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "LOC",
        "FAC",
        "PRODUCT",
        "DATE",
        "PERSON",
        "TIME",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "NORP",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.05695536360144615,
        0.03712068498134613,
        0.08968811482191086,
        -0.02382798306643963,
        0.07714797556400299,
        -0.019814632833003998,
        0.08496084064245224,
        0.0335245355963707,
        0.055633530020713806,
        0.029492894187569618,
        0.07622186839580536,
        0.052245259284973145,
        0.02098659984767437,
        -0.0323709137737751,
        0.03216179087758064,
        -0.04329895228147507,
        0.012029762379825115,
        0.03046472556889057,
        -0.08967891335487366,
        0.017416713759303093,
        0.008680973201990128,
        -0.06733984500169754,
        0.05077780410647392,
        0.05861104652285576,
        -0.0876634418964386,
        -0.004929170943796635,
        0.07116365432739258,
        -0.014978534542024136,
        -0.04179532080888748,
        -0.0056977239437401295,
        -0.08203496783971786,
        0.04124097526073456,
        0.0408763661980629,
        0.12141098827123642,
        -0.025419190526008606,
        -0.031541548669338226,
        0.03625379875302315,
        0.049290165305137634,
        -0.06640494614839554,
        0.07431825250387192,
        0.007354729808866978,
        -0.09293948858976364,
        -0.00314733455888927,
        -0.034055206924676895,
        0.048829030245542526,
        -0.011770624667406082,
        0.007936910726130009,
        -0.014027847908437252,
        -0.0364365391433239,
        0.09145993739366531,
        -0.06705720722675323,
        0.06148596853017807,
        0.02770497463643551,
        -0.0389515720307827,
        0.08210383355617523,
        0.07729898393154144,
        0.003805005457252264,
        0.07876528799533844,
        0.0607457235455513,
        -0.06919381767511368,
        0.07022903859615326,
        -0.0754656046628952,
        -0.016711130738258362,
        -0.005331695079803467,
        0.005127742886543274,
        -0.07062508910894394,
        -0.04950723052024841,
        0.02701365388929844,
        -0.012598445639014244,
        0.03872622177004814,
        -0.017521372064948082,
        -0.002585897920653224,
        0.041224632412195206,
        0.05469343066215515,
        -0.09015138447284698,
        0.035186611115932465,
        0.01117578987032175,
        -0.049726638942956924,
        -0.027598818764090538,
        0.03473798558115959,
        0.07266207784414291,
        -0.027585649862885475,
        0.008092869073152542,
        -0.04124663770198822,
        -0.029201649129390717,
        -0.046366021037101746,
        0.013029533438384533,
        0.002516194712370634,
        0.012515130452811718,
        -0.024801211431622505,
        -0.12439735233783722,
        -0.014166784472763538,
        0.02447456121444702,
        0.0150830103084445,
        0.030974233523011208,
        -0.009824085980653763,
        -0.03314172476530075,
        -0.018267517909407616,
        -0.02557680383324623,
        0.03708739951252937,
        0.09105292707681656,
        0.09620299935340881,
        0.03253811225295067,
        0.0004905159003101289,
        0.010794482193887234,
        -0.05736520141363144,
        -0.027753211557865143,
        0.07539822161197662,
        0.02458367310464382,
        0.15774454176425934,
        -0.01393380481749773,
        0.01847011223435402,
        -0.024996738880872726,
        -0.044370464980602264,
        0.017763763666152954,
        0.0062232003547251225,
        -0.005799606442451477,
        0.07081705331802368,
        0.03626658394932747,
        0.09183172136545181,
        -0.04164997115731239,
        0.0886368528008461,
        -0.0037315317895263433,
        0.018674200400710106,
        0.0030915099196135998,
        -0.029891401529312134,
        0.00980314239859581,
        -4.743721687245246e-34,
        0.002139817224815488,
        0.05073004961013794,
        0.045813217759132385,
        -0.00661342591047287,
        -0.010768433101475239,
        -0.08802977204322815,
        0.058695320039987564,
        -0.01931290328502655,
        -0.04465310648083687,
        0.06725070625543594,
        -0.019400538876652718,
        0.06998880952596664,
        -0.024867575615644455,
        -0.042442575097084045,
        0.04415263235569,
        0.0008566398173570633,
        -0.1532697081565857,
        -0.061856020241975784,
        0.011030588299036026,
        0.046817999333143234,
        0.05038515850901604,
        0.005891724489629269,
        0.06235400214791298,
        -0.012466358952224255,
        0.03394974023103714,
        -0.028867557644844055,
        0.0023033798206597567,
        -0.025006063282489777,
        0.06430750340223312,
        -0.00989441853016615,
        0.01920907385647297,
        -0.030071087181568146,
        0.00539377611130476,
        -0.026540130376815796,
        0.009400617331266403,
        -0.07833059132099152,
        0.05648910254240036,
        -0.07071150094270706,
        -0.017758138477802277,
        -0.004847444593906403,
        -0.05901411175727844,
        -0.04664336517453194,
        -0.023942429572343826,
        -0.03504661098122597,
        -0.05456475540995598,
        0.09926799684762955,
        -0.03447349742054939,
        -0.03251143544912338,
        -0.024042539298534393,
        -0.05022486299276352,
        -0.055778831243515015,
        0.013585777021944523,
        0.053223710507154465,
        -0.027282845228910446,
        0.04213431105017662,
        -0.11533746868371964,
        0.058466289192438126,
        -0.029614903032779694,
        0.04894779250025749,
        -0.046189919114112854,
        -0.03294626250863075,
        0.09314271807670593,
        0.02433917112648487,
        0.014821075834333897,
        -0.13674797117710114,
        -0.0623137503862381,
        -0.0008091634954325855,
        0.042825136333703995,
        -0.04197365790605545,
        -0.025679750367999077,
        -0.022111766040325165,
        -0.002165162703022361,
        -0.07419896125793457,
        0.0010174616472795606,
        -0.017983563244342804,
        -0.015275544486939907,
        -0.06767328828573227,
        -0.01697230525314808,
        -0.010325347073376179,
        -0.03868472948670387,
        -0.04524015635251999,
        -0.06897050887346268,
        0.006804614793509245,
        0.05266527831554413,
        -0.05028554052114487,
        0.006260373163968325,
        0.032448120415210724,
        -0.08831917494535446,
        0.044626057147979736,
        0.018911944702267647,
        -0.1181255653500557,
        -0.0327337346971035,
        -0.05853432044386864,
        -0.018812157213687897,
        0.031212367117404938,
        -2.458317764359381e-33,
        0.08272158354520798,
        0.08292366564273834,
        0.02531523071229458,
        0.035064175724983215,
        0.01588369533419609,
        -0.016936417669057846,
        -0.03031299076974392,
        -0.002590662334114313,
        0.041422199457883835,
        -0.07610815018415451,
        -0.07026446610689163,
        0.010408888570964336,
        0.004423520527780056,
        0.008867965079843998,
        -0.0010339085711166263,
        -0.0651618167757988,
        0.008925733156502247,
        0.10705769062042236,
        -0.011707039549946785,
        -0.01404961571097374,
        0.0294298455119133,
        -0.04798907786607742,
        -0.02530515007674694,
        -0.0026468292344361544,
        -0.10220561921596527,
        0.05557706579566002,
        0.11095049977302551,
        0.044855985790491104,
        -0.16575735807418823,
        0.037570808082818985,
        0.07028677314519882,
        0.010902544483542442,
        0.0026285985950380564,
        0.10035668313503265,
        -0.01583622582256794,
        -0.01194785162806511,
        -0.1396866887807846,
        0.00019676155352499336,
        -0.04871099814772606,
        -0.10783707350492477,
        -0.009276432916522026,
        -0.023283742368221283,
        -0.005106667056679726,
        0.03209943696856499,
        -0.029286179691553116,
        -0.07965239882469177,
        -0.05410574749112129,
        -0.02290867641568184,
        0.015877660363912582,
        -0.052058517932891846,
        0.03639873117208481,
        -0.0083738649263978,
        -0.011475694365799427,
        -0.029504064470529556,
        -0.10354427993297577,
        -0.022594904527068138,
        -0.026240451261401176,
        -0.002233272884041071,
        -0.0049713002517819405,
        0.03086225315928459,
        -0.0508076548576355,
        -0.030557820573449135,
        -0.05636192485690117,
        -0.053764794021844864,
        -0.04615851119160652,
        -0.031727395951747894,
        0.05838260427117348,
        0.03662843629717827,
        -0.008731221780180931,
        -0.0671190470457077,
        0.00933167152106762,
        -0.006246412638574839,
        0.00680411234498024,
        0.10993916541337967,
        -0.024218151345849037,
        0.057033952325582504,
        0.02719043754041195,
        0.03874946013092995,
        0.043867260217666626,
        -0.020580150187015533,
        -0.05385372415184975,
        -0.057031579315662384,
        -0.03183239698410034,
        -0.02342270314693451,
        0.03807390108704567,
        0.14313341677188873,
        0.007951457053422928,
        0.0819644033908844,
        -0.01624317653477192,
        0.04758454114198685,
        0.07184410840272903,
        0.05522046983242035,
        0.055186688899993896,
        0.009631886146962643,
        -0.0022705260198563337,
        -5.803005365123681e-08,
        0.02711087465286255,
        0.09642194211483002,
        -0.023588748648762703,
        0.06434492766857147,
        0.007284834980964661,
        0.020341040566563606,
        -0.020755527541041374,
        0.017087329179048538,
        0.058001190423965454,
        0.01641223579645157,
        -0.021255075931549072,
        0.005092171486467123,
        -0.03266583010554314,
        0.11056742817163467,
        0.04003814980387688,
        0.07760939002037048,
        -0.0557139627635479,
        0.0682983249425888,
        -0.03655451908707619,
        0.005185514222830534,
        -0.047749318182468414,
        -0.022542282938957214,
        -0.01318430993705988,
        0.027678197249770164,
        -0.026584573090076447,
        -0.00499982014298439,
        -0.021296516060829163,
        -0.04623967409133911,
        -0.04192725196480751,
        0.006942538544535637,
        -0.017833612859249115,
        -0.021786117926239967,
        -0.05692175403237343,
        -0.01335095427930355,
        0.0002721404889598489,
        0.06067793816328049,
        0.05555880814790726,
        -0.04391395300626755,
        0.09954744577407837,
        -0.028049584478139877,
        -0.08588138222694397,
        -0.09489411860704422,
        0.07155750691890717,
        -0.035023752599954605,
        -0.07707798480987549,
        0.01907254382967949,
        -0.020940029993653297,
        0.04213434085249901,
        -0.09764230996370316,
        0.04899904504418373,
        -0.031209614127874374,
        -0.034184444695711136,
        -0.03838744014501572,
        -0.03747322037816048,
        0.04677519574761391,
        -0.012207015417516232,
        -0.035767897963523865,
        0.03199353441596031,
        -0.008123714476823807,
        -0.004373801406472921,
        0.03636659309267998,
        -0.027479935437440872,
        -0.06593582779169083,
        0.027665169909596443
    ]
}