{
    "id": "W3G8ErohpWE",
    "title": "This makes me happy - Sega Genesis Mini 2",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-12-06T21:45:38Z",
    "video_url": "https://www.youtube.com/watch?v=W3G8ErohpWE",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "sega",
        "genesis",
        "mini",
        "mini 2",
        "gaming",
        "retro",
        "classic",
        "vintage",
        "sonic",
        "eccho"
    ],
    "views": 485874,
    "likes": 16591,
    "comments_count": 954,
    "description": "Get 20% off your order and free standard shipping on order over $65 with code CELEBRATE at   Anthony is a Sega kid, so we got in the new Sega Genesis Mini 2 for him to take a look at. Is it a worthy successor, or should you stick to the original hardware?  Buy a Sega Genesis Mini 2:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Awww 0:30 Comparison to the Mini 1 1:07 Included games 1:33 Unboxing 2:24 Checking out the console 3:52 Sponsor - iFixit 4:25 This thing is LIGHT 4:43 Powering it up and checking out settings 6:22 Playing Ecco the Dolphin and CRT filter comparison 7:57 Playing Lightning Force and trying Highspeed mode 9:11 Thoughts on included games 10:44 Teardown 12:00 Overall thoughts 12:25 Outro",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://geni.us/soB40cm",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Look at how adorable this thing is. Oh my God, it's so small. It's so tiny, I can fit it in the palm of my hand. Just the box, not even the thing. Oh, I'm so excited. I am a Sega kid. I had a Sega Master System. When I was a very young kid. We wouldn't have had it when I was born. And then, we got a Sega Genesis. This was my life for a long time. Well, what this represents. Now, I had a Genesis Model 1. This is a Model 2. And, fittingly, this is the Sega Genesis Mini 2. I actually have the Mini 1. It's a pretty nice, little kit. It's modeled after the first model of Sega Genesis, but it's got some issues with it. The number one issue is that there aren't that many games for it, and if you hack it, which is possible with Project Lunar, well, I mean, at that point, it kind of feels the same as Raspberry Pi. Because, if you try to use the official interface for it, it just lags and freezes. Unlike the Sega Genesis Mini 1, the Mini 2 only has a single wired control pad. But, that control pad has six buttons, whereas the previous one had three. They give you the big chunky three button controller, for some reason. Even though the games used six-button controller. Yeah, let's take a look at the back. You've got After Burner 2, Alien Soldier, Alien Soldier is actually kind of interesting, Lightening Force, that is a good game. It's also know as Thunder Force 4. Mostly the game is good for it's soundtrack, but the game play is really good too. Midnight Resistance, Outrun, OutRunners, Phantasy Star 2, that is an amazing game. Unfortunate that the Phantasy Star 4 isn't there as well, that's my favorite of the series. So yeah, over 60 classic and bonus titles. Let's get it out of it's box. This is a much stronger line-up than the Genesis Mini 1. So, I've got one six-button controller that feels pretty much the way I remember them feeling when they were new. Although the molding is not quite perfect. It's catching a little on the fingers. It also feels a little lighter than the original versions, but I might just be misremembering. We've got, of course, a little USB power adapter, this thing only just takes, I think 5 volts. But, it does have Sega Corporation on here. HDMI cable, I don't think that even has a Sega logo on it, nope. And, this here, USB cable, which does have Sega on it. That's cute. The USB cable is Micro B, so. (upbeat music) Why am I unboxing cables when I have the console, right here. Let's get it out of it's little baggy. (laughs) Oh, that is adorable. Ahh, that's not how the original power switch worked. (device clicks) That's how it worked on the Genesis 1, but Genesis 2 had a push button. They messed up there. Cartridge slot does open though, and I Don't think there's anything. Yeah, it's just bare down there. I think with the Genesis Mini 1, they did actually have like, a fake PCB down there. Does this come off? Oh yeah, it does. There's nothing to attach a CD attachment to, though. Although, maybe. They did release a CD attachment and I think 32X attachment for the Genesis Mini 1. They didn't give you extra games or anything, though. It was literally just a cosmetic thing. But it does have the mounts to go in to a CD drive. This here is where some posts would've grabbed on to the CD attachment. I haven't been keeping up on this, since it was announced, because I wanted to do it for ShortCircuit. So, I'm kinda going in blind, here. And on the front, oh that's the back, HDMI out and DC in. And, nothing on the sides, but on the front, you get two USB ports. That kind of where they were, where the original controller ports were on the Genesis 2. And, I guess, fittingly, for the Genesis Mini 2, it is smaller than the Genesis Mini 1, which, the Genesis 2 was actually smaller than the Genesis 1. So, there you go. I guess, there's nothing else to do at this point but to turn it on and play some games. But, before we do that, I'm gonna talk to you about our sponsor, IFIXIT. Thanks to IFIXIT for sponsoring today's video. IFIXIT makes compact tool kits with all the essential bits you need to fix your electronics. From mini kits with 16 bits to full repair tool kits to start your repair business, IFIXIT has you covered. Use IFIXIT's over 70,000 repair manuals featuring photos and detailed instructions, and you can work worry free knowing that you've got quality parts backed by IFIXIT's lifetime warranty. Right now, you can purchase an IFIXIT bundle and get 20% off your order. Plus, if your order's over $65, you get free standard shipping with code CELEBRATE. All the offers end on December 14th. I had it all set up here, but before I go and start playing games, I wanna see, I think this is actually as light as the controller is. Okay, 154 grams. Okay, 100 grams, and with the cable, it's, with the cable it's the weight. Okay. (laughs) So, it is on, or presumably. I don't see any lights. There's a little red indicator there to tell me that it's on though. Fair number of languages built in. (device clicks) We'll go with English for now. (patriotic music) (laughs) Okay. All right, similar interface to the original. Let me turn this down a little bit. This is a very similar interface to the Genesis Mini model 1. We've got all the box right here, I think we can toggle it to, we can toggle it to the side, as well. And we can, let's go to settings. There we go. Languages game settings. Okay. So, we can do four by three, which is kind of what I would prefer. Actually, looks like an integer scale, if I'm looking at that correctly, 'cause there are borders along the entire image, whereas that is stretched, which, I mean, If you like that, then, good for you, but it's not me. Wallpaper, I think I'll go with a TV. (controller clicks) Oh, sweet! Okay. This is something that not a lot of people know about. The original Sega Genesis had like a warmer sound, whereas the newer Sega Genesis had like a, kinda, crunchier sound. (controller clicks) I prefer the original. Really depends on what your childhood Genesis sounded like. You can set it here, which is great. I love that. That's attention to detail that you wouldn't really expect, and I didn't get it in the Genesis Model 1 Mini. Mode button setting. Okay. So, the mode button I guess will open the menu? Some games, use the mode setting. I don't know if there are any games in this compilation that use the mode setting. So, I'd do it for like Hold for 3 seconds or may 1 second. I'll leave it on Quick Open for now, though. And, yeah. There's no like screen resolution settings. I think this is 720P. Credits, Legal Notices, Reset Factory Settings, okay. So, let's play some games. Ecco the Dolphin. It's kind of a slower game, but I can play it. It's a Sega CD game. The display output is really good. They are not filtering this in any way, I don't think. So, that's excellent. I guess I would prefer to have the option to have like, composite video. Because, a lot of Genesis games, especially, made use of composite video for extra color. So, you can see in the background here with the clouds, oh. Well, you can see on the title screen here (laughs) that there are a lot of colors that are just kind of, like, dithered and on a composite display, those would've just become new colors. It would kind of blur together, and they would make so that this whole scene wouldn't be like (indistinct) and look kind of weird with different colors. I'd also like to have the option of scan lines, but that's kind of like a hit or miss thing. Oh, there's the CRT filter. Okay. So, we got scan lines, I think we got a slight blur as well. So, you might see that effect. This is more what the developers originally intended release for this game, I think, because of all the heavy use of dithering. The clouds, when it stops scrolling here, look a lot more natural. It's not quite perfect, but we go back to the title screen here, we should also see that the colors are kind of, again, it's not prefect. It needs a little bit more of a horizontal blur. But, you can you can see that it looks a lot more natural in terms of the shading. This is a good game, by the way. It's like, it's kind of like a puzzle game, sort of. I think I need to talk to that guy, specifically. And then, I do this, there we go. And everyone got abducted. All right, let's swap that to a different game. A game like Lightening Force, would be a lot better to take a look at. Oh, Original Mode, Highspeed Mode. Right, the original version of this game had a lot of slow down. And that actually affected not only the game play, but also the music. So, if Highspeed Mode is what I think it is, then it'll remove that slow down. So, I'm gonna go with that. (controller clicks) All right. Seems pretty okay. This display is kind of low end, but it looks like everything is good. My assessment of what highspeed mode was is correct. I think we'll see it here, yeah. This guy has a lot of sprites, this would slow down tremendously if, if not for that mode. The thing about this game is you can actually adjust how fast you're going. (upbeat music) So, I'm currently the slowest speed. Higher, higher, higher. I didn't say I was good at the game. It's been a while since I played through it. Oh, I forgot, that's not a background object. (laughs) I though it was, in the early part. Wow, I am just sucking right now. Like, half of this kind of game is like, memorizing the patterns, and I do not remember anything. Well, I mean, this this would make me happy. As a Sega fan, as someone who likes a lot of these games, like, this is a very solid lineup here. And as someone who, you know, likes video game history, like having access to Japanese games, European games, and games that I might not have previously played, like Mansion of Hidden Souls, which is, actually, if I remember correctly, a pretty good FMV game, which is strange to say. They're actually coming back in style. How many games have the original have? - [Staff] The original had 40. Yeah, 40. So, you're getting 20 more games, it's also 20 more dollars than the original. So, you'd say an extra buck a game. But the original also had two controllers. If you want a second controller, you're looking at another $20. In total, a $40 premium over the previous version. Honestly, I think it's worth it. The previous version kinda went on super sale after a little while, just because it was. I mean, let's be honest, they didn't have a huge number of really good games. Like, you had some really good games. Like, I think you had the entire Sonic series on it, whereas, this doesn't seem to have much of anything Sonic on it. So, you kind of need two of them to get the full breadth of the Sega Genesis library. But, at the same time, like, this is more representative of what the whole library had to offer, than what the Sega Genesis Mini 1 had. You can set up an emulator box for less than this, to put a Raspberry Pi. But it won't look as nice as this. And, this is kind of a collector's item. Yeah, I mean. (device pops) (upbeat music) (laughs) Shutting down. Yeah, it even has like a little shutdown sequence. I really like it. And that's why I'm gonna take it apart. The thing about the previous Genesis Mini, is that it had a lot of little easter eggs in it. Like, there a fake PCB on the inside that made it look like there was a cartridge slot. There was that attachment for the Sega CD. There was the attachment for the 32X. And, I think there was also an attachment for like Sonic 3 and Knuckles, to kind of make the full tower of power, which was really amusing. I don't know if they're doing that with this one or not. And, let's be clear, it kind of is, (indistinct) just because of, I don't know, how many times you bought these games, right? If you're a Sega fan. All right, let's get in there. That's all on the inside of that. I don't see anything super, like, (indistinct) (screw cracking) lttstore.com, by the way. I need to flex the plastic a little to do that. It's really stiff plastic. (inhales deeply) Yeah, nothing. It's a little disappointing, but, I mean, I guess it's to be expected. This is the second generation of the product. The first one was really kind of the big celebration. So, if you want something that goes on your shelf and looks pretty, and also can play some really good games, then the Genesis Mini 2 is a, honestly, really good little collection, I love it. I do wish that it had 32X games. Those are notoriously difficult to, to emulate those. So, I don't really know if I can blame them too much for that. So, yeah. For 100 bucks US, you're getting legal copies of the games, you're getting a box that can handle them, and presumably, there'll be hacks the same way that the previous one was too. So, if you wanted to expand the library, you probably could. Not that I would recommend piracy, but if you own the games and, say, you've dumped them with, I don't know, (indistinct) or whatever, then, yeah. That would be a totally, a thing you could do. And, it looks really cute on your shelf. It's like you look cute when you watch ShortCircuit. You should, maybe, take a look down below and maybe subscribe if you liked this one. There are plenty more videos like this. We do all kinds of things here.",
    "transcript_keywords": [
        "Sega Genesis Mini",
        "Genesis Mini",
        "Sega Genesis",
        "Genesis",
        "Sega",
        "original Sega Genesis",
        "Genesis Mini model",
        "games",
        "Mini",
        "game",
        "kind",
        "Sega Genesis library",
        "previous Genesis Mini",
        "Genesis Model",
        "newer Sega Genesis",
        "good",
        "original",
        "Sega Master System",
        "Yeah",
        "IFIXIT"
    ],
    "transcript_entity_values": [
        "Cartridge",
        "Sega Genesis",
        "5 volts",
        "half",
        "Reset Factory Settings",
        "three",
        "Genesis Model 1",
        "Burner 2",
        "Highspeed Mode",
        "40",
        "60",
        "one",
        "Genesis",
        "USB",
        "20%",
        "154 grams",
        "100 grams",
        "US",
        "Phantasy Star 2",
        "Fair",
        "CRT",
        "Sega",
        "Thunder Force 4",
        "3 seconds",
        "DC",
        "over 70,000",
        "Outrun",
        "IFIXIT",
        "40",
        "20 more dollars",
        "Japanese",
        "second",
        "a Raspberry Pi",
        "Sega Genesis",
        "Legal Notices",
        "40",
        "Sonic",
        "December 14th",
        "European",
        "Micro B",
        "100 bucks",
        "first",
        "Mansion of Hidden Souls",
        "1",
        "32X",
        "Project Lunar",
        "Knuckles",
        "Lightening Force",
        "OutRunners",
        "two",
        "16",
        "over $65",
        "720P.",
        "Genesis Mini",
        "four",
        "Sega Master System",
        "Raspberry Pi",
        "Sega Corporation",
        "Sega",
        "another $20",
        "ShortCircuit",
        "six",
        "Midnight",
        "Model 2",
        "PCB",
        "FMV",
        "Sonic 3",
        "Sonic",
        "20",
        "today",
        "English"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "NORP",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "MONEY",
        "ORDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "LANGUAGE"
    ],
    "vector": [
        0.003650922328233719,
        0.006600291933864355,
        0.08436672389507294,
        -0.09503256529569626,
        0.04452383145689964,
        0.049605369567871094,
        -0.04086252301931381,
        0.06166085600852966,
        -0.02857239730656147,
        0.06350505352020264,
        -0.005907086655497551,
        0.058684661984443665,
        -0.023923981934785843,
        -0.059742558747529984,
        0.008128276094794273,
        -0.05217214301228523,
        0.056294698268175125,
        -0.054114051163196564,
        -0.014757620170712471,
        -0.03152623400092125,
        -0.06479868292808533,
        -0.06613770127296448,
        -0.04779413715004921,
        -0.03041226603090763,
        -0.002958394819870591,
        -0.0020951374899595976,
        -0.02444949559867382,
        -0.00572565570473671,
        0.030713308602571487,
        -0.06238586828112602,
        -0.043110623955726624,
        0.06557801365852356,
        0.04387551173567772,
        -0.020756224170327187,
        0.026242507621645927,
        -0.02358270063996315,
        0.08196926862001419,
        -0.12036260217428207,
        -0.12699274718761444,
        -0.08924433588981628,
        -0.01898709498345852,
        0.006719205062836409,
        -0.0369434617459774,
        0.025136491283774376,
        -0.005147399380803108,
        -0.03390267863869667,
        0.0059324405156075954,
        -0.10719282180070877,
        -0.004140633158385754,
        0.03305076062679291,
        0.0124226538464427,
        -0.0773060992360115,
        0.10346498340368271,
        -0.030520813539624214,
        0.035455405712127686,
        0.07513174414634705,
        0.01671168953180313,
        -0.05283943563699722,
        0.07787223905324936,
        -0.006733345799148083,
        -0.0077150785364210606,
        -0.08898289501667023,
        -0.01993686519563198,
        0.029588371515274048,
        0.04274432733654976,
        -0.08318538963794708,
        0.01913071610033512,
        0.0684841200709343,
        -0.04119110107421875,
        -0.015093090943992138,
        0.022984590381383896,
        0.03499312326312065,
        0.04451445862650871,
        0.14303389191627502,
        0.004340118728578091,
        -0.046336401253938675,
        0.07537629455327988,
        -0.03210172429680824,
        0.009748567827045918,
        0.024698348715901375,
        -0.02643650770187378,
        -0.09185551851987839,
        -0.07477453351020813,
        -0.03495550900697708,
        -0.005880435928702354,
        -0.00029064639238640666,
        0.03640833869576454,
        -0.04054410383105278,
        -0.024608245119452477,
        0.004139055497944355,
        -0.049838870763778687,
        0.07842119038105011,
        0.15553566813468933,
        0.024265971034765244,
        -0.025527581572532654,
        -0.010294095613062382,
        -0.04668615385890007,
        -0.04802568256855011,
        -0.032908715307712555,
        0.042634230107069016,
        0.042173758149147034,
        0.09624622017145157,
        0.03148877993226051,
        -0.06716640293598175,
        0.021467678248882294,
        -0.11535133421421051,
        0.03827490657567978,
        0.017424387857317924,
        0.040713872760534286,
        0.022434132173657417,
        -0.03614973649382591,
        0.012909664772450924,
        -0.06127971038222313,
        0.04509343206882477,
        -0.004691699054092169,
        0.006063925568014383,
        0.0024014736991375685,
        0.030740998685359955,
        0.0663330927491188,
        -0.06345260888338089,
        0.058108218014240265,
        0.025459647178649902,
        -0.018130723387002945,
        0.018928172066807747,
        -0.09994295984506607,
        0.0010175794595852494,
        -0.03123488649725914,
        -3.20945369541803e-33,
        -0.06525704264640808,
        0.04775572568178177,
        -0.011466613970696926,
        -0.06989191472530365,
        0.11836536973714828,
        0.0020086592994630337,
        -0.016747595742344856,
        0.0415676012635231,
        -0.04112010449171066,
        -0.013666825369000435,
        -0.09070871770381927,
        -0.0014921094989404082,
        -0.09212110191583633,
        0.03936412185430527,
        0.042507585138082504,
        -0.1113455519080162,
        0.025593629106879234,
        0.02578604407608509,
        -0.0038328811060637236,
        -0.019733769819140434,
        -0.04769739508628845,
        -0.01438499242067337,
        -0.033450182527303696,
        -0.09117591381072998,
        0.07897382229566574,
        -0.038887664675712585,
        -0.0007127387216314673,
        -0.023434234783053398,
        0.052576206624507904,
        0.03626679629087448,
        -0.117790587246418,
        -0.02989344671368599,
        -0.01576954312622547,
        -0.07458075135946274,
        0.018558138981461525,
        -0.04549822583794594,
        -0.0020705508068203926,
        -0.04770832508802414,
        -0.04322843998670578,
        0.008390883915126324,
        -0.011363530531525612,
        -0.027909375727176666,
        -0.11260773241519928,
        -0.028357943519949913,
        0.01644912175834179,
        0.03867945820093155,
        0.11334793269634247,
        -0.005830151494592428,
        0.1245298832654953,
        0.011180832982063293,
        -0.03189507871866226,
        -0.011036165989935398,
        -0.11395181715488434,
        -0.0704292356967926,
        0.03229794651269913,
        -0.03777259215712547,
        -0.011214773170650005,
        -0.08219625800848007,
        0.0636616200208664,
        0.012426894158124924,
        0.04034120589494705,
        0.050384800881147385,
        0.039685022085905075,
        0.011808501556515694,
        -0.058898136019706726,
        0.09181191772222519,
        0.06130585819482803,
        -0.043706655502319336,
        -0.07711692899465561,
        -0.018980598077178,
        -0.03172525018453598,
        -0.023012900725007057,
        0.05221552401781082,
        -0.01092561800032854,
        0.06275604665279388,
        0.03737129643559456,
        -0.05453457310795784,
        -0.07911026477813721,
        0.011239302344620228,
        -0.004061200190335512,
        0.032024532556533813,
        0.017990659922361374,
        -0.03700302541255951,
        0.05390608310699463,
        0.03493513911962509,
        0.025089537724852562,
        0.09001228213310242,
        0.029191548004746437,
        -0.06996423751115799,
        0.06583358347415924,
        -0.05106524005532265,
        -0.04097896069288254,
        -0.037813927978277206,
        0.02797817438840866,
        -0.04275207221508026,
        -8.572818770764517e-34,
        -0.04465995728969574,
        0.0011688376544043422,
        -0.0022560537327080965,
        -0.012746806256473064,
        -0.032781146466732025,
        0.0067526549100875854,
        -0.016392888501286507,
        -0.005811264738440514,
        0.020108401775360107,
        0.010178308933973312,
        -0.033164504915475845,
        0.01947786659002304,
        -0.0622829869389534,
        -0.03592047095298767,
        0.01144245732575655,
        -0.0339706651866436,
        -0.01048558484762907,
        -0.06405000388622284,
        0.03959409147500992,
        -0.060356345027685165,
        0.10450580716133118,
        0.02759297750890255,
        -0.03118794970214367,
        0.10317686945199966,
        0.045908913016319275,
        0.02985682152211666,
        0.09676673263311386,
        0.09431790560483932,
        -0.05115954577922821,
        0.00595609238371253,
        0.028174445033073425,
        -0.0753110945224762,
        0.020612629130482674,
        -0.03244248032569885,
        0.0399586483836174,
        0.011829608120024204,
        0.023936504498124123,
        0.009270702488720417,
        -0.03757499158382416,
        -0.04421618953347206,
        -0.036786388605833054,
        -0.0415528379380703,
        -0.014308696612715721,
        0.021055681630969048,
        -0.022315233945846558,
        -0.040434330701828,
        0.047860339283943176,
        -0.040393978357315063,
        0.05015984922647476,
        0.017974525690078735,
        -0.041159242391586304,
        -0.014277451671659946,
        0.10913531482219696,
        -0.0036937789991497993,
        -0.05470765754580498,
        -0.03831890970468521,
        -0.06795722991228104,
        0.06292861700057983,
        0.022333111613988876,
        0.0069079711101949215,
        0.03827490285038948,
        -0.07012354582548141,
        0.031024407595396042,
        -0.025937633588910103,
        0.005830980837345123,
        -0.04152706637978554,
        0.12438226491212845,
        0.0478905625641346,
        -0.08879407495260239,
        0.021763503551483154,
        -0.006328419782221317,
        0.009918227791786194,
        0.02741587720811367,
        -0.011967839673161507,
        -0.050160884857177734,
        0.059983029961586,
        0.017461225390434265,
        0.019698554649949074,
        0.006601915694773197,
        -0.04670584946870804,
        -0.012593448162078857,
        0.07800676673650742,
        0.04347425699234009,
        -0.024105312302708626,
        0.04497909173369408,
        -0.07750317454338074,
        0.040520165115594864,
        -0.041630957275629044,
        -0.008499392308294773,
        0.03464731574058533,
        -0.04415768012404442,
        0.0774315595626831,
        -0.018192801624536514,
        0.02538364939391613,
        0.0052343206480145454,
        -5.4677194327723555e-08,
        0.021977568045258522,
        -0.04377472400665283,
        0.04850073158740997,
        0.009888969361782074,
        0.03212655335664749,
        0.011224613524973392,
        -0.0807659849524498,
        -0.006305234506726265,
        -0.0027188342064619064,
        -0.021487316116690636,
        -0.07467713207006454,
        -0.00022222622646950185,
        -0.00339271267876029,
        0.027415573596954346,
        0.010528473183512688,
        0.014506685547530651,
        0.0031123075168579817,
        -0.022091584280133247,
        -0.020777666941285133,
        -0.0010393536649644375,
        -0.04176042228937149,
        0.120284803211689,
        0.03505125269293785,
        -0.08043806254863739,
        -0.03154147043824196,
        0.013703355565667152,
        0.05477529391646385,
        0.03546193614602089,
        0.07924702018499374,
        -0.08567407727241516,
        -0.016488684341311455,
        0.0414007231593132,
        -0.06509990245103836,
        0.044689733535051346,
        -0.07143750786781311,
        -0.0951085016131401,
        -0.05765435844659805,
        0.08312993496656418,
        -0.009007545188069344,
        -0.02384895831346512,
        0.033789247274398804,
        0.037386249750852585,
        -0.034578073769807816,
        0.017861828207969666,
        -0.0065897731110453606,
        0.006438923999667168,
        -0.03224201127886772,
        -0.046339042484760284,
        -0.023190993815660477,
        0.010834304615855217,
        0.0067879799753427505,
        0.0014538951218128204,
        -0.04479524865746498,
        0.07666194438934326,
        0.0517636276781559,
        -0.020045066252350807,
        -0.09375269711017609,
        0.062222160398960114,
        -0.039657581597566605,
        0.09283438324928284,
        0.01750708930194378,
        -0.10816704481840134,
        -0.01648201234638691,
        0.13204367458820343
    ]
}