{
    "id": "W3kggpE9W8A",
    "title": "I stole it. - Caldigit TS4 Dock and Element Hub",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-06-21T19:03:53Z",
    "video_url": "https://www.youtube.com/watch?v=W3kggpE9W8A",
    "category": "Science & Technology",
    "tags": [
        "caldigit",
        "dock",
        "usb-c",
        "thunderbolt 4",
        "thunderbolt",
        "accessory",
        "wfh",
        "desk",
        "office",
        "display"
    ],
    "views": 1278167,
    "likes": 35758,
    "comments_count": 1322,
    "description": "Thanks to CalDigit for sponsoring this video!  Learn more bout CalDigit's Thunderbolt 4 docks at:  TS4:  Element Hub:   Purchase TS4: CalDigit:  Amazon US:  Amazon UK:   Purchase Element Hub: CalDigit:  Amazon US:  Amazon UK:   Purchases made through some store links may provide some compensation to Linus Media Group.  The USB-C and Thunderbolt hub market is HUGE due to laptops having fewer ports to make them more compact, so Caldigit sent over a few of their hubs for us to check out.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:18 TS4 Unboxing 0:53 *groan* 1:14 Included accessories 1:56 WHY. 2:29 This is what makes the TS4 great 4:25 Other adapters 5:16 Trying it out! 5:50 Why 2.5Gb ethernet matters 8:01 I'm taking this home! 8:32 Unboxing the Element Hub 9:57 Trying it out 10:34 Conclusion 10:47 Outro",
    "description_links": [
        "https://www.caldigit.com/thunderbolt-station-4/",
        "https://www.caldigit.com/thunderbolt-4-element-hub/",
        "https://www.caldigit.com/shop/",
        "https://www.amazon.com/CalDigit-TS4-Thunderbolt-Dock-USB/dp/B09GK8LBWS",
        "https://www.amazon.co.uk/CalDigit-TS4-Thunderbolt-Dock-USB/dp/B09GFRPGWZ",
        "https://www.caldigit.com/shop/",
        "https://www.amazon.com/CalDigit-Thunderbolt-Element-Hub-Multi-Port/dp/B08FQX8MXQ",
        "https://www.amazon.co.uk/CalDigit-Thunderbolt-Element-0-8m-Cable/dp/B08FQX8MXQ",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Is he holding balloons? - Yep. - Congratulations on whatever you're celebrating! Sponsored or not, And this one is sponsored by Cal Digit. I wouldn't normally make a video about a Thunderbolt Dock. I mean, how interesting could one of these possibly be? The answer today is, very. This is the TS4 Thunderbolt station four from Cal Digit. It features a whopping 18 ports of connectivity. Oh my gosh. Is this bigger than their old ones too? Okay. Excuse me. 18 ports of connectivity, a total of 98 Watts of power to a connected Thunderbolt compatible computer and another 20 Watts of charging out of this Type-C on the front. As for the rest of the ports, they have more pedestrian power outputs but, let's put it this way. All together, you are looking at a power brick that is not only large, but also in charge. Get it? Get it? In charge? It's large in charge. Come on! That's pretty funny! The point is, it's a 200 Watt brick for a freaking Thunderbolt Dock. I've sorted through all the accessories that matter. This one right here is a two foot Thunderbolt, four cable. You can tell, cause it says Thunderbolt four on it. Not particularly long, but certainly long enough to plug into the back of the dock, the one labeled computer right there we go, and connect to either the right or left side of your preferred device. Can also stand it up like this, but I'll talk a little bit more about that later. You've also got the power brick that I talked about before as well as a, mhm, standard C-13 power connector that goes into it. Cuz this aint no little boy. I said, I'd get to the alternative to standing it up. You can also lay it down flat with these little silicone feet things. I think they've revised the design a little bit over the years, but fundamentally it's the same idea. You just pick any one of the ribs that you like along the bottom. Oh, you know what? I'm gonna bother my OCD brothers in arms out there and I'm gonna put it on like this. - I know, you put those little feet on there, a little something like that, or however you prefer, flip that bad boy over, and it's not gonna slip around on the table. When you go to plug in a cable, we can actually, we can test that. We can actually validate that. Let's go ahead. Oh, that slips a little. Let's try it on a hard surface instead of an lttstore.com mousepad. Okay. It could be stickier. The really exciting stuff is yet to come though, because for me, it's not about the sheer number of ports or even necessarily the power output because I use my Thunderbolt Dock at a desktop. For me, it's about the kind of connectivity. So on the front, you've got your SD card. You've got your micro SD. Yeah. Having both of those natively means no more adapters sitting on my desk. You've also got that 20 watt fast chargers. So that's to quickly top up your phone or, what I'm gonna use it for, is I like to put my phone on a little stand under my monitor when I'm streaming. So this will allow me to do that and charge at the same time. I believe this one does seven and a half Watts. You've also got a Type-A on the front because Cal Digit does not discriminate against people who still use Type-A headphone microphone combo Jack. And then on the back, this right here two and a half gigabit LAN. Thank you! This is the only dock on the market that has two and a half gig ethernet combined with all this other connectivity so that you can get lightning fast access to network, shared resources. And the thing is that gigabit is fast enough for transferring small files. It's fine. But today, if you wanna edit video off of a NAS you want two and a half gig and now you've flippin' got it. It also, conveniently, has two more Thunderbolt ports off of it. That's a funny one. I'd actually love to see how this is wired up electrically because is it like the first two hops of a six device Daisy chain? Couldn't actually answer that one for you. Four Type-A's. You've got a line in headphone jack, if you don't like that combo port at the front, another USB-C but not Thunderbolt this time, and display port 1.4. So on this bad boy you can do multiple high resolution displays. Dual 4k's on Windows and up to dual 6K displays on Mac. To be clear, that's not Cal Digits fault, that particular limitation. It's just because of the way that Apple implements Thunderbolt systems kind of a little bit better. One thing that it's missing is HDMI but this doesn't bother me because USB-C or display port to HDMI adapters are pretty much a dime a dozen. In fact, they actually sent over a couple of those I think to show off. Hm. USB-C to HDMI 2.0, does up to 4k 60 I would think. So you put that bad boy on there. Oh. And if you've got dual display port monitors rather than dual Thunderbolt monitors. Oh, that's why they've got the two Thunderbolt ports! Cuz that's how they're doing the dual 5k or dual 6K displays on Mac. There you go. All right. Well, if you're not on a Mac and you need to convert one of those to a female, whoops man, display port adapter then that's how you're gonna run your dual 4k'S. Trs intressant, that's super cool. Being a PC guy though. I'm not going to be benefiting from any of those Mac exclusive features. Let's go ahead and hook it up to a gaming machine. Shall we? The big thing I wanna see here is two and a half gig LAN. Thunderbolt on PC has really gotten a lot better. I mean, it was always a little better on laptops than it was on desktops but I don't see a two and a half gig ethernet port here. Dun dun duuun. Oh, here it is. Now I got it already! TS4 Windows ethernet driver. Does this laptop actually charge off of Type-C in spite of the fact that it's a freaking gaming laptop? Okay. That's neat. I don't know that it'll do it sustained. It might just keep it from dying nearly as fast. Power brick for this laptop is fricking 250 WATTS. I am quite disconcerted that this network adapter is not showing up though. Oh, I see what you mean. Yeah, here, Brandon. Check this out. Boy, the way this is labeled is not great. Oh my God. I love.. who is this? I love his bow tie. That is amazing. Good. This is working. Thank you. Okay. Oh, that's super cool. If you don't have Thunderbolt, it'll operate as a regular USB hub. Let's go ahead and plug into the right port. There's my ethernet controller. Better make sure you plug into the right port ladies and gentlemen, you're not gonna be doing two and a half gig over your USB Type-C on top of everything else you got going on. And that, ladies and gentlemen, is why you want two and a half gig ethernet. That is literally two and a half times the speed that you would get with gigabit. You know what the craziest part is? Is there are actually consumer applications for two and a half gig now on the internet, like aside from just video editing which has been one of our big concerns over the last, well, you know, 10 years. Steam games, for example, if you have enough CPU horsepower you can actually download games in excess of 250 megabytes a second. Let's download a game. We're managing to drain the battery. We are one minute to full charge cuz we're using up 40% of the CPU to download a game. I love it. Man, I think this SSD might be kind of weak. Ooh. Okay. I saw it spike to a hundred percent usage there. What are you doing buddy? SSDs at a hundred percent. Oh, that's more like it. Oh, CPU usage is at 80%. Oh man. Yeah, we just, we don't have the horses. All right. Well maybe not on a laptop. Oh, it's an 11 900 H though. If you had a faster laptop, it's actually possible. You could crack a hundred megabytes a second downloading games. So there's a use for two and a half gig. Of course the TS4, which I will be taking home. Do do they know that already? Yes. Yeah. I'm gonna be using this for my personal rig now. This thing is so nice, man. Having all this IO on the front, now, everything I've been using a razor dock for a while that has the computer connection on the front instead of on the back which, bless their hearts, in my opinion is not the best way to do that. So having that background to the back for cleaner cable management and then having all the ports that I will need on the front, that's the way I wanna be. But the TS4 is not the only one that I'm gonna be talking about today. There's also the Thunderbolt 4/USB 4 Element Hub. This bad boy is just eight ports, but it can do an 8K display. It's much smaller and it can still do that crazy power delivery to a connected laptop. That's why it still comes with a chungus brick that's like bigger than the dock itself. Because you won't have so many devices connected to it, this brick is only 150 Watts instead of 230 for the full fat TS4. But that is plenty for strong power delivery to your computer. And three Thunderbolt three ports. There's your Power In, four USB Type-A's. And then of course, the Thunderbolt connection to your computer. That's actually super flexible. Because these are all Thunderbolt, I mean don't kid yourself. You're not gonna be getting, oh well I've got a 40 gigabit connection here. And then these are all Thunderbolts, so it's 40 plus 40 plus 40, ah 120 gigabit to connected devices. It just means that you get the capabilities of Thunderbolt ports. So that means that you can easily convert them to display port. You can easily break them out into additional Thunderbolt devices, rather than being limited to just USB devices over a Type-C connection. Because it's Thunderbolt, you can plug them into USB-C devices that are not Thunderbolt because Thunderbolt four is also USB-C capable. Let's have a look at what the cable management situation might look like for this boy. Probably go on the other side for this one. And just like that, all the high speed connectivity that you are likely to need. The TS4, is like, the deluxe one. This is the Elemental one. That's why it's called the Element Hub. It's a little smaller, right? Definitely more tote able. Man, I wonder if the Element Hub can do anything without external power? Now I'm curious. I kind of doubt it. I kind of doubt it. The answer is, no, but that shouldn't come as a surprise Thunderbolt for is cutting edge. And if you're gonna have this number of devices connected to it, obviously, it's gonna need external power. Neither of these come cheap. The Element is $250 but it's nice and compact and tote able. Whereas the TS4 is $380, pricey, but man is it ever cool and you can check them out at the links down below. Thanks Cal Digit for sponsoring this video, you for watching, make sure you get subscribed.",
    "transcript_keywords": [
        "Thunderbolt",
        "Thunderbolt ports",
        "Thunderbolt Dock",
        "half gig",
        "Cal Digit",
        "power",
        "half",
        "ports",
        "port",
        "display port",
        "Dock",
        "gig",
        "Watts",
        "Cal",
        "USBC",
        "front",
        "Element Hub",
        "USB",
        "boy",
        "Dual"
    ],
    "transcript_entity_values": [
        "Daisy",
        "40%",
        "a hundred megabytes",
        "250 megabytes",
        "6",
        "the Element Hub",
        "Thunderbolt",
        "250",
        "three",
        "One",
        "1.4",
        "80%",
        "40",
        "8",
        "one",
        "Thunderbolt",
        "USB",
        "Jack",
        "NAS",
        "Mac",
        "WATTS",
        "two and a",
        "230",
        "Apple",
        "seven and a half",
        "Windows",
        "the Element Hub",
        "second",
        "Watts",
        "Four",
        "200 Watt",
        "11",
        "IO",
        "18",
        "380",
        "two and a half",
        "LAN",
        "5k",
        "only 150",
        "Thunderbolt Dock",
        "USB Type-A's",
        "Brandon",
        "first",
        "up to 4k 60",
        "98",
        "4k'S.",
        "two",
        "Cal",
        "two and a half",
        "one minute",
        "120",
        "the years",
        "four",
        "Cal Digit",
        "USB Type-C",
        "Mac",
        "20 watt",
        "a hundred percent",
        "USB-C",
        "Dun dun duuun",
        "250",
        "SD",
        "six",
        "CPU",
        "jack",
        "10 years",
        "eight",
        "20",
        "today"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.006666101515293121,
        -0.004703294951468706,
        -0.001093285158276558,
        -0.05486522614955902,
        0.16191734373569489,
        0.012939030304551125,
        -0.020628614351153374,
        -0.01983475685119629,
        0.05672534927725792,
        -0.023160042241215706,
        0.017576010897755623,
        -0.015414594672620296,
        -0.05363571643829346,
        0.003902302123606205,
        -0.06343279033899307,
        -0.099818654358387,
        -0.021048348397016525,
        -0.03334079310297966,
        -0.029400622472167015,
        0.017761697992682457,
        -0.04072181135416031,
        -0.07402949780225754,
        0.008428379893302917,
        1.6760724975029007e-05,
        -0.018595954403281212,
        -0.0019353135721758008,
        0.03413137048482895,
        -0.06650105118751526,
        -0.049583759158849716,
        -0.06114949285984039,
        -0.02930651791393757,
        0.006159033626317978,
        0.005899743176996708,
        0.06177010014653206,
        -0.012263280339539051,
        -0.052349891513586044,
        -0.031872887164354324,
        -0.10180779546499252,
        -0.1700190305709839,
        -0.0948772057890892,
        -0.016440890729427338,
        -0.0241225678473711,
        0.0903019905090332,
        -0.0001298964343732223,
        -0.054922737181186676,
        -0.0011030570603907108,
        -0.01950054056942463,
        -0.10811332613229752,
        -0.019206224009394646,
        0.02811831794679165,
        -0.025860833004117012,
        0.006695134565234184,
        -0.04767632856965065,
        0.033291470259428024,
        -0.05260150134563446,
        0.038105230778455734,
        0.04084387421607971,
        0.00690321484580636,
        0.05690208822488785,
        0.0023621818982064724,
        0.1045691967010498,
        -0.0708027109503746,
        -0.008228461258113384,
        0.03407173603773117,
        0.0020159955602139235,
        0.018461769446730614,
        -0.026024211198091507,
        0.06122248247265816,
        -0.026604589074850082,
        0.029527733102440834,
        0.0035918799694627523,
        0.003944109193980694,
        0.0021034046076238155,
        0.04557940736413002,
        0.06791359931230545,
        -0.05722597986459732,
        -0.0030861597042530775,
        0.007375151384621859,
        0.00022005221399012953,
        0.017885014414787292,
        0.005089942365884781,
        0.02098672464489937,
        -0.04826951399445534,
        -0.008276941254734993,
        0.00536145968362689,
        0.05696550011634827,
        0.026917947456240654,
        0.014916817657649517,
        -0.03984781354665756,
        -0.10472334921360016,
        -0.037489306181669235,
        0.09416563808917999,
        0.024181252345442772,
        0.003926986362785101,
        -0.06232688948512077,
        -0.10291586816310883,
        -0.04699798300862312,
        -0.08027719706296921,
        -0.073293536901474,
        0.021769480779767036,
        0.053261689841747284,
        0.0955134853720665,
        0.0033844809513539076,
        -0.07956432551145554,
        -0.017213819548487663,
        -0.07222305983304977,
        -0.04172457382082939,
        0.0011645136401057243,
        -0.045064959675073624,
        0.011365898884832859,
        -0.009047014638781548,
        0.052687112241983414,
        -0.0919160395860672,
        -0.01532762125134468,
        -0.006924957036972046,
        0.045959923416376114,
        -0.08460597693920135,
        0.048978280276060104,
        0.012860096991062164,
        0.019653581082820892,
        0.003265805309638381,
        -0.04282678663730621,
        -0.021093880757689476,
        -0.020969055593013763,
        -0.021144600585103035,
        -0.03353547677397728,
        -0.006163730286061764,
        3.368566406693427e-33,
        -0.005757034290581942,
        0.00798264890909195,
        -0.07107382267713547,
        0.011047395877540112,
        0.15573573112487793,
        -0.007650257088243961,
        0.04532620683312416,
        0.02829861082136631,
        -0.036886803805828094,
        0.02413155511021614,
        -0.022945038974285126,
        -0.017440088093280792,
        -0.06731787323951721,
        0.020200148224830627,
        0.01030049566179514,
        -0.08803994953632355,
        -0.0425342433154583,
        0.03971778601408005,
        -0.028635220602154732,
        -0.0245564766228199,
        0.028870653361082077,
        0.06895114481449127,
        -0.0337434783577919,
        -0.07774731516838074,
        0.025548672303557396,
        0.04376940801739693,
        -0.0063860611990094185,
        -0.015151934698224068,
        0.11735633760690689,
        0.0558515340089798,
        -0.07694730162620544,
        -0.01865791343152523,
        0.03678591549396515,
        -0.045639440417289734,
        0.04765385761857033,
        0.0038195850793272257,
        -0.09319452941417694,
        -0.05184151977300644,
        0.02008405514061451,
        0.09798382222652435,
        -0.013087974861264229,
        -0.05901389569044113,
        -0.04820539057254791,
        -0.07090435922145844,
        0.007830958813428879,
        -0.05955176800489426,
        0.0833006203174591,
        0.03100626729428768,
        0.08595108240842819,
        -0.021489957347512245,
        0.037322789430618286,
        -0.03800717368721962,
        -0.0037805347237735987,
        -0.10896703600883484,
        -0.025996381416916847,
        -0.07001294940710068,
        0.005798203404992819,
        0.027705760672688484,
        0.06760942190885544,
        0.0443292111158371,
        0.02288712002336979,
        0.03940673917531967,
        0.07180772721767426,
        -0.012724482454359531,
        -0.09035426378250122,
        -7.178334635682404e-05,
        0.03192206472158432,
        -0.008393819443881512,
        -0.03174391761422157,
        -0.0006631803698837757,
        -0.033709969371557236,
        0.006787193939089775,
        0.05299152061343193,
        -0.07728426903486252,
        0.027168095111846924,
        0.036151282489299774,
        -0.07157348841428757,
        -0.02927021123468876,
        -0.03381766006350517,
        0.022525977343320847,
        -0.05289170518517494,
        -0.05138161778450012,
        0.07002292573451996,
        0.048035893589258194,
        0.020244210958480835,
        -0.046429913491010666,
        0.008376143872737885,
        -0.020281845703721046,
        -0.02125941775739193,
        0.015697620809078217,
        -0.04388328641653061,
        0.045733291655778885,
        -0.009116040542721748,
        -0.04666663706302643,
        0.014506333507597446,
        -5.6398632035079745e-33,
        0.0407341867685318,
        0.049682579934597015,
        -0.04599842056632042,
        6.809621481806971e-06,
        0.013931377790868282,
        0.05825810134410858,
        0.10474337637424469,
        -0.01972552202641964,
        0.040947336703538895,
        -0.04922934249043465,
        -0.0008156464900821447,
        -0.05346079170703888,
        -0.062038253992795944,
        -0.029680931940674782,
        -0.0118601955473423,
        0.041116490960121155,
        0.013070444576442242,
        -0.08052346110343933,
        -0.050684068351984024,
        -0.06764094531536102,
        0.05949811264872551,
        -0.04975133016705513,
        0.03676051273941994,
        0.0394233763217926,
        -0.004148813430219889,
        -0.04941351339221001,
        0.16577138006687164,
        0.029789870604872704,
        0.048781175166368484,
        -0.01288901548832655,
        -0.025911299511790276,
        -0.04038423299789429,
        -0.0352662019431591,
        0.04480211064219475,
        0.03439735621213913,
        -0.019432328641414642,
        0.06298790127038956,
        0.09576039761304855,
        -0.023406894877552986,
        -0.0019317741971462965,
        -0.010341387242078781,
        0.03786125034093857,
        -0.04289163649082184,
        0.02554452233016491,
        0.058318473398685455,
        -0.09997721016407013,
        -0.03967520222067833,
        0.04395390674471855,
        0.050795476883649826,
        0.038046594709157944,
        -0.019618533551692963,
        -0.09940194338560104,
        0.04368665814399719,
        -0.007212535943835974,
        -0.04278562590479851,
        0.06307905167341232,
        -0.012759438715875149,
        0.09425699710845947,
        0.019282091408967972,
        -0.003526723477989435,
        0.050278935581445694,
        -0.007194063626229763,
        0.011185011826455593,
        -0.025319868698716164,
        0.029698168858885765,
        -0.03197680786252022,
        0.048288848251104355,
        0.017434922978281975,
        -0.05173748731613159,
        0.01134489942342043,
        0.059211939573287964,
        -0.00558323273435235,
        0.00605046795681119,
        -0.04913803189992905,
        0.02912086620926857,
        0.058593880385160446,
        0.046325474977493286,
        -0.019178738817572594,
        0.056580085307359695,
        -0.021562447771430016,
        -0.040362585335969925,
        0.043057508766651154,
        0.07271815091371536,
        -0.026012316346168518,
        0.0619983971118927,
        0.025060756132006645,
        0.05387279763817787,
        0.03065582923591137,
        0.022163530811667442,
        0.055718593299388885,
        -0.08382826298475266,
        0.027838503941893578,
        0.042410776019096375,
        0.03140817955136299,
        0.03783094137907028,
        -5.932992053203634e-08,
        -0.07246971875429153,
        0.03702868893742561,
        -0.0819697454571724,
        0.06376825273036957,
        -0.07570751756429672,
        -0.07043813914060593,
        0.08282913267612457,
        0.030746787786483765,
        0.06540163606405258,
        -0.05761139467358589,
        -0.041827764362096786,
        -0.0589880496263504,
        -0.1019861176609993,
        0.023391682654619217,
        0.006084243301302195,
        0.09435240924358368,
        -0.0032407266553491354,
        0.02022450789809227,
        -0.023563116788864136,
        -0.029515782371163368,
        0.010802635923027992,
        0.02178211882710457,
        0.11106635630130768,
        -0.045522741973400116,
        -0.07549306005239487,
        0.0668811947107315,
        0.004641013685613871,
        0.09775590896606445,
        0.09461241215467453,
        -0.11393752694129944,
        -0.06731916218996048,
        -0.06569675356149673,
        -0.08741441369056702,
        -0.06771530210971832,
        0.027469148859381676,
        -0.03301209211349487,
        -0.07270354777574539,
        0.07493292540311813,
        0.07476367801427841,
        0.06526569277048111,
        0.01782623678445816,
        -0.05474120378494263,
        -0.023270510137081146,
        -0.01785855181515217,
        -0.0035697082057595253,
        0.04206676036119461,
        -0.015809519216418266,
        -0.007877481169998646,
        -0.01204694900661707,
        0.10887110978364944,
        -0.022953500971198082,
        -0.036499470472335815,
        -0.09648525714874268,
        0.024861793965101242,
        0.05748838186264038,
        0.04730482026934624,
        0.05085984990000725,
        0.008753934875130653,
        -0.024969622492790222,
        0.03228848800063133,
        -0.035585951060056686,
        0.025908390060067177,
        -0.008799373172223568,
        0.08696336299180984
    ]
}