{
    "id": "W3tgJ7uBDew",
    "title": "The Google Pixel 4a Wins.",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-08-04T16:30:27Z",
    "video_url": "https://www.youtube.com/watch?v=W3tgJ7uBDew",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "pixel",
        "pixel 4a",
        "google",
        "apple",
        "oneplus",
        "nord",
        "pixel 4",
        "pixel 5",
        "OnePlus nord",
        "samsung",
        "iphone",
        "iPhone se",
        "smartphone",
        "smartphones",
        "budget smartphones",
        "tech",
        "technology",
        "phones",
        "budget",
        "iPhone 11",
        "best budget smartphone",
        "pixel 4a review",
        "unboxing",
        "review",
        "camera",
        "mysterytech",
        "gadgets",
        "a51",
        "a71",
        "lg v50"
    ],
    "views": 328825,
    "likes": 13077,
    "comments_count": 1013,
    "description": "Is the Google Pixel 4a THE best budget smartphone!?   What is the WORST PlayStation?  Best vs. Worst Apple Products:  The IMPOSSIBLE Apple Challenge ft. iJustine:   EXPOSING Dave2Ds Tech  Can you TRUST Gameranx?! ft. Jake Baldino:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/OkBdZoqLqdA",
        "https://youtu.be/pQWqbZ1raE0",
        "https://youtu.be/sd8UfamDJOg",
        "https://youtu.be/53RBwdzW6fs",
        "https://youtu.be/e15q1y6cxtw",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to \"This Is\". The Google Pixel 4A at only $350 packs the exact same camera from its bigger brothers, which means that as far as quality goes, it's about as good as it gets, and with the side benefit of only costing $350. So today, why don't we take a little bit of a closer at why the Pixel 4A is for you. (Matt groans) Thank you very much, by the way. This is when I'm gonna just say thank you very much for subscribing to \"This Is\" for not only puns, but also insightful and very well-knowledged tech content. Again, thank you for subscribing because I know you've obviously already subscribed, right. You got that bell on. You got that notification enabled on your app on your brand new Google Pixel 4A. So the story with his phone is very different than it was for its predecessor, the Pixel 3A, from last year. So with that it really was a departure for Google in that they were able to deliver something which was actually a very good phone on pretty much all fronts. So the thing with the standard Pixel line, for the last several years, almost pretty much since the first one, was that while they're good phones in many aspects, there's pretty much always some problem with it, right? So whether it's battery life, whether it's screen issues, whether it's the notch, but with the Pixel 3A they delivered something which was very competitive with the standard Pixel 3 of the time, but at a significantly cheaper price. And from all the sales data it seems like the Pixel 3A sold much, much better than any of the other Pixel 4s from last year. So it makes sense that they're trying to double down on that with the Pixel 4A. Ooh, look at that. That's what the kids call a hole punch. So unlike the standard Pixel line, which currently uses bezels, which is a little bit of an older school technique, instead we have what actually is a pretty modern looking device. Little bit of a thicker chin on bottom than on top but again, you have to consider that this is $350 and it's not just 350 bucks. This phone is only available in one configuration, six gigs of RAM, 1 and 20 gigs of storage, which side note is actually a very good deal even when you compare it to something like the Nord or specifically that iPhone SE, you have to spend a lot more to hit that same level and you only get it in one color, just black because matte black is cool, I guess. Ah, I do have a SIM card and it's not here because I'm not prepared because I'm making a \"This Is\" video. - [Matt] What? - (clears throat) Don't mind me as I take my SIM card out of the OnePlus Nord, this phone's probably biggest competition. - [Matt] That's a bold claim. - Look, when you're talking about this sort of low to mid range smartphone market, I think that there's a lot of talk about the iPhone SE. The iPhone SE, to be very clear, is an excellent phone for $400. However, if you are purchasing a Pixel device, my thought is you're probably not completely just cross-shopping it with an iPhone. You probably actually really care about Android as Android has many advantages. And also when you look at the iPhone SE, as good of a phone it is and we'll definitely talk about it in a little bit, it also has some pretty big compromises, mostly the design, which is very, very old at this point. Whereas something like the Nord, something like the Pixel 4A feel like a much more modern phone. There's a train outside. I'm going to ignore that. All right, here comes the test. How's the keyboard feel? Ooh, it's a nice little vibration motor. I just typed teat. - [Matt] Why? - I was trying to type test and I types teat. - [Matt] This is the whole reason why me and Ken still come to the office every day. - 'Cause otherwise people would be stuck watching this. You know it's extra bad because I'm editing this, so I'm gonna leave in all my really dumb jokes. - [Matt] Oh yeah. - One thing I will immediately say about the Pixel 4A, this is a really nice size. So if you look at like something compared to the Nord, I mean, it is much, much smaller. And personally, I really like that. I'm a fan of the Z Flip flippy boys and the smaller phones of the world and this to me is really comfy. Woo, woo, do you see that, my friends? So this little hole on the chassis, just to fill your kids in who might not be familiar with this, this little hole in the chassis is used for what us old timers call a headphone jack. So this was before the days of Bluetooth where you had to use this thing called a wire to listen to your music. It was very archaic, I know, but thankfully our friends over at Google have continued to support the headphone jack, and I very much appreciate that. Am I going to use it? Probably not. But I like to have it. So when you put the Pixel 4A side by side with its closest competition, the iPhone SE, which comes in at a full $50 more expensive. So this is 350, this starts at 400, although it is actually $450 if you want that same amount of storage. And then of course we have the big boy, the OnePlus Nord, which is $450, or thereabouts based on your currency. However, it does have that 120 gigs of storage standard. So the thing that I like about the Pixel right off the bat is the camera. So this has the same lens and sensor as the Pixel 4, as well as the Pixel 3, and I think actually the Pixel 3A. What that means is paired with their excellent software, you are getting an excellent, excellent camera on the Pixel. So the Pixel 4A still uses that same single camera. So there's no telephoto, there's no ultra wide, same as the iPhone SE to be fair. When you look at the OnePlus Nord, well this is camera city, but camera city doesn't actually mean much because while yes, you have four camera sensors, you really only have one and a half. So the main camera is quite nice, and I'll show you a couple of photos from that, but the thing is, the ultra wide is nice to have but not particularly good. The macro camera is trash and the depth sensor is next to useless when you consider that both of these phones with only a single lens are able to take actually really nice looking portraits. Now, of course, there's more to a phone than just the camera experience, but when it comes to the Pixel, that has really been their main selling feature. The Pixels have not only good hardware, but also really great image processing with things like night sight that brings out tons of detail, much more so than the other two phones. But I'm sure you've seen all the MKBHD videos on why the Pixel 4A is a interesting foray into the budget phone category. Why don't we talk about some of the things that actually make the Pixel 4A just a little bit different? Like how there's a Discover Something New pet tab on the Play Store and it's \"Minecraft\", \"Clash of Clans\", and \"Call of Duty\", probably the three most popular games ever. Now when you compare the Pixel 4A with something like the iPhone, there are a couple of major advantages on the iPhone front. First of all is longevity. This iPhone we know pretty much for a fact is going to be getting software updates for years and years and years. Now, to be fair, Google's actually promised I believe two to three years based on actual full updates and security updates beyond that for Android on the Pixel, which is very good, probably at least equal if not better than what you're going to get on the Nord, but it is not going to have the performance and it's not going to have the software support for longterm use. Usually that's not really a problem as far as I'm concerned for a $350 phone, but when you have Apple out here with a phone that's a little bit more expensive and something that I would feel completely comfortable saying, \"Hey, you know what, \"this can be your next phone for the three, four years \"in the future.\" That definitely has something to say about that. So spec-wise, this is not the most powerful phone here. So it is powered by the Snapdragon 730G processor, which is a little bit on the older side. It's about a year and a half old at this point. And while the original Pixel 3A was, I would say, borderline too slow, responsiveness and sort of general isn't bad, but it cannot hold a candle to the incredible iPhone SE, which has that Apple A13 processor, really the same kind of responsiveness as you get out of something like a modern iPhone, and even something like the OnePlus Nord, which while yes, there's a little bit of a better processor, but importantly it has a 90 Hertz display, which really does a lot to give you that feeling of fluidity, especially considering how much OnePlus does to really optimize this phone for speed. Now using the Pixel, it's certainly not slow, but I wouldn't call it fast. I'd call it what you'd expect for a $350 phone, especially when you get into things like gaming, you're going to start noticing the limits there. But if that's the price you have to pay to pay a lower price for the phone, then I'm okay with that because really at the end of the day, this is a $350 phone. So it does have its 60 Hertz display, but it's an MLO display, right? It looks really nice and importantly, you have none of that headphone jack, but if I had a... I would show you. You know what a headphone jack is. I already made that joke. But we also do have dual stereo speakers. A game you can see again by our friends over at Xbox Game- That's really good. Something else that the Pixel has this year is thankfully pretty solid battery life. So it has a slightly larger than 3,000 milliamp hour cell, which might not sound impressive but the nice thing is that it does have that battery life in a sort of device that has a fairly low-end processor, especially considering it's only a 60 Hertz display, you should have no problem getting through a full day of use with this. So when you look at the Pixel 4A, it's very easy to talk about the compromises. It's good for the price. It's good, except for this. It's good except for that. But the thing is this actually makes a lot of smart decisions. Obviously, it is very clear that the camera is important, but things like the plastic build actually isn't so bad. I mean sure, would I love to have full water resistance and wireless charging? Absolutely and that is one of the real advantages I think a lot of people don't really talk about too much with the iPhone SE, but I'm willing to get over that, especially at the $350 price point. Would I love to see a 90 Hertz display from the Nord? Absolutely. And something else I would love to have is 5G. So a lot of people talked about the lack of 5G on the Pixel 4A, and to be clear, there is a 5G version of this phone coming at some point. They've sort of oddly pre-announced the Pixel 5A 5G, wait 4A 5G. 4A 5G? - [Ken] Pixel 4A- - But there's also a Pixel- - [Ken] And the Pixel 5. - Okay, so here's the lineup: the Pixel 4A 4G, the Pixel 4A 5G, the Pixel 5 5G. - [Ken] You don't know about the Pixel 5 5G. - The Pixel 5's gonna have 5G, Ken. It's gonna have 5G. It's gonna have 5G. You also have things like the fingerprint sensor on the back. Look, I'm happy that the OnePlus has the in-display fingerprint sensor. Like cool, that makes it for like great marketing. It's not as good. Straight up, it is not as good as having a real fingerprint sensor. I mean, even the iPhone has kept it on the iPhone SE and they've been doing face ID for years. I really liked the idea of actually having that physical one, especially given the days that we live in, where I'm using my fingerprint sensor that all the time, 'cause face ID doesn't work with certain. But you know what I like about the Pixel 4A? It doesn't have anything you don't need. So unlike the Nord, which has a hundred cameras on the back and only one and a half are useful, this, even though it has that same kind of modern design, has one camera and that's fine 'cause it is a very, very good camera. Would I like to see an ultra wide? Absolutely, or even telephoto, whatever the case, would be nice, but this is tried and true to hardware, and importantly from Google's perspective it's that same sensor... That is a really loud train. It's the same sensor that they've been using for awhile, which means I'm sure it's gotten cheaper and cheaper, which enables us to get the same flagship image quality that we've expected on phones twice this price now at $350. I'm a little concerned about the build quality. I personally really liked the way this plastic feels, but when it comes into the jerry-rig everything durability test, I'm a little bit concerned. But on the whole of it, I think Google have made a lot of very smart decisions with the Google Pixel 4A. And if I'm looking for a phone in this price point, all three of these really are excellent options, right? The Nord, if you can buy it, is a great phone, and if you can spend that extra $100, you're getting a better phone, but there's no doubt that there's a lot going for this Nord but it's bigger, it's not as available in as many places, and especially when you look at the difference between 350 and $450, that's significant. The iPhone SE is a little bit more interesting to me. It's an older phone in a lot of senses. It has sort of have a good camera, but it's an old sensor with like sort of better processing, which means that it, generally speaking, does a good job, but if you like start pixel peeping it's not quite as nice. And on the whole of it, I do prefer the Pixel camera. And you have the older school design, you have the mediocre battery life, but you have legitimately really nice things like an incredibly fast processor, and you have the water resistance, and you have that wireless charging. But with the Pixel 3A, it's sort of everything you need and nothing you don't. It's got good battery life, good screen. A lot of these things that you expect and need to use on a daily basis, but at a really, really affordable price. If it's me, I don't think I'm gonna wait for a Pixel 4A 5G. I mean obviously, we need to wait and see what the differences are. Actually, it seems like it may be slightly larger. Obviously it's going to have a bit of a better processor at 5G and stuff, but like, look 350, yeah, you've got me on board. $500? Unless it is a major step forward that one's a little bit of a tougher sell. Which means that as far as I'm concerned, this Google Pixel 4A is one of the most exciting phones of the year. Not because it is great, not because it excels, but because it brings so much how many very smart features to a really compelling price point, and it doesn't bring all the gimmicks that you don't need that you don't need to pay for. So that, my friends, is my video on the Google Pixel 4A. Make sure to subscribe here on \"This Is\" for other Austin Rant Corners like this, and make sure to let Matt know that even though he's 10 feet away and yelling at me off camera, that he's always here in spirit, no matter if he's on camera or not.",
    "transcript_keywords": [
        "Pixel",
        "Google Pixel",
        "phone",
        "Nord",
        "good",
        "camera",
        "iPhone",
        "standard Pixel",
        "Google",
        "bit",
        "OnePlus Nord",
        "Pixel camera",
        "Pixel line",
        "standard Pixel line",
        "lot",
        "nice",
        "phones",
        "sensor",
        "thing",
        "things"
    ],
    "transcript_entity_values": [
        "90",
        "Android",
        "Google Pixel 4A",
        "three",
        "Call of Duty",
        "5",
        "the end of the day",
        "Pixel 3",
        "Android as Android",
        "the OnePlus Nord",
        "20",
        "jack",
        "MLO",
        "One",
        "four years",
        "the Pixel 4A",
        "MKBHD",
        "500",
        "RAM",
        "every day",
        "10 feet",
        "400",
        "OnePlus",
        "a hundred",
        "Nord",
        "a full day",
        "4A",
        "Google",
        "the last several years",
        "Pixel 3A",
        "Matt",
        "Google Pixel 4A.",
        "the Pixel 4A",
        "daily",
        "Snapdragon 730G",
        "100",
        "Pixel 4A",
        "this year",
        "Xbox",
        "first",
        "350",
        "Minecraft",
        "last year",
        "Pixels",
        "4s",
        "50",
        "the Pixel 3A",
        "the days",
        "the Google Pixel 4A. Make",
        "only $350",
        "400",
        "Bluetooth",
        "just 350 bucks",
        "Clash of Clans",
        "the year",
        "1",
        "First",
        "only one and a half",
        "Pixel",
        "450",
        "one",
        "Apple",
        "four",
        "the Play Store",
        "today",
        "about a year and a half old",
        "60",
        "six",
        "120",
        "years",
        "3",
        "Hertz",
        "Austin Rant Corners",
        "two",
        "350",
        "the OnePlus Nord",
        "two to three years",
        "A13",
        "iPhone",
        "Ken",
        "between 350 and $450",
        "the Google Pixel 4A.",
        "iPhone SE"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "FAC",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "FAC",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.0579395517706871,
        -0.022948328405618668,
        0.12135962396860123,
        -0.11717303842306137,
        0.03292278200387955,
        -0.03340676799416542,
        0.09303121268749237,
        0.04018512740731239,
        0.00024306114937644452,
        0.09537415951490402,
        -0.025882866233587265,
        0.004872883204370737,
        0.03735596314072609,
        -0.04715804010629654,
        -7.602676305396017e-06,
        -0.0064826603047549725,
        0.1563492715358734,
        -0.043215081095695496,
        -0.04217381030321121,
        -0.022361380979418755,
        -0.00852108746767044,
        -0.09978900849819183,
        0.07425709813833237,
        0.007812511175870895,
        0.0724925547838211,
        0.06749536097049713,
        -0.05846488103270531,
        -0.047856930643320084,
        0.025960233062505722,
        -0.056846700608730316,
        -0.041420355439186096,
        0.05825185775756836,
        0.025531047955155373,
        0.007269634865224361,
        -0.026074526831507683,
        -0.05161146819591522,
        0.0454905703663826,
        -0.007554350886493921,
        -0.07408614456653595,
        -0.008369995281100273,
        0.02025877870619297,
        -0.0005913787172175944,
        -0.02369767799973488,
        -0.003314815228804946,
        0.050621502101421356,
        -0.004521443974226713,
        0.05033772066235542,
        -0.052643291652202606,
        0.014172585681080818,
        -0.028577597811818123,
        -0.05803085118532181,
        -0.05200006067752838,
        -0.023793622851371765,
        -0.032336920499801636,
        -0.07400015741586685,
        0.07317356020212173,
        -0.024580301716923714,
        0.05658784881234169,
        0.08426094800233841,
        0.06469064205884933,
        -0.03303580358624458,
        -0.08672415465116501,
        -0.013469279743731022,
        0.08321022242307663,
        0.048519376665353775,
        -0.03421465680003166,
        0.04495963081717491,
        -0.058637503534555435,
        -0.03569250926375389,
        0.042847998440265656,
        -0.042431656271219254,
        0.04715842381119728,
        0.0572253093123436,
        0.005165851209312677,
        -0.05285406485199928,
        0.015178713947534561,
        0.03457724675536156,
        -0.043124720454216,
        0.004115922376513481,
        0.044302619993686676,
        0.07506158202886581,
        -0.05710212141275406,
        -0.04132736101746559,
        0.03729616850614548,
        0.005647558718919754,
        -0.034460581839084625,
        0.06438270211219788,
        -0.027492662891745567,
        0.005639102775603533,
        -0.06597211956977844,
        -0.06875969469547272,
        0.09263952076435089,
        0.05435844883322716,
        0.04074942320585251,
        -0.005202277563512325,
        0.018314167857170105,
        0.007337403483688831,
        -0.09654801338911057,
        -0.030849071219563484,
        0.038688335567712784,
        0.009952731430530548,
        0.04030847176909447,
        0.0072524333372712135,
        -0.04077734798192978,
        0.02874414063990116,
        -0.035111404955387115,
        -0.037454716861248016,
        0.046625569462776184,
        0.060468629002571106,
        0.08913015574216843,
        -0.044807322323322296,
        0.058515194803476334,
        -0.053527962416410446,
        -0.0235966295003891,
        0.028308838605880737,
        0.016869505867362022,
        -0.010056096129119396,
        0.037350382655858994,
        0.11053307354450226,
        -0.014133798889815807,
        -0.029502801597118378,
        0.00497311120852828,
        -0.03364625945687294,
        -0.05185212194919586,
        0.012252582237124443,
        -0.05723948031663895,
        -0.0932602509856224,
        3.498998525176699e-33,
        0.041196323931217194,
        0.16468188166618347,
        0.024239422753453255,
        -0.053143247961997986,
        -0.052869055420160294,
        0.05540769174695015,
        -0.0006721287500113249,
        0.08043254911899567,
        -0.06337065249681473,
        0.0015406281454488635,
        -0.003272317349910736,
        0.01854219101369381,
        -0.11370639503002167,
        0.10705297440290451,
        0.0948159322142601,
        0.019690461456775665,
        -0.07134167104959488,
        -0.04035550728440285,
        0.005239623133093119,
        0.02853359840810299,
        0.007426328491419554,
        -0.04704853147268295,
        0.03158210590481758,
        -0.019910555332899094,
        -0.01957886293530464,
        -0.03648347035050392,
        0.027258222922682762,
        -0.023572945967316628,
        0.07829917222261429,
        -0.002632799791172147,
        -0.10831068456172943,
        -0.03651707246899605,
        0.040367648005485535,
        -0.06452278047800064,
        -0.02346917800605297,
        -0.060262180864810944,
        -0.04494626820087433,
        -0.07078667730093002,
        -0.006815638858824968,
        0.010781554505228996,
        -0.09873782098293304,
        0.08696135878562927,
        -0.042606793344020844,
        -0.08076022565364838,
        0.04163037985563278,
        0.017555831000208855,
        0.0153976334258914,
        -0.11217646300792694,
        -0.026507556438446045,
        0.035287268459796906,
        -0.0032092209439724684,
        -0.03650181367993355,
        0.001063077594153583,
        0.04038248583674431,
        -0.04572005569934845,
        -0.03763137757778168,
        0.023474162444472313,
        -0.03388671576976776,
        -0.026608221232891083,
        0.052439965307712555,
        0.00634737079963088,
        -0.01196214184165001,
        -0.019072286784648895,
        0.015802044421434402,
        -0.09449683129787445,
        -0.004995798692107201,
        0.11624639481306076,
        0.05789355933666229,
        -0.10542067885398865,
        0.04025058075785637,
        -0.012709219008684158,
        -0.02988271228969097,
        0.014404863119125366,
        -0.08437281101942062,
        0.04698190838098526,
        -0.03199297562241554,
        -0.054567478597164154,
        -0.009414993226528168,
        0.009115166030824184,
        0.031127847731113434,
        -0.046809691935777664,
        -0.0036840832326561213,
        0.027954092249274254,
        0.010688235983252525,
        -0.02425352670252323,
        -0.010852408595383167,
        0.08405498415231705,
        -0.01872413605451584,
        -0.06400912255048752,
        0.08876639604568481,
        -0.07783206552267075,
        -0.047404881566762924,
        0.014056739397346973,
        0.07097402215003967,
        -0.003125555580481887,
        -4.0098709414379575e-33,
        0.02379475347697735,
        0.021661147475242615,
        -0.006075231358408928,
        0.08174107223749161,
        -0.03817466273903847,
        -0.09653377532958984,
        0.08230650424957275,
        0.02142527885735035,
        0.049200911074876785,
        0.026516130194067955,
        0.0039381664246320724,
        0.051175933331251144,
        0.02481885626912117,
        0.02249990962445736,
        -0.006273061502724886,
        -0.11196664720773697,
        -0.0025947480462491512,
        -0.1240634173154831,
        -0.004742955788969994,
        -0.07369505614042282,
        0.07625545561313629,
        0.057388775050640106,
        -0.00402334239333868,
        0.022358054295182228,
        0.014512901194393635,
        0.02246580272912979,
        0.011780617758631706,
        0.02071538195014,
        -0.027314115315675735,
        -0.023991668596863747,
        0.0395665280520916,
        -0.021507635712623596,
        -0.0005975650274194777,
        0.005636192392557859,
        0.0713353231549263,
        0.013220155611634254,
        0.0038358373567461967,
        0.0025873889680951834,
        0.018903784453868866,
        0.023228339850902557,
        0.02406739443540573,
        0.027643343433737755,
        0.00822425913065672,
        -0.05483251437544823,
        0.0880487784743309,
        -0.035700805485248566,
        0.01311786100268364,
        0.002294717589393258,
        0.03273991122841835,
        0.11021679639816284,
        0.009219398722052574,
        0.04065508022904396,
        -0.06493401527404785,
        0.03599796071648598,
        -0.040687430649995804,
        -0.12235047668218613,
        -0.09555946290493011,
        0.027606315910816193,
        0.007050658576190472,
        -0.01283408422023058,
        0.03291146829724312,
        -0.007661177311092615,
        -0.0886414647102356,
        0.029850898310542107,
        -0.06103861331939697,
        0.04249291867017746,
        0.06461849808692932,
        0.012755435891449451,
        0.01847952976822853,
        0.037141475826501846,
        -0.04598042741417885,
        -0.013747958466410637,
        -0.043443191796541214,
        -0.044297460466623306,
        -0.05450885742902756,
        0.12760363519191742,
        -0.0010941236978396773,
        0.04782112315297127,
        0.042741771787405014,
        -0.0499679259955883,
        0.01724250055849552,
        0.07305677980184555,
        0.07832390815019608,
        -0.006895992439240217,
        0.016092924401164055,
        0.021242760121822357,
        0.045385800302028656,
        -0.016602810472249985,
        -0.023057062178850174,
        0.02250664494931698,
        -0.017067406326532364,
        -0.004869597032666206,
        -0.061219509690999985,
        0.03480033576488495,
        -0.02824591100215912,
        -5.4368005208971226e-08,
        0.05940060317516327,
        -0.014262759126722813,
        -0.021430157124996185,
        -0.0013084253296256065,
        0.0377763994038105,
        -0.07359156757593155,
        -0.06494153290987015,
        0.03538050875067711,
        0.14382104575634003,
        0.01464913971722126,
        0.03789524361491203,
        -0.04388881474733353,
        -0.05214030668139458,
        0.014044812880456448,
        0.04430863633751869,
        0.06604157388210297,
        -0.07285076379776001,
        -0.036139823496341705,
        -0.003159365151077509,
        -0.036339014768600464,
        -0.03275708481669426,
        0.019111957401037216,
        -0.06912986189126968,
        -0.05163368210196495,
        -0.04968787729740143,
        0.007180075626820326,
        0.009780894964933395,
        -0.028049256652593613,
        0.014885999262332916,
        0.028705671429634094,
        -0.02375543676316738,
        -0.031076494604349136,
        -0.0026546332519501448,
        -0.08608775585889816,
        0.017191484570503235,
        -0.07537460327148438,
        -0.0013719566632062197,
        -0.04599861800670624,
        0.10222967714071274,
        0.002427105326205492,
        0.023329926654696465,
        -0.04384751617908478,
        0.07017837464809418,
        -0.025786206126213074,
        -0.016877558082342148,
        -0.01820942759513855,
        -0.024318788200616837,
        -0.07091612368822098,
        0.010729523375630379,
        0.0479251965880394,
        -0.08039223402738571,
        0.015691634267568588,
        -0.03378232568502426,
        -0.012085860595107079,
        0.06160885840654373,
        -0.06145481765270233,
        0.026128213852643967,
        -0.033545173704624176,
        -0.07251344621181488,
        0.046086281538009644,
        0.10480425506830215,
        -0.05021796002984047,
        -0.024882225319743156,
        0.06447158753871918
    ]
}