{
    "id": "w5rb7rrmp1c",
    "title": "No, You’re NOT an IDIOT for WAITING To Buy a Graphics Card…",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2022-07-14T19:45:48Z",
    "video_url": "https://www.youtube.com/watch?v=w5rb7rrmp1c",
    "category": "Science & Technology",
    "tags": [
        "greg salazar",
        "graphics card",
        "gpu prices",
        "graphics card prices",
        "gpu market",
        "gpu inventory",
        "when to buy a gpu",
        "jayztwocents"
    ],
    "views": 175587,
    "likes": 12596,
    "comments_count": 2684,
    "description": "I felt compelled to create this video in response to criticism involving the timing of purchasing graphics cards. I know that not everyone will agree with me. Thanks for watching, regardless.   Consider supporting us on Patreon!   SPONSOR: Snag an OEM Windows 10 Pro key for $16 using code 'SKGS' for a 25% discount: Win10 Home ($15): Office 2019 ($48):   Check out Jay's original video:  Check out Buildzoid's mining graphics card video:   Our Graphics Card Market Value Analysis chart, available for download:    My studio gear on Amazon: Sony A7C (Primary):  Sony a6600 (Secondary):  Sony a6400 (Webcam):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.",
    "description_links": [
        "https://www.patreon.com/gregsalazar",
        "https://bit.ly/Win10SKGS",
        "https://bit.ly/homeSKGS",
        "https://bit.ly/2019SKGS",
        "https://youtu.be/p79H_XOwpZo",
        "https://youtu.be/1T0npiqjEWQ",
        "https://www.dropbox.com/s/pcxx6rt9ox7gn2f/Graphics%20Card%20Market%20Value%20Analysis.xlsx?dl=0",
        "https://geni.us/lOeoIA9",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "- They do not want that 30 series in stock so they are waiting until these are gone and if you're waiting, then you're an idiot because they're gonna be gone and you're gonna find yourself in a situation where you can't get either. Again, history repeats itself and people are still gonna find themselves in this spot because they refuse to listen. So for those of you out there that are intelligent enough to understand what I'm saying, go buy your graphics card right now if you are in the market and you're waiting for 40 series to launch for 30 series price and drop. It just dropped, what are you waiting for? Stop this video and go buy something whether it be AMD or NVIDIA now. I know I sound angry because some of you are stubborn as (bleep) and you're gonna not listen and you're gonna miss out and I'm trying to (bleep) help you, so go. - No, you're not an idiot for choosing to wait to buy a graphics card. What's the rush, Jay? I mean, come on, like I get it. 40 series is coming and yeah, you know, 30 series stuff's gonna dry up because NVIDIA's no longer producing 30 series cards they're penting up supply in preparation for the new generation of card to be launched soon, we expect, I get that, but prices still suck for a lot of SKUs out there. Now, you conveniently point out cards like the 3090 Ti, which is already a fricking dog (bleep) value card to begin with. I don't know any gamer who's just like, \"I gotta have the 3090 Ti,\" okay, I know a few, but they just have too much money to burn they don't care about value. The real value lies in the 3060 cards, the 3070s, the 3080s, even cards like the 3050, right? None of these cards are at MSRP at new, they're not, and I don't talk a lot about new cards to begin with because the real values in the used market. I know there's a big scare about, \"Oh, my card might have been mine with if I bought a used and I'm just, I don't wanna deal with the maintenance or the reliability issues with a mine card.\" We have videos talking about this build so I just came out with a very relevant video as well regarding mining cards, I'll have that link below if you wanna check it out. Needless to say, some folks won't be convinced that used cards are worth it, I get that, but a majority of you who are concerned about value should at least entertain sites like eBay, local listings, Facebook Marketplace, OfferUp, Canadian, Kijiji, check them out, do the due diligence, I don't think you'll regret it. That said, even if we focus on just the new markets, pointing out the fact that cards like the 3090 Ti have been slashed by several hundred dollars really does the general consumer no good because the general consumer is not interested in a card like that to begin with. - 3090 Ti dropped from $2,000 MSRP to $1,599 and it's my understanding that price is gonna go even lower, but right now, like at the time of making this video, $1,599 from 1,999, that means that puts the 3090 Ti in basically the same price category as the 3090. - Yes, the 6,000 XT and the 6,900 XT have become pretty decent values, but again, they are still selling for $7,900, I mean, it's not practical for the general consumers. Let's talk about general consumer cards. The RTX 3060, 60 series cards traditionally have been very good values. We can't find one here in this list at MSRP. They simply do not exist. You can check Amazon exactly the same thing. It can't find a 3060 MSRP, but then why are you suggesting that folks are idiots for not buying these cards over MSRP? That doesn't make any sense to me. There might be the unicorn listing that you should absolutely jump on, sure, we'll both agree there, but the general consensus this market is conveying is that prices have not fully softened yet and so, again, there's no rush here, just wait. Let's say I'm wrong, let's say in two months time NVIDIA announces 40 series cards and then we had the exact same shit show we had with Ampere where at first Turing owners dumped their cards, which would be good for you and I trying to buy, right? Especially in the used market. Turing 2080 Tis were selling for four, $500, insane at the time and then they got screwed over when they couldn't get an Ampere card at a decent price because scalpers, minors, and COVID-19 supply chain shortages just jacked prices up across the board, right? That was a perfect storm of events. For that to happen again, the chances are extremely small, but let's say they do, we are already screwed as it is. The world's economy is in a total rut right now. We've printed more money in one year in this country than we ever have in the history of the US combined and that's not supposed to have any ramifications at all, right? So imagine if that scenario were to occur again within a three year time span, at that point, you're not gonna care whether you have a 20 series, 30 series, or 40 series graphics card in your gaming PC. These are not necessities, unless you need them for work, gaming on a graphics card is not a life changing thing. What is life changing is whether or not you can afford to put food on your table, which I think will become more of an issue, unfortunately, not only in this country, but across the world in the coming months. With what the fed is doing with interest rates nowadays and the US dollar determines quite a bit around the globe, we have a ton of influence with this currency. It's gonna get pretty dang bad and so if I'm wrong and that happens, you're not gonna regret buying a card. You'll actually probably be happy that you save that money for something more important, but let's say I'm wrong in another sense, let's say the prices don't really change much at all, no harm, no foul, at least you tried, right? And let's say, I'm right, I saved you a few hundred dollars, right? And good news, cards are more affordable at that point in time and you can probably pick from a wider range of cards, especially used, which is even better for the general consumer. So again, I don't understand the rush, you're not an idiot, this video, again, you could already tell it's not gonna have a pre-roll or anything in it you might see a YouTube banter too, but that's it. Just wanted to make this off the cuff in response to that 'cause I don't want you to feel pressured into buying now, absurd. First of, prices still kind of suck, with respect to MSRP, for a lot of skews out there, few exceptions, 6,000 XT, 6,900 XT, few others if you're into cards like that, but most of the value oriented cards, 60 series cards let's say from Ampere, are not ripe enough yet and just don't be pressured into buying. Again, I don't get why Jay ignored the used market entirely in that video first of, you know. It's very obvious EVGA and NVIDIA and the companies like they will make money when I sell my EVGA graphics card secondhand on eBay. They make $0 from that sale and I get a little bit of brand exposure, but that's insignificant in the grand scheme of things. They make money when you buy a new card or when you buy from their B-Stock website, which is actually a really good site, you should check out. They don't make money when you buy used that can affect company direction let's say, especially if the video sponsored I don't think Jay's was, but just keep in mind that is something to consider and that might be why you don't hear the used graphics card market brought up a lot of times on certain channels, but, again, I think it would be a sin to look past them. I just wanted to make this just to let you know that no, you are not alone if you feel like an idiot for not buying now, I guess that makes me an idiot too because, you know, we said in our video that the sweet spot is gonna be around August, September, I stand by that, I think we're still gonna have a pretty decent dump of cards like we did when Ampere was announced on the used market with Turing and Pascal and older cards people will just be anticipating the next great thing, that's what consumers do. It's that shiny new object they have to have it regardless of value. So there will be that, but I think demand overall will still be lower because of what we're going through. As a nation, as a fricking- As a planet. Most of us are feeling the effects right now in developed or developing countries and it's, again, it's a situation that you shouldn't feel pressured into. So I don't think you have much to lose at all by choosing to wait, I think it's the safe, smarter play, Jay disagrees, but I think that the evidence speaks for itself. We have a very relevant data set that I'll link in the description. We've talked about many videos, we've collected pricing data over the course of a year for 64 different graphics cards and our projections suggests, these are just projections they're not, you know, I don't have a crystal ball, but they suggest that prices will continue to soften. That's why I think you should wait and again, in light of 40 series coming up the actual announcement hasn't been made yet I know it kind of seemed like Jay was suggesting that it has, we already know everything we need to know about 40 series to make the decision, that's not true because the general consumer doesn't yet. The general consumer isn't following rumors 24/7, we are as an industry because that's our jobs, right? The enthusiast will, but the general consumer won't and so when NVIDIA actually announces those new cards, shows what they're capable of and shows the pricing, that's when I think we'll see a dump, might not be a big dump, especially if the 40 series stuff is expensive relative to 30 and 20 series, well 20 series is pretty expensive to begin with, but 30 series are pretty darn good. We might not see as big a dump, but that dump might still be there and I think that's worth waiting for or at least waiting close to that because you'll still have plenty of speculators offloading their older cards in preparation for the new ones that folks are inevitably gonna want because they're new, right? I have to have the newest, most relevant thing in tech. With that, let me know if you agree, disagree, I'm sure I'll get some hate for this, but Jay's a big boy so am I. His video was- It wasn't a direct response to mine, of course, but the timing was just too ideal to ignore because in our video we said that waiting was the sound thing to do, it made the most sense and again, we had plenty of data to back that up and Jay's video, published shortly thereafter, he says, \"If you wait, you're an idiot.\" I have to respond to that. What we said is not idiotic. No, you're not an idiot if you wait. I think it makes the most sense and look if we're wrong at the end of this, the world will keep spinning, but if we're right, you'll be glad that you saved a few extra bucks, hopefully you save $100, $200 depending on the card, but that's what we're in this for. I'm in this for, you know, obviously your best interest, if I just said a bunch of wrong things all the time you wouldn't wanna watch, you wouldn't trust me, but I'm not alone either there are other YouTubers, Brian over at TechCity has a very similar feeling on this matter, I'm sure others as well are out there, but yeah, don't feel pressured into buying now. Just wanted to say you're not alone, okay? Thanks for watching, my name's Greg, thanks for learning with me.",
    "transcript_keywords": [
        "cards",
        "card",
        "series",
        "graphics card",
        "series cards",
        "general consumer",
        "Jay",
        "video",
        "waiting",
        "MSRP",
        "general",
        "make",
        "NVIDIA",
        "consumer",
        "buy",
        "market",
        "idiot",
        "series graphics card",
        "graphics",
        "prices"
    ],
    "transcript_entity_values": [
        "first",
        "2080 Tis",
        "Ampere",
        "Ampere",
        "Facebook Marketplace",
        "$2,000 MSRP to $",
        "3090",
        "3070s",
        "I.",
        "YouTubers",
        "1,999",
        "one year",
        "3050",
        "1,599",
        "August, September",
        "Amazon",
        "64",
        "3080s",
        "a few extra bucks",
        "Turing",
        "Pascal",
        "AMD",
        "30",
        "the coming months",
        "0",
        "7,900",
        "YouTube",
        "100",
        "fed",
        "Kijiji",
        "Ampere",
        "OfferUp",
        "four, $500",
        "Canadian",
        "6,900",
        "two months",
        "a three year",
        "about 40",
        "several hundred dollars",
        "B-Stock",
        "eBay",
        "40",
        "XT",
        "a few hundred dollars",
        "Brian",
        "EVGA",
        "a year",
        "Greg",
        "MSRP",
        "200",
        "3060",
        "First",
        "60",
        "Turing",
        "COVID-19",
        "US",
        "6,000",
        "20",
        "NVIDIA",
        "Jay"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "NORP",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "NORP",
        "NORP",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.07196055352687836,
        -0.024266015738248825,
        -0.033308058977127075,
        -0.04656287655234337,
        0.09410160779953003,
        0.03060547262430191,
        0.04878696799278259,
        0.051315758377313614,
        0.017831556499004364,
        0.013930104672908783,
        -0.006116057280451059,
        0.021173948422074318,
        -0.01011660136282444,
        0.04876704514026642,
        0.04769645258784294,
        0.03707851469516754,
        0.04633720964193344,
        -0.052005212754011154,
        0.00975755788385868,
        0.023738352581858635,
        -0.07959459722042084,
        -0.07616516947746277,
        0.014731276780366898,
        -0.019389504566788673,
        -0.006580015178769827,
        0.03243456408381462,
        0.046788327395915985,
        -0.020941976457834244,
        -0.026883522048592567,
        0.03636679798364639,
        -0.02326607145369053,
        0.05775366351008415,
        0.08275215327739716,
        0.02857227995991707,
        0.017973465844988823,
        -0.1364547461271286,
        0.06404609233140945,
        -0.0036602350883185863,
        -0.026058657094836235,
        -0.05224131792783737,
        -0.04262711480259895,
        -0.005519528407603502,
        -0.010461811907589436,
        0.01142033003270626,
        0.02886711061000824,
        -0.06513369828462601,
        0.02544739656150341,
        -0.03288397192955017,
        -0.040279217064380646,
        0.003846000647172332,
        -0.03011615388095379,
        -0.07608503103256226,
        0.04311541095376015,
        -0.11167638003826141,
        -0.08987240493297577,
        0.02269965410232544,
        -0.03177564963698387,
        -0.10220853984355927,
        0.02587546966969967,
        -0.03366747498512268,
        0.0783923789858818,
        -0.12398765236139297,
        -0.05989650636911392,
        0.09106653928756714,
        -0.03890896588563919,
        0.006234510336071253,
        0.030775224789977074,
        -0.051689594984054565,
        -0.019910641014575958,
        -0.05208636447787285,
        -0.03898969292640686,
        0.030757594853639603,
        0.007612904533743858,
        -0.03694389387965202,
        -0.0457078218460083,
        0.07326303422451019,
        0.07875455170869827,
        -0.05021542310714722,
        0.06996668130159378,
        -0.021685803309082985,
        0.03781576827168465,
        -0.030692314729094505,
        0.016237333416938782,
        -0.07633562386035919,
        -0.002096029231324792,
        0.039718639105558395,
        0.1026604101061821,
        0.09747786074876785,
        -0.011503389105200768,
        -0.042025066912174225,
        -0.08810495585203171,
        0.05902596190571785,
        0.06177400425076485,
        0.008859056048095226,
        -0.009286457672715187,
        0.022128475829958916,
        0.0007549934671260417,
        -0.08257127553224564,
        -0.07388216257095337,
        0.02679780125617981,
        -0.0024839984253048897,
        0.02931074984371662,
        0.10060152411460876,
        -0.05414707213640213,
        0.05870000272989273,
        0.008394814096391201,
        -0.04873812571167946,
        0.07342216372489929,
        0.03274567797780037,
        0.0588095486164093,
        -0.06028340756893158,
        0.03869369626045227,
        -0.06209033727645874,
        -0.039818864315748215,
        0.009879600256681442,
        0.06175662577152252,
        -0.09560646116733551,
        0.025879140943288803,
        0.1213250681757927,
        0.03815507888793945,
        0.03149844706058502,
        -0.11017937958240509,
        -0.06829005479812622,
        0.009061084128916264,
        0.005071318242698908,
        -0.07638094574213028,
        -0.05491938441991806,
        7.588000440234151e-33,
        -0.0149193424731493,
        0.043767049908638,
        -0.030182192102074623,
        -0.037218816578388214,
        -0.018384816125035286,
        0.026101043447852135,
        0.05682222172617912,
        0.009867837652564049,
        -0.004051350522786379,
        -0.012074391357600689,
        -0.06602339446544647,
        -0.02310957759618759,
        -0.057886481285095215,
        0.0927787646651268,
        0.0008897322695702314,
        -0.023174529895186424,
        -0.023072829470038414,
        0.02927057258784771,
        -0.00790388509631157,
        0.045681290328502655,
        -0.03575417399406433,
        -0.03488101437687874,
        0.031002042815089226,
        -0.00860554352402687,
        -0.02200809307396412,
        0.028694529086351395,
        -0.0573977455496788,
        -0.004970557056367397,
        0.08311603963375092,
        0.026757018640637398,
        -0.02070789784193039,
        -0.021891767159104347,
        -0.0030474229715764523,
        -0.019080771133303642,
        0.011049059219658375,
        -0.02729654498398304,
        0.015838593244552612,
        -0.08657458424568176,
        0.019405152648687363,
        -0.006150233559310436,
        -0.0729023888707161,
        0.084086112678051,
        -0.09254931658506393,
        -0.0808391347527504,
        0.03221014887094498,
        -0.009389947168529034,
        0.007633287459611893,
        0.026112204417586327,
        -0.022033696994185448,
        0.055027466267347336,
        -0.14765745401382446,
        0.09421461075544357,
        -0.03164581581950188,
        0.04020974412560463,
        -0.061907365918159485,
        -0.10029490292072296,
        0.0010352154495194554,
        0.044569794088602066,
        0.06771214306354523,
        0.02655026502907276,
        -0.0295883696526289,
        -0.0004788096121046692,
        -0.05753729119896889,
        -0.0015399853000417352,
        -0.12128953635692596,
        0.015554400160908699,
        0.06259152293205261,
        0.035053715109825134,
        -0.09991773962974548,
        0.09677031636238098,
        0.028579793870449066,
        -0.0025769739877432585,
        -0.04349741339683533,
        -0.06932059675455093,
        0.06057810038328171,
        0.016232214868068695,
        -0.014171618036925793,
        -0.018116474151611328,
        0.00883118063211441,
        0.041344054043293,
        -0.011884428560733795,
        0.06401994079351425,
        -0.02614551968872547,
        0.0036887649912387133,
        0.0037613175809383392,
        0.042517054826021194,
        0.021992623805999756,
        0.005760607309639454,
        -0.02255953848361969,
        -0.03869369253516197,
        -0.04136380925774574,
        -0.03504389524459839,
        0.04019903019070625,
        0.026165585964918137,
        0.054426345974206924,
        -8.285347770180088e-33,
        0.028103135526180267,
        -0.010182712227106094,
        0.026639865711331367,
        -0.0014804297825321555,
        0.00272144703194499,
        -0.01236481312662363,
        0.0763721689581871,
        0.021441809833049774,
        0.07306380569934845,
        -0.1060216873884201,
        0.035679593682289124,
        0.07443143427371979,
        -0.0398016981780529,
        0.051495637744665146,
        -0.02117769792675972,
        -0.10196240991353989,
        -0.015560499392449856,
        -0.12146305292844772,
        0.07133421301841736,
        -0.0628870353102684,
        0.05220899358391762,
        0.04740592837333679,
        -0.061678797006607056,
        -0.004461065400391817,
        -0.0620124489068985,
        0.041200995445251465,
        0.020220516249537468,
        -0.043933477252721786,
        -0.009275444783270359,
        0.02484232559800148,
        0.007952378131449223,
        -0.004798517562448978,
        -0.013846287503838539,
        0.00594313396140933,
        0.05049852281808853,
        0.021151309832930565,
        0.09793516248464584,
        -0.028283683583140373,
        -0.041693560779094696,
        0.028741925954818726,
        -0.013786318711936474,
        0.09088477492332458,
        0.004195043817162514,
        0.010021468624472618,
        0.04276285320520401,
        0.03510900214314461,
        0.0269898883998394,
        -0.06942387670278549,
        0.011546453461050987,
        0.011280566453933716,
        -0.025281231850385666,
        0.07646284252405167,
        0.03942123055458069,
        -0.030414218083024025,
        -0.039205778390169144,
        -0.12069588154554367,
        -0.03549148514866829,
        0.08522547036409378,
        -0.0369744710624218,
        -0.05664106085896492,
        -0.019825413823127747,
        0.041841138154268265,
        -0.06358841806650162,
        -0.10064338147640228,
        -0.0029399157501757145,
        0.04797480255365372,
        0.04009556025266647,
        0.015917213633656502,
        0.009100502356886864,
        -0.025735460221767426,
        -0.10420746356248856,
        0.0009141239570453763,
        -0.09485147893428802,
        -0.019408198073506355,
        -0.002161561045795679,
        0.04710490256547928,
        0.08226440101861954,
        -0.013609890826046467,
        0.08249405771493912,
        -0.01476734783500433,
        -0.021314704790711403,
        -0.06374076753854752,
        0.0594230517745018,
        0.0020841844379901886,
        0.08015330135822296,
        -0.014494645409286022,
        -0.015357759781181812,
        -0.0695657953619957,
        -0.0442349836230278,
        -0.013855372555553913,
        -0.06146159768104553,
        0.08539890497922897,
        -0.02478191629052162,
        0.01902947574853897,
        -0.015450137667357922,
        -6.423041298830867e-08,
        0.029985938221216202,
        -0.008389715105295181,
        0.017436813563108444,
        0.04278279468417168,
        0.03971455991268158,
        -0.04889946058392525,
        0.06635589897632599,
        -0.03645456209778786,
        0.026587611064314842,
        -0.017484111711382866,
        0.08648845553398132,
        -0.037592872977256775,
        -0.00810724962502718,
        -0.02598721534013748,
        -0.006030987948179245,
        -0.003768487134948373,
        -0.03538805618882179,
        0.06045117601752281,
        -0.0010175176430493593,
        -0.016537390649318695,
        0.013726677745580673,
        0.06033709645271301,
        0.07739844173192978,
        -0.045666392892599106,
        -0.03722178936004639,
        -0.0036577899008989334,
        0.025164103135466576,
        -0.018908130005002022,
        0.018233289942145348,
        0.02286527305841446,
        0.004279379267245531,
        -0.029934793710708618,
        0.05552816763520241,
        -0.04697169363498688,
        0.13407213985919952,
        -0.10663574934005737,
        -0.02054462395608425,
        0.08431372791528702,
        0.1449553668498993,
        0.006747606676071882,
        0.011466989293694496,
        -0.08581284433603287,
        -0.043045494705438614,
        -0.015785224735736847,
        -0.009644176810979843,
        0.033462103456258774,
        -0.07135005295276642,
        -0.09357302635908127,
        -0.041819628328084946,
        0.00014809536514803767,
        -0.08298151195049286,
        0.020194919779896736,
        -0.05222926288843155,
        0.058806318789720535,
        0.00786269549280405,
        -0.018762126564979553,
        0.050392553210258484,
        -0.004582179710268974,
        -0.0003855210670735687,
        0.01872423104941845,
        0.03319330886006355,
        -0.06629880517721176,
        -0.047771189361810684,
        -0.0014678180450573564
    ]
}