{
    "id": "W6_nBr8SbPE",
    "title": "Kali Linux 2021.2 zero to WiFi (Free install)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-06-08T15:46:48Z",
    "video_url": "https://www.youtube.com/watch?v=W6_nBr8SbPE",
    "category": "Science & Technology",
    "tags": [
        "kali linux",
        "hacking",
        "kali",
        "kali linux tutorial",
        "kali linux install",
        "kali linux hacking tutorials",
        "kali linux tutorial for beginners",
        "how to use kali linux",
        "ethical hacking",
        "kali linux hacking",
        "kali linux tools",
        "linux",
        "how to install kali linux",
        "kali linux basics",
        "kali linux download",
        "kali linux 2021.2",
        "kali linux 2021",
        "install kali linux",
        "installing kali linux",
        "linux kali",
        "kali 2021.1",
        "kali vmware",
        "kali linux vmware",
        "wifi",
        "kali wifi adapter",
        "kali linux wifi",
        "kali wifite",
        "oscp"
    ],
    "views": 112444,
    "likes": 3663,
    "comments_count": 352,
    "description": "Install Kali Linux 2021.2 on Windows 10 using VMware Workstation Player for free. Need help? Join my Discord:   Menu: 0:00  Kali Linux install overview 0:19  Type 2 hypervisor 0:49  Type 1 hypervisor 1:10  What we are doing 1:30  Kali options (bare metal, WSL, live boot etc) 2:16  Download VMware virtual machine 3:00  Download VMware Workstation Player 3:50  7zip software 4:47  Install VMware Workstation Player 6:37  Start VMware Workstation Player 6:57  VT-x / AMD-V Requirement 7:57  Enable VT-x / AMD-V 11:31  Install 7z software 11:57  Extract Kali 7z file 12:29  Move VMware files to the correct directory 13:00  Import Kali 2021.2 Virtual Machine 13:27  Change Virtual Machine settings 14:23  Start Kali Linux on Windows computer 14:51  Login into Kali Linux VM 15:37  WiFi with Kali Linux 16:43  Run wifite to check wifi networks  ============== Links mentioned: ============== WiFi adapters:  VMware download:   ======================== Recommended WiFi Adapters: ======================== Alfa AWUS036NHA:  Alfa AWUS036ACM:  Alfa AWUS036ACH:  or   Others: Alfa AWUS1900:  Alfa Long-Range Dual-Band AC1200:  Alfa AWUS036NEH:   ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    kali linux wifi kali linux 2021.2 kali linux 2021 vmware vmware kali kali linux install oscp ceh security+ pentest+  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #kalilinux #wifi #kali",
    "description_links": [
        "https://discord.com/invite/usKSyzb",
        "https://youtu.be/5MOsY3VNLK8",
        "http://davidbombal.wiki/vmwareplayerdownload",
        "https://amzn.to/3wnyVen",
        "https://amzn.to/3fCL4WT",
        "https://amzn.to/3rLAjny",
        "https://amzn.to/2PxkkMV",
        "https://amzn.to/31E0AtH",
        "https://amzn.to/34UUCEL",
        "https://amzn.to/3sK2iW8",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- In this video, I'm gonna show you how to download and install Kali or Kali Linux if you prefer on a Windows computer. In this example, we're going to download a prebuilt virtual machine and run Kali within VMware player. Now to get Kali up and running on a Windows computer, we need to do various things. We need to install a hypervisor. VMware Workstation Player is what's called a type two hypervisor. We install an operating system Windows on bare metal. So in other words, I've installed Windows on this laptop, then we install VMware Workstation Player on top of Windows. And then we run another operating system in this case a Linux within VMware Workstation Player on top of Windows. So we running an operating system within another operating system, that's called a type two hypervisor. ESXi is what's called a type one hypervisor. That's where you install the hypervisor software directly on hardware. Hypervisor software allows us to virtualize operating systems. So in other words, we could run Windows or Linux on a Windows computer, or we could run Windows on Mac OS or run Windows on Linux. So in this example, we are running Kali Linux within Windows. Windows is what's called a host operating system, and then our guest operating system is Kali running within Windows. (upbeat ambient music) Now in this example, I'm installing Kali on this Windows laptop. I'm controlling the laptop from my Mac, but all the installation work has been done on this Windows laptop. Now there are multiple ways to use Kali these days. On the Kali.org website, if you click \"Download\", you'll see that you can run Kali directly on hardware. In other words, a bare metal installation, or you can use virtual machines, you can run it on a Raspberry Pi as an example, you can run it on an Android phone, you can run it in the cloud, you can use containers, you can boot off a USB drive so do a live boot or run it within WSL version two. There are advantages and disadvantages of all of these methods. In this example, I'm gonna show you the download and installation of a VMware virtual machine. Again, this is a prebuilt virtual machine that we can download from the Kali website. I've pre downloaded it in case this takes a long time to download, but I'll click \"Save\" to save that, download, according to this, it'll take six minutes to download. I've sometimes found that downloads take a long time from the Kali website, so I've pre downloaded the software. You can also run Kali within VirtualBox. I'll demonstrate that in a separate video, in this video, I'm gonna concentrate on the installation of Kali within VMware player, again, there are advantages and disadvantages to each of these installations. Okay, so while I'm waiting for the Kali VM to download, I'll go to vmware.com. Go to workspace, scroll down and select workstation player. Now VMware, like a lot of companies changes their website on a regular basis, so what I'll do is I'll put the download link below this video in case their website changes again. VMware workstation plays free software that you can download from VMware's website. So I'll click \"Download Now\", and then I'll click \"Go To Downloads\". And I wanna download VMware Workstation Player for Windows. In this example, at 16.1.2, when you watch this video, it may be a later release, just download the latest release that you see. I'm gonna click download now to download the software and save that to my downloads directory. Now there's additional software that you need. The Kali Virtual Machine comes as a 7Z file, or 7Z file. So I'm gonna download the 7Zip software for Windows 64 bit. In my example, I'm using Microsoft Windows 10, version 20H2. And this is a 64 bit version of Windows. In my example, I'm using an Intel processor with 8GB of RAM. It's recommended that you have at least 2GB of RAM for your Kali installation. I've got enough here, I've got 8G, you can increase the amount of RAM that you allocate to your virtual machine. That'll make it run faster, but in my example, 2GB is fine for this demonstration. So I'll download the 7Z software to my downloads directory. Okay, so going to my downloads directory, the first piece of software that I need to download is VM-ware Player. So I'll double click on the executable file, click \"Run\" to run the installation, click \"Yes\" to allow the app to make changes to my device. And as you can see here, VMware workstation 16 installation is starting. Okay, so the wizard displays, it's a very simple installation. I'm basically just gonna go with the defaults. You have to agree to the license agreement. The software is free for non-commercial use. So if you just wanting to study, perhaps you learning ethical hacking, then you can use the software. I'm gonna click \"Next\". Click next. I'm not gonna join the VMware Customer Experience Improvement Program. Click next, click next again. And before I click \"Install\", I just wanna show you that in control panel, under network and internet network and sharing center, change adapter settings, there is no VM-ware network adapter. I do have a VirtualBox in network adapter, applications such as VMware Workstation Player or VMware Workstation Pro or VirtualBox create these network adapters in control panel, that's normal behavior. So if I click install, which I've done now, VMware will create a network adapters, which we'll hopefully see in a moment, you can see it's saying \"installing virtual network adapters\". And there you go, I've got a VMware network adapter and another one. So that's normal behavior, that's expected, that allows us for example to bridge to a physical network adapter or to net our virtual machine. Okay, installation is completed, so I'm gonna click \"Finish\". Okay, so I can see that VMware Workstation has been installed, I could double click on that to run the software. I'm using VMware Workstation Player for non-commercial use. So I'm gonna click \"Continue\" and click \"Finish\". My installation has now completed. You can see that it says non-commercial use only. Okay, so I've got VMA Workstation Player installed, but now this becomes important, you need to have VTX or AMD-V enabled in the bias of your computer. On the Kali website, make sure that you look at the documentation. For example, they tell you what the default credentials are, Kali, Kali. They also have documentation for the installation of Kali within VMware. So as an example, they tell you here in the guide that you need to enable Intel VTX or AMD-V in the bias of your computer. So you need to do that before you import the Kali VM into VMware workstation player and boot it up. Now, if you've already got that done, then jump to this timestamp in the video. I'm gonna show you now how to do that for an Intel and AMD laptop. But again, if you've already done that to, then jump to this timestamp to jump straight to the import of the VM and booting up of the VM on your Windows computer. Now in this example, I've got an ASUS laptop, it's got an Intel CPU and I've got an HP laptop that's got an AMD CPU. The process that you follow will vary depending on the manufacturer. So on ASUS as an example, I need to reboot the laptop and press F2 to go into the bio settings. On HP, I need to use F10 to go into the bio settings. So referred to the documentation for your manufacturer to determine which key you need to use to get into the bios, or just use Google to do a search to find out which key to use to get into the bios for your specific laptop or computer. So I'll now show you how to enable VTX on a laptop that has an Intel processor, as well as a laptop that has an AMD processor. Okay, so the first thing I need to do is shut the laptop down. So I'm gonna click \"Power\", shut down to shut the computer done. Laptop has been shut down. Now because this is an ASUS laptop, I need to press power and F2, so F2 will take me to the bios. And as you can see, I'm now in the bios of the computer. So they tell you which key strokes to use. So as an example, right arrow will take me from one menu to the other. So I've gone from the main menu to advanced. And what I wanna enable is \"Intel Virtualization Technology.\" At the moment it's disabled. So I want to select that option, once again, using the arrow keys, go to Intel Virtualization Technology, press enter, and then specify enabled. So what I'm gonna do now is use the right arrow key, go to save and exit, make sure that I've selected save and exit, press enter, and then press enter again to save the configuration and exit. Laptop is now rebooted. And now I can enter my pin and login. And there you go, I've logged into the laptop. Okay, so I'll do something similar on this computer with an AMD processor, go to the start menu, I'll select \"Power Options\", and I'll select \"Shutdown\" to shut down the computer. Computer's now shutting down. Okay, this is a HP laptop, so I need to use F10. So I'll start the laptop, press F10. Okay, so something similar needs to be done here. I'm gonna go to \"System Configuration\", \"Virtualization Technology\". So Virtualization Technology is currently disabled. What I need to do is press enter, select enabled, press enter, and then I need to exit. So save my configuration and exit. Press enter to save the changes, the laptop is now rebooted. We can see that to the HP laptop is booting up. This is an older laptop, so it's quite slow. Okay, I need to put my password in, press enter to login. I've now successfully logged in. Okay, so you've got VTX enabled in the bios of your computer. Next step is to install the 7Z software. So again, I've run the VMware installation, I've got the Kali 7 Z file. Now I need to extract that file, so I'm gonna run the 7Z software, Say yes to run the application, click install to install it. And now that I've done that I can right click on the 7Z file, and extract the files to say this directory. The files are now being extracted. You basically just need to wait for that to complete. So steps we've done thus far is install VMware Workstation player. We've enabled VTX in the bios of our computer. We've installed the 7Z software. Once we've done that, we can simply import the virtual machine into VMware Workstation Player. Okay, so that's now completed. Here is the extracted directory. There are the VMware files. So what I could do is take that extracted directory and move it to my virtual machines directory. I have other virtual machines in this directory, but our uninstalled VMware Workstation player before doing this demonstration so that I could show you the full process. It's a simple meadow of importing these virtual machines, but for the moment, let me show you how to import the Kali 2021.2 Virtual Machine. So in VMware Workstation Player, go to \"Player\", \"File\", \"Open\", \"Documents\", \"Virtual Machines\". I want Kali 2021.2. Select the VMX file, click \"Open\". A virtual machine has now been imported into VMware Workstation Player. If I click \"Edit Machine Settings\", I can change various parameters, including the RAM. I could allocate more RAM to this virtual machine. I'll leave it as 2G for the moment. I could change the number of processes. If your PC doesn't support for processes, you may need to reduce that. Hard disk space is 80GB, that's fine. Auto detect the CD ROM. In my example, I wanna bridge this to my network adapter. So in other words, under configure adapters, I wanna bridge this to for instance my Wi-Fi adapter. So I'm not gonna bridge it to other adapters, I'm gonna bridge it to my Wi-Fi adapter and click \"Okay\". That allows me to SSH directly to Kali if I'd like. It's as if this virtual machine is on the network rather than being netted to the network. Okay, everything else looks good, so I'm gonna click okay. And then I'm gonna play the virtual machine, in other words start it up. I copied it, so I'm gonna click, I copied it. I'm going to download and install new VMware tools for Linux. So while Kali is booting up, I'll simply download and install the new tools. Okay, that's done, so I'm gonna click \"Close\". And there you go, I've now got Kali running within VMware Workstation Player on my Windows laptop. Default username is Kali, default password is Kali, click \"Login\". And I can log in to my virtual machine. If I click on the terminal, I'll make that a bit bigger. IP address will show me my IP address. As you can see, I'll do that again. As you can see here, IP address is thus on my Mac. I should be able to ping 192.168.136, which I can. So I'm pinging from this Mac book to the virtual machine running on the Windows laptop. Okay. So there you go, I've now got Kali up and running within VMware Workstation Player on a Windows laptop. Now something a lot of people wanna do is get Wi-Fi working. So here I've got an alpha network adapter. This is one of my favorite Wi-Fi adapters, it does have the restriction that it only supports 2.4 GHz but it works out of the box with Kali, in this video, I explained a whole bunch of Wi-Fi adapters so you can have a look at that video if you wanna look at various Wi-Fi adapters. But what I'm gonna do now is plug this into that Windows laptop. (Windows 10 notification ding) Okay, so VMware picks that up. I need to select, do I wanna connect it to the host or to the virtual machine? In my example, I wanna connect it to the virtual machine. Click okay. And if I type IP address, I now see Wi-Fi and network. If I type \"iwconfig\", I see that I have a Wi-Fi interface connected to Kali. I'll clear the screen, and then I can run an application like Wi-Fight to sniff for Wi-Fi networks. So I'll put in my pseudo password, which is Kali, and as you can see there, monitor mode has been enabled on the Wi-Fi adapter and it starts sniffing various Wi-Fi networks. And I could attack a Wi-Fi network if I wanted to. As always, only attack networks that you either own or have permission to attack or press Ctrl-C to stop that and I'll close that down. Okay, so there you go. Start to finish, how to get Kali 2021.2 up and running on a Windows computer using VMware Workstation Player. In separate videos. I'll show you how to get this working in VirtualBox or within WSL version two and other options. Now if you enjoyed this video, please consider subscribing to my YouTube channel. Please like this video and click on the bell to get notifications, that really does help me with the YouTube robots. I'm David Bombal, I wanna wish you all the very best.",
    "transcript_keywords": [
        "VMware Workstation Player",
        "Workstation Player",
        "VMware Workstation",
        "Kali",
        "Windows",
        "Workstation",
        "virtual machine",
        "VMware",
        "player",
        "Windows laptop",
        "click",
        "download",
        "Windows computer",
        "laptop",
        "virtual",
        "run Windows",
        "run Kali",
        "run",
        "Kali Linux",
        "install VMware Workstation"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "these days",
        "SSH",
        "VirtualBox",
        "80",
        "at least",
        "Documents",
        "Download",
        "two",
        "192.168.136",
        "YouTube",
        "Google",
        "8",
        "VTX",
        "Finish",
        "Linux",
        "Intel",
        "GB",
        "the Wi-Fi",
        "the Kali 7 Z",
        "David Bombal",
        "Wi-Fi",
        "2.4 GHz",
        "VTX",
        "USB",
        "F10",
        "Power Options",
        "Android",
        "F2",
        "the Kali VM",
        "Ctrl-C",
        "64",
        "20H2",
        "2GB",
        "Download Now",
        "The Kali Virtual Machine",
        "Wi-Fight",
        "AMD-V",
        "HP",
        "VMware Workstation Player",
        "one",
        "Virtualization Technology",
        "RAM",
        "VMX",
        "Kali Linux",
        "Windows",
        "Virtualization Technology",
        "first",
        "Windows 64",
        "Mac",
        "Wi-Fi",
        "WSL",
        "AMD",
        "Power",
        "F10",
        "VMware",
        "8GB",
        "VM-ware Player",
        "AMD",
        "VM",
        "CPU",
        "Intel Virtualization Technology",
        "2021.2",
        "VMA Workstation Player",
        "16",
        "Go To Downloads",
        "the VMware Customer Experience Improvement Program",
        "Next",
        "Edit Machine Settings",
        "2",
        "Kali.org",
        "Windows on",
        "Kali",
        "Mac",
        "16.1.2",
        "Intel Virtualization Technology",
        "ASUS",
        "six minutes",
        "a Raspberry Pi",
        "VMware Workstation"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "WORK_OF_ART",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "LOC",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG"
    ],
    "vector": [
        0.021588437259197235,
        0.04913017526268959,
        0.005950707942247391,
        -0.038703177124261856,
        0.024519747123122215,
        0.013920548371970654,
        0.001330475090071559,
        -0.019747823476791382,
        -0.06928989291191101,
        0.030445534735918045,
        0.07098890841007233,
        -0.08202355355024338,
        -0.05690800026059151,
        0.05287381261587143,
        -0.013937873765826225,
        0.03140249475836754,
        0.030040334910154343,
        -0.014004139229655266,
        0.051252685487270355,
        -0.04503292590379715,
        0.04824119433760643,
        0.026531914249062538,
        0.07774128019809723,
        -0.08395718783140182,
        0.031268160790205,
        -0.05233558267354965,
        0.07186035811901093,
        0.07795669138431549,
        -0.01477079838514328,
        -0.009146626107394695,
        0.007287857588380575,
        0.050233710557222366,
        -0.022573599591851234,
        0.009128398261964321,
        -0.00305527588352561,
        -0.02218901552259922,
        0.0039724200032651424,
        0.03275230899453163,
        -0.06707365810871124,
        -0.018934279680252075,
        -0.06755731999874115,
        -0.08019426465034485,
        -0.08814432471990585,
        0.047394316643476486,
        0.019982025027275085,
        -0.006335896905511618,
        -0.07353637367486954,
        0.013778614811599255,
        0.09215071052312851,
        -0.02174094133079052,
        -0.06554049998521805,
        -0.026943575590848923,
        0.003360407194122672,
        -0.003398854285478592,
        -0.0113440603017807,
        -0.04109850898385048,
        0.022540191188454628,
        0.08321604132652283,
        0.08144408464431763,
        -0.11264108866453171,
        0.050441939383745193,
        -0.033524900674819946,
        0.0012863720767199993,
        -0.036805473268032074,
        -0.0549730509519577,
        -0.04722454771399498,
        0.015096236020326614,
        0.10855460911989212,
        -0.06533379852771759,
        -0.029112964868545532,
        -0.03810078278183937,
        0.09086992591619492,
        0.043254271149635315,
        -0.047335267066955566,
        -0.013962626457214355,
        -0.00022846387582831085,
        -0.002321992302313447,
        -0.00035905945696868,
        0.018900899216532707,
        0.05107768997550011,
        0.03042938932776451,
        0.035860318690538406,
        -0.036021456122398376,
        -0.05027024447917938,
        -0.035868193954229355,
        0.039770547300577164,
        -0.07715566456317902,
        0.017144825309515,
        0.06368512660264969,
        -0.11151035130023956,
        -0.07105119526386261,
        0.0452992208302021,
        -0.015261572785675526,
        -0.03715352714061737,
        0.11048100143671036,
        0.034603431820869446,
        0.011858152225613594,
        0.018303051590919495,
        0.02983459085226059,
        0.020695626735687256,
        -0.06925170123577118,
        -0.0435209721326828,
        0.044614143669605255,
        0.08794243633747101,
        -0.0234050489962101,
        0.036449383944272995,
        0.04208001121878624,
        0.05242316797375679,
        -0.04111814126372337,
        -0.022944431751966476,
        -0.029378827661275864,
        0.0577266551554203,
        0.009704330004751682,
        -0.07855634391307831,
        0.01978011056780815,
        0.05750339850783348,
        -0.00942300260066986,
        0.16162550449371338,
        -0.01570184901356697,
        0.009119288064539433,
        -0.011249643750488758,
        -0.0924665704369545,
        0.020305316895246506,
        -0.015639258548617363,
        0.027136122807860374,
        -0.028633631765842438,
        0.03519393131136894,
        1.7873833884002378e-32,
        0.08099595457315445,
        0.03179030120372772,
        -0.09172987937927246,
        0.08224621415138245,
        0.09562916308641434,
        -0.07679100334644318,
        0.012777586467564106,
        -0.061905454844236374,
        -0.10369037091732025,
        0.017992760986089706,
        -0.031122542917728424,
        -0.10174206644296646,
        -0.020770657807588577,
        0.04899807274341583,
        0.08146984130144119,
        -0.07525528222322464,
        0.06652303785085678,
        0.00777069665491581,
        -0.00426443200558424,
        0.02810734696686268,
        0.036026570945978165,
        -0.01835307665169239,
        -0.014422127045691013,
        -0.0983649417757988,
        0.013159281574189663,
        0.011075576767325401,
        -0.059838827699422836,
        -0.009063777513802052,
        0.009645957499742508,
        -0.027629418298602104,
        0.009865929372608662,
        -0.02401573583483696,
        0.004949226044118404,
        -0.033207979053258896,
        -0.0628168135881424,
        0.026623554527759552,
        -0.044500138610601425,
        0.03395257517695427,
        -0.05688755214214325,
        -0.07259120047092438,
        0.009059046395123005,
        0.011517856270074844,
        0.0034085435327142477,
        -0.038684677332639694,
        0.020173590630292892,
        -0.06485838443040848,
        0.002096806652843952,
        0.022869078442454338,
        0.0840572789311409,
        0.07348577678203583,
        -0.06166929006576538,
        0.005907456390559673,
        -0.021947557106614113,
        -0.06462641805410385,
        0.037348803132772446,
        0.019912390038371086,
        -0.010947950184345245,
        -0.014378448948264122,
        -0.03817729651927948,
        0.0408472903072834,
        -0.07862482964992523,
        0.015938295051455498,
        0.03635525703430176,
        0.01608387567102909,
        0.01747092790901661,
        -0.10537150502204895,
        -0.07120563834905624,
        -0.07606509327888489,
        0.06677938252687454,
        0.08439917117357254,
        -0.06050994619727135,
        0.005957651883363724,
        -0.00896824523806572,
        0.014970880001783371,
        -0.008987626060843468,
        0.004514762666076422,
        0.04671306163072586,
        -0.08374808728694916,
        -0.09304573386907578,
        -0.02454785816371441,
        0.07875470072031021,
        0.012295804917812347,
        -0.056790318340063095,
        -0.04490048065781593,
        0.07714974135160446,
        -0.048215046525001526,
        -0.02597045712172985,
        -0.07073404639959335,
        0.07647675275802612,
        -0.01672837883234024,
        -0.03492195904254913,
        0.03176628053188324,
        0.010216513648629189,
        0.014616473577916622,
        -0.05134216696023941,
        -1.6241355818722357e-32,
        0.029933413490653038,
        0.06774631142616272,
        0.08797771483659744,
        -0.013081718236207962,
        0.03271457180380821,
        0.059306830167770386,
        0.018261367455124855,
        0.019039513543248177,
        -0.05412885919213295,
        -0.025926193222403526,
        0.017287738621234894,
        0.004461918957531452,
        -0.06883362680673599,
        -0.006705982144922018,
        -0.03589804098010063,
        0.06681482493877411,
        0.05630408227443695,
        -0.06961741298437119,
        0.02148982137441635,
        0.03588714450597763,
        -0.035688869655132294,
        0.15791524946689606,
        -0.006233801133930683,
        -0.055999305099248886,
        -0.04800892621278763,
        0.022272629663348198,
        0.08421969413757324,
        0.08585117012262344,
        -0.03390936553478241,
        0.07023057341575623,
        0.040526505559682846,
        -0.030908651649951935,
        0.014411465264856815,
        -0.024336986243724823,
        0.13851138949394226,
        0.012026764452457428,
        0.08567086607217789,
        0.06148027628660202,
        -0.025300221517682076,
        -0.014139548875391483,
        0.07869196683168411,
        0.030343934893608093,
        -0.10955346375703812,
        -0.05565366894006729,
        -0.0030989989172667265,
        -0.005595464259386063,
        0.07961154729127884,
        0.024217655882239342,
        -0.0495908223092556,
        -0.10824689269065857,
        0.04202977567911148,
        -0.04484754055738449,
        0.010190773755311966,
        0.02359306812286377,
        0.0294597577303648,
        0.011161565780639648,
        -0.02052115835249424,
        0.02312065288424492,
        0.015436341054737568,
        -0.0698193684220314,
        0.038970351219177246,
        -0.06881033629179001,
        -0.013177073560655117,
        -0.03250318393111229,
        0.04278016835451126,
        -0.06518033146858215,
        -0.06451644003391266,
        0.032409440726041794,
        -0.02635279856622219,
        -0.08323641121387482,
        -0.1532677561044693,
        0.017254004254937172,
        0.0038611111231148243,
        0.008597475476562977,
        0.09190776944160461,
        -0.0038020063657313585,
        -0.031300511211156845,
        0.03944346308708191,
        -0.017840323969721794,
        0.03772302344441414,
        0.02653629519045353,
        0.006777504459023476,
        -0.05797896534204483,
        -0.04255546256899834,
        -0.04493618756532669,
        0.05179066210985184,
        -0.026586363092064857,
        0.016505787149071693,
        0.015143449418246746,
        -0.06284310668706894,
        -0.050289180129766464,
        0.01576732099056244,
        0.017813554033637047,
        0.08717402070760727,
        0.007557883858680725,
        -6.200294677682905e-08,
        0.007987996563315392,
        0.028686191886663437,
        -0.01600939780473709,
        -0.030063843354582787,
        0.011854722164571285,
        0.010707568377256393,
        0.07461737096309662,
        -0.17537711560726166,
        0.01264990121126175,
        0.04220367968082428,
        -0.09405213594436646,
        0.07324330508708954,
        -0.04042508453130722,
        0.06111082807183266,
        -0.013623829931020737,
        0.037728339433670044,
        -0.08060282468795776,
        0.04855688661336899,
        -0.006423683371394873,
        0.011978082358837128,
        0.0880947858095169,
        0.03303598612546921,
        0.025271788239479065,
        0.019429795444011688,
        0.03366093337535858,
        0.00529556954279542,
        0.06075843423604965,
        -0.05660635605454445,
        -0.030072523280978203,
        0.0370011106133461,
        -0.039256468415260315,
        0.01426661852747202,
        -0.06324150413274765,
        -0.008298300206661224,
        0.008148890919983387,
        0.002046274719759822,
        -0.0654061958193779,
        0.07564939558506012,
        0.0652863159775734,
        -0.026483410969376564,
        -0.043860964477062225,
        -0.0056584118865430355,
        -0.008904453366994858,
        -0.012663356959819794,
        -0.03627576678991318,
        -0.033837929368019104,
        -0.052600692957639694,
        -0.008351299911737442,
        -0.03157097101211548,
        -0.06777087599039078,
        0.022181237116456032,
        0.015281617641448975,
        -0.021232083439826965,
        -0.07919212430715561,
        -0.052292607724666595,
        0.017660634592175484,
        0.02677062153816223,
        0.011729193851351738,
        0.016634084284305573,
        -0.032015588134527206,
        0.045427631586790085,
        -0.012484435923397541,
        -0.0564795546233654,
        -0.06640436500310898
    ]
}