{
    "id": "W6m6Ojo9rKU",
    "title": "NEW Amazing Dog Travel Bed! 🐶 Unboxing with Rosanna!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-04-27T17:58:54Z",
    "video_url": "https://www.youtube.com/watch?v=W6m6Ojo9rKU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "dog bed",
        "travel",
        "puppy",
        "cute",
        "rosanna pansino",
        "nerdy nummies",
        "justine ezarik",
        "review",
        "unboxing"
    ],
    "views": 1231788,
    "likes": 20819,
    "comments_count": 1217,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? It's Justine, and I'm here with Ro-- - Hello. - and our pups today. - Yeah, look at Cookie. - We are unboxing a dog bed, and I'm so excited about this 'cause it's basically a dog bed for people that travel or go places. So I'm not really sure what it's gonna look like. But it started - Okay. as a Kickstarter from some people in Pittsburgh and I'm originally from Pittsburgh, - Okay. - So I'm even more excited to test this out because it is from my hometown. - Oh, I love this. - So let me just get a knife. - I love dog gadgets, new dog things. - Me too. - This says #GetYourPawsDirty. - Oh my gosh, it does. - We're ready. Let's get our paws dirty, girl. Let's open up this little dog bed and see how it do. - I'm so excited about this, 'cause we always travel and it's always such a struggle trying to get all of his stuff together. - Mm-hm. - His beds, his bowls, his everything. - Finding which hotels are doggie friendly. I bring Cookie's doggie stroller. - You did, you brought it to New York. - I pack all of her treats. Yeah, I brought it to New York. - That's wild! - I'm like-- Oh! - Oh! I see a handle. - Matty must know this is for him, I don't know if you guys, well you probably can't see him. - He's getting really excited over here. Is this for us? - Matty lookie. - Don't move don't move, you have something in your eye. I'll get it, I'll get it. - [Justine] Wow! - [Rosanna] Oh, there you go. There, oh, oh, I got it. - So Matty must have, they must have known this was a dog product because we didn't bring them over here. They wanted to be here for this. - They jumped up with us. I had to pull up a chair 'cause she wanted to be here. - Okay. - Oh, oh. - All right, there we go. - Okay, okay, okay. (quiet gasping) - This is like a dog suitcase. - Ooh, Cookie look! - Matty, look at this! Okay, so let's open it up here. - Ah, okay. It zips open. - (gasping) Oh my gosh! - Oooh! - Matty, it's for you. - Cookie, what is it? - What do you see? - Cookie, what? Do you like this? - Wow! Okay, they're both so into it. Like, how do they know this is for them? - Justine, they're just gonna show it off. Look at 'em go. - Oh wow. Yeah, see what you think Cookie. What do you think of it? Oh my gosh, Matty's tail is wagging so hard. - Yeah, come on Matty, come on. - He's scared. - Look at his handsome bow tie. - I know, he knew he was doing an unboxing today. - He's looking so dapper today. Cookie didn't wear her cute pink bow. She was a little unruly this morning - [Justine] Look at this, a cute little bandana. Cookie, you are all about it. - Cookie, oh wow oh wow. Wow, let's move these out of the way. - [Justine] I love their design, everything. - You got a little card. Do you think they wrote Matty a note? - I think it might just be for everybody, like that's just what they do. Matty, here. Okay Cookie, wow, Cookie is so into everything. (laughing) Okay, here we'll put that over there, but look how cute, a little bandana. - This is her all the time. She, this is her, she just jumps into stuff. She loves it. - She is so into it. - Cookie gives it a four out of four paws. - Definitely. - Okay because she is into it. - Oh my gosh. Okay, let's see. - I think I'm gonna have to get her one of these, just these, like she loves this. I'm gonna have to get one. - This is great, but you could throw all your stuff in here and then just take it with you, so it's like a dog bed suitcase. Let's see what's the note. - Yeah, like there's something in here too. - Oh wow. - Oooh. - Thanks. It is a personalized note! (gasping) \"Hey Justine, we're so excited to share our bed with you and Matty. We designed it to make traveling with our pups painless and easy, and we hope that it does that for you guys. Best, Leah and Eli.\" Oh my gosh, you guys. - That is so sweet. - Like, look at all this design. I am such a huge fan of, oh my gosh! (gasping) It's a picture of Matty! On his little bed. - That is so cute. It's so thoughtful, and even their note is totally handwritten. Like, so personalized. - This is so incredible. - I love this. Cookie, Cookie, Cookie, Cookie. - [Justine] Cookie, you're gonna fall off. - Cookie, Cookie, Cookie, come here. - Okay, this is so cute. I am so impressed. - Let's put a little bandana on you. - Matty, do you wanna get up there and see? - No, Cookie, come here. - Okay, Matty, I know. - We can probably get you a smaller bed, so let's put this on you so you feel fancy. - [Justine] Yeah, they have three different size beds. - And feel a part of it. - Lets let Matty go on here for a little bit. Come on, oh my God. - Oh, it's okay. Here you go. Get up there, go on. - Okay, sit right here. - Go lay down, honey. - Yeah, sit right here. - How do you like it? - Yeah, lay down. - Good girl. - Did you want to see what this is? Ooh, here. Hey, what's in here? Look! (gasping) Matty, look! Oh my gosh, it's a nice, little leash. - That's really cute. - Whoa! Sprucepup.com, get your paws dirty. Matty, you're-- - The little lady loves it. (both laughing) - Come here Matty. - The little lady really loves it. Cookie, go explore, you cute little (laughs). There's many ways you can wear these little scarves. (both laughing) - This is so cool. - Usually you can wear it like a little bandana scarf but also you can be a cute little old lady. - Oh my gosh, there's all kinds of cute little stickers and stuff in here, look at this! - Come here. - Wow! They have alot of accessories, - Come here. - They've got hats and little t shirts. I love that leash, though, that's very nice. - I gotta say, Cookie loves this bed. She just wants to be on it - She really does. Cookie, we can share it. I'll bring it over every time I come over. - They have a really cool logo. I really love the little spruce tree. - Me too! - Like look at cute that is. - Come here, Matty, sit your butt down. - This is not a toy, Cookie, this is a leash. - So this is a professional rock climbing rope and it must be retired after a certain amount of uses for safety and legal reasons. So instead of seeing that real good old landfill, they're recycling it! So this is a recycled rope, a climbing rope. - That's cool! - This is actually so, I'm so impressed. I'm loving this so much, like I can't even handle it. - That's a great idea. - This is a really nice leash. Matty what do you think? - I am into this. - I'm loving the colors, I'm loving everything. This is super cute. I love it! They have three different sizes, I think this is the medium. There's a small and there's a large too. - It has pockets on the side too, - It does! - You can put little things in here. - Wow, wow, wow. - Like little treats. - That's so great. - It's also got these little hooks. - I wonder if there's a-- - Do you hook it to something? Ooh, okay, want me to read you the features? - Yes! - Okay. (loudly clearing throat) Let me read you the features m'lady. One, waterproof sheets. - Ooh! - In case we have an accident. Two, durable materials. There's stash pockets that we found on the side of these. It has industrial hardware at the top and stuff. - It is industrial. - Ooh, girl, this is what Cookie likes! It's a two inch memory foam padding. That, she loves that memory foam. Cookie, she is so fancy. She, if it's memory foam, she's on it. I mean-- - Like she is so into this! Like, we can't even keep her off the table! - No. It's machine washable. - That's really important. - Which I love. If it's not machine washable for dog stuff, I'm like, nope, bye. - Yeah, look, this just kind of comes off. It's velcro'ed in there. - It has padded handles, tuck in bolsters, and fitted sheets. So they're like little sheets. - This is so great. - You can take 'em off and wash 'em. - I love it so much, what a great idea. - Oh this is so cool. And then in the picture, they pack in their stuff in here. - Yeah, so it's like a little suitcase too! So let's show them this. - So it's the suitcase. Yeah, just in here-- - Can you guys see that? - Here, oh, come here Cookie. Come here, come here, come here. Come here, you sweet pea. - It's okay, you can put her back on it. - Okay she loves it. - See. - Look at that. So you pack all your dogs goodies in here, close it up, so it's the bed and their suitcase. - I mean, we can't keep Cookie off of it. We travel a lot, we go up to Big Bear, to the mountains and stuff, so. Matty's just trying to get away from Cookie. (laughing) - [Rosanne] He's like-- - [Justine] He's scared! - [Rosanne] \"Cookie took my bed!\". - Well this is really cool. Let me know what you guys think in the comments below, if this is something that you would use. Is this perfect for your dog, 'cause honestly this is so perfect for somebody who travels or even just like a great dog bed, the fact that it's washable too! - Are there sizes? - There are! - Just kind of like one size? - No, there's three sizes. So this is the medium size, there's a small and then also a large for big dogs. I think you can see on there too. - Oh yeah, here's the big guy! - Yeah! - Here's the big dog. - Like, that's crazy. - You know what, this makes me just want to get another dog, 'cause I feel like we can fit two Cookie's on here. - You probably could-- - Hint, hint! Just throwing it out there, Michael. - Ro wants a puppy! - Mr. Husky, maybe I'd like another dog. - Oh my gosh. - Throwing it out there. - Well this is great, I'll probably end up bringing this over every time I bring Matty over, now. - Yeah, Cookie will hate it. - She's clearly not enjoying it at all. - She really doesn't like this at all. (both laughing) - Well thank you guys so much for watching, I'll put a link in the description if you wanna check this out. Go follow our dogs, would you have, does Cookie have an Insta, she doesn't have an Instagram, does she? - I need to get her one. - You do! - Please let me know if you'd like to see a Cookie Instagram, I've been getting a lot of requests for it over the years, and I was always thinking oh she's not old enough, she's only four, - But, in dog years-- - She shouldn't have her own social media but-- - She's a little, I think now is the time. This is so cool, it's so well designed, I love thoughtful design. - I love this! - It's something that is just so important and I think they really did a great job with this. - It's so cute, I even love the sheets, have little like trees and little dog bone designs on it. - I know! - Like even the sheet, like the cushion fabric design's really cute. - Absolutely love it. Matty, do you like it? But did she take your bed from you? She did. - I know, she really did. She'll have to give it back and share, but look at this cute little face. Look at this happy pup, everybody, she's already snoozing. - She's so excited. - I'm putting her on a rotator, look at her. - I can't believe it. Matty's like but that was my bed! It's okay, Matty, we share. (Rosanna laughing) Oh we should tell them to go, (both gasping) we tested out a bunch of dog gadgets. This was like last year, sometime I think? - So many gadgets! - So many gadgets. - So many. - You guys should go check out that video if you haven't seen it already. It was so much fun. - We need to do more. - We do, follow up. - I found some. - Dog gadgets, kitchen gadgets, I just can't even handle it. - Everything. Everything! - Okay we'll see you guys later! Bye! - Bye!",
    "transcript_keywords": [
        "Cookie",
        "Matty",
        "dog",
        "love",
        "Yeah",
        "cute",
        "bed",
        "Wow",
        "dog bed",
        "gosh",
        "loves",
        "guys",
        "stuff",
        "great",
        "excited",
        "Cookie loves",
        "gadgets",
        "put",
        "cool",
        "Ooh"
    ],
    "transcript_entity_values": [
        "Cookie, Cookie, Cookie, Cookie",
        "Matty",
        "one",
        "Cookie",
        "New York",
        "Eli",
        "Justine",
        "Two",
        "only four",
        "Instagram",
        "Big Bear",
        "three",
        "Husky",
        "Kickstarter",
        "morning",
        "Michael",
        "Ro-- - Hello",
        "the years",
        "Sprucepup.com",
        "last year",
        "Justine]",
        "four",
        "a Cookie Instagram",
        "Cookie",
        "Rosanna",
        "Leah",
        "Pittsburgh",
        "Justine] Cookie",
        "Insta",
        "today",
        "two",
        "two inch",
        "Cookie",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.01064726896584034,
        -0.11159013211727142,
        -0.03622173145413399,
        -0.09396392107009888,
        0.01495710015296936,
        0.06956609338521957,
        0.04846610128879547,
        0.014191797934472561,
        -0.01167719904333353,
        0.05106399953365326,
        0.047479260712862015,
        0.026881679892539978,
        -0.011494241654872894,
        0.01702355220913887,
        -0.018651844933629036,
        0.05930402874946594,
        0.0065079182386398315,
        -0.03423814848065376,
        -0.003362687537446618,
        0.04519103467464447,
        -0.04269060119986534,
        -0.034677986055612564,
        0.02030966803431511,
        0.008985325694084167,
        -0.051157768815755844,
        0.06814039498567581,
        -0.03952258080244064,
        0.008168911561369896,
        -0.09648067504167557,
        -0.10730624198913574,
        0.005710742902010679,
        0.0200649481266737,
        0.0800165981054306,
        0.0030983472242951393,
        0.017869437113404274,
        -0.03318231180310249,
        0.02577412873506546,
        0.005846735090017319,
        -0.035758692771196365,
        0.005825772415846586,
        -0.00557686435058713,
        -0.04040723666548729,
        0.02387193776667118,
        -0.019564982503652573,
        -0.058528050780296326,
        -0.06994692981243134,
        -0.030496491119265556,
        -0.07573481649160385,
        0.06744851917028427,
        0.02186279557645321,
        -0.05250096321105957,
        -0.04342477023601532,
        0.026440491899847984,
        0.02507496438920498,
        -0.09032591432332993,
        -0.03811030089855194,
        -0.10351990908384323,
        0.013963372446596622,
        0.02976232022047043,
        -0.0842885747551918,
        0.02147122286260128,
        0.00867223460227251,
        0.013466497883200645,
        0.03041105344891548,
        -0.046835318207740784,
        -0.06548641622066498,
        -0.01821119897067547,
        0.01496822852641344,
        -0.008533177897334099,
        0.008040361106395721,
        -0.09403547644615173,
        0.05432524159550667,
        -0.016088668256998062,
        0.009600929915904999,
        -0.01606905832886696,
        0.026863599196076393,
        0.04255852475762367,
        -0.05859467014670372,
        0.041799433529376984,
        0.059617698192596436,
        -0.005335608497262001,
        -0.05291935056447983,
        -0.06956982612609863,
        0.007500875275582075,
        0.02433939464390278,
        0.04420540854334831,
        -0.03307252749800682,
        0.027577469125390053,
        -0.09380056709051132,
        -0.08017406612634659,
        -0.07097189128398895,
        -0.03135664016008377,
        -0.010624747723340988,
        0.030972110107541084,
        -0.030458997935056686,
        -0.057037074118852615,
        -0.08041905611753464,
        -0.06741811335086823,
        -0.04946953430771828,
        0.08155076950788498,
        0.03909776359796524,
        -0.036220140755176544,
        0.017037726938724518,
        -0.05852803215384483,
        -0.034210629761219025,
        -0.1347198635339737,
        -0.026597648859024048,
        0.02519606053829193,
        0.0012886167969554663,
        0.015459826216101646,
        -0.053311046212911606,
        0.0058296178467571735,
        -0.05307793244719505,
        -0.039250683039426804,
        0.00919804535806179,
        0.1208576112985611,
        -0.06857962906360626,
        0.07225795090198517,
        0.04149552434682846,
        -0.025110606104135513,
        0.016915567219257355,
        -0.09565731883049011,
        0.002573956735432148,
        0.038925644010305405,
        0.015202616341412067,
        -0.011606446467339993,
        -0.03967288136482239,
        1.3868003337053388e-32,
        -0.012978772632777691,
        0.06114903464913368,
        -0.0034937781747430563,
        0.06955694407224655,
        0.025204269215464592,
        -0.02938954532146454,
        -0.04205946996808052,
        0.09756388515233994,
        -0.008210372179746628,
        0.039028700441122055,
        -0.03633058816194534,
        0.06233283132314682,
        -0.03964397683739662,
        0.0003415130195207894,
        0.017238233238458633,
        -0.07098753750324249,
        0.0023861073423177004,
        -0.05259975790977478,
        -0.05081436410546303,
        -0.017719782888889313,
        -0.0018565856153145432,
        0.03602530062198639,
        0.04020049795508385,
        0.10525235533714294,
        0.1296152025461197,
        0.08678983151912689,
        0.039304330945014954,
        -0.034776221960783005,
        0.06639665365219116,
        0.02538882941007614,
        -0.08104439079761505,
        -0.05322498455643654,
        -0.026449745520949364,
        -0.04908040910959244,
        -0.02533678710460663,
        0.014467155560851097,
        -0.07709310948848724,
        -0.030268311500549316,
        -0.028408251702785492,
        0.04276349022984505,
        0.03198700770735741,
        -0.02073725312948227,
        -0.05651382356882095,
        -0.01772679202258587,
        0.06468881666660309,
        0.052668776363134384,
        0.02830260433256626,
        0.08109770715236664,
        -0.021235255524516106,
        0.011736229062080383,
        -0.041968513280153275,
        0.003165622940286994,
        -0.04424246773123741,
        -0.00761814508587122,
        -0.043094880878925323,
        -0.09365786612033844,
        -0.024153931066393852,
        0.056153979152441025,
        0.09626670181751251,
        0.07634899765253067,
        0.046944934874773026,
        0.016961555927991867,
        0.004997184034436941,
        -0.03819983825087547,
        -0.01190931536257267,
        0.037439972162246704,
        0.03700042888522148,
        -0.03713914006948471,
        0.021330857649445534,
        0.0523715615272522,
        0.014511825516819954,
        -0.018107175827026367,
        0.06696418672800064,
        0.017208196222782135,
        0.07833350449800491,
        0.026539331302046776,
        -0.06647664308547974,
        -0.021695351228117943,
        0.0421023890376091,
        -0.07219921052455902,
        -0.08786804229021072,
        0.08568833768367767,
        -0.01961410604417324,
        0.10819648951292038,
        -0.0028807497583329678,
        -0.06290861964225769,
        0.03613431379199028,
        -0.0005744544323533773,
        -0.07641001790761948,
        0.042605191469192505,
        -0.015218216925859451,
        0.07017963379621506,
        -0.03396141156554222,
        -0.06224636733531952,
        -0.002295158104971051,
        -1.3134753470897461e-32,
        0.03844274953007698,
        0.03112071193754673,
        -7.826157525414601e-05,
        -0.02369297295808792,
        0.08095348626375198,
        0.024615129455924034,
        0.05797905847430229,
        0.08676020056009293,
        0.07144339382648468,
        -0.028824226930737495,
        0.011431194841861725,
        -0.05779711529612541,
        -0.09186850488185883,
        -0.02944296970963478,
        -0.020150115713477135,
        -0.02673763781785965,
        -0.041074275970458984,
        -0.021849483251571655,
        0.027591433376073837,
        -0.016903700307011604,
        0.03435390070080757,
        0.16284090280532837,
        0.050563786178827286,
        0.03276617452502251,
        -0.010026114992797375,
        0.02736872434616089,
        0.02253679372370243,
        0.06664460152387619,
        0.05484076589345932,
        0.03617599979043007,
        -0.04759705066680908,
        -0.0696575790643692,
        -0.03341217711567879,
        0.004721607081592083,
        -0.002104636514559388,
        0.06457341462373734,
        0.036241646856069565,
        0.030642246827483177,
        -0.035791587084531784,
        -0.05846093222498894,
        0.05398264527320862,
        -0.025725306943058968,
        -0.042777832597494125,
        0.024031987413764,
        0.016883503645658493,
        -0.10988921672105789,
        -0.10327669978141785,
        0.011298653669655323,
        0.0362229160964489,
        -0.00634515006095171,
        -0.06738535314798355,
        -0.08035527914762497,
        -0.01338953897356987,
        -0.02514050155878067,
        -0.028903920203447342,
        0.02090175822377205,
        -0.05360639467835426,
        -0.042885929346084595,
        0.05894504487514496,
        0.03288004919886589,
        0.017266735434532166,
        -0.035130396485328674,
        -0.06085827574133873,
        -0.044317200779914856,
        0.007520167622715235,
        -0.12286274135112762,
        0.10669412463903427,
        0.0069523826241493225,
        -0.003914291970431805,
        -0.03200756758451462,
        -0.034745462238788605,
        0.04950616881251335,
        0.019339492544531822,
        0.01984662190079689,
        0.03003835864365101,
        0.020558515563607216,
        -0.05010639503598213,
        0.006722715217620134,
        0.10905016213655472,
        -0.04986243322491646,
        -0.053071700036525726,
        -0.05931990221142769,
        0.025775304064154625,
        0.0929943397641182,
        0.14073000848293304,
        0.07132334262132645,
        0.08600307255983353,
        0.0014119587140157819,
        -0.021715234965085983,
        0.041491590440273285,
        0.04242685064673424,
        0.07559014856815338,
        0.09782027453184128,
        0.09373826533555984,
        -0.06844031810760498,
        -6.583280054428542e-08,
        0.007916691713035107,
        0.013299593701958656,
        -0.027362601831555367,
        -0.0289591234177351,
        0.048652514815330505,
        -0.07076896727085114,
        -0.019586939364671707,
        0.007744927424937487,
        0.020213348791003227,
        -0.051403291523456573,
        0.09603298455476761,
        -0.022663485258817673,
        -0.013222861103713512,
        0.10116832703351974,
        0.01015632227063179,
        0.05608781427145004,
        -0.08351070433855057,
        0.12104624509811401,
        -0.033064138144254684,
        -0.013219880871474743,
        -0.04738530144095421,
        0.06439699232578278,
        0.04262818768620491,
        -0.05022674798965454,
        0.028797179460525513,
        -0.010339684784412384,
        -0.011985255405306816,
        -0.007023268844932318,
        0.0057019880041480064,
        -0.005142961163073778,
        -0.061206504702568054,
        -0.0017402296653017402,
        0.015635190531611443,
        -0.014245176687836647,
        -0.07916567474603653,
        -0.05164603888988495,
        -0.018165044486522675,
        -0.050611916929483414,
        0.003014477901160717,
        0.005621152929961681,
        0.03901125118136406,
        -0.09303654730319977,
        -0.07258535921573639,
        -0.012166160158813,
        0.018199022859334946,
        -0.06718450039625168,
        0.06846916675567627,
        -0.0848122164607048,
        -0.06266006082296371,
        -0.0036645359359681606,
        -0.07083529978990555,
        0.03154763579368591,
        0.029097020626068115,
        -0.030697479844093323,
        0.06617269665002823,
        -0.011151928454637527,
        0.027398476377129555,
        0.022742047905921936,
        0.02772972546517849,
        0.021917495876550674,
        0.06111690029501915,
        0.009533735923469067,
        -0.04689692333340645,
        0.033905524760484695
    ]
}