{
    "id": "w_eE6qRzaCQ",
    "title": "Samsung Galaxy Fold Review: Future Imperfect",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-11-02T13:30:02Z",
    "video_url": "https://www.youtube.com/watch?v=w_eE6qRzaCQ",
    "category": "Science & Technology",
    "tags": [
        "galaxy fold review",
        "folding phone 2019",
        "samsung fold review",
        "galaxy fold durability test",
        "best folding phone",
        "fold phone",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 293549,
    "likes": 10899,
    "comments_count": 715,
    "description": "Sponsored by dbrand. Get your Galaxy Fold skins here:    [SAMSUNG GALAXY FOLD UNBOXING]  As I walk to FedEx to send back my Galaxy Fold review sample, one thought in my mind overrides every other: \"how do I get one back in my hands?\" Because even though it costs nearly $2000, and it's big and heavy and you need to treat it with kid gloves  the Galaxy Fold really does help those of us who do a lot of computing on the go, and dont always want to carry a laptop.    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SAMSUNG GALAXY FOLD REVIEW]  MrMobile's Samsung Galaxy Fold Review was produced following thirty days with a Samsung Galaxy Fold review sample provided by Samsung. The device was an AT&T-branded review sample tested on AT&T. MrMobile does not produce paid or sponsored reviews; Samsung was not offered copy approval and no compensation was requested or provided in exchange for this coverage.    [LINKS]  My Galaxy Fold display is damaged after a day [TechCrunch]:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links, which afford Mobile Nations a commission if you make a purchase. See Mobile Nations' disclosure policy for more details:   #galaxyfold #foldingphone #samsunggalaxyfold #samsung #galaxyfold2 #smartphones #tech",
    "description_links": [
        "https://dbrand.com/mrmobile-fold",
        "https://www.youtube.com/channel/UCSOp...",
        "https://techcrunch.com/2019/09/26/my-galaxy-fold-display-is-damaged-after-a-day/",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links"
    ],
    "transcript": "- I shot my first video in the studio three years ago, and that beginning of Mr. Mobile was very much a new beginning for me. So it seems fitting that the last video I ever shoot in this space, harolds what I consider to be a new era in smartphones. This is the first folding phone that matters. And this is the Mr. Mobile review. (upbeat music) Don't worry, Mr. Mobile isn't going anywhere, I'm just moving to Brooklyn. And having the fold during that moving process has helped illustrate two very simple reasons. I think the foldable phone is the future. One, it gives you a big screen when you need it and a small one when you don't, and two, it lasts a long time, even when you're running it hard. The latter point is best illustrated in this shot from my last review. Let me explain. I had just come off an evening of shooting photos with the Google Pixel 4 and the phone was basically dead. And my Galaxy Fold had power to spare, as usual. So even though I hadn't brought a USB cable to dinner, I was able to use wireless power share to juice up the smaller phone. By the end of the meal, both phones were about 30%. But the Pixel had started it's day, just five hours earlier. And the Fold was on hour 12 by this point, can you kill the Fold before bedtime? Yeah, the more you use that big screen, especially the less time you'll have, but over my 30 days with it, I only needed to recharge it before bed twice. That's pretty remarkable. Even more remarkable is that large primary screen and not because the execution is perfect. As I've said many times at this point the crease is very visible. Well mine is held up with no major damage over the past month only a few tiny marks the plastic is exceedingly fragile. To see how kind of inconsistent and modeled the display service is just put on a pair of sunglasses, wow. And despite all the legalization Samsung introduced following the spring launch setback, the hinges like any hinge it loosens over time. Making the phone creak and pop a little bit as you move it around in your hand. And after a month, the phone doesn't lie quite as flat as it once did. Moving parts, it's gonna move. And as I said, my unboxing, the lack of desperate water resistance makes this feel like a phone from a decade ago. Early in my review period, I was using the phone on the sidewalk when a sudden rain shower moved in and having to immediately stop what I was doing to pocket the phone or protect it was as surreal as it was frustrating. That's a lot of compromises to accept in exchange for a bigger screen. But here's the thing, a bigger screen is the holy grail of smartphone design. It's why you see manufacturers slimming their bezel pushing screens over the side rails, even putting them on the back of phones. The more area you have, the more you can do it once and whether you're studying real estate listings on a map or tracking the bus you're waiting for a while messaging your buddies or reading a book when you get a spare moment. Absolutely, all of that is more comfortable on the Fold, than on a conventional phone. One time that stands out, I was double checking a flight itinerary on the Pixel 4 as I walked into a coffee shop and once I sat down and pulled it up on the Galaxy Fold instead, the sense of relief I got it was like moving into a larger room. This is why folding phones are gonna be the future because you get the space of a small tablet. But unlike an iPad Mini you can fold this one up and put it in your pocket when you're done. Now to last a long time and to contain more screen than it seems the Fold needs to be big, heavy, fragile and expensive. And it is all of those things. Usually reviews objective is to tell you whether or not you should buy a product. Well for this one, the answer for most people will be no. Even with the redesign. A few review units have shown display issues probably due to thumbs being used on the panel to close the phone. So you need to be ginger and gentle even when doing something you're gonna do like 100 times a day. When it's closed, the outside display is too small to comfortably type on and switching between closed and open positions causes many apps to reopen 'cause they're not built for multi screen phones. This gets really annoying if you're on a conference call. Instagram the world's worst app at adapting to anything that's not an iPhone is a total dog's breakfast on the Fold. And putting up with all this will still cost you nearly $2,000. I'm still sore about the iPhone and Galaxy Note pushing us past the $1,000 mark. The difference is phones like the iPhone and Galaxy Note feel like they're giving us variations on a theme. A different presentation of the same dish. With the Galaxy Fold feels like a bespoke meal no one has ever eaten before. And amidst this the core tenets of a smartphone are all here the cameras are from the Galaxy S10. So yeah, they lack and color accuracy but they make up for it in versatility. The speaker and earpiece are very clear and the narrow chassis makes it comfortable to talk on. And almost all these features get sweeter when you open it. For a bigger viewfinder in the camera, or to make it easier to choose what seat you're seeing your movie from. The (mumbles) Uber Eats alongside Twitter's you can see when you need to go get your delivery. Or as I've been doing a lot, using Google Docs alongside the gallery to build a list of furniture you wanna buy for the new apartment. The bottom line as I get ready to pack this thing up and send it back to Samsung, is that I'm already thinking about ways to get it back. Because even though it does cost $2,000 and you need to treat it with kid gloves, there are a lot of us who actually do a lot of mobile computing on the go and need the added real estate that this screen provides and don't always wanna carry a laptop. In other words, more than a gimmick. It's a useful tool. I'll close with two thoughts. First, if you wanna protect the Galaxy Fold there's a case in the box but it makes the thing even chunkier than it already is. So feel free to hit up my sponsor dbrand for a thin vinyl skin that will sport up the looks and keep it safe from scratches all at a fair price, is also helps soothe the sting of the removal of those fun color options that we had back in the spring. There's a link to dbrand in the description. And second, this isn't the first time Samsung has broken the mold. In 2011, it was widely ridiculed for the first Galaxy Note, which many pandas too big and expensive to succeed. Well, we know how that went. It not only succeeded, it was the primary force in driving phone sizes larger so that all of us could get more done on the go. With this one, Samsung has done it again. The Galaxy Fold is the new Galaxy Note. It's the future of smartphones here today. And while I think most folks should wait for the rumored sequel coming in the spring, mostly, I'm grateful that smartphones are exciting again, and for mostly the right reasons. This review made possible by a Samsung Galaxy Fold review sample provided by Samsung. Mr. Mobile does not produce paid reviews however, and as always, the manufacturer was not granted copy approval. That means Samsung is seeing this for the first time right alongside you. If that's the kind of video you'd like to see more of on YouTube, please subscribe to the Mr. Mobile and stay tuned for an upcoming early look at Motorola's first smartphone with flexible display technology that's expected in mid November. Until next time, thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "Galaxy Fold",
        "Samsung Galaxy Fold",
        "fold",
        "Galaxy Fold review",
        "Galaxy Note",
        "Galaxy",
        "phone",
        "Galaxy Fold feels",
        "Samsung",
        "Mobile",
        "time",
        "screen",
        "Galaxy Note feel",
        "phones",
        "studio three years",
        "Samsung Galaxy",
        "review",
        "Galaxy Note pushing",
        "beginning",
        "Fold review"
    ],
    "transcript_entity_values": [
        "2011",
        "the Galaxy Fold",
        "First",
        "12",
        "Galaxy Note",
        "iPad Mini",
        "about 30%",
        "Galaxy Fold",
        "nearly $2,000",
        "Galaxy Note",
        "Brooklyn",
        "the past month",
        "Samsung",
        "100",
        "a month",
        "Samsung Galaxy Fold",
        "YouTube",
        "spring",
        "the Galaxy S10",
        "USB",
        "$1,000 mark",
        "Mobile",
        "Pixel",
        "Motorola",
        "just five hours earlier",
        "today",
        "30 days",
        "iPhone",
        "first",
        "One",
        "Fold",
        "The Galaxy Fold",
        "two",
        "4",
        "three years ago",
        "harolds",
        "Fold",
        "a decade ago",
        "2,000",
        "mid November",
        "second",
        "Fold",
        "the spring",
        "the Galaxy Fold",
        "Google Docs",
        "Twitter"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "PRODUCT",
        "DATE",
        "MONEY",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "FAC",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.18759416043758392,
        0.049032408744096756,
        0.10527200996875763,
        -0.013670186512172222,
        0.03509536013007164,
        -0.009783062152564526,
        0.00666160648688674,
        0.0944635421037674,
        -0.014583992771804333,
        0.05988875776529312,
        0.059854842722415924,
        0.06933318823575974,
        0.04218875244259834,
        0.02427089773118496,
        0.01737361028790474,
        0.028826449066400528,
        0.04089907556772232,
        -0.08745861798524857,
        -0.03868725895881653,
        0.07067746669054031,
        0.0420893132686615,
        -0.04628587141633034,
        0.043640684336423874,
        -0.0607873760163784,
        0.04627818614244461,
        -0.07210162281990051,
        -0.05999480187892914,
        -0.013227974995970726,
        0.010637580417096615,
        -0.027269817888736725,
        0.018312888219952583,
        0.11211761832237244,
        0.008490849286317825,
        0.027251342311501503,
        -0.0029573298525065184,
        -0.08422861993312836,
        -0.02169983461499214,
        0.025046583265066147,
        -0.03416617587208748,
        -0.054445985704660416,
        -0.05543694272637367,
        -0.032213836908340454,
        -0.03618348762392998,
        0.03425850719213486,
        0.0811353251338005,
        -0.03460178151726723,
        0.06361094117164612,
        -0.009006724692881107,
        -0.02447972074151039,
        0.03423840180039406,
        0.028819303959608078,
        -0.0032737741712480783,
        0.05793499946594238,
        -0.01961868442595005,
        -0.10729946941137314,
        0.020914316177368164,
        -0.011277834884822369,
        0.003500486956909299,
        0.026055436581373215,
        0.030799921602010727,
        0.10466400533914566,
        -0.07379542291164398,
        -0.07059554755687714,
        0.024230442941188812,
        0.03084188885986805,
        0.04191707447171211,
        -0.015621037222445011,
        -0.08824986964464188,
        0.00929797999560833,
        -0.028638659045100212,
        0.0024782558903098106,
        -0.046278517693281174,
        0.06846579164266586,
        0.051390405744314194,
        0.03748122602701187,
        0.055109333246946335,
        0.056879110634326935,
        -0.03501121699810028,
        -0.017135070636868477,
        0.0582147017121315,
        -0.009098954498767853,
        -0.012006154283881187,
        -0.06190779432654381,
        -0.038952406495809555,
        0.013478076085448265,
        -0.033949047327041626,
        0.03352198749780655,
        0.0609288290143013,
        -0.04995455965399742,
        -0.024775434285402298,
        0.046161554753780365,
        0.10015498846769333,
        -0.040680162608623505,
        0.021871713921427727,
        -0.07305621355772018,
        -0.027929404750466347,
        -0.044036898761987686,
        -0.0012158197350800037,
        -0.03019885905086994,
        0.03771570324897766,
        0.03735417500138283,
        0.09167683869600296,
        0.07322728633880615,
        0.05324394255876541,
        0.0036614115815609694,
        -0.08021292835474014,
        0.002635046374052763,
        -0.04481317847967148,
        0.016928808763623238,
        0.04088678956031799,
        0.009017926640808582,
        0.057899829000234604,
        -0.02747311443090439,
        0.03539502993226051,
        -0.07316622883081436,
        0.025038642808794975,
        -0.028557216748595238,
        0.06328423321247101,
        0.09533613920211792,
        0.0259646438062191,
        -0.05479288101196289,
        0.03992852941155434,
        -0.03634810075163841,
        -0.1602083295583725,
        0.006569466553628445,
        -0.018419254571199417,
        -0.039327606558799744,
        5.353302660032456e-33,
        -0.04971826821565628,
        0.10397502779960632,
        -0.03314772620797157,
        0.02522924356162548,
        0.020487500354647636,
        -0.0045805638656020164,
        -0.0380672812461853,
        -0.038340408354997635,
        -0.017358405515551567,
        0.07044956833124161,
        -0.0382426418364048,
        0.03609612584114075,
        -0.0029013522434979677,
        0.0011255157878622413,
        -0.027837950736284256,
        -0.08024667203426361,
        0.012811760418117046,
        -0.031021585687994957,
        -0.0553475096821785,
        -0.010394294746220112,
        -0.009946734644472599,
        -0.04814321920275688,
        0.04410194605588913,
        -0.048267170786857605,
        0.008007398806512356,
        0.0009713004110381007,
        0.03890819102525711,
        -0.015895944088697433,
        0.10842280089855194,
        0.03558621555566788,
        -0.10460644960403442,
        0.004594589117914438,
        0.022566992789506912,
        -0.04536983370780945,
        -0.02972324751317501,
        0.015500995330512524,
        -0.016259703785181046,
        -0.07386992871761322,
        0.022033730521798134,
        0.0005235698772594333,
        -0.05385724455118179,
        0.01433802954852581,
        -0.046567220240831375,
        0.02610236406326294,
        0.023192113265395164,
        -0.05930367484688759,
        0.06651580333709717,
        0.030505137518048286,
        -0.023234719410538673,
        -0.0021456971298903227,
        -0.044554635882377625,
        -0.040351301431655884,
        -0.03677761182188988,
        -0.07504372298717499,
        -0.09202034771442413,
        0.011159948073327541,
        0.03620033711194992,
        -0.048843588680028915,
        0.042150937020778656,
        0.07763891667127609,
        0.025747954845428467,
        0.00873559806495905,
        -0.07721269130706787,
        0.016437435522675514,
        -0.08587303012609482,
        0.018607553094625473,
        0.04583584517240524,
        -0.02858969010412693,
        -0.04237271100282669,
        0.029305288568139076,
        0.026629608124494553,
        0.006094658747315407,
        -0.027239518240094185,
        -0.014736318029463291,
        -0.006641663145273924,
        0.019272899255156517,
        0.04840819165110588,
        0.06716719269752502,
        -0.00761816231533885,
        -0.047909803688526154,
        0.02734464593231678,
        -0.010062026791274548,
        0.04494472220540047,
        -0.03465002775192261,
        -0.007173161022365093,
        -0.044904936105012894,
        -0.04217397794127464,
        -0.06288895756006241,
        0.011516200378537178,
        0.02137652039527893,
        -0.08214718103408813,
        0.00506783789023757,
        0.005086307413876057,
        0.01833832822740078,
        0.02467207983136177,
        -5.429581223141283e-33,
        -0.08571463823318481,
        -0.03251978009939194,
        0.02219475619494915,
        -0.03428081050515175,
        0.002885066671296954,
        -0.05012938752770424,
        0.010754389688372612,
        0.054789770394563675,
        -0.04505223035812378,
        -0.036531999707221985,
        -0.055996060371398926,
        0.040270596742630005,
        0.012058636173605919,
        -0.06280750036239624,
        -0.007740897126495838,
        -0.03385427966713905,
        0.027711959555745125,
        -0.05144324526190758,
        -0.013319780118763447,
        0.03391382843255997,
        0.052048154175281525,
        0.0780939906835556,
        0.010225226171314716,
        0.09718319028615952,
        -0.011919617652893066,
        0.03539865463972092,
        0.01157978642731905,
        0.009535875171422958,
        0.08946654200553894,
        0.02184886485338211,
        0.057725511491298676,
        -0.11370424181222916,
        -0.00762587133795023,
        0.09345481544733047,
        0.043142110109329224,
        -0.009934812784194946,
        -0.008604597300291061,
        0.014391841366887093,
        0.08095882833003998,
        -0.01615738496184349,
        0.05000525712966919,
        0.05119069293141365,
        -0.01862727478146553,
        -0.00915583036839962,
        0.003113384358584881,
        -0.07366551458835602,
        -0.06159427389502525,
        -0.05205882340669632,
        0.005385141354054213,
        -0.044215574860572815,
        0.010254733264446259,
        0.004617934115231037,
        0.044793181121349335,
        -0.06116180121898651,
        -0.07854996621608734,
        0.04923326522111893,
        0.044672589749097824,
        -0.04300481081008911,
        0.04956570267677307,
        -0.012443354353308678,
        0.07063460350036621,
        0.030410999432206154,
        -0.04675981402397156,
        -0.05053776130080223,
        -0.028509652242064476,
        0.02981642447412014,
        0.14216236770153046,
        -0.03097882680594921,
        0.030546175315976143,
        -0.0070008751936256886,
        -0.048284243792295456,
        -0.015637513250112534,
        -0.04847761243581772,
        -0.16478773951530457,
        0.06434223800897598,
        0.12436556816101074,
        -0.039940834045410156,
        0.0003519235469866544,
        -0.028264058753848076,
        -0.04690496623516083,
        0.07491958886384964,
        -0.0474865585565567,
        0.005043048411607742,
        -0.015261268243193626,
        0.023834364488720894,
        -0.051273494958877563,
        0.01789962314069271,
        -0.01881387084722519,
        -0.011852957308292389,
        0.05763297900557518,
        -0.05799723416566849,
        0.00276363268494606,
        -0.0795535072684288,
        0.09063860028982162,
        0.024706140160560608,
        -5.366349853375141e-08,
        0.07573076337575912,
        0.050962164998054504,
        0.10090525448322296,
        0.010185686871409416,
        0.01068106945604086,
        -0.05950755625963211,
        0.003307233564555645,
        -0.07140512019395828,
        0.04399817809462547,
        0.004042917862534523,
        -0.06784112006425858,
        -0.0830305740237236,
        -0.12414342164993286,
        0.01699437014758587,
        0.030415983870625496,
        -0.02123216725885868,
        -0.01881183125078678,
        0.1062011644244194,
        -0.0363590307533741,
        0.07045819610357285,
        -0.029807038605213165,
        0.037736907601356506,
        0.047448478639125824,
        -0.03140527009963989,
        0.06470507383346558,
        0.038814108818769455,
        -0.06739453226327896,
        0.044630732387304306,
        0.02511514350771904,
        0.008354987017810345,
        0.012846480123698711,
        0.002591303549706936,
        0.009136325679719448,
        -0.021711718291044235,
        -0.09766653180122375,
        -0.09581464529037476,
        0.05285012349486351,
        -0.04258670285344124,
        0.0997198149561882,
        0.061597347259521484,
        0.08225098252296448,
        0.0002088036562781781,
        -0.0189228355884552,
        0.05829447880387306,
        -0.07747847586870193,
        -0.05841738358139992,
        -0.04351537674665451,
        -0.06832487881183624,
        -0.016748571768403053,
        0.050445348024368286,
        0.006186249200254679,
        -0.1211007684469223,
        -0.07654149830341339,
        0.0014099344843998551,
        -0.030711721628904343,
        -0.002845640992745757,
        0.03721201419830322,
        0.039152152836322784,
        -0.00171294913161546,
        0.009254909120500088,
        0.03634254261851311,
        -0.10467126220464706,
        -0.021932898089289665,
        0.0318179689347744
    ]
}