{
    "id": "wal6V3odfX4",
    "title": "iPad Pro vs Surface Pro 2017!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-06-22T17:51:10Z",
    "video_url": "https://www.youtube.com/watch?v=wal6V3odfX4",
    "category": "Science & Technology",
    "tags": [
        "ipad pro",
        "surface pro",
        "ipad",
        "surface",
        "microsoft surface",
        "ipad pro 12.9",
        "surface pro 2017",
        "ipad pro 2017",
        "ipad 2017",
        "ipad vs surface",
        "surface pro 5",
        "ipad pro vs surface pro",
        "microsoft",
        "unboxing",
        "comparison",
        "tech",
        "tablet",
        "austin evans"
    ],
    "views": 1624848,
    "likes": 24056,
    "comments_count": 4132,
    "description": "Apple iPad Pro 12.9\" vs Surface Pro 2017 - time to replace your laptop? Microsoft Surface Pro 2017 on Amazon:  Apple iPad Pro 12.9\":  Is the Surface Laptop Worth It?   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://austin.tech/surface2017",
        "https://www.apple.com/shop/buy-ipad/ipad-pro",
        "https://www.youtube.com/watch?v=HKUgxVNSDCw",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. And today I'm going to compare what are arguably two of the most important tablets out right now. The brand new iPad Pro versus the Surface Pro. This might seem like a weird comparison but they line up surprisingly well. Not even counting that they came out within like a couple of days of each other. So to start with, we have the 2017 version of the Surface Pro. So they actually hooked us up with the review unit early, which is funny because it has \"Not packaged for retail sale\" on the box. But I'm going to unbox it anyway because that's what I do. So, the Surface Pro as far as hardware wise should be very very similar to the Surface Pro 4. They've made a couple of small tweaks, mostly like smoothing out corners and what not. But the hardware itself and the dimensions are pretty much unchanged. Inside we had what should be the power adaptor. So if you saw our Surface laptop video you'll know that not only is the adaptor magnetic which is kind of cool but it also has a USB port on it. Next, we have the iPad Pro 12.9 inch. Again another new product. And again something that actually really hasn't changed much since the previous generation, at least on the outside. Inside here we have yet again, pretty straightforward. So this is the actual iPad itself in silver. We also have the Lighting cable, some Apple paperwork, as well as the very very small power adapter. The problem is this is a tiny 12-watt adapter, so compared to the 44-watt power cable for the actual Surface this takes forever to charge a big iPad like this. It still always surprise me a little bit when I touch one of these iPads because it is just so huge. I mean, look at this, this is an iPad. I feel like it's a... Actually is it bigger than the Surface? Oh yeah. The Surface is actually smaller than the iPad. Which I guess makes sense, it's a 12.3 versus a 12.9 inch display but... Wow. One area where the Surface definitely does have an advantage is with ports. So again like the Surface laptop we have the magnetic Surface connector which can be used not only to power it but also for the dock. We also have a full-sized USB 3.0 port, mini display, there's also a headphone jack on this side. If you pop open the kickstand inside of here is a tiny little microSD card slot. The iPad has a Lighting connector and a headphone jack. So for basic tablet use this is fine. When it comes to say connecting a USB device or wanting to use a second display the Surface wins hands down. Something else going for the Surface is the kickstand. It's not only will it stand up by itself right out of the box but the kickstand's also very adjustable. So it will go pretty much all the way flat and you bring it up. And it will stop anywhere along the way. It does add a lot of flexibility. With the iPad you pretty much have to have a cover or a keyboard to get it to stand up by itself. That is where the Smart Keyboard comes in. So like earlier versions all it does is just snap on with magnets to the side of the iPad, and then once you fold it out you get yourself a pretty decent keyboard that's going to be attached to the iPad. So not only does the iPad now support quite a few different keyboard shortcuts, so I can open up something like Spotlight, I can actually command tab to go between different apps, and the keyboard itself is pretty much full-sized and it feels decent to type on. The issue is, there's very little travel. It really does not measure up to something like a proper laptop keyboard. By comparison, the Surface type cover feels a lot better. This has actual key travel, so that actually makes a big difference. And not only this is full layout with back lighting which the iPad is not, but it also has a trackpad. So well, yes, the trackpad is not super necessary on something with a touchscreen. I find I use the touchscreen about like 80% of the time or so, but sometimes it's nice to be able to reach down and just be able to mouse over to something. The issue is that neither of these actually come with their keyboards. So the Type Cover for the Surface is going to run you 130 or a 160 for this Alcantara version. And this Smart Keyboard for the iPad Pro is $170. Which is a shame because you really do need the keyboards to get the most out of these devices. One area you can't complain about with these tablets are the displays. So the Surface Pro is rocking a 12.3 inch panel with a resolution of 2736x1824. This PixelSense display looks phenomenal. No one looking at the Surface display is going to be disappointed, but the issue is the iPad screen is just better. Not only does the iPad have a bigger 12.9 inch display with a resolution of 2732x2048, but it also has some cool features such as True Tone to adjust the white balance depending on what room you're in. It gets really bright with 600 nits of brightness. But what blows all that away is ProMotion. What that means is that the iPad Pro has a 120 hertz refresh rate display. Now that's something that you find on stuff like high end game monitors, and it looks awesome in person. So in video it's a little bit harder to show but the animations are incredibly fluid. And also more important than that it feels super super responsive. Hey guys, this is Austin. This is the Fairphone 2 and it is a fully modular smartphone. The speakers on the iPad Pro are also top notch. So it actually has four speakers, so there's going to be one each corner and combined, it sounds better than a lot of laptops. Hey guys, this is Austin. This is the Fairphone 2 and it is a fully modular smartphone. The Surface actually does sound pretty good as well, so it has two front facing speakers. But compared to the iPad it's just not as loud. All models of the iPad Pro now come with the Apple A10X. This is monster of a processor, with six cores, three performance and three low power cores paired with four gigabytes of RAM is a lot for an iPad. The Surface comes with quite a few different configurations. So not only can you get it with the Core m3, i5 or i7 processor but it also has four, eight, and 16 gigabyte RAM options. Both the Core m3 and i5 models are going to be fanless just like the iPad. But regardless of which Surface you pick up they're all going to be dual core chips based on the new Intel Kaby Lake process. Now that's cool, but on paper the iPad has a big core count advantage. Run them through Geekbench and results are surprising. So not only is the iPad faster when you consider single core scores, but on the multithreaded side it is significantly faster than the Surface. Now this is a Core i5 processor, not even the base model, and yet the iPad Pro is still faster. That is impressive. Also Intel is probably really scared right now. All the power in the world doesn't mean much without software to take advantage of it. So the iPad Pro ships with iOS 10. Though it is not bad, things like Split View really make multitasking a lot more doable on the iPad. However, what's really going to change things is iOS 11. So at first glance it looks fairly similar but just like my wardrobe change there's a lot going on under the hood. So say I'm web browsing and I want to pull up the file menu, all I do is swipe up from the bottom, tap it, and then drag it off to the side and I get my normal split view which I can then just readjust if I'd like. Or if I want I can shrink it back down, and if I pull down from the top it becomes a floating window. So I'm still being able to scroll on Safari but I can also just toss this up to the side and do whatever I need to get done. This way you can get up to three apps on screen at once. Now it's not perfect. This is the very first beta, things are not quite as smooth as they could be, but this goes a long way in making the iPad feel a lot more usable. On the other hand, the Surface of course is running Windows 10 Pro. Now Windows 10 has actually seen some pretty major upgrades over the last couple of years, but I've got to say I'm impressed with how much you can do on the iPad with iOS 11. One area where I have no complaints is with battery life. So the iPad Pro like pretty much every iPad ever is quoted at 10 hours of battery life. Whereas the Surface actually can go all the way up to 13 hours. Regardless, you should easily be able to take these for a full day of use without needing the charger. Both also have solid stylus support. So the Surface Pro has an all new Surface Pen which is supposedly a lot faster. And when I tried it recently, it actually does feel pretty solid. However, the Apple Pencil on the new iPad Pro is stupid fast. It really does feel nearly one to one. The Surface Pro is definitely the safe choice. It's a great Windows PC that just happens to be a tablet. The iPad has a terrific display, it's super fast, and iOS 11 is actually pretty good, but it might not be for everyone. So what do you guys think about these tablets? Which one you would pick up? Let me know in the comments below and I will catch you on the next one.",
    "transcript_keywords": [
        "Surface Pro",
        "iPad Pro",
        "Surface",
        "iPad",
        "Pro",
        "iPad Pro pretty",
        "pretty",
        "iPad Pro versus",
        "Surface laptop",
        "iPad Pro ships",
        "keyboard",
        "display",
        "lot",
        "Core",
        "Surface type cover",
        "Surface display",
        "Pro pretty",
        "Surface type",
        "Surface Pen",
        "power"
    ],
    "transcript_entity_values": [
        "160",
        "six",
        "2017",
        "iPad Pro",
        "a full day",
        "The Surface Pro",
        "130",
        "Safari",
        "2736x1824",
        "three",
        "600",
        "the iPad Pro",
        "16 gigabyte",
        "iPad",
        "first",
        "four gigabytes",
        "RAM",
        "the Apple Pencil",
        "eight",
        "the Surface Pro 4",
        "USB",
        "jack",
        "Core",
        "iPad Pro",
        "Austin",
        "170",
        "the Smart Keyboard",
        "up to 13 hours",
        "two",
        "Apple",
        "12.9 inch",
        "this Smart Keyboard",
        "Surface",
        "44-watt",
        "12.3",
        "about like 80%",
        "120",
        "the iPad Pro",
        "four",
        "iOS 10",
        "Split View",
        "Geekbench",
        "iOS 11",
        "PixelSense",
        "second",
        "one",
        "iPads",
        "12-watt",
        "ProMotion",
        "12.3 inch",
        "Surface Pen",
        "Alcantara",
        "Intel",
        "the last couple of years",
        "microSD",
        "Lighting",
        "Lighting",
        "up to three",
        "like a couple of days",
        "Windows 10 Pro",
        "the Surface Pro",
        "One",
        "10 hours",
        "2732x2048",
        "today",
        "iPad Pro 12.9",
        "nearly one"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "EVENT",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.06167731434106827,
        -0.014451529830694199,
        0.06003516912460327,
        -0.10392100363969803,
        0.11260829865932465,
        -0.014743825420737267,
        -0.028437724336981773,
        0.03652491793036461,
        -0.023573286831378937,
        0.059025634080171585,
        0.04319509118795395,
        0.047106873244047165,
        -0.02740183100104332,
        0.052951496094465256,
        0.035917408764362335,
        0.026939406991004944,
        0.04667782410979271,
        -0.07417487353086472,
        -0.009369419887661934,
        0.03570885211229324,
        -0.06215502321720123,
        -0.04517330229282379,
        0.04588514193892479,
        -0.08626177161931992,
        0.00724372174590826,
        0.02435450069606304,
        0.012066202238202095,
        0.0034077242016792297,
        -0.04511747509241104,
        0.027770044282078743,
        -0.0096893897280097,
        0.03688264638185501,
        -0.03293663635849953,
        0.013513375073671341,
        0.021002670750021935,
        -0.0917876660823822,
        -0.041488271206617355,
        -0.014627266675233841,
        -0.01921597123146057,
        -0.06784151494503021,
        -0.0453861728310585,
        -0.06524190306663513,
        -0.08254960179328918,
        0.05107162147760391,
        0.09431713819503784,
        0.02737143449485302,
        0.045662909746170044,
        -0.015069130808115005,
        0.01429480779916048,
        0.0412890687584877,
        0.02754376269876957,
        -0.03468601405620575,
        -0.03409453481435776,
        -0.057898055762052536,
        -0.0683288499712944,
        0.005513906944543123,
        0.026207560673356056,
        0.006271371152251959,
        0.02783391997218132,
        0.0030420038383454084,
        0.04955276474356651,
        -0.1255492866039276,
        0.011686796322464943,
        0.0015438555274158716,
        0.02532636746764183,
        -0.01284473855048418,
        0.032885946333408356,
        -0.05305015295743942,
        0.021700043231248856,
        -0.0055788429453969,
        -0.06466733664274216,
        0.04439496621489525,
        0.0366637259721756,
        0.006454956717789173,
        0.06450205296278,
        0.0008827168494462967,
        0.04287083446979523,
        -0.018742788583040237,
        -0.03492839261889458,
        -0.05122163146734238,
        0.02531648427248001,
        0.08754222840070724,
        -0.042254675179719925,
        -0.028403161093592644,
        -0.016313208267092705,
        -0.04827170819044113,
        0.024520384147763252,
        0.03531452640891075,
        0.0001046833858708851,
        -0.04365520551800728,
        0.025473618879914284,
        0.03998032957315445,
        -0.02785881981253624,
        0.053231868892908096,
        -0.02794611267745495,
        -0.011565829627215862,
        0.003213325282558799,
        -0.07950232923030853,
        -0.03949946165084839,
        0.009826330468058586,
        -0.019602447748184204,
        0.04975312203168869,
        0.05309949815273285,
        -0.07157644629478455,
        -0.01326560229063034,
        -0.04365556314587593,
        0.005802657455205917,
        0.01682857796549797,
        -0.0480576828122139,
        0.024886487051844597,
        0.064857117831707,
        -0.025499628856778145,
        -0.08097314834594727,
        0.07339943200349808,
        0.02153918333351612,
        0.006694302428513765,
        -0.02061380259692669,
        0.01801527850329876,
        0.10254634916782379,
        0.022910937666893005,
        0.007720042485743761,
        0.042056020349264145,
        -0.006992311216890812,
        -0.04614543542265892,
        -0.08658039569854736,
        0.06505971401929855,
        0.0013347266940400004,
        3.572682551848071e-33,
        -0.020593203604221344,
        0.08981694281101227,
        -0.07015500962734222,
        -0.05286489054560661,
        0.017875485122203827,
        -0.030346132814884186,
        0.005885520484298468,
        0.06709197163581848,
        0.057463906705379486,
        0.02063813991844654,
        -0.11849075555801392,
        -0.03171752393245697,
        -0.059705160558223724,
        -0.03680487349629402,
        0.07825801521539688,
        -0.06793175637722015,
        -0.0315251499414444,
        0.0093367425724864,
        -0.040519628673791885,
        0.023618826642632484,
        0.01542613934725523,
        -0.0033711905125528574,
        -0.032145146280527115,
        -0.003504940075799823,
        -0.011233290657401085,
        0.0038250405341386795,
        -0.01500808447599411,
        0.08205562829971313,
        0.007243097294121981,
        -0.0033890842460095882,
        -0.11580992490053177,
        -0.032089270651340485,
        -0.012686734087765217,
        -0.04942574352025986,
        -0.013889524154365063,
        -0.013535614125430584,
        -0.014865310862660408,
        -0.117850661277771,
        0.06850399076938629,
        -0.05178400129079819,
        -0.12854038178920746,
        0.05525004863739014,
        0.025952262803912163,
        -0.001105401897802949,
        0.0853281021118164,
        0.003013652516528964,
        -0.008795679546892643,
        0.038600433617830276,
        0.017291372641921043,
        -0.04128454625606537,
        -0.0442989282310009,
        0.033604953438043594,
        0.013884743675589561,
        -0.01878230646252632,
        -0.09018848091363907,
        -0.05258120596408844,
        -0.0030016403179615736,
        -0.03578935191035271,
        0.09834735095500946,
        0.07374357432126999,
        0.013048605993390083,
        0.007202048785984516,
        -0.06983831524848938,
        0.011226446367800236,
        -0.0732339397072792,
        0.04062347859144211,
        0.11873362958431244,
        0.040602367371320724,
        -0.0458243153989315,
        -0.027476048097014427,
        0.016509531065821648,
        0.040029119700193405,
        -0.012031848542392254,
        -0.057436708360910416,
        0.011263418011367321,
        -0.030174506828188896,
        0.0412718765437603,
        -0.03059854917228222,
        -0.023449856787919998,
        -0.013089553453028202,
        -0.0454099215567112,
        0.1566062569618225,
        -0.02064363844692707,
        -0.008595116436481476,
        -0.11401921510696411,
        0.04357437416911125,
        0.05966305360198021,
        -0.059763696044683456,
        0.035055745393037796,
        0.019626658409833908,
        -0.02472231164574623,
        0.03907202184200287,
        -0.024140914902091026,
        0.010856684297323227,
        0.04522285237908363,
        -4.6069221546358596e-33,
        -0.0029048677533864975,
        -0.03502330929040909,
        -0.035277679562568665,
        0.031037509441375732,
        -0.052681729197502136,
        -0.015841104090213776,
        0.021516624838113785,
        0.01257055252790451,
        -0.04996291175484657,
        -0.07241808623075485,
        -0.010089206509292126,
        0.004461854230612516,
        0.01912904903292656,
        0.00214141677133739,
        -0.007937735877931118,
        0.072421595454216,
        -0.11616753041744232,
        -0.07708457112312317,
        0.06748770922422409,
        -0.017192168161273003,
        0.13495077192783356,
        0.08886019885540009,
        -0.010915378108620644,
        0.01194777712225914,
        -0.038901206105947495,
        -0.03684328496456146,
        0.021156638860702515,
        -0.011162742972373962,
        -0.004311881493777037,
        0.051695261150598526,
        0.03786614164710045,
        -0.058802198618650436,
        0.01681853085756302,
        0.04820569232106209,
        0.08725131303071976,
        0.0002545873576309532,
        0.043354105204343796,
        -0.061243604868650436,
        -0.007764550857245922,
        0.004714655689895153,
        0.07672253996133804,
        0.03622814640402794,
        0.016392549499869347,
        -0.059496521949768066,
        0.05565101280808449,
        0.0536029227077961,
        0.03278249129652977,
        0.010291227139532566,
        0.04882466420531273,
        -0.0525091290473938,
        -0.0463586263358593,
        0.07536838948726654,
        -0.07649220526218414,
        -0.08779790997505188,
        -0.01265364047139883,
        -0.03829663246870041,
        0.019386176019906998,
        -0.042313218116760254,
        -0.0851413831114769,
        -0.028124161064624786,
        0.010003386996686459,
        0.0029351639095693827,
        0.026833225041627884,
        0.013119972310960293,
        -0.004527296405285597,
        0.05786614120006561,
        0.07681404799222946,
        -0.031570982187986374,
        0.032490797340869904,
        0.029894286766648293,
        -0.0696382075548172,
        -0.05387994647026062,
        -0.08551529794931412,
        -0.12792891263961792,
        -0.012359441258013248,
        0.0776224136352539,
        0.08351987600326538,
        0.03453733026981354,
        -0.0576346218585968,
        -0.026829876005649567,
        -0.01108167041093111,
        0.03539934754371643,
        0.025633614510297775,
        0.009671230800449848,
        0.019829366356134415,
        0.03982795774936676,
        -0.01568298228085041,
        -0.008256083354353905,
        -0.01777680777013302,
        0.07615987956523895,
        0.021571800112724304,
        -0.033005744218826294,
        -0.09018903225660324,
        0.023230981081724167,
        0.012712161988019943,
        -4.1619255597424853e-08,
        0.04421067610383034,
        0.09676960110664368,
        0.1070653572678566,
        0.012980276718735695,
        -0.02585875801742077,
        -0.05317637324333191,
        0.05960153415799141,
        0.0054739308543503284,
        0.09270107001066208,
        0.009029815904796124,
        -0.04886537790298462,
        -0.09619610756635666,
        -0.058768488466739655,
        0.03143875673413277,
        0.05491606518626213,
        0.16834360361099243,
        -0.0677664577960968,
        0.05552468076348305,
        -0.01443686056882143,
        -0.040691982954740524,
        0.008904789574444294,
        0.011634285561740398,
        0.027741452679038048,
        -0.07012318819761276,
        -0.02316099964082241,
        0.0025783267337828875,
        -0.08360730856657028,
        0.04586068540811539,
        0.003065363969653845,
        -0.051347535103559494,
        -0.03951149806380272,
        -0.031451333314180374,
        0.0541713573038578,
        -0.03664330020546913,
        0.07071658223867416,
        -0.09185401350259781,
        -0.0028813506942242384,
        0.06483268737792969,
        0.07901269197463989,
        0.10595697909593582,
        0.0004913640441372991,
        -0.030667001381516457,
        -0.1054648831486702,
        0.0008097010431811213,
        0.05799136310815811,
        -0.018076639622449875,
        -0.033006973564624786,
        -0.061034467071294785,
        -0.02024705335497856,
        0.0925302729010582,
        -0.0004444388032425195,
        0.003339675720781088,
        0.02271537482738495,
        0.07748789340257645,
        0.04466533288359642,
        0.06746614724397659,
        -0.060624998062849045,
        -0.014541982673108578,
        0.006901227403432131,
        0.0667170062661171,
        0.06473717838525772,
        -0.08438946306705475,
        -0.048488497734069824,
        0.07210282981395721
    ]
}