{
    "id": "wBbI0oekq9Q",
    "title": "Our Raised Garden Got Invaded! + the results of our experiment...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-10-17T13:45:03Z",
    "video_url": "https://www.youtube.com/watch?v=wBbI0oekq9Q",
    "category": "Howto & Style",
    "tags": [
        "accessible garden",
        "jerryrig garden",
        "wheelchair garden",
        "raised flowerbed",
        "flowerbed",
        "how to garden",
        "diy planter",
        "planter box",
        "raised bed",
        "redwood planter box",
        "squash bugs",
        "potatos"
    ],
    "views": 789552,
    "likes": 30464,
    "comments_count": 1534,
    "description": "Finally! We harvest the garden after THREE years of using our raised accessible garden boxes. This year we had some really tiny invaders coming in to sabotage our plants... Sad day for the garden... but we still managed to harvest some amazing veggies. The potatoes did GREAT along with the basil. Super fun. We enjoy this yearly project.   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So today's video is a little bit different. If you remember, every year for the past three years or so, we plan a garden in the spring and then we harvest the garden in the fall. [Cambry] And it's always been really fun to do. This year we have a little experiment going with some items that are supposedly compast...[Laughing] Compostable! There we go. So more on that later. -We'll see which ones biodegrade and which ones do not. Plus our garden got invaded this year by someone different than him and we'll explain that more in a second. -Let's get started. [Intro] Cy's going to be a part of this one. It's going to be interesting to see it. Right now he's like crawling, more of like a scoot like an army crawl. But I think by the time we harvest he should be walking. So we'll see the update of that as we go through the year. How are our plants doing, Cambry? -Well it is a hot summer but they are mostly happy and I would say 90% of our seeds showed up. You want to show them? Yeah? -Starting with finger one we have our zucchinis which always do phenomenally well at our place. Our corn is looking pretty good. None of the carrots popped up. Not sure what happened to those. Basil's looking good. Might need to water it a little more. It is really hot today. -So our squash plants are weak but alive. Then we've got a little bit of spinach. A little too hot and it just took too long and they're probably not going to do very well. -It's also interesting, back here there's a random pumpkin plant that we did not plant that just kind of showed up. And then we have our two jalapenos no peppers on them yet though. -Over here in our little forest are our potatoes and they are happy as can be. Over here we made a lot of space for watermelon and we've got one little plant popping up. -That's sad. And there he is. Hopefully he makes it because he looks toasty. Over here the corn for some reason isn't popping up in this corner, but we do have quite a lot of pumpkins making an appearance. Excited about those. Okay buddy, are you going to be here next week? You don't want to be on mom's lap. You outta here? -Yep, we done. [Zack] Why are you guys on the wrong side of the fence? Come on. Get outta here. We are back for week two. This time Cy guy chose to join us although he is missing some clothes. But he did bring...what do you got there dude? Oh you want to show everybody? -Hippopotamus. -The hippopotamus. So Cambry planted some new plants. What are these guys? -They are strawberries and they are happy campers. One of them is starting to turn red. -And do strawberries grow every year or are they... -I think you can get ones that come back but these are just like the one summer deal. -Look like we have some zucchinis popping up which is nice. Our zucchini plants always do ridiculously good. Our corn is also doing well. I'm not sure if I showed this last time or not, but we have a pumpkin that we did not plant growing right next to this corn. I'm going to look at the pumpkins. They are all doing well. -Oh ponies are coming through. -Get. Get. You want to sign us off? -Until next time. -So Cambry is on an international trip to Sweden doing some horse things and so it's just me and the Hulk today. Want to show them the pumpkins? Yes, he does. I think this is update number 3. The pumpkins are thriving and doing well. I'm not sure which two are the white pumpkins but it'll be cool to see what they look like. I was told our corn is not coming up in this section but I was told that we can keep on planting corn until July and it will just harvest at a different time. So that'll be interesting. We'll try planting some more in that corner. Potatoes are doing phenomenal. This row, I'm not sure what's going on, Cambry's in charge of that one. And our zucchini plants like always are doing great. We also have some little strawberries. I mean it's still a little pinkish so maybe we'll wait for a second. This batch is looking pretty good. I will keep you updated on those. Cambry should be back next week. So Cambry hasn't been here for the last couple weeks. She's been off doing some horse stuff and this is her first time seeing the garden since she's been back. It's been a while. -Seriously. Holy smokes! -It's grown quite a bit. -This guy I thought was dead when I left. Holy smokes. -Look how tall the corn is. -Yeah, that was the first thing I noticed. Oh no, our raspberries are... -Strawberries? -I mean strawberries look a little bit sad. And something's been eating them all. Our basil is going crazy, so much happier though. What the freak! -Nice. It's kind of crazy how fast everything changes. The first couple weeks were kind of slow. The pumpkins are not flowering yet. The corn is doing pretty well. We have these potatoes. They're growing. It'll be fun to harvest those this year. So our first harvest is a few zucchinis. They are going to be delicious. Cambry's going to make us some zucchini bread. -And pesto. We've got lots of.. -Oh we have basil? -Yeah, look how much basil we have. -I'll show you some of that. -Basil. [Cambry] The squash plants didn't look like that a few days ago. -What happened to it? -I think it got sunburned and it's like dying right now. -Everything else seems to be doing fine. -Oh there's a squash bug. I think that's part of the reason and I don't have my gloves on to grab it gosh dang it. -We did end up planting some more corn. These are the remnants. So over there where there's missing corn we added those. Potatoes are doing phenomenal this year. And the pumpkins are growing out. We've got to weed this again. We will do pavers either this fall or early spring. And hopefully this plant comes back. So tonight Cambry is making pesto so me and Muscles here are going to grab some basil. She needs about 3 cups of leaves. Whoa. Normally she has a pasta maker where she can make this stuff from scratch, but today I think we're just going to do regular store bought noodles. But the pesto will be homemade. [Zack] How is it, dude? Show them your dance again. You're getting it all over. Is it delicious? Jerry Jr. approved. So we've been slacking. I'm not sure what week update this is, but we haven't been taking the best care of the garden. Cambry's been gone most of the summer. -I have some really sad developments that have happened in the garden. -And Cy, obviously...have you been much help? You just want to see yourself in the camera? Oh yeah. Alright Cambry, what's the low down? -Okay, so a lot of our garden has suffered the consequence of having squash bugs. -Okay, this isn't working. Update is later when someone else is sleeping. The compost is probably doing alright. We haven't checked a whole lot. Looks like we are getting some black nutrient rich material in there. We've kind of been just throwing in whatever organics we have. Like currently we have this...a little bit of rice, a little bit of banana guts from breakfast, and some peaches that we didn't finish. And now hopefully those will biodegrade as we continue our composting experience....experiment. Alright, little dude is asleep. Cambry, break down what's going on with the garden. -Sad news first? -Yes. -This year we had an abundance of squash bugs that killed two small squash plants earlier. And then they came over and started devouring this zucchini plant, although it looks to be recovering a bit. They are all over this. Whoa there's a squash bug right here on a leaf. That's how many we have. Usually they hide. So gross. What they do is they go down to the base of the plant and they suck out all of the juices of the plant. And they just suck them dry. And at first it just looks like you're not watering the plant, and then even when you water the plant they are still drying up and dying. -Which brings us to the pumpkins which we'll get to in a second. It has been probably two or three weeks since we've picked zucchinis and they are not supposed to be this big, but that's what happens when the boss is gone for a while. Alright our corn is looking...it looks like we had some wind storms come in. It's hard to say for sure when the corn is done. It looks like we had a few stocks die back here. I've heard that when the hair on the top is black that's when the corn is kind of done. And it looks like that one might be ready to go. That looks pretty darn good. I will come back to pick that. How are the watermelon's, Cambry? -They started off happy. When you have a high abundance of the squash bugs they go after everything melonish, so squashy-ish I should say. So my watermelons are looking like they might not make it. -Do you think we'll get a spoonful of goodness out of this one? Potatoes are doing good, hopefully, you know, fingers crossed for those. And then our pumpkins are looking really sad. But we've had epic years of pumpkins for the last two years so we might need to move them over a finger to kind of rotate the crops a little bit. Next year is going to be epic when we have the watering system figured out, as well as the pavers and bug control. We have a lot of projects we need to do. We just haven't had a whole lot of time this year. -So these are squash bug eggs. They look like little seeds and usually they are underneath the leaves. So we've got a high population of these. [Baby sounds] [Zack] Today I think has been the most progress. A lot has happened in the last week. Everything is flourishing. Cambry... -Except for my squash plant. -Oh yeah. Oops. -Squash bugs got to it. Okay. But on the bright side, I have never gotten bell peppers like this before. -Whoa. -Right? What the. Something snacked. -Oh man. Bugs are stealing our stuff. -Look at that sucker. And there's an even bigger one right in here but I can't quite reach it, can you grab it? -Not as aesthetically pleasing as what we would see in the store, but I'm sure they taste delicious. -Hey! -Looks like there are some jalapenos down here. I will not be eating this one straight from the plant this year. Last year I was dying for hours. But I do have them on my breakfast sandwiches in the morning. So since these guys have been eaten already, we will toss them into our compost. If you remember from earlier when we started this, we have some things in there that are decomposing and we will dump it all out in the fall and see how far things have gotten. But we help it out with food scraps and that's what decomposes and makes dirt for our garden for next year. The corn is doing fantabulous and the pumpkins are once again taking over, just how we like it. And we actually do have little pumpkins growing. This guy is about the size of a softball. Thought I saw another one over here. Yeah, they're growing. Super green. And then Cambry was also pulling the flowers off of the basil and I'll let her explain why, but it does smell really good here right now. -So I'm pulling off all the blooms and the little budding areas so that the plant emphasizes growth on the leaves because we don't eat the flowers, we eat the leaves. And that's the yummy part so we want the plants to make the leaves bigger. -And we have a whole lot. We are also getting way too many zucchinis again. Our garden is a zucchini heaven. You got to be careful though because these freaking zucchini plants...I don't know if you can see these or not, but there are a bunch of little spikes all along these green stalks and they are very painful. Get outta here. Back for another week. It's interesting that the garden...even though we haven't taken very good care of it, it's still taking relatively good care of us. The corn harvest has been surprisingly good, even though the pumpkins are surprisingly dead. [Laughing] -It's kind of been an embarrassing harvest this year though. -But one thing that's not embarrassing though is how many jalapenos we have. -Yeah, our peppers have rocked it. I don't know why but they are happy campers. -Let's take a look. So right here we have jalapenos and I think we have sweet peppers on this side. Shall we see how many we have to fill the white bowl. This plant right here...the peppers are so big the plant has fallen over. Take a look at that. Whoa, dang! Look at this Cambry. -Holy! That's freakin' bigger than Cy's face. -Here's another big boy. Okay, so I'm probably going to regret this, but we're going to do a taste test between a red jalapeno and a green jalapeno, and we're going to see which ones are more spicy. So these two are about the same size. One's red, one's green. Okay, we'll start with the green. So far it tastes like a green sweet pepper, probably because I didn't get a whole lot of seeds in there. Now we're going to try the red. I think all my taste buds are broken from the first one. This one does not....[cough]...the red one doesn't taste like a green pepper. I feel like my opinion is that the red is far more spicy than the green, but the green has more flavor of the peppers. All right, that was good. And now it's Cambry's turn. -Heck no. I'm not doing it. I don't do spicy. -There's plenty left, just take a bite. -No. You're on your own. -You're smart. I probably should have done the rest of this. We picked about half of them. We're going to leave a bunch on there. The pumpkins are super sad, but we do have a couple of white pumpkins left. Oh I'm dying. A pumpkin here...oh we have a big orange pumpkin back there. And then there's an orange pumpin down here as well. Oh it's like a big warty pumpkin. -Yay! That's what I was hoping for. -Nice. So I am going to go...wooo...find some bread and grab Cy. Is it delicious? -He's going for the big one now. -Whoa that's huge. Slow down Turbo! -Baby approved. -Alright, I think we have a few more massive zucchinis. Oh my gosh, this is like the biggest one we've ever had. Boom. -I don't know what one does with one this large. This is nuts, but our freaking jalapeno bushes are so heavy that they're falling over and they're still producing. And this guy fell over and he's been shading that huge one. -Wow that's massive. Wow. -She's a beaut. -This is as big as your head. -Some little ones. -Even though we haven't been the best at taking care of the garden, the garden is still taking care of us and we appreciate it. And we will see you next week. One thing we haven't really done well in the previous years is potatoes, but this year the leaves have just barely started to die and I think it's time to harvest. -It's always a guessing game you don't see what's beneath it. -Whoa. Alright, they're still in the ground. Man. Well is that a potato right there? -Yeah. Pretty cute. -Delicious. Well that one's not bad. -Well look it down in here. -Wow. Jackpot. Whoa those are huge! -And there are a bunch of them. -Are they like solid too? -Yeah, they aren't squishy. We win this year! -Nice. -Third time's a charm. -We can do french fries with the air fryer and stuff. Plus these keep in a cupboard for a really long time don't they? Or like a pantry or something? Those are huge. That is so big. -Look at all that from that one. Do you want these littles? -Hold on....whoa. We got another big haul. Pumpkins are still struggling. I think we have like 6 of them which is quite a bit different than last year or the year before, but that's what happens. At least we got tons of potatoes. [Cambry] How are they still alive? Fully neglected them and they are still producing. -Which brings us to our last garden update. Right now I would say this year has not been our best year as far as maintaining the garden, but it still treated us very nicely and we did get quite a good harvest out of it. One thing we're going to different this year as well is we're not going to clean the garden up at the end of the year. -Why not? -Because...and I do have some logic to this, not because we're lazy. But I think when we pulled the corn up and stuff like that, we exposed some of the nutritious soil to the sun and the sun just kind of cooks all the nutrients out of it. And so I think if we leave a protective layer over top, then our soil will be better for next year. What do you think about that? -Okay. -And we might be a little bit lazy. -No I can't, there's a spider! This has become a bug oasis. Do you see it? It's beautiful. -I did plant this corn about halfway through the season and it looks like we might be ready to harvest a little bit. I mean it's kind of...dang, this one might look already ready. Uh...not really. It was probably too late. But we do have the pumpkins. -I'm kind of embarrassed about our pumpkins this year. They are measly. We only got I think maybe 5 out of this whole area, whereas our first year, if you remember, they were everywhere. We filled up a whole end of the garden... the end with pumpkins. So the bugs got us this year. -Have you ever seen a pumpkin with a longer stem than this? I just want to see if there's a potato underneath. It's connected to a potato. Good luck buddy! -We haven't watered him. -Yeah. He won't be around for long. So I think my favorite thing we grew this year was the potatoes. Kind of like the first year that we've gotten a good harvest of those. And then trying out the french fries was really fun. What about you? -I loved having basil in the garden this year. -We had a lot. -Yeah. Yeah, we had a lot. It went really happy. We had two different kinds. I think I'm going to go for a different kind...variety...whatever it's called, next time with the bigger leaves. -One of the things we did at the very beginning of the year is we started a compost. A compost basically is all the organic materials that we would have thrown in the trash over the year, instead we put in our compost bin to turn into soil. -A little snack for our garden. Some nice nutrients for it to eat in the future. -And so right now we're going to see which of those things actually composted, or biodegraded, as we empty out the compost. So we didn't put as much stuff in here as we probably should have. You can see, here's the cup that was supposed to be biodegradable, but it isn't really. We have a fork that was supposed to be biodegradable but isn't. And, you know, we could have been better about putting stuff in here. Here's the sponge. It probably would have eventually biodegraded. The oranges with their orange peels obviously aren't very biodegradable. Oh look, here's the wooden fork and wooden knife. That looks like it was on its way out. I don't see the packaging though for the shirts and knives that we sell. That looks like it's completely biodegraded. Or the plate. We put a plate in there too, huh? Then the red Solo cup obviously. Was this something important? I don't remember what that might have been. So it was all kind of a gross science experiment. We learned a lot and the black stuff is going to be really nutritious for the soil. -We learned a lot this year from doing it. We'll add more soil next year...a lot more produce. I think give it a little bit more time to really decompose and it'll be great for the next season. -I might just put it in the ground too. I think the compost would do better out in the open. Maybe just covered out in the open instead of in this rotisserie chicken type of thing. -I guess we'll find out. -Yeah. -I am just overly impressed by all these peppers. We spent a fraction of the time on the garden this year, and this is the best they've ever done. These plants just love life. So I know I'm a little disappointed and embarrassed by our pumpkins this year, but we did grow three different types of variety, and I'm so thrilled that one of these guys came to life. I don't remember the name, but it's just like a warty ugly looking pumpkin and I love it. So glad we got one of these guys. -Jerry Jr. decided to join us. And one thing that turned out worse than the pumpkins was the watermelons. There you go dude. Should we open it up? So Jerry Jr. just had his one year birthday, and he has a few tricks he wants to show you. Cambry do you want to...it's not that bad of a watermelon actually. -It's kind of cute, yeah. -I don't know if I'll...should we let him try some? -No! -Yeah, that is not a delicious watermelon. Now he wants some. -No. -How about a jalapeno? -No! -Where's your nose? -There it is! -Where's your muscles? We won't count that one. Where's your muscles? -Yay! Can you clap? Yay! [Baby sounds] That's another cool trick, huh. -So while our garden might not have grown very well... -This guy has! -This guy has grown extremely well. And he's learning all kinds of new tricks. And next year we have some big ideas and things we're going to focus on. And I think we're going to move the corn somewhere else. -I think next year we're going to move some of the pumpkins to another part of the property. And I want to plant a different variety of basil, and try carrots again. -Tell them to subscribe. -Thanks a ton for watching. -We'll see you around. [Baby sounds] -Anything else you want to say? Ok.",
    "transcript_keywords": [
        "year",
        "Cambry",
        "pumpkins",
        "garden",
        "plant",
        "corn",
        "Yeah",
        "lot",
        "kind",
        "good",
        "plants",
        "time",
        "bit",
        "squash",
        "harvest",
        "pumpkin",
        "back",
        "big",
        "Basil",
        "green"
    ],
    "transcript_entity_values": [
        "hours",
        "the summer",
        "tonight",
        "french",
        "two or three weeks",
        "the end of the year",
        "the past three years or so",
        "-This year",
        "6",
        "Cy",
        "the previous years",
        "the year before",
        "our first year",
        "the last week",
        "the year",
        "Cambry",
        "-Which",
        "two",
        "the last two years",
        "this fall",
        "a fraction",
        "three",
        "about half",
        "July",
        "Jackpot",
        "about 3",
        "next week",
        "This year",
        "the next season",
        "90%",
        "week two",
        "a few days ago",
        "this year",
        "The first couple weeks",
        "early spring",
        "next year",
        "5",
        "Hulk",
        "Jerry Jr.",
        "Turbo",
        "Last year",
        "first",
        "second",
        "-Basil",
        "Cy",
        "-He",
        "the last couple weeks",
        "-Except",
        "last year",
        "the first year",
        "today",
        "Basil",
        "Zack",
        "One",
        "Sweden",
        "3",
        "another week",
        "every year",
        "one",
        "Next year"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "TIME",
        "NORP",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "PERCENT",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.08934582769870758,
        0.08071586489677429,
        -0.04973131790757179,
        -0.08491621911525726,
        0.07795704901218414,
        -0.0571025013923645,
        0.050734154880046844,
        0.0008869390585459769,
        -0.041622694581747055,
        0.09228108078241348,
        0.1520446389913559,
        -0.031381748616695404,
        0.005074802320450544,
        0.026410872116684914,
        -0.0334857739508152,
        0.005783621221780777,
        0.0458068922162056,
        -0.007667000871151686,
        -0.07960008084774017,
        0.10864724218845367,
        -0.04081767797470093,
        0.02912813238799572,
        0.09555905312299728,
        -0.04427361488342285,
        -0.04655678942799568,
        0.022702185437083244,
        -0.05163097009062767,
        0.0769566148519516,
        -0.08143799751996994,
        -0.09572429955005646,
        0.02616818994283676,
        0.09588465839624405,
        -0.05419536307454109,
        -0.011088092811405659,
        0.052844226360321045,
        0.08848772197961807,
        0.03194202482700348,
        -0.013778172433376312,
        -0.010147861205041409,
        -0.01997266337275505,
        0.013802644796669483,
        -0.0940643846988678,
        0.014472919516265392,
        -0.038134921342134476,
        -0.0580725371837616,
        0.018278818577528,
        0.03321065753698349,
        -0.06872226297855377,
        0.041729219257831573,
        -0.10564138740301132,
        -0.04108467325568199,
        -0.005447697825729847,
        0.070730060338974,
        -0.05277101323008537,
        -0.07003172487020493,
        -0.05239874869585037,
        -0.008684789761900902,
        -0.016233067959547043,
        0.00035006299731321633,
        0.000699468539096415,
        0.026965560391545296,
        0.029848728328943253,
        -0.052388645708560944,
        0.06544490903615952,
        -0.022460035979747772,
        -0.016997408121824265,
        -0.00909347739070654,
        -0.07039640098810196,
        -0.03339625149965286,
        -0.03702496737241745,
        -0.03596144914627075,
        -0.009973673149943352,
        0.002474200911819935,
        -0.04775790870189667,
        -0.030062096193432808,
        0.057333316653966904,
        -0.044996898621320724,
        0.027180178090929985,
        0.016776837408542633,
        -0.046532128006219864,
        0.06370928138494492,
        -0.02580913156270981,
        0.03167925775051117,
        0.004752593580633402,
        -0.006740654818713665,
        0.1279623657464981,
        -0.01654716022312641,
        0.07877164334058762,
        0.009717085398733616,
        0.0078053162433207035,
        0.004239702597260475,
        -0.004184242337942123,
        0.047261711210012436,
        0.05212435498833656,
        -0.0027454039081931114,
        -0.06337885558605194,
        -0.08006312698125839,
        -0.1183227077126503,
        -0.08539272099733353,
        0.05020814388990402,
        0.010549182072281837,
        -0.0349610336124897,
        -0.014567885547876358,
        -0.03978428989648819,
        0.059505823999643326,
        -0.02363468147814274,
        -0.08819848299026489,
        0.029956195503473282,
        0.025333670899271965,
        0.018128499388694763,
        0.011320004239678383,
        0.08282078057527542,
        -0.07274920493364334,
        -0.02374201826751232,
        0.01133717130869627,
        0.04175442457199097,
        -0.03092712163925171,
        -0.004236090462654829,
        0.06709519773721695,
        -0.03906727954745293,
        0.06252800673246384,
        0.017100246623158455,
        -0.05683768168091774,
        0.029542842879891396,
        0.06752677261829376,
        0.017524229362607002,
        -0.07182158529758453,
        3.108854888874659e-33,
        0.06281008571386337,
        0.14931674301624298,
        0.007588209118694067,
        -0.00668853847309947,
        0.004866322502493858,
        0.021175766363739967,
        0.00543357664719224,
        0.06389570981264114,
        -0.02298082411289215,
        0.018066324293613434,
        -0.010562025010585785,
        -0.002586491173133254,
        0.011597881093621254,
        -0.032721880823373795,
        0.02877134084701538,
        0.006808400619775057,
        -0.05828674137592316,
        -0.006925936788320541,
        0.0028980241622775793,
        -0.019473494961857796,
        -0.08107278496026993,
        -0.07055336982011795,
        -0.020930204540491104,
        0.11600697040557861,
        0.051664553582668304,
        0.02371869795024395,
        0.0033335573971271515,
        -0.04865046218037605,
        0.0224319975823164,
        0.032337792217731476,
        -0.025216663256287575,
        0.0005605597398243845,
        0.0354316271841526,
        0.04743842035531998,
        -0.06732741743326187,
        0.04023665562272072,
        -0.043818555772304535,
        -0.11598584800958633,
        -0.08581718057394028,
        0.0017279419116675854,
        0.0010879930341616273,
        -0.005788970738649368,
        0.028231460601091385,
        -0.021493585780262947,
        0.02568269520998001,
        -0.05294230952858925,
        -0.022078296169638634,
        0.021761154755949974,
        -0.08440916240215302,
        0.0191258005797863,
        0.02864689752459526,
        -0.009343992918729782,
        0.060042351484298706,
        -0.03676760569214821,
        -0.10004295408725739,
        0.023331383243203163,
        0.045403238385915756,
        0.0051497784443199635,
        -0.011602976359426975,
        0.02989603579044342,
        0.044423628598451614,
        0.0025861007161438465,
        -0.027897167950868607,
        0.026396090164780617,
        -0.07839885354042053,
        -0.0779685452580452,
        -0.00781378522515297,
        0.028019055724143982,
        -0.10137166827917099,
        0.060298580676317215,
        -0.034678563475608826,
        0.0034076147712767124,
        0.013931230641901493,
        -0.03995300829410553,
        -0.016074227169156075,
        0.023443354293704033,
        -0.04061252251267433,
        0.014880715869367123,
        0.05910322070121765,
        -0.05973481759428978,
        0.02217959798872471,
        0.022487560287117958,
        0.0249253511428833,
        -0.014497035183012486,
        -0.08031093329191208,
        -0.030877994373440742,
        0.006770001258701086,
        -0.06845694780349731,
        0.038796041160821915,
        0.02768026478588581,
        0.041506025940179825,
        -0.03091128170490265,
        -0.06463613361120224,
        -0.06332860141992569,
        -0.03494255989789963,
        -5.9378128178750226e-33,
        0.0037643967662006617,
        0.05171407759189606,
        -0.009336058981716633,
        -0.00038697669515386224,
        0.034194156527519226,
        -0.02760683186352253,
        0.039370160549879074,
        0.03306955844163895,
        0.042055945843458176,
        -0.13359612226486206,
        -0.10184120386838913,
        0.0920877680182457,
        -0.021779341623187065,
        -0.06295334547758102,
        0.03897443413734436,
        -0.026898857206106186,
        -0.021709728986024857,
        -0.0641053095459938,
        0.023256316781044006,
        -0.022198114544153214,
        -0.018912170082330704,
        0.07316486537456512,
        0.118303582072258,
        0.02620416320860386,
        -0.022804608568549156,
        0.007077956572175026,
        0.021325839683413506,
        -0.0076845199801027775,
        0.04647519066929817,
        -0.03189157694578171,
        0.028119465336203575,
        -0.10277273505926132,
        -0.0018156798323616385,
        0.05836434289813042,
        -0.018678825348615646,
        0.06816773116588593,
        0.030798455700278282,
        -0.03623583912849426,
        0.020785873755812645,
        -0.07429084181785583,
        -0.024865636602044106,
        0.039667610079050064,
        -0.014028125442564487,
        0.06091649830341339,
        -0.09208565205335617,
        -0.08676022291183472,
        -0.02348054200410843,
        0.029600363224744797,
        -0.03551188483834267,
        0.03149641305208206,
        -0.06386484205722809,
        0.04816516488790512,
        -0.001957237720489502,
        -0.02774960920214653,
        -0.08545976132154465,
        0.04496407136321068,
        0.11183818429708481,
        -0.05026202276349068,
        -0.0204039104282856,
        0.00031980752828530967,
        0.023883501067757607,
        0.024255236610770226,
        -0.10505512356758118,
        0.04825039207935333,
        -0.036903079599142075,
        0.028848880901932716,
        0.056355707347393036,
        0.03842857852578163,
        0.03154100477695465,
        0.023616382852196693,
        0.023820161819458008,
        0.021559394896030426,
        0.012586855329573154,
        -0.09463836252689362,
        0.025930574163794518,
        -0.0296510960906744,
        -0.002662269165739417,
        -0.01957608573138714,
        0.007392984349280596,
        -0.027839170768857002,
        0.02860456332564354,
        -0.03552825376391411,
        0.005651561543345451,
        0.058417703956365585,
        0.08693674951791763,
        -0.05047139525413513,
        0.031129103153944016,
        -0.0012035823892802,
        -0.05279380455613136,
        -0.03662338852882385,
        -0.030133554711937904,
        0.0459878109395504,
        -0.005452523939311504,
        0.12522445619106293,
        0.060109931975603104,
        -6.745437985955505e-08,
        0.04648495838046074,
        0.07042714953422546,
        -0.028041008859872818,
        -0.020700529217720032,
        0.1085115447640419,
        -0.05707760900259018,
        0.00672271940857172,
        0.011930746026337147,
        0.004151530098170042,
        -0.04959942772984505,
        -0.02798469550907612,
        -0.0035281176678836346,
        0.006061633583158255,
        0.0902964249253273,
        0.0204254649579525,
        0.020561950281262398,
        -0.002337171696126461,
        -0.0049221268855035305,
        -0.0925203412771225,
        0.039075564593076706,
        -0.10380339622497559,
        -0.0024518100544810295,
        0.011268354952335358,
        -0.05933333933353424,
        -0.05258495733141899,
        0.018164467066526413,
        -0.10203057527542114,
        -0.04584604874253273,
        0.09945458918809891,
        0.10397689789533615,
        -0.02720150351524353,
        0.00014272567932493985,
        -0.020244332030415535,
        0.0668354481458664,
        -0.0847209021449089,
        -0.019670754671096802,
        -0.11888764053583145,
        -0.032792892307043076,
        0.0525522455573082,
        0.029771212488412857,
        -0.027368763461709023,
        -0.06315227597951889,
        0.015219531953334808,
        0.06604015827178955,
        -0.06833205372095108,
        0.004258135333657265,
        -0.016710838302969933,
        -0.10357499867677689,
        -0.006672779098153114,
        0.04037992283701897,
        -0.030724363401532173,
        0.007015822920948267,
        -0.002744759665802121,
        0.05597909539937973,
        -0.01299397274851799,
        0.03512939065694809,
        0.06395649164915085,
        -0.051505014300346375,
        0.0862204059958458,
        0.04120874032378197,
        -0.038754723966121674,
        -0.024371327832341194,
        -0.025747574865818024,
        0.03285595402121544
    ]
}