{
    "id": "wBhveMRyieI",
    "title": "How is THIS only $799?? - Sony ZV-1",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-05-26T14:00:47Z",
    "video_url": "https://www.youtube.com/watch?v=wBhveMRyieI",
    "category": "Science & Technology",
    "tags": [
        "Sony",
        "Camera",
        "Compact",
        "Point and Shoot",
        "4K",
        "Recording",
        "Auto Focus",
        "Microphone",
        "Dead Cat",
        "Jack",
        "Battery",
        "Lenses",
        "Background",
        "Focus",
        "Sharp",
        "Color",
        "LCD Scren",
        "Slow Motion",
        "960fps",
        "Vlog",
        "Vlogger",
        "Kit",
        "Audio",
        "YouTube",
        "Gear",
        "Flip"
    ],
    "views": 344142,
    "likes": 15274,
    "comments_count": 1062,
    "description": "Sign up for Private Internet Access VPN at   How can you get so much performance for $799? Should we stop using our Red Cameras?  Buy the Sony ZV-1 Camera at BHPhoto (PAID LINK):   Buy the Sony Vlogger Kit at BHPhoto (PAID LINK):   Buy Sony RX100 VII Camera at   Buy ANKER 26800+ Battery Banks On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On NewEgg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/piashortcircuit",
        "https://geni.us/w7tXBRn",
        "https://geni.us/8KJ6",
        "https://geni.us/SCRX100VII",
        "https://geni.us/IklkA",
        "https://shop-links.co/1725432044602327216",
        "https://geni.us/HIGsf",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Today we're gonna check out Sony's new camera, the ZV-1. Which, for those of you who have used the RX100, this camera might seem familiar or close to it, but it's mainly designed for people on YouTube and people who like to vlog. Let's see what Sony has changed to accommodate for that use case. Ah, boxes in boxes, I love that. So this is their Vlogging Kit, which is an accessory package, which we will look at in a second, but this does not come with the camera. And here is the box for the ZV-1. Let's see... oh a little dead cat mount for your microphone that is on the top of the camera. We'll get into that in a second. A battery, a little micro-USB cable. That's a little disappointing. I feel like all cameras should be moving to type C if they possibly can, but this guy seems like it's still using micro-USB. So let's take a look at the camera. Wow, it's actually, it feels lighter to my memory than the RX100. But it is a very similar size. It is the same sensor as the newest RX100 mark VII. The two main physical emissions is that there's no physical ring on the front of the lens that you can turn. On the RX100 you could assign that ring to change your settings and you can assign it to many settings. A lot of people assign it to just aperture because it's convenient. This does not have that. If you look at the top here, it doesn't have the EVF. Personally, when I have used the RX100 in the past, I never really used that 'cause I just found it to be a little bit too small. But for those of you who like that feature, well it's not on this camera. But that's okay because there is a lot of other features designed for vloggers, like a flip out screen. This flips out to the side, has full articulation, which is the best! Every camera that has a design for a flip out screen should use this design. I was really excited when the XT4 had this and I'm excited to see it here. Sony's cameras in the past, like A7S2, and the 889 series have that tilting screen that goes up and not quite all the way. So you can look at it from here, you can't easily, I mean, if your vlogging with an 889 you're probably not doing it super often anyway. But it's nice that you can just hold the camera like this and you can just look at yourself and if you want, to also use it this way, you can hold it like this. Look at that, look how nice that is! And if for whatever reason you're looking from the side, you have options. This is the best design. Anyone who doesn't do this, I've said it a million times, you should do this. The camera is currently off and the screen is folded in, but when you open it, it just automatically turns on. That is such a great way to make sure that you never miss a moment. So there's also a couple of other physical things that Sony has added to this camera, but before we finish looking at those, we'd like to thank today's sponsor, PIA. PIA is a VPN that allows you to browse the Internet anonymously and avoid getting exposed. Connect up to five devices Windows, Mac OS, Android, iOS, and Linux. It encrypts all of your Internet traffic and uses a safe protected IP. Try it risk free for 30 days in the link in the video description. So the lens on this camera is not the same as the RX100 mark VII, which is the newest one. This is a 24 to 70 1.8 to 2.8. The newest RX100 mark VII is a 2.8 lens from 24 to 200mm and 4.5 on the long end. So that means you loose a lot more light on the long end of that lens. It's a shorter range on here, but I think I'd choose a slightly shorter range and a faster stop than having to go all the way to 4.5 on the long end of something like the RX100. But that's up to you, it's a personal choice. Most people are going to use it like this at 24 mm, talking directly to the camera. And when their speaking directly to the camera, Sony has also integrated this new mic which allows pickup from audio coming directly to the front of the camera and tries to cut all the background noise around it. So everything behind your camera, it's optimized for vlogging just like this. They've also included this little dead cat that just slots in. And you have a very easy to set up, even when it's windy, audio solution. And because the mic is larger than Sony's other compact cameras, it would be a lot harder to screw up your audio by putting your finger over your mic. So here's the Vlogger Kit which Sony offers as an optional accessory. Let's see what comes inside. Oh another box in the box situation, sunny! What are you doing? You have this SD card which is nice. 64 gig SD card to come with your camera. It's guaranteed to have no right issues that's always nice. So now I've never used one of these smart grip, they've done stuff like this in the past and it always just kind of seemed like a weird addition. Might have also been a little bit on the expensive side, but I actually see potential for this. People might genuinely use this. So the battery on our camera is almost dead, so why don't we use that opportunity to test if the micro USB allows you to charge it while the camera is in use. It does, that's great! So you can charge your camera and still shoot. And so if you're in a situation where your battery is low, have your battery back plugged in, you can continue vlogging. That is great! Smash that like button! This is how vloggers do this, right. Not to make fun of vloggers. I'm just not one, so for anyone who does vlog out there, leave me a comment on if you think you would use this tripod thing. It is nice that you can have your record, and if you wanted to take a photo and your zoom control all from this little joystick here. So the last thing in the box for the Vlogging Kit is this little pouch to hold your little tripod thing, and this battery. So the type of battery that this little grip uses is a CR2032, which is like one of these tiny watch sized batteries or like maybe a wireless remote control kind of thing. Which I guess is what this is. And now I'm not the biggest fan of it, using this type of battery just because while these batteries are not very expensive, they're not super common. Like you can't necessarily go into a grocery store and buy one of these. Now that being said, let's just pop it in and see how easy this is to setup. My remote is powered it's blinking red here. So for pairing on this little remote you have to hold photo and the zoom rocker up to enter pairing mode. Here we go, allow connection for device and connected, alright that was pretty seamless. Now does it work? Let me put an SD card in and we shall see. No! (laughs) Connecting, pair, all right! We have a paired confirmation, so the remote should now work. Even after you've paired the remote in order to actually use it you have to go through a setting that says Bluetooth Remote Control and you have to toggle that to on, and now the remote should work. Whoa, so now we're rolling on the ZV-1 and I'm testing the zoom rocker which is a slower as it, whoa! You know what, I can actually see if you were vlogging and you wanted to just adjust something like your focal length really really quickly, that's a really nice way to do it. Like I'm sure most people have vlogged own one of those JOBY tripods, the flexible ones, but if you wanted an alternative this grip seems like a good option. And the ZV-1 has a little tally light, so you know when you're recording from the front. Which honestly, would be really useful if you've vlogged and you've ever hit record or thought you hit record, did an entire video 'cause it was a static tripod thing and then you go back to look at your camera and it wasn't recording, that would suck! If you don't want to red dot looking at you when you're vlogging you can actually also turn it off. But personally I'd use it all the time and it's a nice inclusion. So another interesting feature that this camera has is a depth of field button. So there's a button on the corner here, if you press it automatically allows it to have a shallower depth of field. Like it just it'll change the F stop to have a generally shallow depth of field for your shot or you could just turn it off. And then even when i put my hand in front of it, like this, it doesn't go to as shallow depth of field than when the button was on. A button like that allows you to just focus on what you're making your video about, versus like, \"Well what setting? \"Am I at 2.8, am I at 1.8?\" It just allows a little bit more flexibility. Good for Sony for including such a simple feature that will probably help a lot of people. So one of the biggest questions I asked myself is, \"Does it retain all the video settings \"that something like the RX100 has?\" Because Sony has always done a good job of making all of their cameras fairly feature rich. For example right now I'm shooting on here in S-Log three. So if you're the type of person who wants to color grade your images to look that much punchier, that much better, and you just want a higher dynamic range look overall, you have that option. So it's nice to see that ZV-1 also includes the standard XAVC 4K, HD, and AVCHD. That has become known on Sony cameras. You have 4K up to 30 FPS and then if you want to shoot in HD you also have the high frame rate options. The frame rates can go up to 240, 480, and 960 FPS. This is a vlogging camera with 960 FPS. You might not use it that often and it's also not the highest quality 960 FPS, but you have it! It's a feature you can use. It has image stabilization so like this shot, when your hand held like this, you have that extra in body stabilization. Considering this isn't a replacement from the RX100 mark VII, I'm surprised how much this camera retains in terms of features. It's the type of thing that allows someone who's a very basic beginner to grow into it and learn that you can get really, really solid looking images out of a camera that is not big and not difficult to use at all. So I just realized and I've complained about this in my XT4 video as well, by default, out of the box you have to charge your camera through the camera. Please stop doing this! Please include a charger! Having to charge it through the camera is sort of annoying because now we're sitting here with a dead camera, because the battery does not charge faster than it being used. Andy just informed me that the battery charger for the Sony is $48.00 U.S. Guys, $48.00 for the privilege to charge your camera's batteries not within the camera, it is still nice that Sony allows you to charge your camera while it's being used, thank you. But I'm a little bit sad that it can't charge quite fast enough. The ZV-1 also has Sony's hotshoe standard, which is multi interface, which just means that it'll work with all the accessories that Sony has made, generally audio accessories. So you could even put something like the XLR modules that you can get for the A series cameras on here. But it is nice to have the option. If you were making more than one person and you wanted the highest quality audio with no syncing that is an option for you, pretty great. And then wrapping up on the other side of the IO there's standard 3.5 millimeter audio jack that for the longest time everyone wanted it on the RX100 and they did introduce and it is a very helpful addition to see here. And then there's the dreaded micro HDMI. I'm not a huge fan of micro HDMI, I know that's on a camera this size it's hard to accommodate anything larger. To Sony's credit, they have three pieces of IO on the right side of the camera, which is more than most cameras this size and this form factor will have. So let's just do a quick like auto focus test and see how well this thing can keep up. I'm just going to put my hand in front of and back to me. First, back to me. Wow, that's snappy! That is nearly instant and it's doing a great job. Wow, this has another feature that I was surprised that they put into this camera. The RX100's had for awhile, is they have a builtin ND filter. So you can do those like slow shutter speed shots or just get a shallower depth of field in your video, depending on your situation. And that's surprising because the kicker to this camera and what makes it so appealing, guys, is it's 799 U.S. So to put that into context, the RX100 mark VII, the most recent RX100 is $1,298 U.S. All of that for $500 less. I am seriously impressed by the price and on top of that on release Sony is offering this at 749 U.S. and they're also offering the Vlogging Kit, which is usually $210 at 149. So for anyone who's just getting started on YouTube or wants to upgrade their vlogging setup but still maintain a very compact form factor, I think Sony has a winner with this camera. They've done an excellent job of taking everything that makes the RX100 a popular and good vlogging camera and they've just made it better. Honestly, even though I don't vlog, I kinda want one of these. Good job, Sony. And thank you guys for watching. Subscribe to Short Circuit.",
    "transcript_keywords": [
        "camera",
        "Sony",
        "Sony cameras",
        "cameras",
        "Vlogging",
        "nice",
        "mark VII",
        "vlogging camera",
        "Vlogging Kit",
        "battery",
        "charge",
        "VII",
        "remote",
        "thing",
        "people",
        "good vlogging camera",
        "feature",
        "Kit",
        "video",
        "audio"
    ],
    "transcript_entity_values": [
        "70 1.8",
        "24",
        "$48.00",
        "the Vlogger Kit",
        "24 mm",
        "FPS",
        "500",
        "RX100",
        "IO",
        "$1,298",
        "30 days",
        "480",
        "three",
        "micro-USB",
        "EVF",
        "1.8",
        "one",
        "USB",
        "4",
        "U.S.",
        "200mm",
        "240",
        "YouTube",
        "XLR",
        "749",
        "64",
        "2.8",
        "AVCHD",
        "Andy",
        "210",
        "889",
        "second",
        "149",
        "PIA",
        "a million",
        "micro HDMI",
        "IO",
        "K, HD",
        "RX100",
        "Linux",
        "48.00",
        "4.5",
        "2.8",
        "799",
        "Windows, Mac OS",
        "Sony",
        "ND",
        "JOBY",
        "two",
        "up to five",
        "Android",
        "3.5 millimeter",
        "the Vlogging Kit",
        "960",
        "more than one",
        "Short Circuit",
        "RX100 mark VII",
        "the dreaded micro HDMI",
        "SD",
        "First",
        "VPN",
        "jack",
        "YouTube",
        "Bluetooth Remote Control",
        "today",
        "RX100"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "GPE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.07831782847642899,
        -0.013494033366441727,
        -0.03599555790424347,
        -0.013505039736628532,
        0.13346026837825775,
        0.06498376280069351,
        0.06999190896749496,
        0.0998607948422432,
        0.011145022697746754,
        0.023505501449108124,
        0.002367510227486491,
        0.022215109318494797,
        0.05308253690600395,
        0.016429739072918892,
        0.0832182765007019,
        -0.04102444648742676,
        0.06479202210903168,
        -0.048778556287288666,
        -0.004796258639544249,
        0.0046994928270578384,
        0.013014024123549461,
        -0.09387506544589996,
        0.043273139744997025,
        -0.07907614856958389,
        0.0478862002491951,
        -0.006722438149154186,
        -0.008220363408327103,
        0.005125179421156645,
        -0.008894689381122589,
        -0.007402743212878704,
        -0.04166970029473305,
        -0.009234512224793434,
        0.00652793375775218,
        0.01408177986741066,
        0.02094193547964096,
        -0.051342714577913284,
        0.02576914243400097,
        -0.06145508959889412,
        -0.12637750804424286,
        0.0164423156529665,
        -0.005721502471715212,
        0.024725291877985,
        -0.03663938492536545,
        0.0203295536339283,
        -0.006870890036225319,
        -0.0007106984267011285,
        0.08545725792646408,
        0.05383242294192314,
        0.02018728293478489,
        0.01862853579223156,
        -0.0061560096219182014,
        -0.033827491104602814,
        0.03749324008822441,
        0.02201956883072853,
        -0.059194814413785934,
        -0.008073211647570133,
        -0.05449732020497322,
        -0.061652593314647675,
        0.05402783676981926,
        -0.0442458912730217,
        0.037625882774591446,
        -0.08270742744207382,
        -0.05321839451789856,
        0.05487857013940811,
        -0.018722277134656906,
        -0.015663670375943184,
        0.05607139319181442,
        0.0001858516625361517,
        -0.06591079384088516,
        -0.050977665930986404,
        -0.03425917774438858,
        0.08113217353820801,
        0.03235885500907898,
        0.04093766584992409,
        -0.0882258340716362,
        0.02147194929420948,
        0.1439446210861206,
        -0.02566767856478691,
        0.06290553510189056,
        -0.02179837040603161,
        0.07172093540430069,
        -0.009404740296304226,
        -0.07502855360507965,
        0.006470117252320051,
        0.06211058422923088,
        0.022962315008044243,
        0.08197098970413208,
        0.04039608687162399,
        0.008662158623337746,
        -0.06234219670295715,
        -0.02506035938858986,
        0.05456789955496788,
        0.04539116472005844,
        0.001387032330967486,
        -0.03572478145360947,
        -0.020850535482168198,
        0.00260555068962276,
        -0.01247856393456459,
        -0.02234118990600109,
        0.033046379685401917,
        0.03940587490797043,
        0.009695474058389664,
        0.08633258938789368,
        -0.051351286470890045,
        -0.0451735220849514,
        -0.029962772503495216,
        -0.04808369651436806,
        0.13889794051647186,
        0.03881272301077843,
        0.03964276611804962,
        -0.13490700721740723,
        0.023775065317749977,
        -0.04846886172890663,
        -0.055599506944417953,
        -0.06989073753356934,
        0.06272147595882416,
        -0.0908116027712822,
        -0.03114299848675728,
        0.07234108448028564,
        -0.04309558495879173,
        0.010012981481850147,
        -0.03986552730202675,
        -0.0012423046864569187,
        0.019287362694740295,
        0.04281449317932129,
        -0.031799592077732086,
        -0.025295153260231018,
        2.13552775030755e-33,
        -0.08371978998184204,
        0.09681685268878937,
        -0.07167032361030579,
        -0.14955216646194458,
        0.01602187007665634,
        0.09512294828891754,
        0.029464853927493095,
        0.07980360835790634,
        -0.08310437202453613,
        0.003940480761229992,
        -0.08079806715250015,
        0.007085242308676243,
        -0.04163813591003418,
        0.08077722042798996,
        0.0319238156080246,
        -0.0040140338242053986,
        0.023414986208081245,
        -0.017714019864797592,
        0.05564664304256439,
        0.07257859408855438,
        -0.019315950572490692,
        -0.034218598157167435,
        0.07302851229906082,
        0.07012045383453369,
        0.014867790974676609,
        0.0057822358794510365,
        0.018480485305190086,
        0.019245570525527,
        0.09432557970285416,
        -0.002907930873334408,
        -0.01858026161789894,
        -0.002479731570929289,
        0.05037052556872368,
        -0.0038165487349033356,
        0.04055598005652428,
        -0.006603903137147427,
        -0.057333119213581085,
        -0.08783550560474396,
        0.008492407388985157,
        -0.02916104532778263,
        -0.08892997354269028,
        0.11325155943632126,
        -0.14928951859474182,
        -0.07641547173261642,
        0.04376891627907753,
        0.007978955283761024,
        -0.03762997314333916,
        0.04347040131688118,
        -0.040477652102708817,
        0.02408515475690365,
        -0.08884265273809433,
        0.08210138976573944,
        -0.1139548048377037,
        0.004966213367879391,
        -0.0339808352291584,
        -0.06251910328865051,
        0.025488005951046944,
        0.02461855486035347,
        0.00786065123975277,
        -0.013718746602535248,
        0.039476532489061356,
        -0.011895338073372841,
        -0.013094109483063221,
        0.0051383585669100285,
        -0.1217975914478302,
        0.056490592658519745,
        0.03983310982584953,
        -0.017782554030418396,
        -0.04957003891468048,
        -0.0017750654369592667,
        0.0031733722425997257,
        -0.016920629888772964,
        0.06008625775575638,
        -0.044391270726919174,
        0.03834245353937149,
        0.05481080338358879,
        -0.0989639014005661,
        0.015753092244267464,
        0.06952627003192902,
        0.036015477031469345,
        -0.11503192037343979,
        0.055932510644197464,
        0.04783490672707558,
        0.11745022237300873,
        -0.022678490728139877,
        -0.023982789367437363,
        0.009617634117603302,
        0.05358829349279404,
        -0.08167914301156998,
        0.020000455901026726,
        0.006540983449667692,
        -0.026260260492563248,
        0.002458119997754693,
        -0.025815509259700775,
        -0.009359286166727543,
        -2.607593057286334e-33,
        -0.07711347192525864,
        0.042943570762872696,
        -0.05087023973464966,
        0.010531664825975895,
        -0.004121346399188042,
        -0.014555448666214943,
        0.02096232958137989,
        0.003304040525108576,
        0.0019456598674878478,
        -0.08136045932769775,
        0.021820316091179848,
        0.012759598903357983,
        -0.023360805585980415,
        0.024813754484057426,
        0.01330307312309742,
        -0.08672884851694107,
        0.02340451069176197,
        -0.0782046690583229,
        0.029123876243829727,
        -0.034350406378507614,
        0.06302198767662048,
        0.08584769815206528,
        0.03211922198534012,
        0.07511289417743683,
        0.025663970038294792,
        -0.030453409999608994,
        0.0508183054625988,
        0.05883205682039261,
        0.022040972486138344,
        0.002510113874450326,
        -0.019408490508794785,
        -0.02294033020734787,
        -0.02885434962809086,
        -0.01972181163728237,
        -0.0044204555451869965,
        0.016010718420147896,
        0.06573022902011871,
        0.09932790696620941,
        0.05286601185798645,
        -0.003121207468211651,
        0.056152135133743286,
        -0.09190665930509567,
        -0.013121890835464,
        -0.020643875002861023,
        0.02319631539285183,
        -0.014990046620368958,
        -0.0600254125893116,
        -0.060143012553453445,
        -0.019651643931865692,
        0.021148519590497017,
        -0.04704543203115463,
        -0.009878451004624367,
        0.023945225402712822,
        0.02711733989417553,
        -0.07022476941347122,
        0.014483862556517124,
        -0.051329873502254486,
        0.05520050972700119,
        0.018269257619976997,
        -0.016908228397369385,
        0.07290709018707275,
        0.04336622729897499,
        -0.08753696084022522,
        0.114352285861969,
        -0.03227200731635094,
        -0.04399121552705765,
        0.06502103805541992,
        0.03327036276459694,
        0.011726727709174156,
        -0.06431795656681061,
        -0.040505897253751755,
        0.008376077748835087,
        0.041030921041965485,
        0.002785349264740944,
        -0.04780992865562439,
        0.02710786648094654,
        -0.012122640386223793,
        0.009769860655069351,
        0.0695999264717102,
        -0.015041613020002842,
        -0.024759529158473015,
        0.0028051978442817926,
        0.08844880014657974,
        0.0007093145977705717,
        0.05829814821481705,
        0.005151047836989164,
        0.03287700563669205,
        -0.07827665656805038,
        -0.006520212162286043,
        -0.05271558463573456,
        -0.09163852035999298,
        -0.029495904222130775,
        -0.048924390226602554,
        0.032050084322690964,
        -0.018036019057035446,
        -4.9162206749997495e-08,
        0.011347637511789799,
        -0.03545547276735306,
        0.06500941514968872,
        -0.016869133338332176,
        0.029532557353377342,
        -0.07604944705963135,
        -0.0011951758060604334,
        0.03267886862158775,
        0.016088994219899178,
        0.041895776987075806,
        0.07521278411149979,
        -0.04788944497704506,
        -0.047438498586416245,
        -0.040629468858242035,
        -0.036249835044145584,
        0.00510786846280098,
        0.012885496020317078,
        0.03814481198787689,
        0.0013851779513061047,
        -0.0137521643191576,
        -0.03437994793057442,
        0.01975671574473381,
        0.007232649717479944,
        -0.029218506067991257,
        0.019761761650443077,
        0.022937661036849022,
        -0.03455370292067528,
        0.007236712612211704,
        0.07430465519428253,
        -0.05550036579370499,
        -0.017095742747187614,
        0.0074922251515090466,
        0.04820642247796059,
        -0.018557829782366753,
        0.0010977888014167547,
        -0.07050091028213501,
        -0.07982399314641953,
        0.023543324321508408,
        0.06408940255641937,
        -0.014256737194955349,
        0.0072599793784320354,
        -0.055873721837997437,
        0.012815417721867561,
        -0.015036974102258682,
        0.05533558875322342,
        -0.003491410054266453,
        -0.06480706483125687,
        -0.08575944602489471,
        0.029497260227799416,
        0.0011429621372371912,
        -0.004285501781851053,
        -0.002622799249365926,
        -0.04690678417682648,
        -0.013875233940780163,
        0.015214791521430016,
        -0.03773873671889305,
        0.03773767501115799,
        -0.016762016341090202,
        -0.009083263576030731,
        0.14703190326690674,
        0.012028676457703114,
        -0.13125409185886383,
        -0.070496566593647,
        0.06707287579774857
    ]
}