{
    "id": "WCRrrsWYdkM",
    "title": "I bought the WEIRDEST Japanese Tech from Sendico",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-01-28T16:01:33Z",
    "video_url": "https://www.youtube.com/watch?v=WCRrrsWYdkM",
    "category": "Science & Technology",
    "tags": [
        "japan",
        "japanese",
        "tech",
        "sendico",
        "nintendo",
        "color game 6",
        "color tv game 6",
        "sega",
        "sg-1000",
        "sg 1000",
        "sg-1000 ii",
        "sg-1000 2",
        "kunkun",
        "nec",
        "windows",
        "windows 95",
        "pc",
        "pc engine gt",
        "pc engine",
        "turboexpress",
        "pokemon",
        "pokemon emerald",
        "game and watch",
        "austin",
        "austin evans"
    ],
    "views": 385693,
    "likes": 10984,
    "comments_count": 307,
    "description": "Try Acronis Cyber Protect Home Office (formerly Acronis True Image), the most reliable home backup and security on the market   Use our special code AustinEvans2023 and get 40% off your new license.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Windows 95 NEC PC 3:13 PC Engine GT 6:40 Acronis 7:43 Retro Japanese Games 11:35 Sega SG-1000 II 14:03 Pokemon Emerald 15:47 Nintendo Color TV-Game 6 18:26 Kunkun Body Odor Detector",
    "description_links": [
        "http://go.acronis.com/austinevans",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- A huge thank you to the sponsor of this video, Acronis. Welcome back to part two of our odyssey through Sendico, the best spot on the internet to get some weird, wacky and wild Japanese tech. Oh my God, is it full of tungsten cubes? - [Alex] I wish. - This is our NEC PC-9821 CU16. It's not broken or at least not shattered. The size and the heft of this thing is absolutely unbelievable. I don't have an enormous amount of information about the system. I believe it's from the mid-90s. It is a full PC. It's got a Pentium processor and originally it ran Windows 95. It has floppy disc, CD. It is quite yellowed, but in generally good condition. So this is the moment of truth. Did I spend $35 on this PC in junk condition and then a subsequent $200 to have it shipped halfway around the world just for it to not function or did I spend a lot of money to get a vaguely functional Windows 95 Japanese computer? Let's find out, shall we? Oh, CRT's coming to life. Whoa. Oh, oh, there are a lot of cracks and maybe slightly more... (cheering) It works. It works. 640 kilobits of memory. 30 megabyte hard drive, I assume. All right, let me go and find myself a PS2 mouse and keyboard. See if I can get this thing somewhat functional, but it does actually look like it works. The CRT is very blue, but I might be able to just tweak the color and I just need to get it to boot into Windows 95 and not safe mode. But I think we've got ourselves a functional computer. I think we might be okay. So to get our NEC PC to work, we have a couple of extra items. First of all, we grabbed ourselves a voltage stepper. So this is gonna take US 120 volts and give you 100 volts out. Technically, most Japanese electronics actually work on US sort of power supplies just because 100 and 120 volts, like a lot of things will have like a switching power supply. We also tried to use a PS2 keyboard before we realized that this is even older than that. So we bought a Sun keyboard from the 90s in hopes that this actually functions. So let us see if our NEC PC is going to be the easy peasy way to PC with me. (cricket sounds) Well, the screen immediately looks better, I think. It looks sharper. It's not doing that weird like glitchy thing. Windows 95, okay. Oh no, no, that's still blue, unfortunately. There's one color and it's blue. Do you see that? It's like the whole screen like jumps in and out. It feels like this may be on it's last legs. A device file is required to run Windows. The registry references this file, but it does not exist. Press any key to continue. I'm pressing any key. Okay, you know what? I think sometimes in life it's important to take an L with grace. To make me feel better edit team, can you just make this look like it's on fire right now? (yelling) (fire sound) Oh my God, it's on fire. Oh God. This is something that I have no idea what I'm looking at. It's like a small handheld of some variety. A PC Engine GT. If you're asking what's a PC Engine GT, this is the chunkiest of chunkers. It might not look big, but I have hands and this is what it looks like in said hands. It is huge. How much did I pay for this? Because I remember I got a little feisty with some of the bids on this one. - [Alex] We ended up paying 55,500 Yen for this, which translates to about $371. - Look, they're really rare and really cool, okay? But I basically paid as much as a PS5 for this weird obscure Japanese handheld that no one has ever heard of. So let's get some batteries, get some games and see if this actually works. A big reason why this is so heavy and chunky is that this kind of has more in common with the actual home console, maybe like the arcade machines, than it does with something like a Game Boy. This has essentially the full performance and in fact, compatibility, with full home console games in the portable form factor. Do you know how much these were when they were new? They must have been enormously expensive. - [Alex] So it was roughly around 45,000 Yen. It was not a cheap thing way back in the day. - Yeah. So with the batteries installed, this weighs 565 grams or over one pound. So it is truly, for something so small, dense. But it should give us some great performance. Am I stalling right now because I'm afraid to hit the power button to make sure that our very expensive system works? Yes, I am. So you can see that the games for the PC Engine came in a couple of different forms. Even though this looks like a CD, it actually has a card inside. This doesn't seem like something that's 30-year-old technology. Like especially compared to like a Game Boy cart or something, like that's quite impressive. There we go. (mellow music) All right. Here goes nothing. I didn't mean that literally here goes nothing, I meant it more like metaphorically. (laughing) Oh wait, hey, it's coming to life. It just takes a minute to warm up. (laughing) It literally takes a minute to warm up. - [Alex] Yeah, because it's a full fat console. - Oh my God. No, but the screen was like dim dim. It just takes like 30 seconds for the pixels to remember how to pixel. It's gonna be hard to get on camera, so let me actually sit down so we can get a nice tight shot because this is gonna be real hard to see. You can see here over here we have actually some information. So we have gear, we have the tire, we have a bunch of stuff. This looks shockingly good. Like honestly, if I put my head back in the 1990s, we're talking over 30 years ago, this running on a handheld is unbelievable. I think it's clear that this was expensive, but way, way ahead of it's time. And this game is actually kind of playable. When you talk about stuff that has like historical value, when you talk about stuff that is just incredibly cool, the kind of tech that we had, like keep in mind that this was released a year after the original Game Boy. That went from a four color non-backlit display to a full color 60 hertz backlit panel that's running proper console games. Am I saying some of this stuff to make myself feel better that I spent so much money? Yes, yes I am. But I am so happy we got this thing. It is just so, so damn cool. A huge thank you to the sponsor of this video, Acronis. Acronis Cyber Protect Home Office provides complete protection for your data and digital life. It's the only personal solution with a unique integration of cybersecurity and backup technologies. Safeguard your sensitive data against all kinds of modern threats like cutting edge cyber attacks, accidental deletion, disc failure, or even device loss. Gone are the days where you need several services to keep your data safe. Acronis saves you time, money and it's super simple to manage everything from a single interface. Bad actors are getting smarter and harder to stop. Acronis has your back with award-winning backup software that neutralizes cyber threats like ransomware attacks. You've also got comprehensive coverage, protecting you against malware and even identity theft, with features like 24 hour support and up to one million dollars in identity fraud protection, and real-time monitoring and alerts, you can rest easy knowing thieves can't easily scam you. So if you need award-winning backup software, malware protection, and now identity theft all in one, easy to use dashboard, Acronis has your back. Use code AustinEvans2023 for a 40% discount, which can be used for all home office products. And thank you again to Acronis for sponsoring this video. There's so much stuff in here. I don't even know where to begin. It all looks really old. Okay, let's start with this one first, which is Pulse Missile. What is Pulse? Wait, what did I buy? Oh, it's from our big lot of all the weird stuff, isn't it? - [Alex] Yes. - Oh. Okay, so I got a ton of these things. So we'll just go through them one at a time. These are video games, bordering on toys, would be the way I would describe it. So we'll start out with Pulse Missile. Oh, that's adorable. That is actually adorable. Look at that. I'm gonna have some confidence that this is gonna work because this thing looks like it's in good shape and what could have possibly gone wrong in the last 40 years of sitting around someone's attic or garage somewhere? The missile shows up when I hold the fire button, (mellow music) but I turn left and right, nothing happens, and fire and I press the button and it just turns red. Vaguely functional is the way I would describe Pulse Missile. I'm gonna take the batteries out so nothing else gets corroded. And let's find some more of these little toys and see how many of them actually work versus how many of them have succumbed to the ages. Boy, there's a lot. Okay, even if these things don't work, the original boxes are so dope. We just like talk about like sort of 70s and 80s, like retro cool. So the idea with this one seems to be that it is not Space Invader, but an analog, cheaper, more basic version of that game. It's a sort of more standalone thing. And there we go, our invader from space. Okay, we have batteries, let's hit power and see what happens. Oh yeah boy, start. (beeping sound) Oh my God, that is really obnoxiously loud. What happens is like the screen just turns on and off. It's really hard to play. - [Alex] That's kind of dope. - That is really cool. I got a score of 105. I didn't do very well. This is neat. I will give this two giant thumbs up. I mean as a very early analog toy, an electronic game as you might say, that's dope. Oh wow, we got a big one here. This is Scramble by Tomy and Konami. Interesting. All right, let's see what we've got here. So this is the astronomic war game, dynamic multi-screen with an LSI CPU. We've got some switches here. It looks like it is in phenomenal shape. But this is actually kind of wild. Let's plug it in and see what we got. So it's a scroller and I'm also trying to shoot all the stuff along the way. Okay, we'll try again. This is actually really cool. This is much closer to a video game that I would say in a more traditional sense. Scramble gets two enormous thumbs up. The fact that this thing is 40 years old in a nearly flawless condition with the original box for the power supply and everything, all right, all right, I'm feeling this now. I'm feeling this now. This is so cool. And then we've got ourselves a Game and Watch Gold with Manhole. Now, this is a little bit more of the classic Game and Watch, so I know that we have a bunch of these style games. How much did I pay for the lot? - [Alex] Yeah, so for the lot, it was a little bit on the more expensive side, but seeing as how we dug up some like actually neat things, like I feel a little bit better about that. It was 27,500 Yen, which is roughly around $184 US. - I mean, so far I'm actually pretty happy, especially because they all have like the boxes and mostly work short of Pulse Missile, which is a little bit sort of scuffed. So let's fire it up and see. This copy is definitely not in great shape. Oh boy, yeah, that screen's rough. You can see what it's supposed to look like and what it actually looks like. And that screen is, well, it saw better days probably in like the 90s or the 80s. So next up we have the Sega SG-1000 II. All you need to know is that this is one of the very first home consoles that Sega ever made from the early 80s and it looks incredibly cool. How much did I pay for this? And please tell me that I paid for this in good working order, and I didn't buy a junk console. (laughing) - [Alex] Okay, well, let's start with the price. - Lie to me, please. - [Alex] The price is 18,000 Yen, which is roughly around 122 US dollars. (upbeat music) - [Austin] That's fine, that's fine. This is much more similar to a console that we would consider to be an actual video game console compared to some of these earlier things, which were, let's be honest, a mixture of toys and electronics and a little bit of actual tech. Oh snap. That's actually in good shape, isn't it? Oh my God, that's in amazing condition. Hold on. I don't think this was used very much and it's certainly been kept in incredibly good condition over the last 40 years. Let's try these controllers. So it's funny. So the controllers, they do detach, but they have these little like homes that you can sort of pop onto the side of the SG-1000. I guess you slide it? How do you get the controllers off? I know there's a way of doing this. So you pull it. Oh, you pull it, okay. I don't want to break it, okay? So we've got ourselves two controllers, the Sega SJ-150s. Boy, that is sure a D-pad, all right. I was able to find an SG-1000 II original game, which theoretically will work. Again, this stuff is incredibly old, so half of this might not work at all, but this is GP World for the SC 3000 or the SG 1000 series from 1985. It looks really cool. Time to activate our series of adapters, shall we? Okay, GP World for the SG-1000 II. This interface is truly something special. And this is your actual gameplay. You've got all your data up here, your huge map and your very questionable controls here. Wait, is it like auto steering for me? Look, I'm not even touching it, I'm just holding the gas. And if I hold the brake, I can slow down, and hold the gas, I'll speed up, and I crashed. (laughing) Considering what this was for back in the day and the fact that it works, I would consider that to be a win. So when I saw a boxed copy of Pokemon Emerald, I couldn't say no. I mean, how could you say no to this? Now, I don't know if it actually came with that adapter. I don't remember what the listing said, but let's take a look, shall we? All right, so... Oh, we got it. Oh, it came with the adapter. Yes. You would take it and hook it up to your Game Boy. Now, this was made for Game Boy Advance. I think it works with the SP as well as the normal Game Boys. You attach it here, there you go. And then you press this to release it. So with that, I could wirelessly battle and trade with my friends without needing to deal with the link cable. All right, only one thing left for it. Let's actually make sure our game functions and then let's see what we got here. We got Sceptile. Sometimes a Wailord, that's a questionable move. So this is fully functional. Now, of course, how comfortable you are with playing a Japanese copy of the game is gonna depend on how much you have brushed up on your reading Japanese skills. I'm clearly a kanji expert. I can read three to four characters in the whole world. (beeping) How much did I pay for this copy of Pokemon Emerald complete in box? - [Alex] So it was just under 10,000 Yen, which is roughly 66 US dollars. - If you want to buy a complete in box copy of Pokemon Emerald, I bet that would cost you like $300. I'm not even exaggerating. So the fact that we can get this for a fraction and it comes with more stuff, it's cool. Plus this holo pattern makes me feel something inside that I haven't felt since the year 2005. Joy. Next up we have yet another large box. Oh snap. We're going old school yet again. Nintendo has a long and storied history of making toys, sus things, sus places and Mario. But in between some of that, in the late 70s and early 80s before the NES that we all know and love, Nintendo were out here making some interesting stuff. You know, there's obviously the Game and Watch. There's also this. This is the Nintendo TV Game Six. Now, you could largely argue that this is the first proper Nintendo console. This is much more similar to something like Pong or the Odyssey. And that is a proper portable-ish console designed for your TV. How much was this again? It's like not that much money, right? - [Alex] Well you will be happy to know that it is one of our cheaper items at 8,500 Yen, roughly around 57 US dollars. - [Austin] Brilliant. And there you go. Oh, it's actually pretty nice. So I don't know why early consoles all decided that even though you're going to plug this into your TV, you're not gonna include a power adapter, but instead use a bunch of big ass batteries. It only says Nintendo here, which I guess makes sense because if you think about it, no one... Well, I don't want to say no knew what Nintendo was, but Nintendo was like, you know, they made like toys and games and stuff. They weren't really a massive household name. So Color TV Game Six was the name they had for the great, great, great, great, great, great, great-grandfather of the Nintendo Switch. So when it comes to the Nintendo Color TV Game Six, the problem is that because this is sold and so foreign to a US-based television, we have to go through a series of adapters, which as you can see, works, but has completely destroyed the image quality. So this is good as we got, but let's give it a try nonetheless. So it is essentially Pong, from my understanding. Oh wait, where's the ball? Oh, I saw, I saw, I saw it. I saw it, okay. I finally saw it. Ah, yeah. All right, here's the thing. This is not very playable. I wish we had sort of better image quality for it, but ultimately this does work. And someday if we can find a better way of getting an actual video signal out of it, we can enjoy Mario Pong like 10 years before Mario was invented. All right. What? Oh, it's this stupid (quacking sound). Okay. So this is a thing I shouldn't have bought. It's weird. It's not even that old. So this is the Konica Minolta Kunkun. It tells you if something is stinky. I love Japan. Sure, we'll just go with it. So after struggling with the Kunkun for quite a while, we now have it properly paired and ready to test to see how stinky I really am. - To calibrate it, we took it to a Magic The Gathering tournament. (laughing) - So I'm gonna put it really close. I'm going to see if my breath stinks. Ready, and. (blowing sound) - [Ken] Does the score go over 200? - We were able to detect mouth odor. Wait, what? Oh, we were able to measure mouth odor. Okay, my results are three out of 100. - [Alex] That's very good. - That's pretty good. - [Alex] Yay. - Who wants to smell my breath? - [Ken] No. (laughing) (blowing breath sound) (indistinct) - All right, I'll be real. That was pretty neutral. I didn't actually... I was sniffing. - Wait, what if I chew gum and then try it again? I'm gonna see if by chewing some gum, if it can improve my neutral smell. (upbeat music) - [Matt] Oh, the noises. - I've got to aggressively chew. So clearly, my breath now smells like gum. If it detects the odor, then I actually should have a higher number. - [Ken] You sound like a dude that found out how to beat a breathalyzer test and are like making a TikTok about it. (blowing breath sound) Oh my God. - Oh my God, I got up to a 49 of 100. (laughing) So it is. It's just detecting smell. Not good or bad. It's not distinguishing that, it's just smell. So I went from a three with no gum to a 49 with gum. This is science right here, I tell you, science. All right, so now it's gonna tell me if my head smells. Okay. The answer is my head is, oh, oh, oh, oh my goodness. I just got a 93 of 100 for my head smell. (laughing) So I'm wearing deodorant right now. So I'm theoretically thinking that it's gonna smell that deodorant and give me a high score. Yep, we got it. Okay. The score is... Wow, it's pretty good. 39 out of 100. And again, it is that same, quote unquote, sweat odor that it's seeing. I'm a little worried about the smell. The smell of sweat seems to be relatively strong. Use deodorant, idiot. (laughing) So you know what? Kunkun body odor tester remover 9000, I now feel more confident that I can walk into a room and not pull a SpongeBob of (blowing breath sound) and everyone just fainting. - Do you guys want to hear a bathroom joke? - You trying to kill us? - And thank you again to Acronis for sponsoring this video.",
    "transcript_keywords": [
        "Game",
        "Game Boy",
        "games",
        "thing",
        "God",
        "Nintendo",
        "Boy",
        "Pulse Missile",
        "stuff",
        "good",
        "work",
        "Acronis",
        "cool",
        "works",
        "console games",
        "Japanese",
        "console",
        "Game Boy Advance",
        "video game",
        "original Game Boy"
    ],
    "transcript_entity_values": [
        "like 30 seconds",
        "Game Boy Advance",
        "Sendico",
        "Konami",
        "half",
        "SpongeBob",
        "AustinEvans2023",
        "Pulse Missile",
        "first",
        "GT",
        "Nintendo",
        "Pokemon Emerald",
        "Game Boys",
        "the SG-1000 II",
        "30 years ago",
        "the year 2005",
        "NEC",
        "a Magic The Gathering",
        "two",
        "40 years old",
        "a year",
        "Pulse Missile",
        "Matt",
        "four",
        "SG",
        "Kunkun",
        "Japan",
        "one",
        "60",
        "40%",
        "a minute",
        "only one",
        "9000",
        "the Game and Watch",
        "Tomy",
        "Nintendo Color TV Game Six",
        "Pong",
        "the late 70s and early 80s",
        "Alex] Yay",
        "TikTok",
        "SG-1000",
        "Acronis",
        "the Nintendo Switch",
        "the day",
        "Austin",
        "80s",
        "the 1990s",
        "Windows 95",
        "one million dollars",
        "30-year-old",
        "27,500 Yen",
        "120 volts",
        "30 megabyte",
        "SG-1000 II",
        "US",
        "LSI",
        "about $371",
        "Mario Pong like",
        "CRT",
        "39",
        "Scramble",
        "Acronis Cyber Protect Home Office",
        "the early 80s",
        "18,000 Yen",
        "24 hour",
        "93",
        "Sega",
        "300",
        "GP World",
        "8,500 Yen",
        "100 volts",
        "the 90s",
        "200",
        "SP",
        "3000",
        "the days",
        "640",
        "1000",
        "Acronis",
        "First",
        "35",
        "100",
        "the last 40 years",
        "Mario",
        "55,500 Yen",
        "Game Six",
        "three",
        "122 US dollars",
        "Sun",
        "roughly around $184 US",
        "Nintendo",
        "Windows",
        "49",
        "Pentium",
        "Game and Watch",
        "1985",
        "Konica",
        "10,000 Yen",
        "up to",
        "the 90s or the 80s",
        "120 volts",
        "105",
        "565 grams",
        "roughly 66 US dollars",
        "the mid-90s",
        "NES",
        "200",
        "Japanese",
        "CPU",
        "70s",
        "Game Boy"
    ],
    "transcript_entity_types": [
        "TIME",
        "WORK_OF_ART",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "EVENT",
        "DATE",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "FAC",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "MONEY",
        "DATE",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "EVENT",
        "GPE",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "MONEY",
        "TIME",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "MONEY",
        "QUANTITY",
        "DATE",
        "MONEY",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "EVENT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.17522719502449036,
        0.027975773438811302,
        0.007260429207235575,
        0.01965384930372238,
        0.04673812910914421,
        -0.10599784553050995,
        0.06431770324707031,
        0.07637704908847809,
        -0.061184849590063095,
        -0.035206906497478485,
        0.02832154370844364,
        -0.012076226063072681,
        0.04076496139168739,
        0.07292980700731277,
        -0.055537767708301544,
        0.007186584640294313,
        0.030834589153528214,
        -0.06793661415576935,
        -0.048986297100782394,
        -0.0015838630497455597,
        -0.024363595992326736,
        -0.024340322241187096,
        -0.022102676331996918,
        -0.014655216597020626,
        0.025694765150547028,
        0.07306937873363495,
        0.0076669310219585896,
        -0.02196984924376011,
        -0.0642397329211235,
        -0.07725789397954941,
        -0.041944246739149094,
        0.02334512583911419,
        -0.017040621489286423,
        0.033607278019189835,
        0.11464525014162064,
        -0.0011404751567170024,
        0.007176830433309078,
        -0.028960106894373894,
        -0.057654447853565216,
        -0.06076483428478241,
        -0.07456161081790924,
        0.046523235738277435,
        0.06796500086784363,
        0.06553870439529419,
        -0.0048284586519002914,
        -0.005789316724985838,
        -0.03706098347902298,
        -0.07822231948375702,
        0.06758101284503937,
        -0.0333000086247921,
        -0.060742393136024475,
        -0.007218679413199425,
        0.13610832393169403,
        0.07555093616247177,
        0.020576931536197662,
        -0.0883868858218193,
        0.019299281761050224,
        -0.04710263013839722,
        0.015379112213850021,
        -0.07558384537696838,
        0.08155234903097153,
        -0.04779462143778801,
        0.015595149248838425,
        -0.0012357467785477638,
        0.007112880237400532,
        0.022474857047200203,
        -0.0560622438788414,
        -0.005893908906728029,
        0.04392619431018829,
        -0.03856125846505165,
        0.04386743903160095,
        0.05050995573401451,
        -0.01451081782579422,
        0.10287196189165115,
        0.01772690750658512,
        0.05110563710331917,
        -0.0023796032182872295,
        -0.09557449817657471,
        -0.017360784113407135,
        0.05178665369749069,
        -0.0146073829382658,
        0.03506871685385704,
        0.020509859547019005,
        0.005463700741529465,
        0.04617984965443611,
        0.08114871382713318,
        -0.04440886527299881,
        0.024479495361447334,
        -0.030913004651665688,
        0.040967248380184174,
        0.007642474491149187,
        0.021794714033603668,
        0.0558992363512516,
        0.013828900642693043,
        0.03556486591696739,
        -0.019440820440649986,
        0.04646286740899086,
        -0.0005635652341879904,
        -0.06166577711701393,
        0.04811398684978485,
        0.003251040820032358,
        0.02300027199089527,
        0.08505258709192276,
        -0.024764979258179665,
        -0.03415009751915932,
        -0.06338033080101013,
        -0.04933912307024002,
        0.04496632516384125,
        0.03257894888520241,
        0.008378391154110432,
        -0.009658468887209892,
        -0.01694496162235737,
        -0.07367327809333801,
        -0.03232772648334503,
        0.031109130010008812,
        0.004478665068745613,
        -0.09379595518112183,
        0.09705731272697449,
        -0.06151178106665611,
        -0.01358239259570837,
        0.040799032896757126,
        -0.010292327962815762,
        -0.060199424624443054,
        -0.03447280451655388,
        0.12461892515420914,
        -0.02523978054523468,
        -0.022619372233748436,
        7.86269363355415e-33,
        -0.012134900316596031,
        0.11184176057577133,
        -0.03338155895471573,
        -0.020887034013867378,
        1.4915925021341536e-05,
        -0.05035555735230446,
        -0.04549289494752884,
        0.018144402652978897,
        -0.027325864881277084,
        0.07994399964809418,
        -0.1289706826210022,
        0.07768981158733368,
        -0.05302504822611809,
        -0.06366370618343353,
        0.035298433154821396,
        -0.08012571185827255,
        0.014886759221553802,
        0.012610618956387043,
        -0.05022561177611351,
        0.023864775896072388,
        0.09120646864175797,
        0.047825880348682404,
        0.02525992877781391,
        -0.058338623493909836,
        -0.0401923768222332,
        0.026927949860692024,
        -0.01853514462709427,
        -0.04091738536953926,
        0.033299800008535385,
        0.05702250450849533,
        -0.0483415424823761,
        0.049276456236839294,
        -0.031701941043138504,
        0.029564136639237404,
        -0.050945911556482315,
        -0.027044830843806267,
        -0.08784645050764084,
        -0.08792771399021149,
        -0.05186649039387703,
        -0.005252323113381863,
        0.024005474522709846,
        0.0218589436262846,
        -0.06654056161642075,
        0.05761311948299408,
        0.05436531454324722,
        -0.04854452610015869,
        0.045620448887348175,
        0.03486209362745285,
        -0.01131424866616726,
        0.04362928494811058,
        -0.08635274320840836,
        0.03684147074818611,
        0.0282220970839262,
        0.016286835074424744,
        -0.016943085938692093,
        -0.024396633729338646,
        0.1281939297914505,
        -0.0649690181016922,
        0.08276927471160889,
        0.025104690343141556,
        0.08344332873821259,
        -0.01026037149131298,
        0.03964255750179291,
        0.022230874747037888,
        -0.05531759932637215,
        0.005981657654047012,
        0.0036572327371686697,
        -0.01306928787380457,
        0.0034222782123833895,
        0.045928955078125,
        -0.030885817483067513,
        -0.04864827170968056,
        0.03102860599756241,
        -0.017596347257494926,
        0.018610578030347824,
        -0.04292650893330574,
        -0.04127855971455574,
        -0.024808896705508232,
        -0.0693853497505188,
        -0.04692651703953743,
        -0.0846601277589798,
        -0.06519190222024918,
        0.07393211126327515,
        -0.002473860513418913,
        -0.038317129015922546,
        0.05589478090405464,
        -0.007203333079814911,
        0.018257440999150276,
        -0.026209324598312378,
        0.008542079478502274,
        0.03257506340742111,
        -0.09770853817462921,
        0.010064850561320782,
        -0.007409216836094856,
        -0.0696299821138382,
        -6.205702837639637e-33,
        -0.005566019099205732,
        -0.08306644856929779,
        -0.01647840067744255,
        -0.04849450662732124,
        -0.02348652295768261,
        -0.03226470947265625,
        -0.0854702815413475,
        0.15015918016433716,
        -0.005128477234393358,
        -0.02102905511856079,
        0.08287964016199112,
        0.044047728180885315,
        -0.012918306514620781,
        -0.031184133142232895,
        0.023447224870324135,
        0.026019103825092316,
        0.0681232437491417,
        0.00637465575709939,
        -0.005365969613194466,
        -0.015957362949848175,
        0.0054511409252882,
        0.009136003442108631,
        -0.06583517044782639,
        -0.03276936709880829,
        -0.01152597926557064,
        0.14300106465816498,
        0.030882909893989563,
        -0.060295771807432175,
        0.0534835048019886,
        0.07836626470088959,
        -0.058401767164468765,
        0.0007219017716124654,
        0.0015434788074344397,
        0.0823233500123024,
        -0.006355784833431244,
        -0.11066202819347382,
        0.06351586431264877,
        -0.02637268602848053,
        -0.02310880832374096,
        -0.07827908545732498,
        0.0690663680434227,
        0.07982799410820007,
        -0.09204281866550446,
        0.1134384348988533,
        -0.04492665454745293,
        0.0031039114110171795,
        -0.024467790499329567,
        0.03438619151711464,
        0.05146809294819832,
        -0.007268710061907768,
        0.07039070129394531,
        -0.021301979199051857,
        0.03453943878412247,
        0.002086714841425419,
        -0.004790772218257189,
        0.02998414821922779,
        0.023532750084996223,
        0.027088260278105736,
        -0.025454608723521233,
        -0.006328787188977003,
        0.026427317410707474,
        -0.04172278940677643,
        0.00028041814221069217,
        0.02991386316716671,
        0.01882943883538246,
        0.056656159460544586,
        0.07974326610565186,
        0.07984446734189987,
        -0.05078577995300293,
        -0.034517355263233185,
        0.030900124460458755,
        0.06723400950431824,
        -0.029161082580685616,
        -0.05215543136000633,
        0.0577843002974987,
        -0.0360681377351284,
        -0.03815789148211479,
        -0.03906077891588211,
        -0.000860756728798151,
        -0.01726260595023632,
        -0.008830642327666283,
        0.002953155664727092,
        0.03161166235804558,
        0.026323996484279633,
        0.11552122980356216,
        -0.006518827751278877,
        -0.039680980145931244,
        0.023359505459666252,
        -0.05925478786230087,
        -0.02949458360671997,
        -0.06216832995414734,
        0.092901811003685,
        -0.020907090976834297,
        0.054226942360401154,
        0.02302788570523262,
        -6.084637504955026e-08,
        -0.01888580247759819,
        -0.0005473633646033704,
        -0.018314026296138763,
        -0.013762793503701687,
        0.02237222157418728,
        -0.06151226907968521,
        -0.0218237042427063,
        0.0635085254907608,
        -0.00678711524233222,
        -0.038835082203149796,
        0.029403457418084145,
        -0.037126608192920685,
        -0.049248699098825455,
        -0.021948734298348427,
        0.042728129774332047,
        -0.01949041523039341,
        -0.055193059146404266,
        0.05925101414322853,
        -0.05597185716032982,
        -0.025011833757162094,
        0.009076738730072975,
        -0.00042759135249070823,
        0.13474199175834656,
        -0.04451760649681091,
        -0.0551423653960228,
        0.10433092713356018,
        -0.04347458481788635,
        0.0716014951467514,
        0.030812261626124382,
        -0.030746201053261757,
        -0.07130637019872665,
        -0.06634817272424698,
        0.030752239748835564,
        0.023239297792315483,
        0.01753324642777443,
        -0.0033479079138487577,
        -0.016434313729405403,
        -0.011829585768282413,
        -0.003293369198217988,
        -0.0409078486263752,
        -0.016520801931619644,
        -0.09325554966926575,
        -0.04490475729107857,
        0.053432051092386246,
        -0.0038587928283959627,
        -0.047745149582624435,
        -0.031205851584672928,
        -0.0942564308643341,
        0.017673460766673088,
        0.020331747829914093,
        0.018694225698709488,
        -0.00609293207526207,
        0.002165114041417837,
        0.06516389548778534,
        0.0019588489085435867,
        0.01797322928905487,
        0.019416067749261856,
        -0.05110950022935867,
        -0.050371203571558,
        0.11613300442695618,
        0.06654753535985947,
        -0.07185152918100357,
        -0.019208701327443123,
        0.0654105469584465
    ]
}