{
    "id": "WfVF-Ec4naQ",
    "title": "iOS 16 Hands-On: Top 5 New Features!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-07-11T17:20:43Z",
    "video_url": "https://www.youtube.com/watch?v=WfVF-Ec4naQ",
    "category": "Science & Technology",
    "tags": [],
    "views": 10342927,
    "likes": 320756,
    "comments_count": 10004,
    "description": "iOS 16, coming to an iPhone (8 or later) near you  MKBHD Merch:   Wallpapers:          Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://unsplash.com/photos/79iyvY_vzCc",
        "https://highrises.hythacg.com/",
        "https://unsplash.com/photos/cXw7cgv9oB8",
        "https://unsplash.com/photos/MA57M3V78YU",
        "https://twitter.com/outrunyouth/status/1528749330873450497?s=21",
        "https://unsplash.com/photos/WJc8NtS5cLQ",
        "https://unsplash.com/photos/f_eJLUBi6aA",
        "https://twitter.com/brandonjhavard/status/1546549187558375431?s=21",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- The newest version of iOS was revealed by Apple about a month ago, which means sometime in the next few months, your iPhone's gonna change, for the better, luckily, as long as you have an iPhone 8 or later. This is iOS 16. (upbeat music) I've had the beta for iOS 16 on this iPhone for about a month, played around with it a lot. It's not stable enough to make your main just yet, just warning you. But there's a lot of good stuff here, some of which Apple did talk about on stage, some of which they didn't. Either way, this is the five best features in iOS 16. Number five, the ability to edit and unsend messages. I realize I've only been asking to do this on Twitter, but apparently, people have wanted this for iMessage too. So now you can long-press the message you send, and for up to 15 minutes after you first send something, you can edit, and then type what you actually meant to send, and it'll revise to whoever you sent it to. Or if you're just so disgusted with what you originally sent, you can actually unsend a message completely which is pretty sweet. If you do either of these things, the other person will see that it was edited but won't see the edit history. And if you undo send, it just leaves an alert in place for both people. By the way, just as a heads up, if you go to try this feature with someone who isn't on iOS 16 yet, it won't work. They won't see the edit on their end, or the undo on their end so they'll still see the crazy terrible message you initially sent, you've been warned. But that brings us to number four which is live objects. I think I gotta just rewind just little bit so you can understand, or at least fully appreciate how amazing this is. You remember Live Text, right? Live Text lets you open any picture with text in it, and it immediately recognizes that text and lets you interact with it, lets you copy, paste it somewhere, etc. iOS 16 also adds Live Text in videos, if you pause a video on a frame with text somewhere in it, you can lift that text from inside the video that way. But the cherry on top is now in a photo with a subject and a background, you can long-press and literally lift any object out of a photo to copy and paste into whatever you want, messages, for example. So it erases the background, does all the masking for you, and does a surprisingly good job for a literal one-second background delete. You can do this with seemingly any photo too, it's not just like portrait mode photos shot on the iPhone. It can be shot on any camera as a matter of fact, any picture. It just seems to need to have a reasonable subject versus background, and the iPhone will just figure it out. I am very impressed, I'll be making all kinds of stickers for our Discord now. Then, number three for me is the little things, just all the little things added up together, this is one of those things where iOS still looks and feels like iOS so it's not that dramatic of an overhaul. But when you add together all these small things, it does feel like a pretty nice refresh, and I like pretty much all the things that changed. I like that the Weather app finally shows you individual daytime forecast now, it's crazy that it took them buying Dark Sky to finally implement all this. But now, for one day, you can see how the temperature will move and fluctuate throughout the day, or when it'll rain, etc., love it. I like the new video-watching UI if you choose to watch a video in Safari now, clean, simple. I like that face ID works in landscape now, it's a small touch, but finally, thank you. I like that the home screen says, Search, at the bottom where you can pull up a slightly refreshed Spotlight Search UI, pops up from the bottom now. And I use Spotlight all the time so I notice this right away. And I like that the things you order with the Apple Card will start showing up in the Wallet app itself. So if you keep track of everything there, then RIP to some package tracking apps. And I know a lot of people that will like that the iPhone finally has a haptic keyboard, is one of those things that Android has had for so many years, a decade at this point, probably since the beginning. But it's funny 'cause it's one of those things that immediately lets me feel when a phone has a good haptic engine or not. Because first thing you do is type in a wifi password and you can feel the haptic keyboard, and it's either a soft, mushy haptics, or really tight and clicky. The good ones? I leave it on. The bad ones? I turn it off. The iPhone literally has the best vibration motor on any phone so it's about damn time the keyboard gets the haptic feedback and it's very good. It's off by default, but you can easily hop into Settings and turn it on. There's always a bunch of little things with software updates that add up to a bigger change, and I kind of like all these are really good. But now, it's time for the bigger things. Number two is Continuity Camera. This one might be my personal favorite but it is the one I got the biggest announcement reaction on stage, and it was the biggest shocker so it's super cool. Basically, over the years our smartphone cameras have gotten better and better, but webcams in laptops? Not so much. I mean, it was only the M1 MacBooks in 2020 where Apple finally updated to a 1080P webcam, but it still looks worse than a normal phone camera. So Apple had this brilliant idea, why don't we use the good cameras that we make, which are the iPhone cameras, as your webcam? It's genius. You've gotta have iOS 16 and the latest version of macOS Ventura to do it. But once you've got all that going, Continuity Camera wirelessly turns your iPhone into your Mac's webcam. Doing that, not only looks infinitely better, but also gives you access to all the other cool things that your iPhone's camera can do like Portrait mode, Studio Light, and Center Stage if you want, it's pretty sick. But easily, the coolest part of this is called Desk View. By using your phone's ultra wide camera when it's mounted on top of your laptop or your monitor, you can get your standard webcam view, and this top down view of whatever's on your desk in front of you. In this case, it's basically showing what's right in front of your keyboard, where your hands are at, anything that's pretty flat to the ground. It seems like black magic, but it works pretty well. That's a lot of software processing going on, to take the edge of the ultra wide frame and flip it upside down, and turn it into this perfect top down view. But I can see this being crazy useful in so many circumstances as long as whatever object you're working with is pretty flat, so that is dope. And that brings us to number one which is the new lock screen. This is the biggest visual, most obvious change to iOS, it's got the most new stuff here. And it's just all the customization of the clock, and the wallpaper, and all the stuff going on, so let's just jump right in. First things first, the lock screen looks different right away, new clock font, matching colors, some widgets. To start customizing your lock screen, you just hold it down and then hit the Customize button, and then just tap what you wanna start to customize. You can mess with the font and the color, of course, to get the contrast right so things are readable. And then, up above the clock and below the clock, you have slots to add widgets, you can see I already have a few here. And it's kind of like adding them to your home screen, you just pick the one you wanna add, tap it or click to drag it in. And the widgets below the clock are very much just like watch complications, There're these little square, glanceable pieces of information that you can't really interact much with. But when you click them, they open the app that they're associated with. And the ones above the clock are mainly just a text format, so they make a lot of sense for maybe calendar events or weather, things like that. You can already play around endlessly with just that combination of things, you can mess with the clock, the weather, the widgets, whatever else you wanna put in there. But then, what's nice is you can save your layout, what you've made, and then go to create a new one. Now you can save multiple different lock screens that you've customized and set up. And just like watch faces on the Apple Watch, you can just hold it down and switch between any of these ones you've made at any time. But now, here's an extra wrench to throw into this whole equation. If you don't add any bottom widgets, if you just have your clock and maybe a top widget, there's a new feature where the clock will nest itself between the foreground and the background of your wallpaper. And this was not just for Portrait mode photos or photos from the iPhone, this is any photo. Apple is using a little bit more of their AI, their impressive object recognition from that Live Objects feature earlier. And it's able to, with pretty impressive consistency, give me some pretty cool cutouts. It's really too bad it doesn't work once you add widgets under the time, at least in this beta, so you have to choose between a cool clock cutout and lots of widgets on your home screen. But I think this feature is pretty sweet when it works. And I am also a fan of this little animation you're seeing where when you unlock, it fades in the foreground just before it fades in the background from black, it's a nice touch. To take this even further, you can associate any lock screen that you make with a Focus mode. If you have a Focus mode for work, for example, you could already do a certain home screen for work. Now you can have a certain lock screen for work, then you can have a home and lock screen for going to sleep, going to the gym, going home, whatever, all that stuff just ties and switches automatically. And then also now that your lock screen is so much prettier, the notifications roll in and they don't cover your masterpiece anymore, they roll in from the bottom. I really like that change. It's good for reachability on phones of all screen sizes, but it also just seems to make chronological sense the way they've been rolling in. And they keep rolling in from the bottom without interrupting your precious lock screen. And you can choose to display notifications as a stack, a list, or account. In the past, they'd always been a list, that's what we're used to, but I like them as a stack now, it's more compact. And another cool feature Apple added is called Live Activities, and this is basically an app that will update its notification live with new information instead of sending you new notifications over and over again. Something like when your Uber is getting closer and closer to you before it picks you up, or maybe live sports scores, just updates a scoreboard. I really like the new Music Live activity, it's much smaller than the huge widget was before, and you can still scrub through songs, it's great. And also, the new Live Timer notification's pretty sweet, just having that little animation to count down the seconds, just a good amount of polish here on the lock screen. And I think that's really the highlight of iOS 16, is just people are gonna be out here customizing their lock screens, doing crazy stuff with the way they... that's the thing that you interact with the most on your phone. How many times do you think? Maybe 100 times a day you unlock your phone and look at the wallpaper and your lock screen. It's a big deal. That's pretty much it for iOS 16, let me know what your favorite feature is in the comments below. And I'll talk to you guys in the next one, peace. (gentle music)",
    "transcript_keywords": [
        "lock screen",
        "things",
        "screen",
        "iOS",
        "live",
        "lock",
        "pretty",
        "Apple",
        "Live Text",
        "iPhone",
        "Text",
        "clock",
        "good",
        "home screen",
        "camera",
        "widgets",
        "adds Live Text",
        "background",
        "phone",
        "add"
    ],
    "transcript_entity_values": [
        "the next few months",
        "AI",
        "about a month ago",
        "daytime",
        "Desk View",
        "iOS 16",
        "Apple",
        "Ventura",
        "iOS 16",
        "Live Timer",
        "about a month",
        "up to 15 minutes",
        "number three",
        "the M1 MacBooks",
        "Music Live",
        "iMessage",
        "Number two",
        "one day",
        "the day",
        "iOS 16",
        "Weather",
        "1080P webcam",
        "Focus",
        "Continuity Camera",
        "UI",
        "the years",
        "Android",
        "polish",
        "five",
        "first",
        "Center Stage",
        "the Apple Card",
        "Discord",
        "Live Objects",
        "First",
        "iPhone",
        "100",
        "Portrait",
        "iOS 16",
        "Safari",
        "the Apple Watch",
        "a decade",
        "the seconds",
        "Twitter",
        "Studio Light",
        "Mac",
        "iOS 16",
        "Live Text",
        "Dark Sky",
        "2020",
        "Live Activities"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "LAW",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "EVENT",
        "ORG",
        "FAC",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "WORK_OF_ART",
        "FAC",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.011183146387338638,
        0.0015054310206323862,
        0.09352211654186249,
        -0.047834403812885284,
        0.057166121900081635,
        0.03338894248008728,
        -0.014941822737455368,
        -0.02043507620692253,
        0.0012610689736902714,
        -0.01399924885481596,
        0.012885757721960545,
        0.03230779618024826,
        -0.07910531759262085,
        0.04378839209675789,
        -0.006965606473386288,
        0.02177661843597889,
        0.11341072618961334,
        -0.06486084312200546,
        -0.10742220282554626,
        -0.016790492460131645,
        -0.05720056965947151,
        -0.013215433806180954,
        0.04102256894111633,
        0.06827109307050705,
        0.05756627023220062,
        0.020462775602936745,
        -0.08656150102615356,
        -0.06653178483247757,
        -0.055958930402994156,
        -0.03927018865942955,
        0.02007937803864479,
        0.0795341283082962,
        0.10393615067005157,
        0.019880155101418495,
        -0.116862952709198,
        -0.07020538300275803,
        -0.002655685879290104,
        0.016841083765029907,
        -0.006970576476305723,
        -0.05326021835207939,
        -0.0360291562974453,
        -0.009734938852488995,
        -0.068796806037426,
        0.07877840846776962,
        -0.009185047820210457,
        0.029928920790553093,
        0.012068667449057102,
        0.010202081874012947,
        -0.026237910613417625,
        0.01405433937907219,
        0.035601720213890076,
        -0.016561033204197884,
        -0.02838153950870037,
        0.10326412320137024,
        0.004881548695266247,
        0.014558913186192513,
        -0.03484218195080757,
        0.06701141595840454,
        0.0817396491765976,
        0.04778609424829483,
        -0.009662127122282982,
        -0.025981055572628975,
        0.04653461277484894,
        0.011188427917659283,
        0.02132892608642578,
        -0.03682179003953934,
        0.02605544403195381,
        0.025160247460007668,
        0.011908179149031639,
        -0.002073889132589102,
        0.04136443883180618,
        0.009209788404405117,
        0.02890721522271633,
        0.01513646449893713,
        0.03193057328462601,
        0.01672617346048355,
        -0.0055573610588908195,
        -0.02938632108271122,
        -0.09433592855930328,
        0.006639059633016586,
        0.03548591583967209,
        -0.028460854664444923,
        0.06309874355792999,
        -0.06516929715871811,
        -0.004076284356415272,
        -0.02033539116382599,
        -0.03035122901201248,
        -0.0015250641154125333,
        -0.00905620027333498,
        0.027104556560516357,
        -0.007287939544767141,
        0.035547565668821335,
        -0.0026096177753061056,
        -0.006127002649009228,
        0.051236867904663086,
        0.02450270764529705,
        -0.05995146557688713,
        -0.07726329565048218,
        -0.04821504279971123,
        -0.048442941159009933,
        0.04601925611495972,
        0.00528673455119133,
        -0.03507787734270096,
        -0.01098573300987482,
        0.040839314460754395,
        -0.0986703559756279,
        0.06538285315036774,
        -0.04009402543306351,
        -0.012525839731097221,
        0.07203449308872223,
        0.059027768671512604,
        0.029048709198832512,
        0.01801832765340805,
        -0.021703671663999557,
        0.08001891523599625,
        0.01655566692352295,
        0.040605224668979645,
        0.13767309486865997,
        0.1134023517370224,
        0.05299990624189377,
        0.011258531361818314,
        -0.04170794412493706,
        -0.05800659582018852,
        -0.04802771285176277,
        -0.06544608622789383,
        0.0547255277633667,
        -0.026846226304769516,
        2.0937196406816245e-33,
        0.041594963520765305,
        0.09661765396595001,
        -0.08836045861244202,
        0.0166879091411829,
        0.014579626731574535,
        -0.10189042240381241,
        -0.017789103090763092,
        0.04436277598142624,
        -0.04308490827679634,
        -0.032283149659633636,
        0.010935037396848202,
        -0.03489256650209427,
        0.01760758087038994,
        -0.02102597802877426,
        0.10125904530286789,
        -0.08731406182050705,
        -0.05910658463835716,
        0.002507706405594945,
        0.03683064877986908,
        0.014365515671670437,
        -0.02159039117395878,
        -0.010688175447285175,
        -0.033853400498628616,
        -0.0059018549509346485,
        0.057887304574251175,
        0.027557123452425003,
        0.07393769919872284,
        -0.05468855798244476,
        0.016821544617414474,
        -0.03171699121594429,
        -0.08164032548666,
        0.07705668359994888,
        -0.019395736977458,
        -0.03855670988559723,
        0.0016193633200600743,
        -0.005310968495905399,
        0.005585237871855497,
        -0.09107097238302231,
        0.0314084030687809,
        -0.08350280672311783,
        -0.023789692670106888,
        -0.006948948837816715,
        -0.11513204127550125,
        -0.029811831191182137,
        0.018922856077551842,
        0.03811289742588997,
        -0.10872175544500351,
        -0.004592858720570803,
        0.02435551956295967,
        -0.05660376697778702,
        -0.024945957586169243,
        0.05536610260605812,
        -0.07458909600973129,
        -0.0821835845708847,
        -0.049668531864881516,
        0.012325332500040531,
        0.0009408207261003554,
        -0.1019405648112297,
        -0.005907178390771151,
        0.03626658394932747,
        -0.007514243014156818,
        0.016082512214779854,
        -0.03429264947772026,
        -0.054120466113090515,
        -0.01614152453839779,
        0.06562134623527527,
        -0.03704282268881798,
        -0.022014988586306572,
        -0.00519331032410264,
        -0.018425563350319862,
        -0.09462767094373703,
        -0.014195779338479042,
        -0.01744895428419113,
        0.02600564993917942,
        -0.03105592541396618,
        0.04440953582525253,
        0.015511804260313511,
        -0.05678803473711014,
        0.03797128051519394,
        0.010143425315618515,
        0.043706681579351425,
        0.038172390311956406,
        -0.01758187636733055,
        0.06049368530511856,
        0.07864894717931747,
        -0.08466357737779617,
        -0.0009450269280932844,
        -0.048461005091667175,
        -0.009192058816552162,
        0.13241781294345856,
        -0.10798944532871246,
        0.016265999525785446,
        0.036038901656866074,
        0.09417057037353516,
        -0.055780865252017975,
        -3.825132820656619e-33,
        0.05492718517780304,
        -0.07897167652845383,
        -0.07201000303030014,
        0.00294067757204175,
        0.05024594068527222,
        -0.022816454991698265,
        0.008502274751663208,
        0.09012752771377563,
        0.009513928554952145,
        -0.05598906800150871,
        -0.05051218345761299,
        -0.006989152170717716,
        -0.02658139541745186,
        0.03242354467511177,
        -0.08048221468925476,
        -0.009724253788590431,
        -0.03550124168395996,
        -0.01940363086760044,
        -0.06403154879808426,
        0.013690252788364887,
        -0.026354031637310982,
        -0.0016230264445766807,
        -0.05237212032079697,
        0.029413413256406784,
        -0.05333136394619942,
        -0.030229073017835617,
        -0.02374010905623436,
        0.017333976924419403,
        0.025837762281298637,
        -0.0944400355219841,
        0.047927774488925934,
        -0.06514421105384827,
        -0.03231089562177658,
        -0.0591297522187233,
        -0.008290731348097324,
        0.05473059415817261,
        -0.009410304948687553,
        -0.003140743589028716,
        -0.030545366927981377,
        0.029174987226724625,
        0.1415574997663498,
        0.09476063400506973,
        -0.00011560373241081834,
        -0.010880506597459316,
        -0.011308367364108562,
        0.07782299816608429,
        -0.02926131896674633,
        0.09690871834754944,
        -0.07366769760847092,
        0.06774656474590302,
        0.054730165749788284,
        -0.03956964239478111,
        0.047052305191755295,
        -0.026834992691874504,
        -0.05676684528589249,
        -0.006198064424097538,
        0.0020452584140002728,
        -0.014407051727175713,
        0.028514817357063293,
        0.015952249988913536,
        0.06313958764076233,
        -0.012081572785973549,
        0.000436597503721714,
        -0.13409411907196045,
        -0.003212078008800745,
        -0.010584593750536442,
        0.03022245317697525,
        -0.05750579014420509,
        0.01735914684832096,
        0.0496162511408329,
        -0.0628332570195198,
        -0.11046918481588364,
        -0.01181886252015829,
        -0.013050355948507786,
        0.08123816549777985,
        0.018715640529990196,
        0.014077691361308098,
        -0.09177257865667343,
        -0.07580333203077316,
        -0.07038240134716034,
        0.014559292234480381,
        0.13797956705093384,
        0.021695559844374657,
        0.0038801440969109535,
        0.09260345250368118,
        0.09401234239339828,
        0.051104746758937836,
        0.014921070076525211,
        0.05511320382356644,
        0.05563206225633621,
        0.02697575092315674,
        0.04242291301488876,
        0.015657562762498856,
        0.08508116006851196,
        -0.027776017785072327,
        -5.458719698481218e-08,
        0.005358131602406502,
        -0.04636991024017334,
        0.02395765110850334,
        -0.011780203320086002,
        0.014023338444530964,
        -0.02131340280175209,
        0.025045834481716156,
        -0.039128657430410385,
        0.13892404735088348,
        -0.05231273174285889,
        0.0010469143744558096,
        -0.04375786706805229,
        -0.08878093957901001,
        0.024129966273903847,
        0.004057110752910376,
        -0.025646327063441277,
        -0.018834158778190613,
        -0.0355289988219738,
        0.01796349324285984,
        -0.037701014429330826,
        0.034185536205768585,
        0.056084636598825455,
        -0.015160062350332737,
        -0.037454597651958466,
        0.0385420061647892,
        0.007330091204494238,
        0.06071576476097107,
        -0.00023260823218151927,
        -0.0301939956843853,
        -0.013895020820200443,
        0.02740170992910862,
        -0.0011184741742908955,
        0.06323397159576416,
        -0.006285378709435463,
        -0.039830680936574936,
        0.00563984178006649,
        0.02309354580938816,
        -0.08192762732505798,
        0.060974691063165665,
        -0.007726605050265789,
        0.06970716267824173,
        -0.016972078010439873,
        0.006884605158120394,
        0.0012667955597862601,
        -0.022478148341178894,
        -0.0631028413772583,
        0.0017161256400868297,
        -0.11548921465873718,
        -0.021028831601142883,
        0.04829087853431702,
        -0.07574635744094849,
        -0.0324990339577198,
        0.04152139276266098,
        0.053830601274967194,
        0.14689552783966064,
        0.011720542795956135,
        0.027887064963579178,
        -0.0013875985750928521,
        0.03362233564257622,
        -0.036171868443489075,
        0.10589354485273361,
        -0.06166577339172363,
        -0.036258596926927567,
        0.009427890181541443
    ]
}