{
    "id": "wIC-iGDTU40",
    "title": "The LED's Challenge to High Pressure Sodium",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-06-19T16:04:26Z",
    "video_url": "https://www.youtube.com/watch?v=wIC-iGDTU40",
    "category": "Science & Technology",
    "tags": [
        "LED",
        "light emitting diode",
        "street light",
        "traffic light",
        "stop light",
        "high pressure sodium",
        "HPS",
        "roadway light",
        "outdoor lighting",
        "light pollution",
        "circadian rhythm",
        "blue light",
        "leds and blue light"
    ],
    "views": 1497019,
    "likes": 46948,
    "comments_count": 6012,
    "description": "You can support this channel on Patreon!  Link below      Now that we know why street lights are orange, lets look at whether or not they should still be so.  The answer isnt as straightforward as it might seem.  Although newer technology seems to surpass HPS in nearly all respects, there are still considerations to be made.  Link to the Previous Video:   Technology Connections on Twitter:   Sources (lots of great ones!): Lighting Research Center study comparing induction and metal halide sources to HPS:   US Department of Energys information on blue light sources in street lighting:   University of Pittsburghs environmental assessment of LEDs (in case you are worried about the extra e-waste compared to the mercury and sodium):   Some general info on spectral sensitivity of the human eye:   Basic info on light pollution (including relative impacts on sky glow) came from everyones favorite reliable source of knowledge:   Spec sheet for the Cree LED   Product overview:   More info on spectral misalignment:   Where Dr. Alan Lewis research is cited:    You can support this channel on Patreon!  Patrons of the channel are what keep these videos coming.  If youre interested in supporting the channel with a contribution of your choosing, please check out my Patreon page.  Thanks for your consideration!   And thank you to the following Patrons! Charlie Quigley, Dakota Williams, Adam Erickson, Kevin Terrell, Tommi Hares, Trevor Smith, Thomas Fuchs, Callum Brieske, Tomas, Chuck Floyd, Eitan Tal, Emil Gilliam, Andy Copsey, Bitcore, Filip, Per 'Zapro' Jensen, Ward Sutherland, rn Arnarson, Alberto Amatucci, etho624, Chris Giddings, Tomasz Kolinko, Carles Codony, Samuel Plainfield, Jason McMillon, TeaChest Media, Michael Pacheco, Jason Ganiatsas, Mike Gerow, Marc Schroth, Andrew J Thom, Samuel Blakey, Mrpirate707, Frank Harris, Joseph Spiros, Patrick Meister, Sergey Kiselev, Clara Latter, Ashley Grant, Scott Emmett O'Donnell, Tianyu Ge, jeekl, rozboris, Kelly Rose, Paul Fisher, Stephen Vrazel, Applied Science, Peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Matthew Rossi, Paul Craigie, Alex Smith, Nick, Tyler, Paul Williams, Steven Hidy, Fredrik Grufman, Kollin O'Dannel, RJ Kent, Yona, Kevin Strehl, Tony DeSimone, Mike Bailey, Maggie Brown, Howard Kraut, TM, Mark Nicholas Wales, Jason D., T.J. Steckbeck, Pavlo Pravdiukov, Tobias Faller, Marco Anastasi, Peter Byrd, Trix Farrar, Matthew Razza, Mitchel J. Mullin II, Jakob Strande Langgaard, Jan Staval, Paul Walton, Matt Falcon, Steven First, Denver Alexander, Conor Hennessy Sykes, FinaleGrande, Christopher Dickey, OnlyOneSolutionTBHFam, Matt Sackett, Tim Juchcinski, Wayne Marsh, Ernie Smith, foophoof, Stein Strindhaug, Hank Eskin, Brady Brown, Giacomo Scaparrotti, Winfield Trail, Luke Biddle, Marc Ethier, Joseph Hill, John Semander, Bill Basch, Robert Toth, Magnus Tranum, blouerat, PK  IF YOU DON'T SEE YOUR NAME: The description was too long to give all of you credit!  Going forward, when this happens the first half of you will be featured here and the following half will be on the next video.  This is a wonderful problem for *me* to have, but I hope you don't feel too left out.  Thanks for your understanding!",
    "description_links": [
        "https://youtu.be/U1dMlVwUsrA",
        "https://twitter.com/TechConnectify",
        "http://www.lrc.rpi.edu/researchAreas/pdf/GrotonFinalReport.pdf",
        "https://www.energy.gov/sites/prod/files/2017/03/f34/Street%20Lighting%20and%20Blue%20Light%20FAQs.pdf",
        "https://www.sciencedaily.com/releases/2010/03/100308132136.htm",
        "https://light-measurement.com/spectral-sensitivity-of-eye/",
        "https://en.wikipedia.org/wiki/Light_pollution",
        "http://api.icentera.com/v2/getfile.aspx?f=E9CE983DDF2101638FA38D240926FE55E07EDD8D97F195ABD14AC9FFAF3CAF03C2995E6AD9E245B0",
        "http://lighting.cree.com/products/outdoor/street-and-roadway/xsp-series",
        "http://www.patmullins.com/sodiumpollution.html",
        "http://www.thelindy.com/uploads/Should_vision_influence_roadway_lighting_design.pdf",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "In my last video, we talked about the high pressure sodium lamp and its ubiquitous use in outdoor lighting. Already this type of lighting is starting to be phased out with various technologies, with new LED technology among the most common. Now, given the robust nature of the sodium lamp and its proven track record in providing an efficient light source reliably, does it make sense that we switch to newer light sources? Well, as usual in life, there are pros and cons. So lets start with a basic question: why do we use outdoor lighting? For street lighting, specifically, the basic answer is to improve safety, particularly pedestrian safety. The odds of a crash of any kind are greater at night, because its harder to see. With the aid of artificial roadway lighting, a driver can see much farther than their cars headlights shine, especially to the sides. Now of course there are disadvantages to large amounts of street lighting, which well get to, but assuming safety is the goal, are sodium lamps good? Well, no. Not really. Remember how I said that the Sodium D-line is close to our eyes peak sensitivity, but only under photopic daylight conditions? Well it turns out that our eyes see quite differently at night than during the day. Under nighttime, scotopic lighting conditions, our eyes actually see bluish light better. And that makes sense--after all, moonlight and starlight are pretty bluish, so under these dimly lit conditions, having a greater sensitivity to blue light would mean we can see better. Under scotopic lighting conditions, only the rod cells in our eyes are activated. Rod cells cannot distinguish color, but they are much more sensitive to light than the cone cells. The peak sensitivity of the rod cells is around 498 nanometers, which is a green-blue color. Now of course under street lighting our cone cells are still active--we can after all see colors and are not exclusively using the rod cells. This dim-but-not-quite-dark lighting scenario is often called mesopic vision, a mix of the two. Still, stimulation to the rod cells will be far more visible and is more important. So then, how well does the light from sodium vapor lamps line up with our scotopic light sensitivity? Not well. This is the CIE 1951 scotopic luminosity function graph. The X axis is the wavelength of light in nanometers, and the Y axis is the eyes relative sensitivity to these wavelengths under scotopic nighttime conditions. As you can see, peak sensitivity is around the 500 nanometer mark. And wheres the wavelength produced by a sodium vapor discharge? Its about here, 589 nanometers. The rod cells are barely activated by a sodium discharge. While the discharge may be extremely efficient at producing visible light, at night time this light is fundamentally misaligned with our eyes sensitivity. See, if you look at the response curves of scotopic and photopic conditions together, you can see that the sodium discharge lines up great with our photopic vision. But when our eyes are adjusted to nighttime lighting conditions, its actually pretty bad. This is why focusing on the sodium D-line emissions seemingly perfect alignment with our vision is somewhat of a farce. While its true during the day, its literally quite far from the truth at night. Aside from the simple spectral misalignment of the sodium lamp, research shows that people can indeed see better under light sources with a bluer spectral content. In Peter Morantes research for the Lighting Research Center at the Rensselaer Polytechnic Institute (link below), survey respondents strongly preferred the light from a 6500k correlated color temperature light source over that of high pressure sodium, with metrics of visibility, brightness, safety and security, color rendering, and overall preference all favoring the newer light source, which also used only 55% of the energy of the high pressure sodium lamps it replaced. The study, which by the way is really comprehensive and worth taking a look at, was done in 2008, which was a tad before LED technology became economically viable. The study compared induction lighting, which is sort-of like fluorescent lighting (and worth a video on its own one day because its pretty neat if not so practical any longer) as well as metal halide lighting to the sodium lamps for the purposes of creating a recommendation to a local utility company. The conclusion was that metal halide didnt make sense due to higher maintenance costs, but induction would make tons of sense. But I also liked this final recommendation: Well, its been about 10 years time since that study, and LEDs are economically viable. In fact, theyve become incredibly economically viable. But before we move on to them, lets go over the main issue once more. Because of the spectral misalignment of the sodium vapor lamp with our scotopic (and mesopic) light sensitivity, it takes more light output from a sodium lamp to produce the same visible light level from a bluer light source. In fact, Dr. Alan Lewis of the New England College of Optometry measured individuals response time to a hazard approaching from the sides, and found that in well-lit areas such as a major motorway, a high pressure sodium light system needs to produce 3.9 times as much light as a metal halide source to achieve the same response time. The effect is even greater in dimly lit areas, where he found that 7.8 times as much light from high pressure sodium was required to match response time under cooler, metal halide light sources. So it seems as though the high pressure sodium light is less efficient that it appears on paper, and that roadway safety is greatly increased when light sources are used that are tuned to our scotopic and mesopic light sensitivity. Its looking pretty bad for high pressure sodium. But theres one thing that HPS technology doesnt do that bluer light sources might. That, my friends, is circadian rhythm disruption. Research has suggested that the color of light we are exposed to has a great impact on what time our biological clocks think it is. The shorter wavelength of daylight sun and blue sky may help keep us awake by suppressing melatonin production, and the long wavelength light of the sunset may signal our bodies to sleep by allowing melatonin to seep into our blood streams. To help us understand the impact different light sources can have on circadian rhythm disruption, light sources are characterized by their melanopic content. Theres a great source from the US Department of Energy linked down below which goes over this in much greater detail, but as a general overview, with high pressure sodium technology normalized at 1 for both scotopic light content and melanopic light content, a metal halide lamp with a color temperature of about 4,000K will have about 2.5 to 2.8 times as much scotopic light content, but also produces 3.16 to 3.75 times as much melanopic light content. If you look at the various color temperatures of LED light sources, you can see that as the color temperature increases, both scotopic light content AND melanopic light content increase. However, melanopic light content increases at a greater rate than scotopic light. What this means is, theres a trade-off. And its complicated. The higher the color temperature, the more scotopic light it produces, which means you could use less light (and thus less energy) to get the same perceived brightness and safety levels. But, because melanopic light content increases at a greater rate, although you may need less light of a higher color temperature, it will disrupt circadian rhythm to a greater extent. You can see that high pressure sodium has among the lowest melanopic light content of any light source, with only amber LEDs and low pressure sodium producing less melanopic light. So then, were presented with a choice. We can clearly use less energy and expect a safer nighttime driving experience with light sources of higher color temperatures, but this may cause unwanted side-effects that sodium lighting largely doesnt. And this is completely ignoring aesthetic preferences. I myself generally detest cooler lighting, as I find it harsh and unpleasant. But I can acknowledge its safety advantages. In my area on Interstate 88, many of the roadway lights have been changed from high pressure sodium to LED. The change is dramatic, with visibility greatly enhanced once under the cooler light. As much as I dont like the color, I can tell its a lot safer. Visibility in my periphery is tremendously better, and Im certain these new lights are using less energy than those they replaced. Before I move into the conclusion of this video, lets discuss the issue of light pollution. Light pollution is exactly what it sounds like--excess light in our environment that is irritating, unnecessary, poorly distributed, or in general unwanted. Outdoor lighting is by far the most prolific source of light pollution, and it has gotten so bad that people living anywhere near a city can barely see the night sky. Theres even an anecdote about a widespread blackout in Los Angeles causing many panicked 911 calls from lifelong residents who had never seen the Milky Way before and were a little scared of it. Light pollution is a complicated problem, but the LED may actually help to solve it. Now to be clear, the solutions Im about to offer arent exclusive to LEDs, but the way light is emitted from an LED chip makes controlling it relatively easy. So first, lets discuss one of the biggest causes of light pollution; lights that point up. This is less obvious than it seems, but its incredibly important. Right outside my apartment are drop-lens cobra luminaries containing high pressure sodium lights. Because the lens protrudes downward from the fixture, a lot of light escapes to the sides and indeed upwards. Im on the 4th floor of my building, and my eye-level is above these street lights, but I can still see the source of the light. This is not ideal for a number of reasons. First, a lot of light is being wasted by lighting up things that are not the road. Thats kinda dumb. But secondly, a lot of this light is going up into the sky. Granted, this style of fixture isnt the worst offender, but a better design would be a flat lens that does not allow light to escape above the horizontal. This may still throw light farther to the sides than necessary, but none of it will end up lighting the sky. The worst offenders for this kind of light pollution are lights that illuminate buildings by shining upwards, wall-pack lights without shielding, and these decorative fixtures. Ill admit theyre pretty, but theyre really wasteful. Recently I was on an airplane flying into Chicago at night. I took some video as we landed, and you can see the difference between a well-managed light and a poorly managed light. This roadway is lit well. I cannot see the actual light sources, I can only see the reflected light from the road. Thats what we want. As we got closer to the airport, these neighborhoods had tons of lights that were visible from above. Much of the light produced by these lamps is shining into the sky and being wasted. I should not be able to see the actual light source from an airplane, yet I can. This is contributing to skyglow. Skyglow is what makes the night sky hard to see when youre close to a city. This is probably the most widespread light pollution problem, and while its not caused exclusively by poorly designed fixtures, they are a major component. But once again, the solutions to skyglow are complicated. Largely because light sources that cause the least skyglow are high and low pressure sodium. In fact, low pressure sodium is used widely around large astronomical observatories because their nearly monochromatic light output can easily be filtered out, eliminating any skyglow they create. I saw a large number of people saying that high pressure sodium can also be filtered out, but I dont think thats true due to the pressure broadening and their spikier output. Someone correct me if Im wrong but I could only find references to low pressure sodium being used around observatories. Anyway, where it gets tricky is that an LED light source has about three times as much sky glow impact than a high pressure sodium light. But also, you need less of it, so perhaps the sky glow impact is similar. In addition, the sky glow impact of incandescent lighting is barely higher than low pressure sodium. So it could be that LED street lighting correlated to a 2700K color temperature causes less sky glow than high pressure sodium. But I think further research needs to be done there. In any case, what makes LEDs potentially much better at reducing skyglow is the optical systems that can be combined with them. Early LED fixtures may have used a large number of small 1 watt LEDs and tiny lenses to direct their light. Some really bad designs may have simply had an exposed chip, prodiving little directional control. You still see this a lot in cheap flood light fixtures. But newer fixtures like these from Cree will use large chip-on-board emitters, like these 10W chips but larger, and because they only emit light in one direction, its very easy to control their output with a lens. You can see on the spec sheet that there are 5 lenses in total, though larger fixtures have more. Most importantly, the optic system is customizable. Depending on fixture height and spacing, you may need a wider spread of light or a shorter one. Due to the customizable optics, you can get wonderfully consistent lighting on a road surface such as this area here. This may also help to prevent light pollution because less overall light is needed. The hotspots of light you see from above here mean some areas get too much light, and others get too little. A more scotopic light source with better and more consistent control may not only reduce light pollution, but may use less energy and provide safer driving. Now many of these developments are rather new, especially the newer optic designs. But the advantages of LED lighting become confused when drop-in replacement bulbs are used. I dont have any major issues about going this route--after all replacing the entire fixture can be costly, and some drop-in designs are fairly good. But the optic system of a sodium, mercury vapor, or metal halide fixture is designed to reflect and project light emanating from a tiny arc tube, which an LED drop-in cant recreate. Many of the complaints regarding poor light distribution in LED replacement lamps may simply be from the use of these replacements. Then theres the issue with existing ballasts. Some drop-in lamps claim to work with existing ballasts, but I have a few misgivings regarding how well their power supplies deal with the voltage the ballast provides--particularly if the high voltage ignitor sends some crazy voltage spikes to the LED drop-in. Im sure they can be designed to cope, but it still worries me somewhat. So then, we have a series of complicated choices to make. Sodium vapor lights are pretty efficient, have only a moderate contribution to sky glow, cause only minor circadian rhythm disruption if any, and have a proven track record of reliability. But their color also makes them far less effective at improving safety, and due to the misalignment of their output with our scotopic light sensitivity, they require more light (and thus use a lot more energy) than a whiter light source. Perhaps less an issue but still important is that they contain both mercury and elemental sodium, meaning their disposal is far more dangerous and complicated. If we were to switch to a white LED source with a color temperature of about 5,000 K, nighttime visibility would be greatly increased. Studies have shown that people see hazards far sooner under this light, and as the bluer wavelengths match our scotopic and mesopic color sensitivity more closely, we can use less of it while also achieving a greater safety benefit. This reduces the need for energy. However, this bluer light contributes more to circadian rhythm disruption and skyglow, but some of that is mitigated by the lower output required by this light source. Still, many people may not find the aesthetics of this light source pleasing. One possible compromise would be to use a warmer color temperature LED light source. Data from the US Department of Energy tells us that a 3000K LED light would produce 1.89 to 2.39 times as much scotopic light as a high pressure sodium lamp, while increasing melanopic content between 2.1 and 2.99 times. Because of its greater scotopic output, a 3000K LED replacement should only need to produce about half as much light as a high pressure sodium lamp. This effectively cuts the circadian rhythm disruption potential in half, too, placing it near about the same as high pressure sodium. The greatest downside to using a warm color temperature LED is in their efficiency. The efficiency of these lights is very similar to that of an average high pressure sodium lamp. At 67 lumens per watt, these 3,000K LEDs are just slightly less efficient than the sodium lamp featured in my last video. Although you would need only about half as much light output, there are HPS lamps which approach 150 lumens per watt. This would mean that a 3000K LED will use just about as much energy as a very efficient HPS lamp. Id still call that good, but it makes replacement less compelling. To normalize the effects of scotopic light content, Ive multiplied the lumens per watt number by the scotopic light content for the following light sources. As you can see, the normalized efficiency of the LED goes up considerably as the color temperature does, due to both luminous efficiency and greater scotopic content. This is likely why most LED street lamp installations are done with the blueish 5700K and higher color temperatures. You can use the least amount of energy to produce the same amount of perceived brightness and safety. However, the normalized efficiency of even the 3000K LED is very similar to that of high pressure sodium, and few HPS lamps actually output 150 lumens per watt. Also, the calculated lumens per watt of the LED is based on the input power of the fixture, so the losses in the ballast (which are fairly high for high pressure sodium) arent accounted for here. To conclude, although the high pressure sodium light is very efficient, its primary output color is misaligned with our nighttime visibility. Only about a quarter of its light is actually effective at stimulating the cells in our eyes. Although the cool color temperature of many LED replacements is harsh and aesthetically displeasing, studies have shown that it is not only more efficient but also makes driving at night safer. There is however the potential for greater circadian rhythm disruption and larger amounts of skyglow using these bluer light sources. Still, it seems clear that the high pressure sodium lamp is on its way out. Advancements in LED technology are happening at a breakneck pace. Just 10 years ago they weren't seen as viable. But today, even the least efficient of LED replacements ends up meeting the efficiency of high pressure sodium when scotopic light output is considered. As it stands in 2018, we are faced with a choice of efficiency over aesthetics. Im pretty sure Id enjoy roadways lit with the relatively warm 3000K LEDs, and these also wouldnt disrupt sleep much. But you can save a lot more energy (and potentially have safer roadways) with 5700K lighting. Either way, it seems clear that LED technology will very soon overtake the tried-and-true high pressure sodium lamp, just as the HPS lamp itself replaced the mercury vapor lamp. And in 40 or 50 years, who knows what technology might light our roadways. So I have a couple of things to close out, first you may have noticed in my chart that the mercury vapor lamp had a normalized efficiency of over 100 lumens per watt, and the 50 watt sodium lamp in the last video was only 78 lumens per watt. Mercury vapor bulbs do have considerable operating disadvantages compared to HPS, most notably their steady decrease in light output as they age, but I think it is somewhat humorous that our current understanding of the visual system suggests that sodium light may have been a step backwards in some situations. You may have noticed that I didnt talk about the blue light from LEDs and how this is supposedly ruining our eyes--thats because the science behind this is questionable at best. You can clearly see in this chart that there is blue-light content in nearly all light sources, and lower color temperature LEDs have less blue-light content than their higher color temperature varieties. I dont doubt that blue light can disrupt circadian rhythm--that much seems certain. But considering that our eyes can withstand the intensity of sunlight, which is far far greater than any normal artificial light source and also has a lot of blue light (and ultraviolet which definitely IS harmful), I think the blue light thing is just fear mongering. If someone can point to some verified, peer-reviewed research supporting this, and not a dodgy website, Ill consider changing my stance. In any case, the high flexibility of LED technology means that it can be tuned in pretty much any way you like. I also want to give a shoutout to VWestlife for the suggestion of LED fixtures with both high and low color temperatures that will switch to the warm light later in the night. I think thats a great idea, though obviously it would add expense to any fixture. However, I was surprised to learn that the Cree LED fixtures Ive been using as a reference are all capable of dimming, and they have a 0 to 10V control input to enable this. Reducing light levels to perhaps 50% of normal after midnight might become a common practice, and I think that would be pretty wise. Maybe this will get combined with technology similar to Philips warm-glow and well get incandescent-like lighting at night. For those worried about light pollution for astronomical observatories, there are amber LED street lights available designed to replace low pressure sodium lights. This is also great news for wildlife--many animals cannot see the wavelength of light produced by low pressure sodium, so this light source is used where lights may be disruptive. One particular example is near beaches where sea turtles lay their eggs. After they hatch, baby sea turtles follow moonlight to the ocean, and street lighting was confusing the poor things and they were travelling inland. Since they cannot see the wavelength of a low pressure sodium light or its amber LED equivalent, they arent confused and successfully make it to the ocean where they belong. As a last little tid-bit, the spec sheet from Cree says that their LED cobra head replacements should produce at least 95% of their original light output after 100,000 hours. Assuming the driver and heat sink are robust enough, these fixtures should last well beyond 20 years. That is impressive. Thanks for watching, I hope you enjoyed the video! If you havent subscribed to Technology Connections yet, and you like my nerdy deep-dives into whatever floats through my head, what are you waiting for? Hit the button! Please? As always, thanks to everyone who supports this channel on Patreon! You are all making a big difference and its super awesome of you. If youre thinking of joining these awesome people and becoming a patron yourself, why not check out my Patreon page? Thanks for consideration. And Ill see you next time!",
    "transcript_keywords": [
        "light",
        "high pressure sodium",
        "pressure sodium",
        "pressure sodium light",
        "LED",
        "sodium",
        "light source",
        "high pressure",
        "LED light source",
        "scotopic light",
        "pressure sodium lamp",
        "LED light",
        "sodium light",
        "light content",
        "low pressure sodium",
        "pressure",
        "sodium lamp",
        "scotopic light content",
        "lighting",
        "high"
    ],
    "transcript_entity_values": [
        "Los Angeles",
        "K",
        "the Rensselaer Polytechnic Institute",
        "2700",
        "two",
        "about half",
        "3.75",
        "one",
        "500 nanometer mark",
        "Cree",
        "3,000",
        "Alan Lewis",
        "5",
        "normal after midnight",
        "about 5,000",
        "VWestlife",
        "moonlight",
        "Philips",
        "around 498 nanometers",
        "40 or 50 years",
        "Cree",
        "150 lumens per watt",
        "about three",
        "2.39",
        "3.16",
        "100,000 hours",
        "67 lumens per watt",
        "3000",
        "first",
        "20 years",
        "7.8",
        "about 4,000",
        "the Lighting Research Center",
        "589 nanometers",
        "2018",
        "1 watt",
        "about 10 years",
        "only 78 lumens per watt",
        "between 2.1",
        "1951",
        "1.89",
        "the lumens per watt",
        "1",
        "secondly",
        "nanometers",
        "Chicago",
        "Just 10 years ago",
        "Only about a quarter",
        "Patreon",
        "today",
        "0",
        "at least 95%",
        "5700",
        "10V",
        "50 watt",
        "Mercury",
        "3.9",
        "HPS",
        "only about half",
        "Peter Morantes",
        "lumens per watt",
        "half",
        "later in the night",
        "over 100 lumens per watt",
        "only 55%",
        "the New England College of Optometry",
        "Interstate 88",
        "the US Department of Energy",
        "10W",
        "2.99",
        "6500k",
        "about 2.5 to 2.8",
        "Rod",
        "2008",
        "perhaps 50%",
        "911",
        "Technology Connections",
        "One",
        "HPS",
        "First",
        "night",
        "4th",
        "the day"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "QUANTITY",
        "DATE",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORDINAL",
        "DATE"
    ],
    "vector": [
        -0.057457100600004196,
        -0.04016312584280968,
        0.05851810425519943,
        0.0016838506562635303,
        0.05423180013895035,
        -0.0257269199937582,
        0.04193022847175598,
        0.035339102149009705,
        -0.036041054874658585,
        -0.03701755404472351,
        -0.03874249383807182,
        0.008627312257885933,
        -0.015655774623155594,
        -0.0013781633460894227,
        -0.004083933774381876,
        0.004866790026426315,
        0.06580588966608047,
        -0.017318902537226677,
        -0.04182000085711479,
        0.04740510508418083,
        0.08668579161167145,
        -0.06872724741697311,
        0.03416762128472328,
        0.03911887854337692,
        -0.05526324734091759,
        0.03754828870296478,
        0.03593439981341362,
        -0.02125135064125061,
        -0.04457808658480644,
        -0.05589655786752701,
        -0.03843217343091965,
        0.020686248317360878,
        -0.0577898845076561,
        -0.02981582283973694,
        -0.05531342700123787,
        -0.07697857171297073,
        0.04304271936416626,
        0.004552978090941906,
        -0.04128585010766983,
        0.019719891250133514,
        0.002449918072670698,
        -0.10141035914421082,
        0.003880560165271163,
        -0.006327335722744465,
        0.0009485083282925189,
        -0.050913531333208084,
        0.04395265504717827,
        -0.09150301665067673,
        -0.06527545303106308,
        -0.0942077785730362,
        -0.021881606429815292,
        -0.05976857244968414,
        0.06634928286075592,
        -0.0325830914080143,
        0.008170551620423794,
        -0.019400302320718765,
        -0.11733806878328323,
        -0.015824394300580025,
        0.07036556303501129,
        -0.07794991135597229,
        0.10163506120443344,
        0.0082693537697196,
        -0.047037914395332336,
        0.0021355964709073305,
        0.005441611632704735,
        0.07986236363649368,
        0.008593825623393059,
        -0.027665818110108376,
        0.01713821478188038,
        -0.12175503373146057,
        -0.057312168180942535,
        0.02311350405216217,
        0.04615997150540352,
        -0.0013075119350105524,
        -0.0363239049911499,
        0.07376661151647568,
        0.08927559852600098,
        -0.06446115672588348,
        -0.06915049254894257,
        -0.04228568822145462,
        0.10942383110523224,
        0.025261469185352325,
        -0.058065541088581085,
        0.08131241053342819,
        0.10360251367092133,
        0.014331367798149586,
        -0.010538934729993343,
        0.04955863580107689,
        -0.10827335715293884,
        0.007174803409725428,
        -0.029250187799334526,
        -0.00015690363943576813,
        -0.013412672095000744,
        -0.006424630992114544,
        0.012642539106309414,
        0.06932748109102249,
        -0.04218487814068794,
        -0.10331099480390549,
        -0.00856467243283987,
        0.02773868665099144,
        0.03822529688477516,
        0.04545649513602257,
        -0.06606736034154892,
        -0.04400748014450073,
        -0.031185081228613853,
        -0.035337455570697784,
        0.017316481098532677,
        0.07926494628190994,
        0.003324874909594655,
        0.0735185369849205,
        0.05038527026772499,
        -0.02071770653128624,
        -0.12135545909404755,
        -0.01585601456463337,
        -0.008106378838419914,
        -0.005880196578800678,
        0.01121192704886198,
        0.0027039602864533663,
        -0.004731691908091307,
        -0.043344151228666306,
        0.017062105238437653,
        0.0366225428879261,
        -0.0028507059905678034,
        0.06901375204324722,
        0.14687934517860413,
        0.0048515587113797665,
        -0.060525115579366684,
        3.0633634411688285e-33,
        -0.026770511642098427,
        0.09601837396621704,
        -0.011862116865813732,
        -0.018175939098000526,
        0.004578231368213892,
        -0.03352540731430054,
        0.006002139765769243,
        0.023353183642029762,
        0.004653949290513992,
        -0.04505529627203941,
        0.0830501988530159,
        0.07371716946363449,
        -0.009973797015845776,
        -0.029641348868608475,
        0.0004774858243763447,
        -0.06019185483455658,
        0.050058912485837936,
        0.008168185129761696,
        -0.05086571350693703,
        -0.05143142491579056,
        -0.10090096294879913,
        -0.03470023721456528,
        0.026351818814873695,
        0.03172815963625908,
        0.003715120954439044,
        -0.018529338762164116,
        -0.07114855200052261,
        -0.017718369141221046,
        0.03133384883403778,
        0.02875230275094509,
        0.07289939373731613,
        0.017347950488328934,
        -0.01704319193959236,
        0.07135344296693802,
        -0.03519504889845848,
        0.0068361652083694935,
        -0.024739131331443787,
        -0.07296932488679886,
        0.05903218686580658,
        -0.04817575588822365,
        -0.030766012147068977,
        0.1709570288658142,
        0.04345448315143585,
        0.07425178587436676,
        0.02001972869038582,
        0.04874436929821968,
        -0.03365250676870346,
        0.025586893782019615,
        0.04753953218460083,
        0.02898004837334156,
        -0.08524522185325623,
        -0.020481524989008904,
        -0.08731939643621445,
        -0.016977893188595772,
        0.0031884971540421247,
        0.06842430680990219,
        -0.029490871354937553,
        -0.023346368223428726,
        0.06323207914829254,
        -0.026066645979881287,
        -0.050603948533535004,
        0.06450832635164261,
        -0.0107671357691288,
        -0.03727038577198982,
        -0.06778950989246368,
        0.003488344606012106,
        -0.02607184275984764,
        0.034092977643013,
        -0.14805611968040466,
        -0.01526500005275011,
        -0.03755013272166252,
        -0.05830669775605202,
        0.01602594554424286,
        -0.06711645424365997,
        -0.021207163110375404,
        0.04478480666875839,
        0.015817997977137566,
        0.01859351620078087,
        0.0543261393904686,
        0.034146226942539215,
        -0.05329001322388649,
        -0.0017383596859872341,
        0.04085548594594002,
        -0.03606678172945976,
        0.011844862252473831,
        -0.015182600356638432,
        0.012718837708234787,
        0.03085016831755638,
        -0.04126060754060745,
        0.028866907581686974,
        0.09201345592737198,
        -0.003987761680036783,
        -0.004492231644690037,
        -0.07216159254312515,
        -0.07433245331048965,
        -4.437873577360137e-33,
        -0.007525281980633736,
        0.010085145942866802,
        0.0033975522965192795,
        0.04030570760369301,
        0.08983293920755386,
        -0.05641528218984604,
        -0.03344982862472534,
        -0.028277521952986717,
        0.08718795329332352,
        -0.023872682824730873,
        0.049704089760780334,
        0.05458014830946922,
        -0.0065162950195372105,
        0.011909707449376583,
        -0.03278344124555588,
        -0.029141249135136604,
        -0.026002006605267525,
        0.05171527713537216,
        0.007419123314321041,
        -0.02810269221663475,
        -0.014559829607605934,
        0.067512646317482,
        -0.06515998393297195,
        -0.0010521364165470004,
        0.009753257036209106,
        0.02381925843656063,
        -0.02006547898054123,
        -0.023721449077129364,
        -0.037791237235069275,
        -0.020362623035907745,
        -0.030589645728468895,
        0.11448017507791519,
        -0.0344727523624897,
        -0.008995143696665764,
        -0.05971875041723251,
        0.0737127885222435,
        0.0654299333691597,
        -0.024149015545845032,
        -0.09463436156511307,
        0.03299751877784729,
        0.05394575744867325,
        -0.0073444838635623455,
        0.016698820516467094,
        -0.10288126021623611,
        -0.07586321979761124,
        0.05441226810216904,
        -0.01862405613064766,
        -0.010143104940652847,
        0.01966239884495735,
        0.021589836105704308,
        0.1260010302066803,
        0.049313150346279144,
        -0.06787163019180298,
        0.061846546828746796,
        -0.04791054502129555,
        -0.01406962051987648,
        0.03784408047795296,
        0.07673513889312744,
        -0.06027692183852196,
        -0.03076206147670746,
        0.02953808382153511,
        0.046483270823955536,
        -0.0232264194637537,
        -0.054451122879981995,
        -0.011737284250557423,
        -0.07739473879337311,
        0.11492324620485306,
        0.024920595809817314,
        0.059582799673080444,
        -0.0504441037774086,
        0.07664550095796585,
        -0.032095566391944885,
        0.006087035406380892,
        -0.013186400756239891,
        0.01966877467930317,
        -0.07302048802375793,
        -0.013532696291804314,
        -0.022415494546294212,
        -0.06471822410821915,
        0.04492947459220886,
        -0.010963964276015759,
        0.04997686296701431,
        -0.031072111800312996,
        0.044218823313713074,
        0.06669042259454727,
        0.07420164346694946,
        0.04491638392210007,
        -0.009260490536689758,
        -0.12341039627790451,
        -0.004257264547049999,
        -0.038014426827430725,
        0.006202958058565855,
        -0.058688852936029434,
        0.03733443468809128,
        0.0613136850297451,
        -5.720605500414422e-08,
        -0.014435794204473495,
        0.013180896639823914,
        -0.023211074993014336,
        -0.021161004900932312,
        -0.019880477339029312,
        -0.04080386832356453,
        0.061641495674848557,
        0.052016764879226685,
        -0.01732589863240719,
        -0.0021520720329135656,
        0.006914203986525536,
        -0.013257182203233242,
        0.07133640348911285,
        0.017471686005592346,
        0.030115991830825806,
        -0.061625778675079346,
        -0.060492366552352905,
        -0.0384625643491745,
        -0.055551402270793915,
        -0.0009370154584757984,
        0.0013406594516709447,
        0.015356873162090778,
        0.05678620561957359,
        0.020570890977978706,
        0.02670055627822876,
        0.06522047519683838,
        0.07100482285022736,
        0.006280656438320875,
        -0.01314536202698946,
        -0.014448234811425209,
        0.038957249373197556,
        0.023653561249375343,
        0.048283401876688004,
        -0.03663278743624687,
        -0.0023905157577246428,
        -0.05484084039926529,
        -0.01152875181287527,
        0.05663657188415527,
        -0.03825577348470688,
        0.14266812801361084,
        -0.12357423454523087,
        -0.09566622227430344,
        -0.04267227649688721,
        0.06617895513772964,
        9.393311484018341e-05,
        0.04290939122438431,
        -0.022648759186267853,
        0.03999103233218193,
        -0.034182727336883545,
        -0.028802184388041496,
        -0.011684243567287922,
        -0.04004809260368347,
        0.0019907597452402115,
        -0.04709680378437042,
        -0.027162889018654823,
        -0.007034339010715485,
        0.03549104183912277,
        0.04165719449520111,
        -0.04383565112948418,
        -0.03141416981816292,
        0.17008386552333832,
        -0.01671094074845314,
        -0.054057616740465164,
        0.06882912665605545
    ]
}