{
    "id": "WJncf9aO_wU",
    "title": "TOP iOS 17 FEATURES!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-07-24T18:55:53Z",
    "video_url": "https://www.youtube.com/watch?v=WJncf9aO_wU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 659600,
    "likes": 20999,
    "comments_count": 536,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And in this video today we are talking about iOS 17. Now Apple announced the newest iPhone software at WWDC, and ever since then I could not wait to show it to you. I had been testing it out, and they just officially released the public beta. There are a ton of new features to talk about, so we're gonna be getting into all of that and all of the new features. And at the end of the video, I'm gonna reveal one of the features that I am most excited about. So stick around for that, and if you want, maybe you could hit the like button or subscribe if you're not already, because I've got another video dropping very soon about Macoa Sonoma. So let's get into it and I'll show you some of my favorite new stuff in iOS 17. Phone, FaceTime, Messages are all getting really big updates. There's improvements to Airdrop with a new feature called NameDrop. I see what you did there. The keyboard is also getting a nice refresh with more intelligent text input and dictation. There's a new standby mode, which takes some inspiration from nightstand mode on the Apple Watch, a new native app called Journal, plus added tools for vision and mental health inside of the health app. A big theme with all of these new features seems to be a focus on machine learning, which makes a lot of sense considering how much is happening with AI right now. And it looks like Apple's heading towards utilizing this kind of tech a lot more in their software in the future. I also think it's interesting how Apple doesn't actually like to use the word or letters AI or even mention artificial intelligence. It seems like for most consumers, that can kind of sound like a scary thing. So Apple has done a really great job of finding their way around it to make it seem just like magic. The first thing that I wanna start with is the phone app. Now on my actual phone, I don't like to admit it, but I've kind of moved the phone app like off of the main page 'cause I don't actually like making phone calls, but it is kind of exciting to see it getting a little bit of an update. And this is all kind of starting with the new contact posters feature. Now you can make this huge full screen contact page with custom backgrounds, text, and images, or you can even use a Memoji. So now when someone calls you or you call someone, this card will pop up on their phone. So let's make our first one, and I'll show you guys how it works. So here's one of the contacts that I made already. It's super easy to add an update. So I'm going to edit this. You can add multiple ones. So like this one is super basic, and you can actually set these to be given to like different people too, which is kind of cool. So I'm gonna do a Memoji one. Let's do a little piggy 'cause I like pigs. Oh, I can make it do my own little expression here. Okay, that's fitting. You can change the fonts, you can change the size. Okay, what do you guys think? Do we love it or do we love it? I feel like if this got sent to some of my friends' phones, they actually wouldn't be surprised at all. So you guys can see that I still have my pandemic Memoji in here. Let's go with my new updated one and she's got her little hoodie on. I kinda like that font actually. Clearly we're having a little purple theme. Okay, there it is. And done, of course you could add all of your contact info in there as well, but for the sake of this video, we're not gonna do it. Another new feature in the phone app that I'm so excited about is live voicemail. I mean, this is so freaking cool. So before you could get a translation of the voicemail after someone leaves it, but with this you'll be able to see a live speech to text translation as the person is leaving the voicemail. This is super cool because if it is something really important, you'll be able to see right away that maybe you should pick it up and not sit there and read the text instead, which I think we're all gonna be very guilty of. Messages are getting a couple very cool updates too. So now you can use search filters inside of the app, and now voice messages automatically get transcribed, which I am so glad that this is finally a thing, because there's something that I love and hate about voice messages. I think they're great because they're super personal, but I always forget what people say, and now it'll transcribe it and I can just kind of look at it really quick. Mm, love that. Another new feature in messages is check in. So with this, you can let friends and family know when you've arrived somewhere. This is great for my family because we're always asking each other like, \"Where are you at? Are you gonna be here?\" And of course you can't really lie and say, \"I just left, I'm just leaving now. Oh yeah, yeah, I already left.\" When in reality, you're running around your house trying to find your keys, your purse, your shoes, your phone and your extra phone and your extra extra phone because that's just the person that you are. So you can choose the data that you'd like to share if you don't arrive. You can do a limited option. So this includes your current location and details about the battery, network, signal, or you can do full. This includes basically all of the data, and it'll give you the location of the last iPhone unlock and Apple Watch removal. So let's do that because I feel like if I'm using this and something happens, I would definitely want them to know. We're gonna send a check-in to my sister. Okay, we're not because she doesn't have, she doesn't have iOS 17 installed. So we're going to send it to Tyler. Apple store, Cupertino. So it's gonna take me 5 hours, 45 minutes. I'm probably gonna walk, so it's gonna take me 152 hours. So I'm gonna share that with Tyler. It's going to take me 152 hours to walk there. We'll check in when I get there. Okay, this is great. I also have the option to share my name and photo with him, which I guess, yeah, let's do it. I'm probably gonna change that photo, but for now that's what we're gonna get. And of course one of the other things that I'm so hyped about is the new stickers feature. Let's make a freaking sticker. I've already made a few, but I wanna show you guys how easy it is. So here we go. We go into the stickers, and these are the ones that I've already made. And with these, I've basically just used live photos. Okay, so I'm gonna start making my action now. So we're gonna add a sticker. So here's the one that I just did. You just hit add sticker and that's, like that's it. So I'm just gonna put it over top of... (Justine laughing) It's pretty cool. I'm really excited about this. I'm gonna be making a whole entire like little sticker pack that I can send to people, and it's so easy, like literally anyone can do this in seconds. I mean, you saw it happen right before your eyes. Next up is standby. So when you turn your phone sideways while it's charging, there's an all new full screen display setup. Now this seems to be inspired by the nightstand mode for the Apple Watch, which I absolutely love. And this just makes so much sense. So when your phone is in standby, you can customize the screen with different clock styles, photos, widgets and smart stacks. I am really into this, and I think this might be the first step towards some kind of Apple Smart Home product. I don't know, like maybe like a digital home pod, or we can just keep using standby mode with our iPhone, 'cause that also is pretty much the same thing. Okay, we've got our little stand, now let's test out standby mode. Here we go. Okay, so here's a few of the standby faces. These are just the basic ones Apple already has like pre-made in here. So we're gonna open up this. So we're gonna add some more things. So let's add, we'll add some reminders, add widget. Okay, we love that. So I can just swipe through these. We've got the podcast, reminders, no events today. Oh my goodness, Maddie, you're so cute. Let's go with nature. So standby mode, pretty awesome. Very, very excited about it. Now, widgets have also been revamped in iOS 17. So instead of only being able to tap a widget to open the app, you can now perform actions right on the widget itself without leaving your home screen. I like this because it actually makes widgets seem more useful. Like I like being able to visually see these things, but now being able to actually interact with it, it just makes so much more sense. Now Airdrop is probably one of my favorite features in the iOS Apple ecosystem, and they have a new feature called NameDrop. So basically it's a super easy way to connect with new people. So instead of exchanging numbers or typing in Insta handles or whatever you guys do today, I don't know, Snap? I'm not sure, maybe I don't wanna know. Now all you have to do is bring your two phones together and these big beautiful contact posters will pop up and you can instantly exchange info from device to device. Something that I thought would be also interesting if somebody comes up to you and like they try to get your number and like you don't really wanna share your number with 'em, or maybe like you just wanna give them your email address not your phone number, you can choose which contact poster to send them. So I like that a lot. Now another thing that I'm pretty stoked about is Apple's new Journal app. Now we don't have this just yet to try because it's not actually coming out until later this year, but I'm really interested in this. I don't know about you guys, but I've definitely tried to use journaling apps in the past, but I wasn't really able to stick with it. But this is really cool because it actually uses machine learning to give smart suggestions for your journal entries, including photos you took or places you went, workouts you did that day, and it even gives you writing prompts to get you started. And I feel like this is a really smart way to make it easier to actually stick with journaling. Alright, so moving on, there are some really nice updates to the keyboard experience too, with improved accuracy while typing. So you can still see these still pop up, but there's like a little line that kind of is underlined. So with that, you can go back and change it if that's not what you wanted to say. So let's see if I write duck, okay, well, I don't wanna test it out. Do I test it out? I don't know. Let me just see. I'm just gonna test it out. I'm gonna test it out. Tyler, just blur the text, just blur it. Okay, so they won't know why I'm actually writing it. Oh my God, I actually wrote it and didn't correct it. (Justine laughing) Oh geez, okay, wait, I need to delete that. I'm gonna delete it. Undo send, undo send! Okay, I've unsent the message. We've also got some new changes to Airplay now as well, so your phone is gonna start to learn how you use Airplay, which devices you use the most, and how you use them. There's a new Airplay devices list, and it will now suggest the most relevant device. And eventually as it continues to learn your Airplay habits, it will begin automatically connecting to your devices. So for me, I always listen to music on my home pod in the bathroom while I'm getting ready for the day. So my phone will learn that and just automatically connect so I won't have to do anything, it just knows. So the health and fitness apps are both getting some really cool upgrades. Now, I'm pretty hyped about this because in the health app there are some new insights into vision and mental health. The new state of mind feature lets you track how you're feeling day to day with this interactive screen, and this is great because reflecting on how you feel is very important and I love that they're adding this type of feature. This is cool because this actually is giving you a bunch of resources to care for your mental health, learn about your mental health, common concerns. Definitely feel like this is a really cool addition to the health app. Now for vision, the health app can now track your time in daylight and it can help manage your screen distance if you're holding your phone too close to your face. I am excited about this because I do have a three-year-old niece who's 3 going on 20. Watching her watch YouTube videos, I kept getting so upset because she was using the phone and her iPad and holding it so close to her face and I kept telling her to move it back. So with this, the app is actually not going to let you view your content unless you move it to a safe distance. So now if she actually wants to watch this content, she's gonna have to listen to it and move it further back. In the fitness app, the sharing feed has been improved to make it easier to navigate and see your friends' progress. There's also new weekly tips from Apple fitness trainers and an all-new design for the trophy case. So you can see all of your awards, challenges, and competitions all in one place. There's also a new custom plans feature which lets you create a workout schedule based on your specific goals. You select which days and which workouts, and Fitness Plus provides a custom plan and gives you reminders to keep you on track. Do 60 minutes Monday, Wednesday, Friday, build your plan. Core, kickboxing, Pilates, tread, strength. Oh, this gives you, oh, I like this, look how cool! So if you have 60 minutes, it's gonna give you all of the things that you can do. Oh my gosh, I love this. Okay, create my plan. This is so cool. There's some other cool changes coming like offline maps and EV charger locations inside the Maps app. You can also now drop the hey part when you're saying hey if you prefer. Spotlight Search is getting a little bit smarter as well as visual lookup and live text. The Reminders app now automatically sorts your grocery list by category, which I'm so hyped about that. Facial recognition in photos now can recognize animals as it very well should. Now with all of these new awesome features, there is still one thing that I am so, so, so, so, so excited about, and that's the update to AirPods. Now, if you watch my videos then you know that I'm absolutely obsessed with my gen two AirPods and I basically, I really never shut up about them. They are getting even better, which I didn't even think was possible. So you can now just tap the AirPods stem to mute and unmute when on a call. They also have improved automatic device switching, which was already really good. So that's amazing that it's gonna connect even faster. There's also personalized volume now. So using machine learning, the AirPods will know your volume preferences between media types. But the coolest AirPods feature is the brand new adaptive audio setting. This is basically a mix between active noise cancellation and transparency mode that seamlessly blends your audio into the environment around you. And the reason that I'm so excited about this is I go running a lot, and these AirPods have been my best running friend, but sometimes the noise cancellation is so intense that I can't hear anything around me at all, which is actually not very safe. So it's really good to know that if a car is coming or if something is happening around me or if there's a bike that's trying to say, \"Hey, scoot over.\" But sometimes the transparency mode can kind of take you out of that groove because I still want to hear my music and get into the zone. So this is like a perfect combination of the two. So I'm very excited to test this out. So my friends, those are some of my favorite features. I would love to hear from you, what are your favorites in the comments below? I'll see you guys in the next one, bye!",
    "transcript_keywords": [
        "Apple",
        "Phone",
        "app",
        "feature",
        "kind",
        "Apple Watch",
        "cool",
        "phone app",
        "features",
        "love",
        "health app",
        "add",
        "health",
        "guys",
        "make",
        "excited",
        "mode",
        "Watch",
        "Justine",
        "thing"
    ],
    "transcript_entity_values": [
        "iOS 17",
        "Insta",
        "AirPods",
        "NameDrop",
        "WWDC",
        "one",
        "iPad",
        "Pilates",
        "EV",
        "Monday, Wednesday, Friday",
        "the next one",
        "17",
        "Apple",
        "Justine",
        "Memoji",
        "Fitness Plus",
        "iPhone",
        "20",
        "60 minutes",
        "a ton",
        "the day",
        "weekly",
        "Cupertino",
        "iOS 17",
        "FaceTime",
        "Maps",
        "Apple Smart Home",
        "days",
        "45 minutes",
        "Maddie",
        "Mm",
        "5 hours",
        "Memoji",
        "3",
        "YouTube videos",
        "Airplay",
        "three-year-old",
        "Journal",
        "today",
        "later this year",
        "two",
        "AI",
        "Tyler",
        "Airdrop",
        "seconds",
        "first",
        "Apple Watch",
        "Macoa Sonoma",
        "152 hours",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "DATE",
        "GPE",
        "EVENT",
        "ORG",
        "LOC",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "PERSON",
        "TIME",
        "LOC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG"
    ],
    "vector": [
        -0.043121740221977234,
        -0.05836882442235947,
        -0.041525039821863174,
        -0.12423617392778397,
        0.03785545006394386,
        0.026033781468868256,
        0.0363377220928669,
        0.0342070497572422,
        -0.05067187175154686,
        0.08702703565359116,
        0.032180055975914,
        -0.009992769919335842,
        -0.056844305247068405,
        0.043337807059288025,
        0.0074675981886684895,
        0.03129032999277115,
        0.07224029302597046,
        -0.006673463620245457,
        0.018515044823288918,
        -0.009619536809623241,
        -0.05266865715384483,
        -0.033818379044532776,
        0.07217425853013992,
        -0.0012648674892261624,
        0.025675853714346886,
        0.05939396098256111,
        -0.032218508422374725,
        0.036510031670331955,
        -0.07329872250556946,
        -0.052281830459833145,
        -0.005345817189663649,
        0.054870493710041046,
        0.11818944662809372,
        0.002993494039401412,
        -0.030713237822055817,
        -0.1071750596165657,
        0.04395712539553642,
        -0.007647796534001827,
        0.006423315964639187,
        -0.060293734073638916,
        -0.015657469630241394,
        -0.0023821918293833733,
        0.006971937604248524,
        0.009249845519661903,
        -0.046901773661375046,
        -0.08016910403966904,
        -0.02391333505511284,
        -0.03493429720401764,
        0.008172285743057728,
        0.05599437654018402,
        -0.08836691826581955,
        -0.023617999628186226,
        0.02590489573776722,
        0.07225015759468079,
        -0.034675970673561096,
        -0.019108157604932785,
        -0.11239985376596451,
        -0.005035562440752983,
        0.06809253990650177,
        -0.06076359376311302,
        0.03404926508665085,
        -0.041973914951086044,
        0.010406226851046085,
        0.05156533047556877,
        -0.031603578478097916,
        -0.07316572219133377,
        0.02868221513926983,
        -0.0061293249018490314,
        -0.006212273612618446,
        -0.03197765350341797,
        -0.09686199575662613,
        0.05315133556723595,
        0.008410983718931675,
        -0.018647832795977592,
        0.008891025558114052,
        0.0663151666522026,
        0.04036998748779297,
        -0.06071574613451958,
        -0.02613162249326706,
        0.02187720313668251,
        0.04237784072756767,
        -0.009059068746864796,
        -0.040248651057481766,
        -0.002430262742564082,
        0.028640637174248695,
        7.197842205641791e-05,
        -0.0004497067129705101,
        0.022296633571386337,
        -0.05753249302506447,
        -0.05206261947751045,
        -0.07832116633653641,
        -0.009597010910511017,
        -0.019199874252080917,
        -0.04037129133939743,
        -0.01835557259619236,
        -0.03880789875984192,
        -0.02368999272584915,
        -0.08131612092256546,
        -0.05906696245074272,
        0.042371172457933426,
        0.04211656376719475,
        -0.03931988775730133,
        0.023776324465870857,
        -0.048243023455142975,
        -0.022155961021780968,
        -0.09375009685754776,
        -0.0043525309301912785,
        -0.0019789133220911026,
        0.02956404909491539,
        0.06405092030763626,
        -0.019201867282390594,
        0.042472921311855316,
        -0.06483254581689835,
        -0.07826542109251022,
        0.0737849771976471,
        0.08661467581987381,
        -0.028565408661961555,
        0.11794338375329971,
        0.07801111042499542,
        0.034675393253564835,
        -0.040448471903800964,
        -0.05606995150446892,
        -0.036193203181028366,
        0.037828002125024796,
        -0.027367331087589264,
        0.0061199055053293705,
        -0.07344307005405426,
        1.2072368125247171e-32,
        0.008520001545548439,
        0.07582173496484756,
        -0.01090470515191555,
        0.0452604666352272,
        -0.009362827055156231,
        -0.04312754422426224,
        -0.014838713221251965,
        0.09492931514978409,
        -0.026600638404488564,
        0.017669200897216797,
        -0.03401515260338783,
        0.031309232115745544,
        -0.04376956447958946,
        0.028572987765073776,
        0.09426666796207428,
        -0.044344790279865265,
        -0.042286645621061325,
        -0.04397128149867058,
        -0.04085381329059601,
        -0.016701851040124893,
        -0.0057600028812885284,
        -0.03002469427883625,
        -0.034041259437799454,
        0.07311869412660599,
        0.12060634791851044,
        0.055219441652297974,
        0.053080059587955475,
        0.013490069657564163,
        0.06274036318063736,
        -0.0008765996317379177,
        -0.07008316367864609,
        -0.02602049522101879,
        -0.02477281726896763,
        -0.08466207981109619,
        0.005124082788825035,
        0.007026528473943472,
        -0.060641683638095856,
        -0.029872655868530273,
        0.010840795002877712,
        -0.04863636568188667,
        -0.03931688517332077,
        0.04164355620741844,
        -0.09679408371448517,
        -0.04464351013302803,
        0.08833982050418854,
        0.09126754105091095,
        0.015108069404959679,
        0.033445652574300766,
        -0.014122625812888145,
        0.006012665573507547,
        -0.04802369698882103,
        -0.015063882805407047,
        -0.08249819278717041,
        -0.03528493642807007,
        -0.010280507616698742,
        -0.04253331571817398,
        -0.0314912348985672,
        0.03988294303417206,
        0.04934282973408699,
        0.055794499814510345,
        -0.02615842968225479,
        -0.043836817145347595,
        -0.028694406151771545,
        -0.035543181002140045,
        -0.07091019302606583,
        0.10897273570299149,
        0.10091494023799896,
        -0.061243414878845215,
        0.03838714212179184,
        0.07862338423728943,
        -0.035435937345027924,
        0.026862388476729393,
        0.04017983004450798,
        0.006270625628530979,
        0.038451917469501495,
        0.051364023238420486,
        -0.016516603529453278,
        -0.09174651652574539,
        0.018969804048538208,
        -0.03543376177549362,
        -0.1158231794834137,
        0.0645274966955185,
        -0.013142404146492481,
        0.09896311163902283,
        -0.0001021806092467159,
        -0.065406933426857,
        -0.00825189333409071,
        -0.04248020425438881,
        -0.009554171934723854,
        0.045451581478118896,
        -0.027014438062906265,
        0.0478825718164444,
        -0.07574935257434845,
        -0.013282920233905315,
        -0.05960070341825485,
        -1.1228333793997998e-32,
        0.04772890731692314,
        0.0023111740592867136,
        -0.022512108087539673,
        -0.04013248533010483,
        0.005174999590963125,
        -0.04781690239906311,
        0.04011695459485054,
        0.10753889381885529,
        0.03972618281841278,
        -0.11981812119483948,
        0.07588179409503937,
        -0.08280780911445618,
        -0.08868304640054703,
        0.03648093342781067,
        -0.03303151577711105,
        -0.011269665323197842,
        -0.08634920418262482,
        -0.06653282791376114,
        0.05539332330226898,
        -0.007014694157987833,
        0.07178908586502075,
        0.09656918048858643,
        0.08019603043794632,
        0.03323560953140259,
        -0.0047083706595003605,
        0.027482526376843452,
        0.02617514692246914,
        0.022039169445633888,
        0.07552627474069595,
        -0.007301146164536476,
        0.011055566370487213,
        -0.10667946189641953,
        -0.047858837991952896,
        -0.015695329755544662,
        0.0306062251329422,
        0.06454945355653763,
        0.009480208158493042,
        0.04600773751735687,
        -0.002746958751231432,
        -0.027480434626340866,
        0.051820315420627594,
        0.030999550595879555,
        0.028985610231757164,
        -0.0014155699172988534,
        0.0014306663069874048,
        -0.06207425892353058,
        -0.032419752329587936,
        0.05297909677028656,
        -0.002556102117523551,
        -0.012962644919753075,
        -0.04278154671192169,
        -0.0460394062101841,
        -0.04688545688986778,
        -0.00841532927006483,
        -0.031427349895238876,
        0.024942858144640923,
        -0.01691337302327156,
        -0.00024593493435531855,
        0.02463059313595295,
        0.011521290056407452,
        0.07847965508699417,
        -0.032682277262210846,
        -0.06744974851608276,
        -0.07981529831886292,
        0.002681991085410118,
        -0.047300782054662704,
        0.06778983026742935,
        -0.0037081255577504635,
        -0.00557746971026063,
        0.015327578410506248,
        -0.03844909369945526,
        -0.022518683224916458,
        0.04530356079339981,
        -0.00353771960362792,
        0.009119723923504353,
        0.018577376380562782,
        -0.03141867369413376,
        -0.009880566038191319,
        0.08777717500925064,
        -0.06226098909974098,
        -0.021773260086774826,
        0.08069395273923874,
        0.002161901444196701,
        0.07847431302070618,
        0.10387551039457321,
        0.110317662358284,
        0.08482707291841507,
        -0.02978925034403801,
        0.015529335476458073,
        0.08131945133209229,
        0.02796958014369011,
        0.07207918912172318,
        0.03665154427289963,
        0.0756315067410469,
        -0.11132334172725677,
        -6.021100773523358e-08,
        0.015036530792713165,
        0.015257880091667175,
        -0.016812054440379143,
        -0.0084674758836627,
        0.008654515258967876,
        -0.06095561012625694,
        -0.02703865058720112,
        0.026302261278033257,
        0.11783605813980103,
        -0.03520369157195091,
        0.07888521999120712,
        -0.005331799387931824,
        -0.03865085169672966,
        0.10158944875001907,
        0.06499022245407104,
        0.00276425969786942,
        -0.09085921198129654,
        0.05543430894613266,
        -0.02188507281243801,
        -0.09181468188762665,
        -0.039290741086006165,
        0.07314461469650269,
        0.0023754409048706293,
        -0.007349578198045492,
        0.02301173098385334,
        -0.013003273867070675,
        -0.03591986745595932,
        -0.022285237908363342,
        0.04516094923019409,
        0.015323441475629807,
        -0.05609685182571411,
        -0.013216059654951096,
        0.08764787018299103,
        -0.060026828199625015,
        -0.006221146788448095,
        -0.006941549014300108,
        -0.03761042281985283,
        -0.0636085793375969,
        0.05847339332103729,
        -0.005372782237827778,
        0.022051159292459488,
        -0.11713050305843353,
        -0.029489517211914062,
        -0.00223125540651381,
        0.027498258277773857,
        -0.0775015577673912,
        0.034395765513181686,
        -0.06203340366482735,
        -0.025798937305808067,
        -0.030968770384788513,
        -0.06259577721357346,
        0.02587391994893551,
        0.06341291964054108,
        -0.026389870792627335,
        0.08371379226446152,
        0.013916511088609695,
        0.04879333823919296,
        0.007195273879915476,
        -0.0062062423676252365,
        -0.02039196901023388,
        0.0904339998960495,
        -0.027223117649555206,
        -0.06097324192523956,
        0.07487334311008453
    ]
}