{
    "id": "Wk1oClYJE58",
    "title": "The Tesla Bot: Explained!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-08-23T23:06:19Z",
    "video_url": "https://www.youtube.com/watch?v=Wk1oClYJE58",
    "category": "Science & Technology",
    "tags": [
        "Tesla Bot",
        "Teslabot",
        "Tesla robot",
        "humanoid robot",
        "Elon Musk",
        "MKBHD",
        "Tesla Bot explained",
        "self driving",
        "self driving robot"
    ],
    "views": 5349838,
    "likes": 206194,
    "comments_count": 25428,
    "description": "Tesla announced a 5 foot 8 humanoid robot. Here's WHY.  That shirt!   All the official info:  Tesla AI day:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.tesla.com/AI",
        "https://youtu.be/j0z4FweCy4M",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(gentle upbeat music) - So, Tesla just announced a whole human-sized, human-shaped sentient robot. This is not a drill. This is a thing that really just happened. And a lot of things come to mind when hearing that. So let's get into it. Now, the two things that might have come to your mind when hearing that, like me, are number one, why Tesla of all companies? And number two, why a robot human of all things? But if you frame it in a certain way, it actually can make a lot of sense, but you got to break a few things down first to get there. So let's get there. So Tesla, Tesla is a car company, mostly. And I've reviewed their cars, we've seen their announcements, their factories, maybe we'll call it a vehicle company. They have a truck, they have a bunch of other stuff, but they have a factory that makes cars. So they're a car company. But only like by that specific definition, it's actually pretty common to look at Tesla as a software company. Just because their software advantage and all of the things that they do with the software in their cars is so important to them. It's like they're a software company that happens to make electric cars. And so, when you compare to the Mercedes of the world or the Audi's of the world or BMWs, I would never describe those companies as software companies, but for Tesla, that's where their main advantage is. And so part of this software thing that they're doing is this self-driving project, okay? Now, aside from all of the massive missed time windows and overoptimistic promises and deadlines and things like that, their self-driving is currently, as it is today, some of the most advanced in the world. And it's not because of high-resolution mapping or predetermined routes, it's because Teslas are using their sensors, or mostly cameras at this point, and constantly scanning their environments and making thousands of little on the fly decisions in real time. And then, all of the miles driven with this autopilot in action is used to upload the data back to their servers and train the whole rest of the fleet. So this whole system is a constantly self-improving thing. The bigger it gets, the faster it can continue to get better. So this requires a lot of computing, a lot of horsepower to be frank, and a lot of smart code. And that's what Tesla has been really good at. So Tesla had their AI day a couple days ago. You might not have heard about it, but they do this every year. They live stream a bunch of talks from Tesla engineers about computer vision and how their neural networks have evolved over time and explaining their focus on making autonomous cars that rely on computer vision and their synthetic visual cortex. It's really great, lots of informative, complex stuff. And at this year's, they unveiled their new custom D1 chip, which is this chip that's designed and built entirely in-house by a car company, which is specifically made to train Tesla's full self-driving algorithms based on driving footage even faster. And they're basically gonna be replacing all of their GPUs they're currently using to make this super computer designed to do computer vision machine learning. It's big stuff. And so at some point during all of this, Elon's on stage talking and then he says something about, to the effect of, Tesla is basically a robotics company. - Tesla is arguably the world's biggest robotics company 'cause our cars are, like I said, semi-sentient robots on wheels. - And if you think about it, it's like, okay, yeah. I could see that. I mean, obviously, Tesla builds cars, so we'll call them a car company still. But like if it's Tesla's AI day and they're giving a presentation and they're trying to make as good of a show as possible for recruiting purposes, they're gonna call it robots. So they happen to make robots that are on wheels. But yeah, that's how you can get it to make sense mentally. It's like, all right, yeah. Self-driving cars is just one application of AI and computer vision and robotics, just to solve that problem. So that's what's happening. It's a bunch of sensors scanning its environment and making a bunch of decisions based on that. And then training future versions of it based on what happens. That's just what's happening in self-driving cars. So then I can see it making sense. Then Elon right afterward said this. - It kinda makes sense to put that onto a humanoid form. - He says it makes sense to make these robots in a humanoid form. And that is where I disagree. So this is the newly unveiled Tesla robot. It's called Tesla Bot. It's a 5'8, 125 pound, sleek-looking like black and white human-shaped robot with this face mask, with the screen on it. It's got hands with, you know, full 10 fingers. It's got feet, but with no toes. It's pretty slow. It has a max speed of five miles per hour so that you can outrun it. And then it can lift things up up to 10 pounds with the arms extended or it can deadlift to 150. Lots of cameras and actuators. And of course, the full self-driving computer inside. So they're saying it's gonna be easy to overpower or run away from so that should never be a concern. But the main purpose, the purpose of this Tesla Bot, the thing that they kept saying over and over again on stage during the presentation and during Q and A's when they're asked about it, they kept defaulting to it will be able to do tasks that are repetitive, dangerous, or boring, so that humans don't have to. And so, if you buy Tesla as a robotics company, then yeah, this makes sense. It's just another robot that will use the sensors to scan its environment and make a bunch of decisions and navigate around this world that it's in. But the thing that I have to say, and this is gonna come with the caveat that I'm of course, not a robotics engineer. I'm not an expert at this but here's my take. The human form is very inefficient. Now, don't get me wrong. Humans, we're pretty great, right? We're very accomplished species and we're very complex and we've done a lot of things well. But they work as a body so well because number one, our brains are amazing. But number two, because we've built this world around us, that we live in mostly with ergonomics designed for humans. But when it's not designed for humans like this upright bipedal thing that's balancing all the time, it's not very efficient. We just did a retrotech episode about this, about humanoid robots. So I'll link it below if you haven't already watched it. It's a super fun one. But we did a lot of talking with people and experts about this. And it turns out, if you want to make a robot to take over a task, you typically don't wanna build it like a human. You wanna build it for a single task and make it as efficient as possible at that one task. So pop culture forever has been obsessed with humanoid robots. Like I can't even count all the instances of humanoid-shaped robots in movies and TV shows over the years that we found. It's something we've been fascinated with since the beginning of time. There's endless versions of it. But it turns out, the ideal way to make a robot vacuum the floor for you is not to build a human-sized shaped robot that pushes around a vacuum. It's to make the robot the vacuum. The vacuum is the robot. You don't want a humanoid robot standing at the sink washing dishes for you. The dishwasher is the robot. Like that's the single purpose built robot. Tesla knows this. You don't have a humanoid-shaped robots sitting in your car, driving the car for you. The car is the robot. The self-driving car that drives itself has already been done. So the list of things you would want a human-shaped robot for is pretty small because labor is typically not designed around the human form. The one example that kept giving over and over in their AI day presentation was grocery shopping. So, you know, you walk to the grocery store, you grab a cart or a basket and you pick out some items and put them in the basket. I guess that's, you know, you need a bunch of different peripherals and things to pull that off, and maybe a human-shaped robot would be fine for that. But there's not a whole lot else I can think of. Like even when I picture the most simple, boring tasks, like making a bed or building a table. Like when I picture a robot that would be especially good at that, I don't picture a human-shaped one, I picture one that's super focused and super efficient. Maybe I'm just short-sighted. But I remember when I talked with Elon at the factory a couple of years ago about all the things that they do with robots versus the couple of things left that they still do with humans, he had a really interesting answer. - So some parts of it are like 80 to 90% automated, and then some parts of it are like only 10 to 20% automated. - What are those parts that humans do better than... - Humans are really good at adaptation and rapid evolution, and doing like finicky things, like that. It's like trying to connect a hose but that's like sort of dangling around. - I see. - And then you go like, the robots got to find the hose, grab it, then connect it to another hose. - [Marques] At that point. - It's like really hard. - Yeah. - Like a person can just go, \"Oh, it's done.\" - Gotcha. - Yeah. - That makes a lot of sense. - Yeah. And it's like, well, when you see it, it's like, wow, it's super obvious. - Right. - And then we try to have robots do this. It's like robots grabbing the wrong thing, and like will stick it over here. And they're like, oh, the hose was here, what the robot do was here, as not. Like tries to grab air and then like smashes into the car. (both laughs) - You don't want that. - Yeah, it was a comedy of errors, a tragedy of errors. - So, yeah, all that really made me think. Like with as good as Tesla is with self-driving, why would you want a humanoid, a human-shaped robot to try to do things that humans are already good at? How long is it gonna take for that robot to actually get good at things that humans are good at? And you know what the best way to answer that would probably be to look at the most advanced robotics company that I can think of at the moment which is Boston Dynamics. So there's two very different types of humanoid robots that I've seen exist in this world. On one end, it's like the dumb, single purpose thing you see at CES. Like these are the barely functional robots you see that can really do only a few things decently well. They're kinda cheesy-looking. They're human-shaped for no reason, but they exist. And then on the other end of the spectrum, there is Boston Dynamics' Atlas. And man, I wish when I was out there, I could have seen Atlas in person because just the dog, Spot, is already impressive enough. Like it's got the sensors, it has a basic level of understanding, scanning its environment, and it can be programmed to do dangerous or boring or repetitive things and go places that humans wouldn't go. And we say dog because they've called it Spot, And it's kind of looks like a dog if you make it behave the right way sometimes. But really, it's just a quadruped, any four-legged animal would do. But Atlas on the other hand, well, I haven't necessarily seen it do anything specifically useful yet, but seeing that five foot human-shaped robot navigate the world in crazy ways is something else. I mean, I did share a new video of it doing parkour and Elon seemed very impressed. But even after all these years of development and the history of how much we've seen it get better, Atlas is not a robot that's gonna be on sale for people to buy anytime soon. And if you ask them about it, they'll tell you it's just them experimenting with their computing in a new form factor. And so at the end of the day, my take, Tesla Bot probably won't exist anytime soon either. Like you know, I know they said onstage there would be a prototype maybe next year. I kinda doubt that they're gonna leap frog Boston Dynamics in the next two years. But then, here's the other thing. Even if they do come out with it, Tesla right now is training their self-driving computers with billions and billions of miles of self-driving happening on the streets today, right? So the best way to get as much data about that as possible is to have it go out in the real world and do it. It's kinda genius actually, that they're making so many cars and people are really using it for them. But now, they're gonna be asking for a humanoid robot to go out and navigate the entire rest of the real world where there is an order of magnitude more stuff to identify and react to. I mean, on the streets, there's obviously other cars and trucks and buses, and it can identify motorcycles and bicycles and pedestrians even. And then, there's traffic cones and there's lights, and all the rest of the traffic control devices, construction zones, arrows on the road, it's kinda starting to run out. That's almost it. But how well is the Tesla Bot gonna do when you ask it to go get bananas from the grocery store? Like really? Like how good could it get? Or if you ask it, \"Hey, Tesla Bot, go grab my AirPods Max from downstairs,\" is it gonna be able to know that that's headphones or is it gonna have to have a model of every new pair of headphones that ever comes out to be able to identify which one you're talking about? And all of this training, that's you can see where I'm coming from, all this training has to come from real-world data, which I guess would have to come from people using Tesla Bots in their homes and starting to get this going which seems a little less likely to me than people getting a self-driving car. And then, there's just a whole bunch of other unknowns about this robot, too. What other colors will it come in? Will it come in matte black? How does it charge? Will it just sit on a USB port in the corner of a room every day? I don't know. Will this ever even go on sale? And I don't know if it's really even about this robot going on sale as much as it is just about, honestly, it could really just be Tesla exploring their computer vision in another form factor just like Boston Dynamics. It's just about Tesla becoming the best AI and computer vision company that they possibly can, and this being just one more avenue to get better at it. So there's no good reason I can think of for a humanoid robot to exist out there in people's hands anyway. But, hey, it makes a lot of good headlines. It's obviously something we've been fascinated with forever and will continue to be for a long time. And it could just be one more form factor that Tesla's exploring. And also when have they ever said no to a good free PR opportunity. So anyway, that's about my thoughts on it. I'm super curious what you guys think. If you have any thoughts on, would you want something like this in your own home? Do you think the robot will exist? Sure the comment section will be fun below this one. Either way, thanks for watching. Get you guys on the next one, peace.",
    "transcript_keywords": [
        "Tesla",
        "robot",
        "Tesla Bot",
        "things",
        "robots",
        "make",
        "cars",
        "car",
        "company",
        "thing",
        "humanshaped robot",
        "good",
        "car company",
        "selfdriving",
        "lot",
        "humans",
        "Tesla robot",
        "world",
        "unveiled Tesla robot",
        "humanoid"
    ],
    "transcript_entity_values": [
        "AI",
        "Tesla Bots",
        "today",
        "year",
        "thousands",
        "Tesla Bot",
        "150",
        "one",
        "5'8",
        "four",
        "five foot",
        "Boston Dynamics",
        "BMWs",
        "Elon",
        "number one",
        "the next two years",
        "CES",
        "80 to 90%",
        "up to 10 pounds",
        "20%",
        "10",
        "five miles per hour",
        "Audi",
        "Atlas",
        "the years",
        "billions and billions",
        "125 pound",
        "AirPods Max",
        "first",
        "Tesla Bot",
        "Atlas",
        "next year",
        "Teslas",
        "a couple of years ago",
        "a couple days ago",
        "Tesla",
        "number two",
        "Mercedes",
        "hose",
        "two",
        "the end of the day",
        "this every year",
        "Boston Dynamics' Atlas",
        "USB",
        "AI day"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "DATE",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.09096049517393112,
        -0.009576529264450073,
        0.03216496855020523,
        0.01450683269649744,
        0.012254511937499046,
        -0.011654969304800034,
        0.046450842171907425,
        0.05209807679057121,
        0.002938575344160199,
        -0.02164931781589985,
        -0.001705692964605987,
        0.016606222838163376,
        0.053614094853401184,
        -0.03495268523693085,
        0.02565670572221279,
        -0.01554048340767622,
        0.049667153507471085,
        -0.025243796408176422,
        -0.050545476377010345,
        0.039611224085092545,
        -0.0047033075243234634,
        -0.0007578513468615711,
        0.01703134924173355,
        0.02555442973971367,
        -0.042610108852386475,
        0.08782467991113663,
        -0.05245638266205788,
        -0.04260588437318802,
        -0.058505795896053314,
        -0.08852209895849228,
        -0.01624484732747078,
        0.08863717317581177,
        0.04672101512551308,
        -0.006889741402119398,
        0.024312838912010193,
        0.07931320369243622,
        -0.030801041051745415,
        0.04110000282526016,
        0.037703629583120346,
        -0.039988238364458084,
        -0.008539912290871143,
        -0.09693524986505508,
        0.006561124697327614,
        -0.023705272004008293,
        0.05632102116942406,
        0.08966819196939468,
        0.05103176459670067,
        -0.06186673417687416,
        0.03480158746242523,
        -0.035672884434461594,
        -0.1268470138311386,
        -0.004237113054841757,
        0.10243115574121475,
        -0.017797712236642838,
        -0.06178345903754234,
        -0.01991598680615425,
        0.057768892496824265,
        0.002572454512119293,
        0.027876516804099083,
        -0.0011471988400444388,
        0.06756710261106491,
        -0.10206732153892517,
        0.048416197299957275,
        0.023173430934548378,
        0.07572408765554428,
        -0.07996386289596558,
        -0.08303344994783401,
        -0.04855730012059212,
        -0.09340324252843857,
        0.03635942563414574,
        0.11686161160469055,
        -0.005035185255110264,
        0.03440021350979805,
        0.079070545732975,
        -0.007014452014118433,
        -0.05859944596886635,
        0.0790863186120987,
        0.009284032508730888,
        0.031004605814814568,
        0.026408003643155098,
        0.03578765317797661,
        0.00783690344542265,
        -0.03983897715806961,
        0.051211073994636536,
        -0.07630369812250137,
        0.06737304478883743,
        0.07901471853256226,
        -0.0018235368188470602,
        -0.08650039881467819,
        0.03896893188357353,
        -0.052117396146059036,
        -0.06875067204236984,
        -0.028487836942076683,
        0.005322323180735111,
        0.01687186025083065,
        0.04868149012327194,
        -0.03905847668647766,
        -0.022894861176609993,
        -0.0060555292293429375,
        -0.006214817054569721,
        0.0883495956659317,
        0.0060008615255355835,
        0.023948509246110916,
        0.011234477162361145,
        -0.049840047955513,
        -0.08868076652288437,
        -0.05215980112552643,
        0.02150392159819603,
        0.09390964359045029,
        0.007046837359666824,
        0.026136981323361397,
        -0.0467846654355526,
        -0.04871397092938423,
        0.03416823968291283,
        -0.04168590530753136,
        -0.053115058690309525,
        -0.03126691281795502,
        0.053040970116853714,
        0.04701671376824379,
        0.01978827454149723,
        0.028368718922138214,
        0.016540786251425743,
        0.010968486778438091,
        0.02593398466706276,
        0.0914854034781456,
        -0.008577047847211361,
        -0.03862778842449188,
        -2.343835634848829e-33,
        -0.066679447889328,
        0.018086543306708336,
        0.010976561345160007,
        0.08724551647901535,
        0.04783051088452339,
        -0.02254183031618595,
        -0.05641527101397514,
        0.07464495301246643,
        0.049291159957647324,
        0.051119375973939896,
        -0.0779920443892479,
        0.046421077102422714,
        0.04544943571090698,
        0.04555186629295349,
        -0.08230685442686081,
        -0.020848989486694336,
        -0.10270652920007706,
        -0.07692016661167145,
        -0.05192197859287262,
        -0.027550222352147102,
        0.07307259738445282,
        0.06362803280353546,
        0.057208187878131866,
        0.07442150264978409,
        0.06371898204088211,
        -0.07008510828018188,
        -0.019088048487901688,
        -0.04274874925613403,
        -0.023148324340581894,
        0.005190644878894091,
        -0.10399594902992249,
        0.09046538174152374,
        0.0054927715100348,
        0.04502181336283684,
        0.009168545715510845,
        -0.04148611053824425,
        -0.0736967921257019,
        -0.08369891345500946,
        -0.0444355309009552,
        -0.040005818009376526,
        -0.02404935471713543,
        0.035068076103925705,
        -0.11787637323141098,
        -0.06791870296001434,
        -0.006460228469222784,
        0.038540467619895935,
        0.0016604865668341517,
        -0.037187039852142334,
        -0.0300676841288805,
        -0.01360304094851017,
        -0.0199612807482481,
        0.07749901711940765,
        0.06126301363110542,
        -0.05264847353100777,
        0.06036775931715965,
        -0.04715495556592941,
        0.023575374856591225,
        -0.027104198932647705,
        -0.013153238222002983,
        -0.006452973932027817,
        -0.03612200915813446,
        0.11116169393062592,
        0.014280995354056358,
        0.06493105739355087,
        -0.018731065094470978,
        0.04214239865541458,
        0.05541194602847099,
        0.08385463804006577,
        0.08028065413236618,
        0.09895016998052597,
        0.015995290130376816,
        -0.013859408907592297,
        -0.04303176328539848,
        0.0017530544428154826,
        -0.034108467400074005,
        0.016250770539045334,
        -0.03511682525277138,
        0.0039004492573440075,
        0.0022226739674806595,
        0.015659460797905922,
        -0.031208083033561707,
        -0.012663807719945908,
        0.007371827960014343,
        -0.0026820863131433725,
        0.04528173804283142,
        0.008862905204296112,
        0.017209406942129135,
        -0.07017771154642105,
        -0.011104799807071686,
        0.0068182130344212055,
        -0.0613192617893219,
        -0.01927478238940239,
        -0.051081687211990356,
        0.030340684577822685,
        -0.07620244473218918,
        -2.3089153711057452e-33,
        -0.01350144948810339,
        -0.01567862182855606,
        0.05093466490507126,
        -0.015177568420767784,
        0.03116234578192234,
        -0.044010698795318604,
        -0.02522968500852585,
        -0.0308995358645916,
        0.0030570647213608027,
        0.08680534362792969,
        -0.02213210053741932,
        -0.005970645695924759,
        -0.01421077735722065,
        0.0238249059766531,
        0.045759472995996475,
        -0.0017239433946087956,
        -0.003577598836272955,
        -0.13835161924362183,
        -0.050234436988830566,
        -0.009805618785321712,
        -0.010830649174749851,
        0.06981676816940308,
        -0.07723937928676605,
        0.006133446469902992,
        -0.0013664800208061934,
        0.03078446537256241,
        -0.05170707032084465,
        -0.030680522322654724,
        0.034904927015304565,
        -0.012794732116162777,
        -0.07362907379865646,
        -0.09765750914812088,
        -0.033069826662540436,
        0.03479509428143501,
        0.07241377979516983,
        -0.010879257693886757,
        -0.07131512463092804,
        -0.0008503069402649999,
        0.07153236865997314,
        -0.021049395203590393,
        0.007627653889358044,
        -0.02889001928269863,
        0.009666670113801956,
        -0.0580560527741909,
        0.008369997143745422,
        -0.13161398470401764,
        -0.03763966262340546,
        0.0023480423260480165,
        -0.04596623405814171,
        0.06329875439405441,
        0.06403391808271408,
        0.039267487823963165,
        0.004280587192624807,
        -0.06716757267713547,
        -0.09645577520132065,
        -0.07495589554309845,
        0.023938454687595367,
        0.00021090605878271163,
        0.035765402019023895,
        0.06031601130962372,
        0.04539455845952034,
        -0.004025087226182222,
        0.014074720442295074,
        0.07510332018136978,
        -0.12703950703144073,
        -0.022575628012418747,
        0.013519344851374626,
        -0.0014442831743508577,
        0.012938248924911022,
        -0.07438958436250687,
        0.046991053968667984,
        -0.027014384046196938,
        -0.04694025218486786,
        0.006991469766944647,
        -0.05431484431028366,
        0.06837685406208038,
        0.003113124053925276,
        -0.061761524528265,
        0.04417634382843971,
        -0.0954904705286026,
        0.016673380509018898,
        -0.026626335456967354,
        0.12027381360530853,
        0.08198076486587524,
        0.038671817630529404,
        0.09317485988140106,
        -0.03684164583683014,
        0.04097278043627739,
        0.0452253483235836,
        0.04963423311710358,
        0.00937256682664156,
        0.022287936881184578,
        -0.04427468031644821,
        0.053282685577869415,
        -0.12119871377944946,
        -5.784835366284824e-08,
        -0.019923487678170204,
        -0.04578051716089249,
        -0.0015090536326169968,
        -0.029170168563723564,
        0.09711622446775436,
        -0.04594925045967102,
        0.02915405109524727,
        -0.04238160327076912,
        -0.028978491201996803,
        0.03783782944083214,
        0.050030920654535294,
        -0.026823338121175766,
        -0.07409573346376419,
        0.09908530861139297,
        0.03639598563313484,
        0.021074514836072922,
        -0.05457669496536255,
        -0.029788579791784286,
        -0.02580486610531807,
        0.050132136791944504,
        0.016247447580099106,
        -0.040872879326343536,
        -0.008432849310338497,
        0.029998747631907463,
        0.009102804586291313,
        -0.035787373781204224,
        -0.08345889300107956,
        -0.038894835859537125,
        0.002458978211507201,
        -0.0033406028524041176,
        -0.032462988048791885,
        -0.010661888867616653,
        -0.01158104557543993,
        0.01405145600438118,
        0.01413912232965231,
        -0.06356315314769745,
        -0.007774137891829014,
        -0.09426466375589371,
        0.01375544723123312,
        -0.03845098242163658,
        0.037196431308984756,
        0.04378442466259003,
        0.0061496552079916,
        0.0135455671697855,
        -0.015522956848144531,
        -0.04217250645160675,
        -0.09485859423875809,
        -0.12881900370121002,
        -0.05558082461357117,
        0.05571488291025162,
        -0.03688086196780205,
        -0.066981241106987,
        0.03326413035392761,
        0.07976039499044418,
        0.0798669084906578,
        -0.008964424952864647,
        -0.03470473363995552,
        -0.03591127693653107,
        -0.041781939566135406,
        -0.0019248907919973135,
        0.008917934261262417,
        0.03198542818427086,
        0.08196551352739334,
        0.03547286614775658
    ]
}