{
    "id": "wKFyLz0YLFo",
    "title": "The Minimum Wage Gaming PC",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2023-01-20T23:15:06Z",
    "video_url": "https://www.youtube.com/watch?v=wKFyLz0YLFo",
    "category": "Science & Technology",
    "tags": [
        "greg salazar",
        "minimum wage",
        "minimum wage pc",
        "budget gaming pc",
        "cheap pc",
        "cheap gaming pc",
        "cheap computer",
        "the minimum wage gaming pc",
        "used pc",
        "used computer",
        "gaming computer",
        "budget gaming pc build",
        "budget pc 2023",
        "cheap pc in 2023",
        "budget gaming pc 2023",
        "budget gaming pc setup",
        "$350 gaming pc",
        "$350 pc",
        "350 usd",
        "350 usd gaming pc"
    ],
    "views": 173497,
    "likes": 6469,
    "comments_count": 1050,
    "description": "SPONSOR: Use code 'GSVIP' to save 30% while shopping at VIP-SCDKey during their New Year sale: Windows 10 ($15):  Windows 11 ($21):  Office 2021 ($49):   Meet our minimum wage gaming PC! We set aside a budget of $350 to buy a rig we thought would hold up to modern 1080p gaming, content creation, and other workstation applications. This rig boasts an Intel Core i7 4930K, GTX 970, and 48GB of DDR3. Let's see how it performs!   Consider supporting us on Patreon!   Shop used gaming PCs on eBay:  Shop gaming PCs on Amazon:    My studio gear on Amazon: Sony A7C (Primary):  Sony a6600 (Secondary):  Sony a6400 (Webcam):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.",
    "description_links": [
        "https://bit.ly/GSVIPWIN10pro",
        "https://bit.ly/GSVIPWIN11pro",
        "https://bit.ly/GSVIPOFFICE2021",
        "https://www.patreon.com/gregsalazar",
        "https://ebay.us/p2IuUc",
        "https://geni.us/JRyRX",
        "https://geni.us/lOeoIA9",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "- In the state of Florida, as of time of filming, minimum wage is $11 per hour. And I'll be honest with you, that's not a lot of money. I remember back when I was working at Winn-Dixie, I was getting paid just over $8 an hour and we've only, what, gone up $3 since then? The price of everything has skyrocketed since those days. So it's just, it's difficult to wrap my mind around how folks make this work. Obviously there are government incentive, subsidies, food stamps, things you could take advantage of to stretch this income as far as you can. But the reality is a lot of folks are living on a paycheck like this day to day. And what I wanted to do in this video was see just how far we could stretch a week's worth of that pay. So let's assume an eight hour workday minus an hour for lunch, that gives us $77 of minimum wage here in Florida, times five is just over $350 for the week. And this again is assuming we're not even taking out taxes or paying into other programs, health insurance, what have you. So that's, again, not a lot of money to work with. What can you buy if you set aside a week's pay for a gaming pc? Actually, I think we did pretty good. And I think you'll enjoy watching this one play out. We're gonna not only walk through the build that I bought here locally from somebody, but we're also gonna test it in a few games and see just how it holds up here in early 2023. Are you ready? Stay with me. If you're tired of seeing the exact same Activate Windows watermark over and over, then be sure to check out VIP-SCDKey. They're running a New Year's super sale of 30% on Windows 10 OEM keys, which work nearly the same as their retail counterparts, but for a fraction of the price. Activating Windows will give you access to free Windows 11 upgrades as well, custom wallpapers, and a few other benefits. To get started, click the link blow and hop on over to the product page. Be sure to select the Windows version that you're currently running, this is super important because your key might not work otherwise. Then click Buy Now. Then be sure to use our new year offer code GSVIP. Don't forget this one, that's GSVIP for a special 30% discount at checkout bringing your total to around 15 bucks. It's literally that simple. Your product key will be delivered usually within a few seconds at which point you can activate your copy of Windows. But we'll detail how to do this later in the video. Find under the great deals as well at VIP-SCDKEY including Microsoft Office via the links below. This here is the gaming PC that we bought for exactly $350 locally here in Orlando, Florida, slightly under what you'd expect to make in a week with that minimum wage job. However, again, you've got taxes and other things to consider. So the fact that we came in a little under budget I think is more fitting here. This rig is actually pretty impressive, I think, for the money. Now, could you have parted this out and maybe, I don't know, spent less for a similar performing system? Yeah, sure. But the fact is this is already preassembled for you and more or less guaranteed to work unless you bought from somebody you don't trust and got ripped off which is also something to consider if you're buying online. And when you meet somebody locally, it just goes without saying, make sure you do it in a public, safe place. Do not invite a stranger into your home. Do not go to that stranger's home, I don't recommend that either. I know it's difficult with PC gear to check or to just kind of rely on the word of the owner that it works. You can't just bring a generator with you and like plug it in and make sure the system powers on in a Publix parking lot. So you really have to play it by ear and I recommend going with reputable sellers who have great feedback for one. That's a good way to weed out the sus that's out there. So this rig, let me go run through the specs for you very quickly here. It has a Core I7 2770K in it. That's right, an X79 platform here. It has 48 gigs of DDR3 which is more than I think we're gonna need for gaming but I'm not complaining. We have a GTX 970 in here from EVGA and an RM750 watt power supply. This here was the OfferUp listing that I came across for this rig. And you could see the price was originally around $400. I talked 'em down to 350, it was actually very easy to do. I pitched 350 and said, \"Hey, I'll give you cash, I'll meet you in person same day or next day.\" And they agreed, we didn't have to haggle, and I prefer to do that. Honestly, like I'll give you my best price right away and it's take it or leave it. I'm not gonna go back and forth multiple times especially when responses can be a bit spotty, that's just how I do it. You don't have to agree with that, but it tends to work out pretty well for local deals. And I was really impressed by how clean this rig looked in the photos. You could tell they took good care of it. These are all older components for the most part. I was impressed that there was an RM750 power supply in here from Corsair, so that was nice to see. But everything else is at least several years old and of course the price reflects this. But it was clean, it looked inviting. The description was pretty straightforward, no BS there, And so that was why I was willing to reach out. As for the two gentlemen who sold me the rig, one of 'em knew who I was, which I wasn't expecting but that was cool. And it was, I mean it was a very cordial meeting, very direct and nothing shady. From a presentation standpoint, again, there's a lot I really liked about this. Everything is very cleanly routed. All the power supply cables running through this bottom large rubber grommet here, front IO, front panel wiring, fan cable, HD audio, the giant PCIe self metal power connector, all of that is run where it should be. It's where I would run things in a case like this is quite a large case here but it just looked very presentable. As for storage here we've got a one terabyte WD Blue hard disk drive and a 500 gig SSD, which is really cool. I expect that's where our operating system will be. So you get a lot of storage in this price range as well. And depending on who you ask, another cool feature, you get a five and a quarter inch optical drive. Check that out. Old school but a lot of folks still like these So the inclusion of one is a nice touch. One thing I am curious about is cable management. How well did we do here? Oh, okay. I mean it's about as good as you probably could have done in a case like this. Not a ton of real estate directly behind the motherboard tray. A bit more, yeah, a bit more space down here to work with. But I mean what can you do? You've got so many cables to route and not a lot of space to route them while also keeping them out of sight. So I think given what we're working with, not too bad, not gonna complain. Let's fire up then shall we and see if it works. Oh, turned on on its own. I didn't touch anything. Oh there it goes again. Is it wired up correctly? Sometimes when you flip flop the reset switch and the power switch, you can do things like that. I think it's just an older rig, sometimes that happens. Okay, so we get a post right away. That is a good sign if I do say so myself. It looks like our drives are detected and I believe, are they gonna go into the bios or Windows? Okay, there we go. So Windows is already loaded on. That's actually really convenient. Didn't have to do anything at all. You just start downloading stuff, playing some games. But just a heads up, whenever buying a fully assembled computer from anybody, I would say including a company that maybe has used these components before, it's publicized as a used rig. You wanna make sure that there aren't programs already installed on the machine that could spy on things you do. Just be careful of that. You might want to reinstall windows, really scan for spyware or something. Now I was checking to make sure all the fans are spinning. We got our tower cooler here. We've got our exhaust fan to the rear as well. We do have two fans up front although they aren't really doing much 'cause this is totally choked off. One of these fans it does look like is spinning but the top one is not. So let's see, maybe we can see better from this side. Oh, oh whoa. Okay. Maybe it wasn't as cleaned as I initially thought. That's kind of gross. - [Narrator] 12 seconds later. - Ah, I want you to look at that. Both fans magically start working now. Okay, so not the end of the world but while we're on the subject of cleaning let's check out a few other components that are prone to getting quite dirty with time, including the graphics card. I'm mainly talking about the graphics card. I know you can't see it that well in there. The CPU cooler actually looks decent. There's some collection of dust there at the bottom but the back looks good. I don't expect that thermals are gonna be too affected there. And honestly the graphic card from the top looks pretty clean as well. There is a bit of surface dust though accruing over the PCB and I think what we're gonna do is take this out, just give it a quick dusting. And I've gotta be honest though, actually looks pretty clean from this side. I mean you can tell it's been dusted. The heat sink underneath looks really clean. Even the fans themselves look really clean. The only, the only bit of dust that I can see is just on the PCB itself. You can see, just moved some of the dust out of the way with my finger. For an older rig, I mean, it still looks pretty darn clean. And one last point of concern, the memory. It looks like this was fully populated before with 64 gigs of DDR3, and two DIMMs were removed on the right side. The order though for RAM slotting, if you only have six DIMMs, I think is slightly different than this. So we'll need to move things around just a tad if you wanna take advantage of quad-channel memory. So here's the manual and this here is the config we wanna follow for six DIMMs. So according to that manual, this is how it should look with one gap on each side. Now to be fair to this platform, because again it is several, several years old and X79, DX12 isn't really ideal here. And Time Spy is also a 1440p benchmark. Time Spy Extreme is a 4K benchmark. So I think that for $350, anything above 1080p gameplay is, or should be out of reach and just not really expected unless you're playing some very easy to tackle game like CS:GO or maybe Dota 2. All that said, our system scored at 3637 which is fairly underwhelming scoring only 10% better than all submitted results here. But again, you need to remember that time Spy is a newer benchmark than, say Fire Strike. It is a 1440p benchmark. It is a DX12 benchmark. And because of those things, a lot of folks tend to stray away from Time Spy and test older things like Fire Strike. My oh my, just look at the side by side comparison here. So much smoother, yes, there is a resolution drop to 1080p in vanilla Fire Strike, but you can see that this is where the system really starts to stride and just looks comfortable in this position. With a score of just over 10,000, we place a little under 50% of all submitted results so we're right in the sweet spot here in the Fire Strike benchmark. And again, with a $350 system here in 2023, I think that's pretty impressive. So for 1080p gameplay, I expect this machine will actually do quite well. The GTX 970, while it is several generations old from NVIDIA at this point can carry its weight in 720p and 1080p even in some modern titles which I'll show you next. Meet DIRT 5. So this game didn't fare the best in the medium preset in 1080p. We're getting around 40 FPS or so which I mean is okay for a racing style game. See, it doesn't look terrible here, but we're looking for at least 60 FPS. So what I did in the next test was drop settings to low or very low. And in the same resolution, our frame rate jumped well above 60 FPS, which I think is much more doable. And if I'm being completely honest, if we place these side by side, I can't really tell which is which. I mean, can you see which one is very low versus medium? It's kind of a wash in my view at least. And I know there's gonna be a lot of post-processing here but don't be afraid to drop the settings in this game. Still looks very good. Next up, I wanted to test Assassin's Creed Odyssey, a game I haven't tested in quite a while. But for an older system like this I mean anywhere between 40, 50, 60 FPS is pretty darn good. It does occasionally drop though down to around 30 FPS. There were quite frequent frame time spikes here which I was a bit concerned by. And this is just 1080p medium preset. There is a bit of anti aliasing happening here as well. Don't worry about the jaggies, that's just because we don't have Vsync enabled so it's gonna look a bit choppy in playback. But I was actually kind of impressed that this system was even able to open Assassins Creed just based on what I've had to deal with in the past. So there you have it then, proof that a minimum wage gaming PC can in fact game and it can game quite well if you're willing to make some in-game concessions. Now let's assume this PC didn't already come with an activated copy of Windows. The solution would be very simple, no reason to fret. So let's start where we left off earlier assuming you already bought a Windows OEM key for around 15 bucks from our sponsor again linked below. go ahead and open up your settings window and click Updates and Security. You'll see an Activate Windows tab and it's here where you'll want to enter that OEM key you just purchased. Just click the change or add product key button and select Activate. Now this process could take up to a few minutes but don't freak out, just let it do its thing. You should be successful if the correct version of Windows was selected at checkout, which is why we emphasized that earlier. And that's it. That's all you need to do. Bye-bye watermark. It's literally that simple and affordable thanks to VIP-SCDKEY. Just remember that OEM keys locked to the hardware in question So you may need to reactivate should you swap motherboards or other major hardware down the line. It's one of the reasons OEM keys are much cheaper than retail counterparts. Remember to use our unique New Year's super sale offer code GSVIP, by the way, to save big time on your favorite software. Click those links below to get started today. Is this my first choice for building a budget gaming PC in around the 3 to $500 range? I mean, if I had to build this myself, maybe not, I probably wouldn't have gone the X79 route, I think that probably incurs a slightly higher cost just because of the platform and maybe how rare it is, especially today. But I bought a fully assembled rig. I mean it's not like I really had a choice. And this is something that, well, you'll have to decide for yourself. Could you build a better rig if you decided to just buy individual parts, say secondhand, on eBay? Potentially, in fact, probably I think probably is the right word. But the fact that I was able to get this preassembled relatively clean with the exception of the front panel and just plug and play. It worked. It already had Windows installed. it already had the latest NVIDIA drivers installed as well. These guys took really good care of this and I was really impressed with their delivery. Overall, just left a really good taste in the mouth. So if you guys are in the Orlando, Florida area, I do recommend them based on this single sample that I have here. You can tell they took good care of their hardware and that they value their work. There is one final thing I'd like to address. And this just comes with a territory of budget builds in general. You always have commenters saying things like, well you could have gotten this or this, or you should have done this, the price of this is way better than this, the value, blah, blah, blah. First off, you're buying, again, a fully assembled rig, you don't have much of a choice. And so it's up to you however you wanna approach that. The other thing I'd like to point out is that when you are in a budget like this, a very constrained, let's say you're setting aside just one week's worth of minimum wage pay for a gaming pc, right? The scenario we gave ourselves here, you don't really have the flexibility of future proofing. And that's a word or a phrase I should say that I just have grown to hate, honestly. I just hate it. Sometimes I use it myself and I hate myself for using it, but it's something you can't really escape with technology because technology is always advancing, at least it should, in nature. And so when you buy something like this, you're gonna hear from people say, oh this is a cornered platform, there's zero upgrade path, blah, blah, blah. Like yeah, we get that. And in my experience it just, it wouldn't make sense to buy, say an A320 motherboard so you can get am4 support and then put in like Ryzen 3. I mean maybe get the like Ryzen 3 1200 in here. I don't know what the prices are of those. I'd have to go back and look. GTX 970, maybe if you upgraded to that platform, you'd have to compromise on the graphics card. You couldn't get a 970, maybe you'd have to get like a 950 or a 960 or a R9 270, something that's slightly weaker. And I think in many of the games that we tested here, the GTX 970 was doing quite well. So you don't wanna take a a big frame rate cut in a budget rig like this for the sake of having an upgrade path. If you're already on a tight budget to begin with, why would you even expect to be upgrading anytime soon? I don't really see that logic all the way through. I just wanted to express that to you guys. I know not everyone will agree, but that's why I approach budget builds the way that I do. I don't plan on future proofing. I don't build or pick parts with that intent. I just try to maximize the performance I can get for the dollar today, in the now, because that's all I should be concerned with in that tide of a budget. Now with that, I am still curious what you think about this rig. I didn't go and price it all out on eBay. I'm sure it comes in somewhere around the 250 to 350 mark. I probably paid a bit of a premium just to have it assembled for me. The case is probably not available anymore. I don't know, this is a fairly old Corsair case and there tends to be a cult falling around chassis like these. So maybe you just wanted it for the nostalgia. Who knows? Power supply was pretty good though. And the fact that we get 48 gigs of DDR3 I mean that's a bit more than you'd need for gaming for sure but it is definitely sufficient for video editing like we mentioned earlier and when combined with the CUDA acceleration from the 970 here, I think it's a decent content creation rig as well. Although we didn't really approach that from that angle in this video. But yeah, I'm just curious to hear what you guys think in the comment section below. If you enjoyed watching this one play out, let me know by giving this one a thumbs up. That would be greatly appreciated. Consider subscribing if you have not already and I will catch you in the next one. And my name is Greg. Thanks for learning with me.",
    "transcript_keywords": [
        "Windows",
        "rig",
        "good",
        "lot",
        "Time Spy",
        "pretty",
        "things",
        "bit",
        "Fire Strike",
        "time",
        "work",
        "Activate Windows",
        "Windows OEM key",
        "price",
        "make",
        "side",
        "clean",
        "system",
        "budget",
        "game"
    ],
    "transcript_entity_values": [
        "350 mark",
        "DDR3",
        "Fire Strike",
        "Orlando",
        "Corsair",
        "around $400",
        "3",
        "New Year's",
        "am4",
        "RM750",
        "950",
        "only 10%",
        "Spy",
        "two",
        "11",
        "Vsync",
        "eight hour",
        "50",
        "IO",
        "250",
        "GTX 970",
        "several years old",
        "CUDA",
        "NVIDIA",
        "a week",
        "3637",
        "X79",
        "GSVIP",
        "GTX",
        "64",
        "4",
        "Assassin",
        "a little under 50%",
        "Florida",
        "Winn-Dixie",
        "970",
        "today",
        "PCB",
        "30%",
        "350",
        "OfferUp",
        "workday",
        "Publix",
        "one",
        "RAM",
        "60 FPS",
        "Windows",
        "at least 60 FPS",
        "this day",
        "960",
        "first",
        "500",
        "Ryzen 3",
        "SSD",
        "Updates and Security",
        "Fire Strike",
        "Windows",
        "early 2023",
        "week",
        "Time Spy Extreme",
        "A320",
        "77",
        "48",
        "3 to $500",
        "EVGA",
        "just over $8",
        "Windows 10",
        "between 40",
        "First",
        "next day",
        "Assassins Creed",
        "2023",
        "over $350",
        "1080p",
        "six",
        "at least several years old",
        "FPS",
        "Microsoft Office",
        "12 seconds",
        "up to a few minutes",
        "five",
        "those days",
        "One",
        "Time Spy",
        "the week",
        "a few seconds",
        "just over 10,000",
        "five and a",
        "CPU",
        "zero",
        "Ryzen 3 1200",
        "DDR3",
        "1080p",
        "Corsair",
        "eBay",
        "Windows 11",
        "around 15 bucks",
        "Greg",
        "WD Blue",
        "350"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "FAC",
        "GPE",
        "ORG",
        "MONEY",
        "MONEY",
        "EVENT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "ORG",
        "TIME",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "LAW",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "LAW",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.05828413367271423,
        -0.03345247730612755,
        0.01493572723120451,
        -0.058422770351171494,
        0.009057698771357536,
        0.02462588995695114,
        -0.02490302547812462,
        -0.01686331443488598,
        -0.04657116159796715,
        0.06915231049060822,
        -0.04994596540927887,
        0.055162638425827026,
        0.012408167123794556,
        -0.030434515327215195,
        0.05576061084866524,
        0.005333478096872568,
        0.13953612744808197,
        -0.056984830647706985,
        0.028547009453177452,
        -0.006424375344067812,
        -0.03366588428616524,
        -0.10425171256065369,
        -0.02641480043530464,
        -0.0789952427148819,
        0.10862555354833603,
        0.011689278297126293,
        0.017097225412726402,
        0.021175354719161987,
        -0.024457866325974464,
        0.030370838940143585,
        -0.06728953123092651,
        0.015162138268351555,
        0.011371808126568794,
        0.04405587539076805,
        -0.0010459263576194644,
        -0.06907535344362259,
        0.026824068278074265,
        -0.06779764592647552,
        -0.09117092937231064,
        -0.09190676361322403,
        -0.041016630828380585,
        -0.016054434701800346,
        -0.0708964467048645,
        0.024919936433434486,
        0.02643539570271969,
        -0.005779668223112822,
        -0.004572330974042416,
        -0.026650244370102882,
        -0.017132150009274483,
        0.005970753729343414,
        -0.028650619089603424,
        -0.06595522165298462,
        0.08991947770118713,
        -0.044463180005550385,
        -0.11513660848140717,
        0.009424328804016113,
        -0.016003724187612534,
        -0.037865493446588516,
        0.06491165608167648,
        -0.009429031051695347,
        0.051508016884326935,
        -0.10461411625146866,
        -0.019346294924616814,
        0.07324909418821335,
        -0.011742250062525272,
        -0.01107132900506258,
        0.07323013991117477,
        -0.017952850088477135,
        -0.053773701190948486,
        -0.03149562329053879,
        -0.02703360840678215,
        0.008803412318229675,
        0.0006992108537815511,
        -0.020272469148039818,
        0.012620847672224045,
        0.03207506611943245,
        0.08495119959115982,
        -0.07787612825632095,
        0.08115116506814957,
        0.0023709398228675127,
        0.05485520139336586,
        -0.006875500548630953,
        -0.0331604965031147,
        0.011937283910810947,
        -0.018617844209074974,
        -0.024443382397294044,
        0.018864111974835396,
        0.05874168872833252,
        0.013331330381333828,
        -0.06576219201087952,
        -0.03610901162028313,
        0.05417481064796448,
        0.021204909309744835,
        0.02644617296755314,
        -0.0005229097441770136,
        -0.009898429736495018,
        -0.0037126170936971903,
        -0.03332976624369621,
        -0.05271085351705551,
        0.03943583741784096,
        -0.0066928197629749775,
        0.0004596290527842939,
        0.14115798473358154,
        -0.02102133072912693,
        -0.04652438685297966,
        0.010066990740597248,
        -0.045303139835596085,
        0.07250230759382248,
        0.003503648564219475,
        0.021194273605942726,
        -0.0757145881652832,
        0.06848813593387604,
        -0.07005378603935242,
        -0.021583350375294685,
        0.04607883468270302,
        0.0676831528544426,
        -0.038944605737924576,
        0.05582502484321594,
        0.08811131119728088,
        0.027255937457084656,
        0.012616864405572414,
        -0.05479370430111885,
        -0.057887621223926544,
        0.004321458749473095,
        0.019808389246463776,
        -0.014010054990649223,
        -0.10586380213499069,
        6.746771867063597e-33,
        0.007940378040075302,
        0.06893128156661987,
        -0.029758915305137634,
        -0.09823253005743027,
        -0.0024114330299198627,
        0.02276199497282505,
        0.07372681796550751,
        0.06772241741418839,
        -0.04884233698248863,
        0.049763720482587814,
        -0.037248097360134125,
        -0.008314157836139202,
        -0.034129850566387177,
        0.04978438466787338,
        0.04348373785614967,
        -0.04302245005965233,
        -0.025241483002901077,
        0.03273393213748932,
        -0.011183971539139748,
        0.016344867646694183,
        -0.0033158964943140745,
        -0.04770240932703018,
        0.025795411318540573,
        0.009364389814436436,
        -0.009261387400329113,
        -0.01159709133207798,
        -0.05195017531514168,
        -0.028690187260508537,
        0.10858512669801712,
        0.026612602174282074,
        -0.055295199155807495,
        -0.07828206568956375,
        0.023929666727781296,
        -0.003500234568491578,
        -0.009108299389481544,
        -0.02890913560986519,
        -0.013052549213171005,
        -0.08583267033100128,
        -0.0456966832280159,
        0.025869082659482956,
        -0.07467401027679443,
        0.11952587962150574,
        -0.05464063584804535,
        -0.1228298619389534,
        -0.024781929329037666,
        0.021752895787358284,
        0.04343642666935921,
        -0.01537877507507801,
        -0.07528520375490189,
        0.07185909152030945,
        -0.08450371772050858,
        0.10418105125427246,
        -0.04885474219918251,
        0.056206878274679184,
        -0.02102215774357319,
        -0.05795317888259888,
        0.07078350335359573,
        -0.02130642905831337,
        0.08421564102172852,
        0.04967297613620758,
        -0.029034927487373352,
        -0.04947218298912048,
        -0.050422992557287216,
        -0.013107884675264359,
        -0.07283002138137817,
        0.030356306582689285,
        0.11056085675954819,
        0.05831289291381836,
        -0.0652962177991867,
        0.05190718173980713,
        0.031005650758743286,
        -0.005208864808082581,
        0.014009498991072178,
        -0.0549841932952404,
        0.0824866071343422,
        0.06373592466115952,
        -0.07126122713088989,
        -0.043863967061042786,
        -0.007553720846772194,
        -0.01687614619731903,
        -0.04184851050376892,
        0.09413762390613556,
        -0.023773159831762314,
        0.04016183316707611,
        -0.010988827794790268,
        0.04531247168779373,
        -0.0014983199071139097,
        0.0006458099815063179,
        -0.04145783558487892,
        -0.017867691814899445,
        -0.06939505785703659,
        -0.00862470455467701,
        0.0385010652244091,
        0.013069787062704563,
        0.013047139160335064,
        -6.824944445445187e-33,
        -0.05942279100418091,
        0.0011833361349999905,
        -0.025864554569125175,
        0.06331107765436172,
        0.028602218255400658,
        -0.04167834296822548,
        0.0976831316947937,
        -0.022136392071843147,
        0.035667579621076584,
        -0.06006712466478348,
        0.021066993474960327,
        0.02220221422612667,
        0.010997530072927475,
        0.07227784395217896,
        -0.01434393972158432,
        -0.06749585270881653,
        -0.04772128909826279,
        -0.08136650919914246,
        0.07117725908756256,
        -0.031382642686367035,
        0.105012908577919,
        0.05567876994609833,
        -0.0019490133272483945,
        0.0557456873357296,
        0.04630757123231888,
        0.01834007538855076,
        -0.03468003496527672,
        0.0032019373029470444,
        0.02073199674487114,
        0.05106508359313011,
        0.015257039107382298,
        0.014647925272583961,
        0.035932380706071854,
        -0.005339472088962793,
        0.09279882907867432,
        0.011482649482786655,
        0.0392303429543972,
        0.02226225659251213,
        -0.015221411362290382,
        0.021871384233236313,
        0.06092147156596184,
        0.020281553268432617,
        -0.001577913761138916,
        0.010963124223053455,
        0.07725992798805237,
        0.02680332213640213,
        -0.019153757020831108,
        -0.06553629040718079,
        0.04770280048251152,
        -0.04688004404306412,
        -0.013754595071077347,
        0.01986599713563919,
        0.0020054823253303766,
        -0.001085965777747333,
        -0.04633036628365517,
        -0.08898787200450897,
        -0.04378189891576767,
        0.06505617499351501,
        0.003123583970591426,
        -0.05146604776382446,
        0.0352742075920105,
        0.03486419469118118,
        -0.07784509658813477,
        0.027929019182920456,
        0.04883590713143349,
        0.018431825563311577,
        0.12572404742240906,
        0.042505230754613876,
        0.00714483018964529,
        -0.0643693059682846,
        -0.09157367050647736,
        -0.04195911064743996,
        0.033083587884902954,
        0.000838051550090313,
        -0.06828527897596359,
        0.04505752772092819,
        0.05079774186015129,
        -0.010547231882810593,
        0.08509434014558792,
        0.0038365970831364393,
        -0.011291260831058025,
        -0.02989017218351364,
        0.06752557307481766,
        -0.01117317657917738,
        0.0533398799598217,
        -0.01936880499124527,
        -0.011907895095646381,
        -0.031172988936305046,
        -0.02954426035284996,
        -0.02326550893485546,
        -0.09061770141124725,
        0.05457751080393791,
        -0.03296397998929024,
        0.0031766858883202076,
        0.01158942375332117,
        -5.6049771046673413e-08,
        0.06077628955245018,
        -0.020800773054361343,
        -0.03547593951225281,
        0.01360743772238493,
        -0.007009421940892935,
        -0.09269744157791138,
        0.04972149059176445,
        -0.004024237394332886,
        0.09451712667942047,
        0.018476128578186035,
        0.09795762598514557,
        -0.08939258009195328,
        0.013252334669232368,
        0.007562167942523956,
        0.04655856266617775,
        0.015225059352815151,
        -0.017105715349316597,
        0.04867001995444298,
        -0.03699027746915817,
        -0.05024447664618492,
        0.002450032625347376,
        0.07929124683141708,
        0.04872683435678482,
        -0.08288205415010452,
        -0.032480400055646896,
        -0.024385981261730194,
        -0.01034732349216938,
        0.026371249929070473,
        0.007134959567338228,
        0.0054142833687365055,
        -0.07749643176794052,
        0.030971508473157883,
        -0.008090123534202576,
        -0.12362633645534515,
        0.04304893687367439,
        -0.0820838212966919,
        -0.018462728708982468,
        0.05610327795147896,
        0.14788466691970825,
        0.004920090548694134,
        -0.05196774750947952,
        -0.11928729712963104,
        -0.08209744840860367,
        -0.061159685254096985,
        0.06065559759736061,
        -0.021077122539281845,
        -0.10137466341257095,
        -0.046887099742889404,
        -0.02687927335500717,
        0.01003127358853817,
        -0.05013670399785042,
        0.06564158946275711,
        -0.012890518642961979,
        0.021108750253915787,
        0.08973562717437744,
        -0.045458510518074036,
        0.023288996890187263,
        0.046638209372758865,
        -0.013589403592050076,
        -0.006721926853060722,
        0.024893540889024734,
        -0.09584232419729233,
        -0.06850847601890564,
        0.02536437101662159
    ]
}