{
    "id": "wKVTUCyBslk",
    "title": "Google's Friendliest Smartphone - Pixel 4a",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-08-13T14:29:53Z",
    "video_url": "https://www.youtube.com/watch?v=wKVTUCyBslk",
    "category": "Science & Technology",
    "tags": [
        "Google",
        "Pixel",
        "Smartphone",
        "4a",
        "New",
        "Unboxing",
        "First Impressions",
        "Linus",
        "Plastic",
        "Affordable",
        "Price",
        "Assistant",
        "Bluetooth",
        "Pictures",
        "HDR+",
        "Night Sight",
        "USB-C",
        "Snapdragon 730G",
        "12.2 MP",
        "$349",
        "Android",
        "Mobile"
    ],
    "views": 630270,
    "likes": 26740,
    "comments_count": 2697,
    "description": "Sign up for Private Internet Access VPN at    We finally got our hands on Google's Pixel 4a and this device packs a full-blown punch especially at $349!  Check out the Google Pixel 4a at   Buy Apple iPhone SE On Amazon (PAID LINK):   On Newegg (PAID LINK):   Buy Google Pixel Smartphones On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):    Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Nerd or Die Stream Overlays & Templates:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://lmg.gg/jJGgK",
        "https://geni.us/WccZoP",
        "https://geni.us/i8RX6St",
        "https://geni.us/8I46B",
        "https://geni.us/upZJ",
        "https://geni.us/xIzh",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://geni.us/s8hBAgR",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Hey, better late than never. That's what I always say, ladies and gentlemen, this is it. The one and only Google Pixel 4a launching in Canada on September the whatevereth who cares because everyone else has already made videos about this. So we're just going for it here ladies and gentlemen. The Pixel 4a is part of an overall industry trend that honestly I'm surprised didn't take off sooner. Being hands on with it, I do wonder if things might've gone a little bit too far here. It's really plasticky feeling. You know what it reminds me of is like the old Nexus 5, tops back like really good hardware, but with an unapologetically plastic build quality that helped to justify the low price. And a low price it does have at just $350. The Pixel 4a on paper looks like the best bang for the buck for someone who cares about the photos they can take with their smartphone, but not necessarily, the raw gaming horsepower. Let's get this puppy fired up here. This video is brought to you by Private Internet Access, with PIA you can access services and websites online as though you are in a different country. PIA encrypts all your internet traffic, and uses a safe, protected IP. And you can connect up to 10 devices at once with a single account with clients, for Windows, Mac iOS, Android, Linux, and iOS. Buy a one year plan for $39.95 and get two months free at the link in the video description. Let's have a look at the accessories real quick here. Got your SIM removal tool, got your wall wart. Let's see, is this a fast charger, nine volt two amp, fast but not super fast. Woopsie daisies, Type-C to Type-C. And then I believe this puppy is for transferring data or something like that. You know how it feels in the hand though Brandon, friendly, it's one handable, that's something that honestly I, as someone with smaller hands have really missed about flagship devices, but it's not too small, just like you've seen on some of Apple's lower end devices. I wouldn't describe it as a thick bezel, but you've got like a mid sized bezel all the way around, as opposed to, what we used to see as the sort of the trendier move, which was kind of your wraparound display on the side, and then a bigger forehead or chin. I still absolutely hate hole punch displays. And I can't wait for this atrocious industry trend to go away. But, on a $350 device, I'm a lot more willing to overlook, why they couldn't engineer and under screen display or, a popup or a flip around or whatever else the case may be. I'm already really coming around to it. So it's got a rear fingerprint sensor, which it's not state-of-the-art. There's no face dot scanning thing. There's no under screened fingerprint sensor or anything like that. But as a daily driver Note 9 user, I, the vast majority of the time just use my rear fingerprint scanner, even though I do have an Iris scanner. Anyway, like it is something that I've really gotten used to over the years. Wow that was a really fast fingerprint setup. Okay, so it's coaching me on gestures. This is not a good initial setup gesture coaching thing though, because I've seen better ones that force you to actually perform the gestures before allowing you to move on. There's no squeeze, that's something that's missing on this Pixel device compared to previous ones. Honestly there's gonna be quite a few Pixel experience things that you're not gonna enjoy here. So for one thing, that is a single camera setup, it's actually still got this gigantic camera bump as though it did have multiple cameras, which has led to some speculation about the upcoming 5G version of the Pixel 4a. Maybe having more than just 5G added to it. 'Cause it's going to be 150 more dollars, compared to what we might expect from an upcoming flagship Pixel device, like a non a variant, there's no high refresh rate display. And the hardware is quite pedestrian. So even compared to a Pixel 3, the Pixel 4a is not a super fast performer. It's 730G chipset is even slower than what you'd find in similar concept devices like the LG Velvet, and the OnePlus Nord. It's got just six gigs of Ram, and is only available with 128 gigs of storage. Even though there's no micro SD expansion, it's got just a 3140 mAh battery. And even the camera, which Pixel devices are famous for is just a 12 megapixel single lens affair. But, what I'm expecting Google to get right with this device is of course, the little things, the haptic feedback on this phone, in spite of it being, (murmur)a mid tier to entry-level device is really good. I don't know that other than the iPhone SE, I have ever seen that before. Because that's the kind of little touch that manufacturers who focus too much on specs and not enough on experience, tend to overlook. Another big one is software, starting with display calibration. This is something that Google and Apple both take very seriously. Whereas a lot of other smartphone brands are all about, pumping up the vibrancy at the expense of true to life colors. We actually shoot our videos at 18:9, and you can see that Google appears to have positioned their hole punch, so that 16:9 content won't cut off. But if you're watching videos that are in a more cinematic aspect ratio, it looks like the default behavior is to just have a hole in your content. Something that just is always going to bother me unfortunately. I will say though that, if you had told me I was gonna see an OLED display of this quality on a $350 mobile device, just three short years ago, I'd have told you you were freaking nuts. Wow this is even on adaptive mode, but there's hardly any difference between natural and adaptive. Thank you Google. I would even leave this adaptive mode on, it's really not bad. So on the bottom you've got your Type-C port as well as speaker ports. On the left you got a whole lot of not much other than a SIM tray. on the top, hey, you got a noise canceling microphone and a headphone jack. And then over on the right, you got your lock button as well as your volume up and volume down. Quick double click there, it's gonna launch the camera. Let's just take a couple quick snaps. I'm just, I'm idly curious. Man, they just get it like so close to what your eye actually sees don't they? That looks way too sharp to just be 12 megapixels. You got to love all their AI nonsense. So far this is Pixel exclusive, although I wouldn't be too surprised to see it rolled out to others in the future. But you can actually use the same AI nonsense that Google uses to take a single lens shooter like this one and apply a background bokeh in post and use that on your old photos as well. Like previous Google Pixel devices, there's unlimited high quality now, not unlimited quality, but high quality storage for both photos and videos, which It'll help a little bit at least with the fact that it's only got 128 gigs of storage on board. I wanna know if it has an amplified earpiece speaker. That's a really big one for me. - Introducing the products that we are both reviewing today, - It's goblin. - And creating today's video. - Not bad, the speakers aren't great And there's a fair bit of device vibration. It doesn't feel premium when you've got the volume turned up. - And support for HDR 10. HLG, and Dolby Vision, all on a whopping... - Little bit of distortion But, it gets loud, it's stereo, it sounds not bad. This thing is gonna be popular you guys, it's all about delivering, that premium experience, but selectively in the places where people actually care about it. Three years of committed software updates, you get that Pixel quality camera processing, but you get it for $350 because you don't need like a, crazy multi-camera set up, a giant screen, all that other fancy stuff. There's no wireless charging, nothing like that, but it's responsive enough. As long as you've never experienced a high refresh rate display. I don't think you would look at this and go, 730G I simply cannot use it to, call my acquaintances. I don't have a SIM in it, so that's why, I was trying to call you Brandon. Gift my brother or my aunt or whatever. Not enthusiasts but, obviously they want a device that just freaking works. I was like, hey, what phone should I get? This or the iPhone SE are looking pretty compelling. The one area where this falls behind the SE is that I would expect Apple, especially given that they've got a flagship level SOC in that thing, to provide support for it for longer. So it's gonna come down to kind of how long you wanna use your device for. The iPhone SE is really a very compelling option right now actually. Manufacturers are starting to really bang that drum and you've got Apple and Google onboard now. Maybe we're gonna see the end of the, $1,200 phone or maybe we won't, then they just will be a little bit better and you can pay it a lot more. I guess that's fine too. You know what else is fine, subscribing to ShortCircuit.",
    "transcript_keywords": [
        "Pixel",
        "Google Pixel devices",
        "Google Pixel",
        "Google",
        "Pixel device",
        "device",
        "previous Google Pixel",
        "Pixel device compared",
        "flagship Pixel device",
        "devices",
        "Pixel quality camera",
        "display",
        "Pixel experience things",
        "Canada on September",
        "quality",
        "thing",
        "Apple",
        "fast",
        "camera",
        "bit"
    ],
    "transcript_entity_values": [
        "up to 10",
        "Windows, Mac iOS",
        "just $350",
        "nine volt",
        "18:9",
        "Private Internet Access",
        "one",
        "Ram",
        "12 megapixel",
        "Google Pixel",
        "Google",
        "9",
        "$350",
        "IP",
        "1,200",
        "SOC",
        "PIA",
        "730",
        "today",
        "Dolby Vision",
        "Linux",
        "three short years ago",
        "128",
        "HLG",
        "the LG Velvet",
        "September",
        "daily",
        "Iris",
        "Brandon",
        "two",
        "12 megapixels",
        "350",
        "Android",
        "Canada",
        "the OnePlus Nord",
        "the years",
        "one year",
        "3140",
        "two months",
        "SE",
        "16:9",
        "ShortCircuit",
        "Google Pixel 4a",
        "Nexus 5",
        "six",
        "39.95",
        "jack",
        "Three years",
        "Apple",
        "5",
        "150 more dollars"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "GPE",
        "FAC",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY"
    ],
    "vector": [
        -0.12275567650794983,
        -0.018820105120539665,
        0.13401255011558533,
        -0.06669627130031586,
        0.03465540334582329,
        0.03792461380362511,
        0.038702044636011124,
        0.003641089191660285,
        -0.006636991631239653,
        0.017787808552384377,
        0.053359128534793854,
        0.0067862775176763535,
        0.016658887267112732,
        -0.02718318998813629,
        0.05234677344560623,
        -0.002319628605619073,
        0.09246605634689331,
        -0.035132996737957,
        -0.018265563994646072,
        -0.024379581212997437,
        -0.004210525657981634,
        -0.09771499782800674,
        0.039849016815423965,
        -0.042222652584314346,
        0.05360458791255951,
        -0.024840349331498146,
        0.005384603049606085,
        -0.021495800465345383,
        0.04507074132561684,
        -0.04782390594482422,
        0.005960963666439056,
        0.03132951259613037,
        0.00554798124358058,
        0.045351725071668625,
        -0.025081869214773178,
        -0.07718143612146378,
        0.022355467081069946,
        -0.015794087201356888,
        -0.08400096744298935,
        0.004862783942371607,
        0.030320284888148308,
        -0.056589193642139435,
        -0.028768539428710938,
        0.015428546816110611,
        0.042822182178497314,
        0.000503480201587081,
        0.05700124800205231,
        0.03395630791783333,
        0.025194799527525902,
        -0.017156053334474564,
        0.033391453325748444,
        -0.03657340630888939,
        -0.014028411358594894,
        0.017975417897105217,
        -0.06471356004476547,
        0.01327956560999155,
        -0.020962005481123924,
        -0.0021532464306801558,
        0.11210601776838303,
        0.051288098096847534,
        0.04979395493865013,
        -0.057757191359996796,
        -0.058698706328868866,
        0.0955195501446724,
        -0.026622630655765533,
        0.027984481304883957,
        -0.00819347519427538,
        0.008152293041348457,
        -0.05728626996278763,
        -0.026472056284546852,
        -0.012332631275057793,
        0.026541484519839287,
        0.06027020886540413,
        0.010278446599841118,
        -0.06337996572256088,
        0.016303107142448425,
        0.08381857722997665,
        -0.012306991964578629,
        0.021227695047855377,
        0.034376416355371475,
        0.017723288387060165,
        0.006274085957556963,
        -0.011828807182610035,
        0.020752834156155586,
        0.020939959213137627,
        -0.03841829672455788,
        0.04761269688606262,
        0.0610111728310585,
        0.01880301535129547,
        -0.06636842340230942,
        -0.02839088998734951,
        0.13310083746910095,
        0.026021990925073624,
        0.0430816188454628,
        0.001208344823680818,
        0.026320651173591614,
        -0.002095629461109638,
        -0.07647309452295303,
        -0.07587262988090515,
        0.0264823529869318,
        0.008909107185900211,
        0.055933497846126556,
        0.042248521000146866,
        -0.008226195350289345,
        -0.013691332191228867,
        -0.041693065315485,
        -0.037361279129981995,
        0.06699660420417786,
        0.08595903217792511,
        0.09963897615671158,
        -0.059876177459955215,
        -0.01760326698422432,
        -0.0720963180065155,
        -0.024713801220059395,
        -0.05592436343431473,
        0.02119269408285618,
        -0.08226384967565536,
        0.012276890687644482,
        0.16486801207065582,
        -0.057888761162757874,
        -0.011506338603794575,
        0.05206026881933212,
        -0.05614182725548744,
        -0.07153940200805664,
        -0.01291719265282154,
        0.006261305417865515,
        -0.1178889200091362,
        2.6668265849662537e-33,
        -0.0064942664466798306,
        0.10530681908130646,
        -0.06325633823871613,
        -0.09672091156244278,
        0.003438137238845229,
        0.07278882712125778,
        0.04684294015169144,
        0.050509221851825714,
        -0.06047992780804634,
        -0.0022812022361904383,
        -0.05879602208733559,
        0.016583692282438278,
        -0.07977105677127838,
        0.09772442281246185,
        0.04644094035029411,
        -0.026288911700248718,
        -0.015219810418784618,
        -0.036209043115377426,
        0.08500548452138901,
        0.041449613869190216,
        -0.02926064096391201,
        -0.05959559977054596,
        0.01903964951634407,
        -0.007647385820746422,
        -0.028214339166879654,
        -0.010664308443665504,
        0.014510816894471645,
        -0.022286778315901756,
        0.10731194913387299,
        0.012262736447155476,
        -0.05063524469733238,
        -0.03444584831595421,
        0.06293410807847977,
        0.001561553101055324,
        -0.04572780057787895,
        -0.009520240128040314,
        -0.07367798686027527,
        -0.09926142543554306,
        0.013060830533504486,
        0.03983902186155319,
        -0.14636161923408508,
        0.03796160966157913,
        -0.07480413466691971,
        -0.1034746989607811,
        0.011027835309505463,
        -0.006794323213398457,
        -0.03363560140132904,
        -0.052512869238853455,
        0.049135129898786545,
        0.04984258487820625,
        -0.03055388852953911,
        0.003984509501606226,
        -0.0961444228887558,
        -0.06897211074829102,
        -0.05399792268872261,
        -0.03111865557730198,
        0.0032412216532975435,
        0.019226495176553726,
        -0.025334356352686882,
        -0.006723146419972181,
        0.007375094573944807,
        0.023761145770549774,
        -0.021088777109980583,
        -0.006190192885696888,
        -0.11041238903999329,
        -0.01622941717505455,
        0.015620133839547634,
        -0.02946128137409687,
        -0.08280393481254578,
        0.01872180588543415,
        -0.01640036515891552,
        0.01740611530840397,
        0.11567262560129166,
        -0.013985879719257355,
        -0.008870460093021393,
        -0.030079500749707222,
        -0.07127248495817184,
        0.020312288776040077,
        0.018293367698788643,
        0.0008486401056870818,
        -0.07028871774673462,
        0.014558938331902027,
        0.09500575065612793,
        0.0628160759806633,
        -0.028368042781949043,
        -0.017826540395617485,
        0.022070834413170815,
        0.003457017010077834,
        -0.04477734863758087,
        0.06300881505012512,
        -0.10864457488059998,
        -0.06269781291484833,
        -0.01986326463520527,
        0.028808243572711945,
        -0.02551872842013836,
        -4.229051046698389e-33,
        -0.08316069841384888,
        0.0006143251666799188,
        -0.06105320528149605,
        0.04809486120939255,
        0.03198061138391495,
        -0.022496750578284264,
        0.0721828043460846,
        0.03957134485244751,
        0.034126218408346176,
        -0.011932325549423695,
        0.006875383667647839,
        0.10105863958597183,
        0.07626879960298538,
        -0.008313638158142567,
        0.02418280579149723,
        -0.10430575162172318,
        -0.0279097780585289,
        -0.10528700798749924,
        -0.009435595944523811,
        -0.03864413499832153,
        0.04118548333644867,
        0.03235163539648056,
        0.016707822680473328,
        0.09131942689418793,
        0.0693584606051445,
        -0.007607187144458294,
        0.06805215775966644,
        0.03253985941410065,
        -0.02923303097486496,
        0.02875894494354725,
        -0.01179608702659607,
        -0.03796277940273285,
        -0.04507392272353172,
        0.0006117152515798807,
        0.0692211166024208,
        -0.009008404798805714,
        0.028288474306464195,
        0.05316806212067604,
        0.05551900342106819,
        -0.07027322053909302,
        0.026470748707652092,
        -0.03496620059013367,
        0.053524140268564224,
        0.014833619818091393,
        0.04741354659199715,
        -0.02204582467675209,
        -0.018022604286670685,
        -0.022586282342672348,
        -0.01305532269179821,
        0.08023352921009064,
        -0.02153046242892742,
        0.03242570906877518,
        -0.023445870727300644,
        0.03593229502439499,
        -0.08525201678276062,
        -0.02778644487261772,
        -0.01918688602745533,
        0.014438934624195099,
        -0.0012453993549570441,
        -0.027017295360565186,
        0.041040584444999695,
        -0.013624755665659904,
        -0.02222883701324463,
        0.0860564261674881,
        -0.03885408490896225,
        -0.014156111516058445,
        0.007788012735545635,
        0.03613443300127983,
        -0.020404694601893425,
        0.061090122908353806,
        -0.054294392466545105,
        0.002725041238591075,
        0.00033167359651997685,
        -0.059127405285835266,
        -0.04857489466667175,
        0.07506410777568817,
        0.000905873894225806,
        0.03884133696556091,
        0.012957323342561722,
        -0.028092438355088234,
        0.030178096145391464,
        0.1028197631239891,
        0.09512503445148468,
        -0.049809809774160385,
        0.10052983462810516,
        -0.03407193720340729,
        0.03479190170764923,
        -0.008784311823546886,
        -0.007882794365286827,
        0.0038757077418267727,
        -0.10801885277032852,
        -0.0043386309407651424,
        -0.07768795639276505,
        0.04908403754234314,
        -0.0105063421651721,
        -5.5779118213195034e-08,
        0.05221102014183998,
        0.025384068489074707,
        0.02480168081820011,
        -0.04381033033132553,
        0.01117554772645235,
        -0.05813806504011154,
        -0.014711914584040642,
        -0.028775254264473915,
        0.1017468199133873,
        -0.017499709501862526,
        0.02404923364520073,
        -0.08499451726675034,
        -0.09195857495069504,
        0.040884796530008316,
        -0.032223548740148544,
        -0.00266141421161592,
        -0.02183997817337513,
        -0.018695274367928505,
        -0.021111374720931053,
        -0.07561750710010529,
        -0.08718779683113098,
        0.025264922529459,
        -0.029002364724874496,
        -0.011442179791629314,
        0.017363304272294044,
        0.04654785618185997,
        0.001809603301808238,
        0.0055367611348629,
        0.07638078182935715,
        0.012979278340935707,
        -0.04270079359412193,
        -0.01713433489203453,
        0.03303620219230652,
        -0.06866145879030228,
        -0.005259860772639513,
        -0.027180857956409454,
        -0.016908088698983192,
        -0.024303937330842018,
        0.07727920264005661,
        0.05332357436418533,
        0.023640893399715424,
        -0.06951939314603806,
        0.07353843748569489,
        -0.04682023823261261,
        0.031552575528621674,
        -0.04813492298126221,
        -0.05266159400343895,
        -0.0837867483496666,
        0.07380819320678711,
        0.1185089498758316,
        -0.03816017135977745,
        -0.04073691740632057,
        -0.07399905472993851,
        -0.024614106863737106,
        0.06270285695791245,
        -0.06704974919557571,
        0.01997920125722885,
        -0.027006102725863457,
        0.02609049715101719,
        0.10298280417919159,
        0.030121875926852226,
        -0.08792474865913391,
        -0.01622365601360798,
        0.0870138630270958
    ]
}