{
    "id": "WLOijOyX1P0",
    "title": "Do I lose money?! - How to stay Motivated - Q&A #2",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-12-15T08:52:02Z",
    "video_url": "https://www.youtube.com/watch?v=WLOijOyX1P0",
    "category": "Howto & Style",
    "tags": [
        "JerryRigEverything",
        "Question and answer",
        "Youtube Tips",
        "Motivation",
        "How to stay motivated",
        "Money",
        "YouTube",
        "Success",
        "Business",
        "How to start a business",
        "How to start a YouTube channel",
        "Q&A",
        "YouTube Q&A",
        "Phone repair",
        "Future of phone repair"
    ],
    "views": 739388,
    "likes": 27700,
    "comments_count": 2048,
    "description": "Its time for another Question and Answer video. Click 'SHOW MORE' to see a list of the questions that were asked. HERE is the 4K camera that sucks at 4K:   CLICK TO SEE MORE   0:15 - What do you do with Destroyed Phones? 0:50 - Do you feel Guilty when destroying Phones? 0:54 - What Lenses do I use? 1:08 - Do you need the latest tech to be a YouTuber? 1:43 - How is the 'Mouse Proofed' cabin? 2:20 - Why did you Start a YouTube Channel? 3:03 - Are you a Full Time YouTuber? 3:12 - What is the Future of the Cell Phone Repair Industry? 4:27 - Are you going to do more 'Big Projects' like the Cabin video? 4:42 - Do you make enough money to cover the cost of phones? 5:39 - How many hours a week do you work on your channel? 6:25 - How do you stay up to date on all the new tech? 6:54 - What would be your job if you didnt do YouTube? 7:18 - What keeps you motivated? 8:14 - Who do you want to collaborate with? 8:30 - Have I ever been bribed to 'take it easy' on a test?!?   Check out my FIRST Q and A video HERE:   If you have any more questions be sure to follow me on Twitter so you wont miss the next Q and A Video! Thank you for watching!  Awesome Smart Phone Tool Kit:  Green Pry tool:  Phone opening metal tool:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2hQAdaT",
        "https://youtu.be/lFy9rvmV5lE",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "I announced on Twitter a couple days ago that I was going to do a Q&A video for passing 600,000 subscribers. So here we are. Lets get started. [Intro] The question I usually get the most - every single day actually- is what do I do with the destroyed phones that I have. And actually I keep every single one of them. When Im done with the durability test, I can also do a teardown video from that same phone. And as the year goes on, sometimes people have questions on how to repair certain things specifically. Like with the iPhones; Ive already done my durability tests and the teardown but there are a couple things specifically, outside of a normal teardown, that can still be repairedlike the glass lens on the iPhone 7. So Im going to make a couple videos on that and that just, you know, goes for all the phones as well. I can keep on using them throughout the year. Its not a onetime use thing. And they definitely never get thrown away. Do you ever feel guilty when you destroy phones? Absolutely not. Another question that I get a lot is what lenses do you use? I always link everything that I use in the video, whether its replacement parts or camera equipment, down in the video description. This particular video Im shooting with a new camera, a Sony camera, that Ill also be linking down in the video description. So let me know what you think of the video quality. Do you need to have the latest devices in starting a tech channel? And the answer to that question is absolutely not. The biggest hurdle when starting a YouTube channel or any business is the actually starting part. Everyones like oh when I have this I can start. Or when I have this I can start. You should just start and learn the process and gradually upgrade to more and more expensive devices as the business or the YouTube channel is paying for itself. Youll learn so much by working with what you have available that when that nice stuff does finally come, youll be phenomenal at it. So the answer to your question, no you do not need the latest and greatest to start a YouTube channel. How is the mouse-proofing going on and did you get any sponsors from Smartphone brands yet? I actually havent been up to the cabin since we made that video. I hear from my family that the mice are staying outbut that was through the fall. Now that its winter and theres a lot of snow up there, it could be a different story. I plan on heading up there next month. If you guys want a follow up video just let me know down in the comments and Ill make sure to film that when I go check it out. As far as Smartphone brand go theres only one company thats ever sent me a cell phone, the Umi Super Phone, and that phone didnt even do super awesome on my tests. So no, I am not sponsored and no one has sponsored a cell phone teardown or durability test yet besides that one free phone I got from Umi. How did you have the idea to start your YouTube channel and why did you start? I talk a little bit about this in my last Q&A video that I did a couple months ago and actually, you know, to summarize I would be doing these projects that you see me doing on my YouTube channel, whether I had a YouTube channel or not. So filming it was just another easy step. I realized when I started watching cell phone repair videos back when I first started to learn how to do it that the videos were like 30 minutes long and I didnt have time to watch that stuff. So I was like, why dont I just make these videos shortershort and sweet. And it turns out that people on the internet actually like short concise little videos, and now Im the largest cell phone repair YouTube channel in the world so thats kind of fun. To summarize, I started because I was already doing the projects anyway and I wanted to help other people out with the tutorials. Are you a fulltime YouTuber or do you have a regular job? The last time I had a regular job was about 2 and a half years ago, and ever since then YouTube has been my main thing. How do you see the future of cell phone repair with more and more non modular components in newer devices? Well phones have been getting a lot harder to repair, but the repair industry is not going anywhere. People will always want to repair their devices whether its hard to repair them or not. In my own experience with my YouTube channel, I have a much larger audience of people who are just curious about whats inside their phone instead of people who are curious about actually fixing their phone themselves. People like watching seeing it done, but they dont necessarily want to do it or attempt it. So either way its good for my YouTube channel. The content is here to stay because there are viewers wanting to see it. But as far as the actual repair industry, people are always going to be breaking their phones. Whether they fix it themselves or they turn to a professional, thats where these newer phones come into playlike the sealed shut Galaxy S7 or the iPhone 7, its actually a lot harder to repair than the previous models. So to answer your question, the cell phone industry is here to stay, but I feel like its transitioning more from the average do-it-yourselfer to a professional who has done it a couple times before. But also keep in mind that the super high end phones that are hard to repair, like the Galaxy S7, dont make up the entire market. There are easy phones like the L-noxv or the LGv20 that are easy to repair and those are always going to be here as well. Will you be doing anymore big project videos like the Cabin video? And yes, I will. I havent told anybody this, but Im working on getting a wrecked Tesla that I can take apart component by component and we can do an entire teardown of the car. I have some plans for that internal batterybut well see if that actually happens. Do you earn enough money to cover the cost of the phones you buy for testing? The answer is yes and no. For that initial one durability test, no, the phone does not pay for itself usually. But when I use the phone for the teardown and other projects that I have on my channel with the phones, like camera comparison tests, yes, the phones do end up paying for themselves over time. But it is a lot of work to get to that point where the projects do start paying for themselves. It doesnt happen right away. Alright, so I know this is a Q&A, but Im using this brand-new camera, the Sony RX-100 which I think is the 4th version, and has died on me 4 times. It has overheated because of shooting in 4K and it can only do it in 5 minute segmentsbut if I do segments right after each other as Im filming this video, it will say the temperatures too high and it stops. So I will not be keeping this camera. This is my review of the Sony RX-100 and it is going back where I got it. So I dropped it down to 1080p and now we can finish the Q&A. How many hours do you put in a week to your YouTube channel, networking etc? Well, like I mentioned before, I would be doing all of these projects on my own whether I was filming them or not. So YouTube doesnt really seem like a job to me. Its just doing what I like doing and filming it for everybody else. So I mean its not that big of a deal. If I was to keep track of all the hours that I put into my YouTube channel it would be way more than 40it would be more than 80. Im literally working almost all of the time whether its on Twitter, Facebook, social mediaall of those things are considered, you know, part of this job. But it doesnt feel like work to me because I enjoy it; and thats nice. And its also really nice that I can take time off and away from YouTube and everything when I want to. But in order to become successful it requires a lot of work. How do you stay up to date with all that is going on in the tech world? So that is actually a really good question because the tech is always improving and theres always companies coming out with new stuff. The main places that I get my tech information from are just, you know, sites on the internetsurprise. I do a lot with Twitter. I follow other tech YouTubers, you know, if I see a fun project that someone else is doingIll, you know, do a tear down of that particular piece of tech. And then I also use Reddit a lot as well. Reddit is the front page of the internet and there is a lot of information cycling through thats always relevant. What would have been your title if you were not into YouTube? I would still be doing all these projects that you see me doing here on my channel, but I would also have to have a real job or a normal job and it would probably be something in the construction industry. I always really enjoyed residential construction, whether it was framing houses or drywall painting. So thats probably what I would end up doing. But I also enjoy being my own boss, so I would own my own company in that industry. What keeps you motivated? This is actually a really really good question cuz motivation is one of those things that its not always there. You got to work for it every day. And I think that, you know, the reason that I stay motivated is because my mind works in consequences. I think in consequences. Like if I wake up and I eat junk food and I watch Netflix all day long, next week or next month Im not going to have a business and Im going to be pretty darn unhealthy. Thats the consequence. You know, cause and effect. But if I wake up today and I work hard, I go to the gym, and I grow my business tomorrow in a couple weeks, or in a couple months from now, Im going to have success when it comes to the business and Im going to be healthy. So Im thinking of the future and thats what keeps me motivated. Success is literally the only option if you stay productive. What you do today literally defines how your tomorrow is going to turn out. Any YouTubers who I would like to collaborate with? Ive actually been doing a lot with the Whats Inside YouTube channel lately and thats been really fun. A couple other YouTubers I would like to collaborate with is probably the King of Random and Codys Lab. Both of those guys do some really fun projects and I think that it would be fun to do those projects with them. Have you ever been offered money to take it easy on a Smartphone test? And the answer is no, never. Ive only been given one phone for free and that was the Umi Super Phone. I did have one cell phone manufacturing company in China reach out to me, its actually a pretty big company, they reached out to me and asked me if I would review some of their cell phones. Im not going to tell you who it is, and so I responded back and I was like, hey do you know who I am and what I do with cell phones? And then I never heard from them again. So they backed out of that. Thanks a ton for watching this Q&A. If you have any more questions hit me up on Twitter, Instagram or Facebook or down in the comments below this video and Ill try to answer as many as possible. I do try to stay pretty active in the comments section. So thanks for watching and Ill see you around.",
    "transcript_keywords": [
        "YouTube channel",
        "phone",
        "cell phone",
        "phones",
        "YouTube",
        "channel",
        "video",
        "cell phone repair",
        "repair",
        "Umi Super Phone",
        "phone repair",
        "lot",
        "cell",
        "phone repair videos",
        "videos",
        "phone repair YouTube",
        "projects",
        "couple",
        "people",
        "question"
    ],
    "transcript_entity_values": [
        "Codys Lab",
        "all the hours",
        "a couple weeks",
        "China",
        "the Whats Inside YouTube",
        "the year",
        "Instagram",
        "4th",
        "more than 80",
        "YouTube",
        "Facebook",
        "Reddit",
        "tomorrow",
        "the Umi Super Phone",
        "Sony",
        "Umi",
        "Netflix",
        "only one",
        "YouTubers",
        "30 minutes",
        "4",
        "the iPhone 7",
        "next month",
        "next week",
        "Galaxy S7",
        "Success",
        "doingIll",
        "Ill",
        "iPhones",
        "a couple months ago",
        "more than 40it",
        "600,000",
        "LGv20",
        "Tesla",
        "the Galaxy S7",
        "5 minute",
        "today",
        "YouTuber",
        "about 2 and a half years ago",
        "a couple months from now",
        "YouTube",
        "a week",
        "one",
        "a couple days ago",
        "Twitter"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "EVENT",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "NORP",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.014982135966420174,
        -0.03166704997420311,
        0.09134552627801895,
        -0.05636759102344513,
        0.044657301157712936,
        0.010631759651005268,
        0.08348963409662247,
        0.027283502742648125,
        -0.03260935842990875,
        -0.0026332552079111338,
        -0.02843441069126129,
        0.0025434033013880253,
        -0.03442279249429703,
        0.01594243198633194,
        -0.03179115802049637,
        -0.04115426167845726,
        0.024676380679011345,
        -0.04998578876256943,
        -0.17166541516780853,
        -0.011187816970050335,
        0.022170579060912132,
        -0.03558871150016785,
        0.07896967232227325,
        0.034268569201231,
        0.013960081152617931,
        0.007527122739702463,
        0.02664979360997677,
        0.0030399335082620382,
        -0.05081918090581894,
        -0.008963201195001602,
        -0.09920597076416016,
        0.058435603976249695,
        0.033434540033340454,
        -0.002622633008286357,
        -0.0071786679327487946,
        -0.08503546565771103,
        -0.006489187944680452,
        -0.00013748521450906992,
        -0.006769677624106407,
        0.02140939049422741,
        -0.002880800049751997,
        -0.06404776871204376,
        -0.01223078928887844,
        0.009601828642189503,
        -0.012221797369420528,
        -0.0534592904150486,
        0.009424970485270023,
        -0.049991391599178314,
        0.018947770819067955,
        0.02082742564380169,
        -0.06392613053321838,
        -0.014093575067818165,
        -0.015401639975607395,
        -0.0404559001326561,
        -0.05488887056708336,
        0.02327013947069645,
        -0.020853383466601372,
        0.016138041391968727,
        0.08047470450401306,
        0.04443525895476341,
        0.03565111756324768,
        -0.015903152525424957,
        -0.018444793298840523,
        0.09042911976575851,
        0.013575287535786629,
        -0.005689815618097782,
        0.03888504579663277,
        0.013234325684607029,
        -0.021933678537607193,
        0.025560598820447922,
        -0.1381247639656067,
        0.034026727080345154,
        -0.0011375559261068702,
        0.019083328545093536,
        -0.0285131074488163,
        -0.07197302579879761,
        -0.012408334761857986,
        -0.028143862262368202,
        -0.0029997776728123426,
        0.035806648433208466,
        0.08896529674530029,
        -0.0785323977470398,
        -0.015917185693979263,
        -0.023705825209617615,
        -0.06593415886163712,
        -0.02246321178972721,
        0.020121034234762192,
        0.10226523131132126,
        -0.016269782558083534,
        -0.09199583530426025,
        -0.08663511276245117,
        0.08204486221075058,
        0.005889091640710831,
        -0.01626705564558506,
        0.055269308388233185,
        0.010596518404781818,
        -0.07680932432413101,
        -0.005944430362433195,
        0.028647832572460175,
        0.0038495403714478016,
        0.0938020721077919,
        -0.04482373967766762,
        0.06273210793733597,
        -0.0073289163410663605,
        -0.019334372133016586,
        0.018556417897343636,
        -0.07091738283634186,
        0.1110481470823288,
        0.03695983067154884,
        0.007696698419749737,
        -0.029950307682156563,
        0.0644640251994133,
        0.024505602195858955,
        -0.012813562527298927,
        0.045045237988233566,
        0.04398062452673912,
        -0.02146025560796261,
        0.05893448367714882,
        0.0333922915160656,
        0.03704971820116043,
        0.0536995530128479,
        0.07895296812057495,
        0.08974264562129974,
        -0.020518923178315163,
        0.039018187671899796,
        -0.005984404124319553,
        -0.02715209871530533,
        -1.9949176874560804e-34,
        0.09648151695728302,
        0.0399777889251709,
        0.0028958264738321304,
        0.013848809525370598,
        -0.007507848087698221,
        0.06329145282506943,
        -0.014440818689763546,
        0.11023163795471191,
        0.030786780640482903,
        0.02266319841146469,
        0.06304511427879333,
        -0.047659169882535934,
        -0.03923454508185387,
        -0.03360563889145851,
        0.08157951384782791,
        0.034082040190696716,
        0.002450365573167801,
        -0.06491464376449585,
        -0.030678043141961098,
        -0.005550299771130085,
        0.050950754433870316,
        -0.005588934291154146,
        -0.0027827350422739983,
        0.07565214484930038,
        0.007610142230987549,
        -0.030477313324809074,
        -0.02032383903861046,
        -0.05828261747956276,
        -0.0011782313231378794,
        6.784210563637316e-05,
        -0.14221051335334778,
        -0.06411680579185486,
        -0.04103405773639679,
        -0.07401732355356216,
        -0.004614606034010649,
        0.005323159508407116,
        -0.05497589707374573,
        -0.03990013152360916,
        -0.01785885915160179,
        -0.04039383307099342,
        -0.13617199659347534,
        0.038332272320985794,
        -0.05946223437786102,
        0.0363997183740139,
        0.007784324232488871,
        -0.017463330179452896,
        0.05933190882205963,
        -0.04262027516961098,
        0.011100192554295063,
        0.03603057190775871,
        -0.034150298684835434,
        -0.005172278732061386,
        0.0409681499004364,
        -0.08715061098337173,
        -0.013112439773976803,
        0.033489909023046494,
        0.02157767117023468,
        -0.05416512489318848,
        -0.006310102064162493,
        0.017211049795150757,
        -0.007400691043585539,
        0.005566935054957867,
        -0.001377152162604034,
        0.012230639345943928,
        -0.09920138865709305,
        0.05467994511127472,
        0.045891620218753815,
        0.08239969611167908,
        0.024109160527586937,
        0.03803251311182976,
        -0.027845220640301704,
        0.01800033077597618,
        -0.0010431616101413965,
        -0.06068890169262886,
        0.054283685982227325,
        0.10508863627910614,
        -0.06285339593887329,
        -0.0718643069267273,
        -0.06111104413866997,
        0.007194087840616703,
        0.12005626410245895,
        0.038277652114629745,
        0.08291041105985641,
        -0.022419461980462074,
        0.06947578489780426,
        -0.06510169804096222,
        0.1007920652627945,
        -0.057467445731163025,
        0.07317548245191574,
        -0.01699497178196907,
        -0.009179068729281425,
        -0.024797821417450905,
        -0.02140400931239128,
        -0.03382180258631706,
        0.06850480288267136,
        -1.941105760127344e-33,
        -0.01791311614215374,
        0.06525185704231262,
        0.021296437829732895,
        0.041298605501651764,
        0.009250517003238201,
        -0.03750230744481087,
        0.022122180089354515,
        -0.00473277410492301,
        0.05274922773241997,
        -0.05368958041071892,
        -0.06712079048156738,
        -0.019266581162810326,
        -0.08446188271045685,
        -0.03077455423772335,
        -0.08802714943885803,
        -0.05299527943134308,
        -0.06674840301275253,
        -0.09698737412691116,
        -0.05975278839468956,
        -0.018374016508460045,
        -0.0086234575137496,
        0.017695996910333633,
        -0.07359659671783447,
        0.023781565949320793,
        0.014099471271038055,
        0.035516172647476196,
        0.022545790299773216,
        0.07955600321292877,
        0.08853278309106827,
        0.008526119403541088,
        0.02056555449962616,
        -0.0776355192065239,
        0.058959074318408966,
        -0.011772428639233112,
        0.03081108257174492,
        0.01788485236465931,
        0.10353180766105652,
        -0.004352412186563015,
        -0.014160901308059692,
        -0.0069128768518567085,
        0.07480037957429886,
        0.00031045041396282613,
        0.015081455931067467,
        -0.08924682438373566,
        -0.029731737449765205,
        -0.05533057078719139,
        -0.041744671761989594,
        -0.04650367796421051,
        -0.07980432361364365,
        -0.016825389117002487,
        0.07795096933841705,
        -0.0011955900117754936,
        -0.019864220172166824,
        0.03153564780950546,
        -0.030404575169086456,
        -0.016383355483412743,
        -0.002930473070591688,
        0.0789288803935051,
        0.03833313286304474,
        -0.06540508568286896,
        -0.036854472011327744,
        -0.021497981622815132,
        0.04000463709235191,
        0.050185754895210266,
        0.016693225130438805,
        -0.1353415697813034,
        0.09113245457410812,
        0.05251191183924675,
        -0.019694196060299873,
        -0.08797185122966766,
        -0.046553466469049454,
        0.0026278127916157246,
        0.03640102595090866,
        -0.018382541835308075,
        0.05810239911079407,
        0.052291277796030045,
        0.03984004631638527,
        -0.03729847073554993,
        -0.02558974176645279,
        0.0036854457575827837,
        0.011982813477516174,
        -0.03531956300139427,
        0.0247806366533041,
        0.02685392275452614,
        0.003212203271687031,
        0.09548696875572205,
        0.06366139650344849,
        0.07795841991901398,
        0.008396494202315807,
        -0.016015974804759026,
        0.03544657304883003,
        -0.005378571338951588,
        -0.08296922594308853,
        0.02687438391149044,
        0.0554584264755249,
        -4.3644369895901036e-08,
        0.022332940250635147,
        0.10462731868028641,
        -0.020608000457286835,
        0.006586769130080938,
        0.02237727679312229,
        -0.06625459343194962,
        0.021143468096852303,
        0.058558233082294464,
        0.06681177020072937,
        -0.05438556149601936,
        0.023112593218684196,
        -0.025114431977272034,
        0.010678010992705822,
        0.06062854826450348,
        0.04787570983171463,
        -0.004317456856369972,
        0.0025186827406287193,
        -0.05054834112524986,
        0.013560264371335506,
        -0.022589728236198425,
        0.012032751925289631,
        0.023119507357478142,
        -0.017736515030264854,
        0.05111145228147507,
        -0.04819735139608383,
        0.013463545590639114,
        -0.036947738379240036,
        0.08493176847696304,
        0.019160548225045204,
        -0.00587403355166316,
        -0.012117819860577583,
        -0.029348108917474747,
        -0.12701736390590668,
        -0.059296268969774246,
        0.014475129544734955,
        -0.14468573033809662,
        -0.00028712995117530227,
        -0.11684668064117432,
        0.024472462013363838,
        0.10663534700870514,
        -0.018865050747990608,
        -0.07691604644060135,
        0.06810174882411957,
        0.06268856674432755,
        0.013982455246150494,
        -0.038517750799655914,
        -0.053891539573669434,
        -0.041373517364263535,
        -0.03565596044063568,
        -0.07914193719625473,
        -0.09628495573997498,
        0.004865818656980991,
        -0.014970960095524788,
        -0.025485441088676453,
        0.08447733521461487,
        -0.011983823031187057,
        0.055522315204143524,
        0.05702653527259827,
        -0.04569786414504051,
        -0.033764589577913284,
        0.037694212049245834,
        -0.03723098710179329,
        -0.11242970079183578,
        0.028632426634430885
    ]
}