{
    "id": "WLtG2Ed5uP4",
    "title": "The END of Loot Boxes?!",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-08-09T16:30:46Z",
    "video_url": "https://www.youtube.com/watch?v=WLtG2Ed5uP4",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "gaming",
        "overwatch",
        "loot boxes",
        "loot boxes are surprise mechanics",
        "star wars battlefront 2",
        "battlefront 2",
        "rocket league",
        "fortnite",
        "ea surprise mechanics",
        "microtransactions",
        "battle pass",
        "bloons td 6",
        "video game news",
        "tech",
        "overwatch loot boxes",
        "sony",
        "playstation",
        "xbox",
        "nintendo",
        "microsoft",
        "switch",
        "activision blizzard",
        "bethesda",
        "EA",
        "alphabet",
        "google",
        "apple",
        "nest",
        "waymo",
        "apple card",
        "apple card release",
        "credit card",
        "video games",
        "loot llama",
        "lootboxes",
        "apple pay",
        "pay to win"
    ],
    "views": 99729,
    "likes": 3932,
    "comments_count": 319,
    "description": "Who doesn't love a bunch of surprise mechanics? Fortnite is BEATING Minecraft:  Why Minecraft is BIGGER Than Ever:  RAIDING Area 51?:  So You Want to Be an Astronaut:  How Japan Took Over 7-Eleven:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/zckuX8NFoxM",
        "https://youtu.be/Lx6K35Acm-w",
        "https://youtu.be/HmW2MUiIIcI",
        "https://youtu.be/p7J63sLw_dU",
        "https://youtu.be/CU9vL6zdhso",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys and welcome to This is Now. This week Sony, Microsoft and Nintendo have all announced that they're committed to addressing the growing issue of lootboxes in games. Now gaming is one of the only mediums of entertainment that arguably keeps getting better and better. One element that just sucks are random lootboxes. Whether it's a box or a crate or even a llama. They're absolutely everywhere in gaming and it is no shock as to why. When you open up a box, players get a rush of anticipation for whatever cool item you will get, but then more often than not, it's followed by disappointment (car races by) so you try for the next box, and the next, and the next. And it's pretty much you're constantly chasing the same rush as you get behind the psychology of gambling or slot machines. It's not really a good thing especially when they get very expensive. Matt, what's the most money you've ever spent on a lootbox? - [Matt] Uh, about a hundred bucks. I spent like a hundred bucks on in-game currency. - Oh. Bloons? - [Matt] It was bloons. - (chuckles) - [Matt] It was bloons. - Well dude, I mean there's definitely multiple layers here right. Because I think free-to-play games in lot of cases specifically mobile ones seem to be the most egregious. But a lot of lootboxes are in full paid console and PC games. I mean it sucks to spend $60 on a game and then spend another $100 on lootboxes. And sure, in most cases you can grind to get that new lootbox but it can take hours or even days. But thankfully there is an alternative. Just pay some real life money to speed up the process. Although I'm not sure if that's actually a thankfully or an unfortunately. (crowd laughing) I mean how many people have called me a noob for using the default Fortnite skin in videos. - [Matt] A lot. - You know what? Someone literally friended me on Fortnite and gifted me a skin purely for this reason. However there's often a pay-to-win aspect with these boxes. Where players feel like lootboxes are a necessity to stay competitive. Probably the biggest example is EA's Starwars Battlefront II. (boos) The entire progression system was almost entirely based off of a random star card reward system and this is already a pretty bad system to start with even without the lootbox. Players really felt forced to purchase boxes just to progress normally. And again, this is a game they had already spent $60 to purchase. We actually did a video on this a few months back with free-to-play games as well as the pay-to-win micro transactions. And the gist is, if you spend money on a game once, the chance of you spending even more money skyrockets. I know personally for me, if I'm playing a free-to play game that I really enjoy, I almost feel sort of obligated to spend a little bit of money on it even if I don't really want the items. But I think I'm probably in the minority. Most people are hopelessly addicted. Bloons! - [Matt] Bloons! - The big three's announcement was made, at an FTC sponsored workshop on lootboxes and their ethics. Several other companies in the ESA have also agreed to disclose the quote, relative rarity or probability of items from purchases on lootboxes. From purchases on lootboxes? For purchases inside lootboxes? From purchasing lootboxes and getting things inside, how do boxes work? - [Matt] You purchase them. That was a typo on my part. - Oh, I thought it was dumb. Thanks Matt. - [Matt] No that's a typo. Usually you are dumb - [Austin] Among them was Bethesda, Activision, Blizzard and ironically EA who recently went on record that looboxes were quote, not gambling but surprise mechanics. (chuckles) Over the past couple of years, lootboxes have been gaining more and more attention from law makers, calling for legislation and regulation which is basically never a good sign when it comes to video games. Nintendo already had to remove their Fire Emblem and Animal Crossing mobile games from the Belgian market because the in-game lootboxes fall under that country's definition of gambling. Back in May, the Protecting Children from Abusive Games act was proposed, they were banning game companies from selling lootboxes to players under the age of 18. More importantly, it will prohibit developpers from even include pay-to-win mechanics in games targeted for kids. Now of course that's a very tricky thing to actually define. Pokemon is a traditionally kid's game. But how many of its player base are in their 50s like Matt? - [Matt] Ow! - Wait did you just burn yourself? You wrote that! You wrote that you're in your 50s. Matt's over here literally making fun of himself so you think I'm being mean, that's not true. Matt is writing the script right now and he just burned himself (Matt chuckles) I take no responsibility for that one. Instead a lot of games are now opting for a battle pass model. Which is actually popularized by Dota 2. Players pay a flat rate for the pass and then they unlock new tiers and rewards as they level up. This isn't necessarily a better deal. Matt, you know that Crash Royale recently added a battle pass. Five dollars a month and - [Matt] It's a monthly one? - Your boy may have - yes. In fact, the most recent battle pass I think was like 29 days or something. Your boy may have spent a few hours grinding at the end to make sure I got that last couple of levels of my lootbox. The exact specifics are still being worked out, but developers who want to distribute games on Playstation, Xbox or Switch will be required to disclose the drop rates for lootboxes by 2020. Now I will say that PC-exclusive games do not have to follow these rules. At least not yet. - So what we're looking at is surprise mechanics (Curb your Enthusiasm theme plays ) but I think it's important to look at this so if you go to, if you go to. - For the past several years, Apple has had the distinct honor of being the richest company in the World. However, Google's parent company, Alphabet has now overtaken Apple as the new richest company. With a cool 117 billion dollars in their reserve. Now to clarify, we say richest, we're not exactly talking about revenue. Wal-Mart and a bunch of gas and oil companies generate way more revenue but their profits generally aren't as high. Instead we're talking about cash on hand. Like Tim Cook walking out of the bank and be like \"I need to withdraw 117 billion dollars please\" although he can't anymore because Google has more. Back in 2015, Google Inc. restructured their business into a new parent company, Alphabet which included all of their subsidiaries including Calico, Waymo and Nest which later merged into Google. Basically it's an alphabet soup. (crowd booing sound effect) (chuckles) c'mon give me that. It was an alphabet soup. While those other companies generate billions for Alphabet, it's no surprise that Google services like Android, YouTube and the Play Store have been the largest chunk of revenue by a lot. And on top of all that, recently the Pixel 3A did beat sales projections. While Google and Android fanboys might see this as an absolute win. With Google finally beating Apple, the numbers don't exactly tell the whole story. It's much less about how much money that Alphabet has made but it's more so about how much money Apple is spending. At the beginning of the year, Apple had amassed an absurd 245 billion dollars of cash on hand. For context, that's the equivalent GDP of the entire country of Peru. However, investors generally do not like it when companies have all this cash on hand. I mean what's the point of having cash in the bank when they could be getting cash back into the business or more specifically, they can just be giving the cash back to the investors. So since 2018, Apple spent over 175 billion dollars just literally buying back their stock which increases the price which makes everyone happy. Except, I don't know, people who buy iPhones. Speaking of iPhones, while the sales have been on the decline for a while. Apple has been increasing the number of investments they make in new businesses. According to Tim Cook, Apple has acquired approximately 20 to 25 companies over the last year, including last month when they purchased Intel's smartphone modem business. That's insane. Cook says that these are smaller companies which is why they haven't actually even announced a lot of these acquisitions. But still a huge investment. Now on top of that, Apple has been investing into their upcoming streaming service and game subscriptions and all of this means that Apple is a company which has traditionally made lots of and lots of money in places such as the Mac, such as the iPad but specifically with the iPhone. And those iPhone sales have sort of plateau-ed, they haven't kind of doubled or tripled every year, they're looking for other revenue sources and other ways to spend this money. With the key thing here is is that they have so much cash in the bank that there's literally no reason for them not to go and investigate, you know, some company that might make the lens for the Apple Glasses or some company which will make a better screen for the Apple Watch 35. I mean literally they have so much cash on hand that there's no reason not to go \"Just make it rain, make it rain, make it rain\" Speaking of new Apple services, five months after it was announced. Apple's Credit Card, the aptly named Apple Card is finally starting shipping out if you're lucky. If you're also lucky, this segment is going to be hosted by none other than the world renowned Apple expert (crowd cheering) Ken Bolido. Round of applause please, round of applause. (Austin claps) - Thank you, thank you, thank you. (Austin's clapping continues) No really, thank you. We're good, we're good now, we're good now. With the release, Apple joins an ever growing number of tech companies who have their own credit card. Both Uber and Amazon have had cards for a couple of years now. And Amazon even recently released a new card targeted specifically for people looking to build or improve their credit. Thousands of people preemptively signed up for the Apple Card but only a select number of people received emails that their new card was finally available. Like with all of their products, Apple has deeply integrated the Apple Card into their ecosystem. Users can apply directly in the Wallet app and the card is integrated immediately into Apple Pay. By Default, users are only issued a digital version but they can opt-in for a physical card and in true Apple fashion. It is absolutely over-the-top. The all white card is made out of titanium with the Apple logo etched in. The perks of the card are nothing special in fact, it's pretty much on par with similar cards like say, the Uber card. What distinguishes the Apple Card however is its commitment to security. Unlike just about every other credit card out there, the Apple Card actually doesn't have a credit card number. Instead, every time you use it, a new unique card number is generated. What this means is, say you use the card on a sketchy website and that gets hacked. Your data is still safe because the credit card number that gets stolen was only valid for that one purchase. Now that Apple Card is genuinely interesting because it inserts them into this part of the market that they haven't been in before. Of course there's Apple Pay and that's all digital. But a physical card might actually push some people over to their camp, I guess. - What Ken is trying to say right now is that Tim Cook has a lot of money and the Apple Card is going to literally mean that you're going to give him more money. - Give Tim Cook more money! - [Austin] Wait what? No - Oh no? No? Thank you guys for watching this episode of This is Now - No no no, get out of here. Thank you very much for watching this episode of This is Now. Feel free to check out some of our other episodes here you can subscibe to Ken. R-I-P. And most importantly. Make sure to tell Matt that you love him because we all really truly do.",
    "transcript_keywords": [
        "Apple",
        "Apple Card",
        "card",
        "lootboxes",
        "Apple Credit Card",
        "Credit Card",
        "games",
        "money",
        "Google",
        "Apple Pay",
        "game",
        "Tim Cook",
        "card number",
        "credit card number",
        "Matt",
        "named Apple Card",
        "make",
        "cash",
        "Alphabet",
        "companies"
    ],
    "transcript_entity_values": [
        "hours",
        "Ken Bolido",
        "Android",
        "this a few months",
        "a few hours",
        "three",
        "35",
        "iPhones",
        "a couple of years",
        "Five dollars",
        "approximately 20 to 25",
        "Pokemon",
        "every year",
        "Peru",
        "Nintendo",
        "One",
        "YouTube",
        "Microsoft",
        "2015",
        "May",
        "the Protecting Children",
        "the past several years",
        "245 billion dollars",
        "Dota 2",
        "60",
        "the last year",
        "the age of 18",
        "Animal Crossing",
        "Google",
        "Thousands",
        "Matt",
        "2020",
        "iPad",
        "Austin",
        "Calico",
        "Royale",
        "EA",
        "Xbox",
        "Credit Card",
        "Apple Card",
        "Fire Emblem",
        "five months",
        "FTC",
        "the Apple Card",
        "Belgian",
        "last month",
        "Google Inc.",
        "Fortnite",
        "Activision",
        "the Pixel 3A",
        "Starwars Battlefront II",
        "Playstation",
        "billions",
        "2018",
        "the Apple Watch",
        "Intel",
        "Wal-Mart",
        "29 days",
        "one",
        "Mac",
        "Apple",
        "about a hundred bucks",
        "the Play Store",
        "Alphabet",
        "Bethesda",
        "another $100",
        "Nest",
        "117 billion dollars",
        "over 175 billion dollars",
        "the Apple Glasses",
        "Tim Cook",
        "Abusive Games",
        "monthly",
        "Amazon",
        "the past couple of years",
        "the beginning of the year",
        "Sony",
        "50s",
        "iPhone",
        "Ken",
        "plateau-ed",
        "Waymo",
        "Cook",
        "ESA",
        "Switch"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "NORP",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "EVENT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG"
    ],
    "vector": [
        0.056502118706703186,
        0.001704050344415009,
        0.059014447033405304,
        0.022628286853432655,
        0.08851238340139389,
        -0.03125699982047081,
        0.030314592644572258,
        -0.004773451015353203,
        0.0680123120546341,
        0.03860146552324295,
        -0.09243374317884445,
        0.023468395695090294,
        0.009787199087440968,
        -0.051467664539813995,
        0.040436748415231705,
        -0.05516507849097252,
        0.0418238528072834,
        -0.029535790905356407,
        -0.0306113138794899,
        0.09960456192493439,
        0.0009959430899471045,
        -0.09105648100376129,
        -0.0042583211325109005,
        0.005306379869580269,
        -0.026560377329587936,
        0.053767479956150055,
        -0.019845418632030487,
        -0.01214230339974165,
        -0.08138120919466019,
        -0.0236978679895401,
        0.029850497841835022,
        0.06165993586182594,
        0.012246848084032536,
        0.04544426500797272,
        0.007542841602116823,
        0.013729305937886238,
        -0.04795871302485466,
        0.019337834790349007,
        -0.029452886432409286,
        -0.05280081555247307,
        -0.04346344619989395,
        -0.04391523450613022,
        0.024875007569789886,
        0.06574185937643051,
        0.020502544939517975,
        -0.04557713493704796,
        -0.008841712027788162,
        -0.10520302504301071,
        -0.05207337066531181,
        0.02339141070842743,
        -0.00895914901047945,
        -0.04415427893400192,
        0.06489478051662445,
        -0.05064660683274269,
        0.0034810162615031004,
        -0.06757181882858276,
        0.03242844343185425,
        0.014169389382004738,
        0.02599845826625824,
        0.02570345439016819,
        0.028852662071585655,
        -0.025706307962536812,
        0.028138352558016777,
        -0.013555308803915977,
        0.09622068703174591,
        -0.06585095077753067,
        0.05354098975658417,
        0.09211022406816483,
        -0.08670618385076523,
        -0.029238250106573105,
        0.07116109877824783,
        0.03995949774980545,
        -0.0016335112741217017,
        0.04639226198196411,
        0.04907233268022537,
        0.021024396643042564,
        -0.004193404223769903,
        -0.013080309145152569,
        0.01902502402663231,
        0.09395609050989151,
        0.03813149034976959,
        0.030329246073961258,
        0.01871369779109955,
        -0.050647884607315063,
        -0.03242478519678116,
        -0.05162100866436958,
        -0.013575367629528046,
        0.07975958287715912,
        -0.05781550332903862,
        -0.05303739756345749,
        -0.02866516262292862,
        -0.0056040179915726185,
        0.0348590649664402,
        0.10716048628091812,
        0.06056883931159973,
        0.007996927946805954,
        -0.050926242023706436,
        -0.026208147406578064,
        -0.045303624123334885,
        -0.009580991230905056,
        0.06868252158164978,
        0.03271140530705452,
        0.0265966784209013,
        -0.0023439121432602406,
        0.08787700533866882,
        -0.07024888694286346,
        -0.049464039504528046,
        0.035843271762132645,
        -0.024658681824803352,
        0.026518963277339935,
        -0.09642131626605988,
        0.022266719490289688,
        -0.025181658565998077,
        0.005341543350368738,
        -0.05319245159626007,
        0.005967148579657078,
        -0.06627236306667328,
        0.10186821222305298,
        -0.03616653382778168,
        0.07093782722949982,
        0.09092602133750916,
        0.00959663838148117,
        0.004988627042621374,
        -0.02868773601949215,
        0.016238991171121597,
        0.0038746658246964216,
        -0.044156357645988464,
        5.105020988065511e-33,
        0.03983534872531891,
        -0.08919655531644821,
        -0.022685624659061432,
        0.05054640769958496,
        0.03275468572974205,
        -0.055977486073970795,
        0.03758539259433746,
        0.03927692398428917,
        0.005063434597104788,
        0.059407398104667664,
        -0.09935005009174347,
        0.09608948975801468,
        -0.027459124103188515,
        0.013577123172581196,
        0.06459324061870575,
        -0.12120048701763153,
        -0.09771715849637985,
        -0.06543370336294174,
        0.06266319006681442,
        -0.03784355893731117,
        -0.035220857709646225,
        -0.06010233983397484,
        0.044621966779232025,
        0.029280828312039375,
        0.00044915868784300983,
        0.09976384043693542,
        -0.011603739112615585,
        -0.00855844933539629,
        -0.01624389924108982,
        0.031311798840761185,
        -0.03774217516183853,
        -0.12644563615322113,
        0.02392328530550003,
        0.005347143858671188,
        0.012891785241663456,
        -0.06609427183866501,
        -0.009138492867350578,
        -0.03235960006713867,
        -0.042744409292936325,
        -0.04108313471078873,
        -0.07775086164474487,
        -0.05468680337071419,
        -0.11004389077425003,
        -0.001596995396539569,
        0.007206450682133436,
        -0.0031774542294442654,
        0.05168849974870682,
        -0.01798834651708603,
        -0.15583279728889465,
        0.024441713467240334,
        -0.01847079023718834,
        0.02824835479259491,
        0.0001838949538068846,
        0.012428350746631622,
        -0.03565828129649162,
        -0.1108291894197464,
        0.0008160898578353226,
        -0.027600323781371117,
        0.023760123178362846,
        -0.00709571735933423,
        0.031050434336066246,
        0.002698340220376849,
        -0.02868417277932167,
        -0.005929585546255112,
        -0.0581834577023983,
        0.03494221717119217,
        0.023465612903237343,
        0.01751737855374813,
        -0.039165377616882324,
        0.0771317183971405,
        0.11377912014722824,
        0.07357426732778549,
        -0.06793105602264404,
        -0.053636565804481506,
        0.025451896712183952,
        0.002462314907461405,
        -0.0011125835590064526,
        -0.01525129284709692,
        -0.0037732317578047514,
        -0.09644214063882828,
        0.06090722605586052,
        0.004315604921430349,
        -0.029025280848145485,
        0.00928544718772173,
        -0.08026517927646637,
        0.004975199233740568,
        0.028128812089562416,
        -0.014546060003340244,
        -0.0417221263051033,
        0.01632614992558956,
        -0.014440516009926796,
        -0.08338014781475067,
        0.07556487619876862,
        -0.020000586286187172,
        0.03329719603061676,
        -4.181360506201559e-33,
        0.011464163661003113,
        -0.06705353409051895,
        0.003841124475002289,
        0.006426897365599871,
        0.042995747178792953,
        0.0036975559778511524,
        -0.02769273705780506,
        -0.09574620425701141,
        -0.001991724595427513,
        0.02370564639568329,
        -0.10969313234090805,
        -0.0011215765262022614,
        0.03239523246884346,
        0.05510275065898895,
        0.0021021233405917883,
        -0.05982222780585289,
        0.04394187033176422,
        -0.005086453631520271,
        0.04929725453257561,
        -0.04061124101281166,
        0.04377324506640434,
        0.036779873073101044,
        -0.044864293187856674,
        -0.07728195190429688,
        -0.0504947230219841,
        0.012407236732542515,
        -0.045399975031614304,
        -0.07493413239717484,
        -0.020370664075016975,
        0.07569151371717453,
        0.01974884420633316,
        -0.011709669604897499,
        0.03775149583816528,
        -0.02141079679131508,
        0.02599024400115013,
        0.03731435164809227,
        0.034715138375759125,
        0.02919141575694084,
        -0.027517221868038177,
        -0.0404861755669117,
        -0.10706440359354019,
        -0.0271989144384861,
        -0.06386449187994003,
        0.035138510167598724,
        -0.030802186578512192,
        0.0002945319574791938,
        -0.05197322368621826,
        0.0034053886774927378,
        0.11432026326656342,
        0.04984404891729355,
        0.014267947524785995,
        0.0011880801757797599,
        0.004986924584954977,
        -0.12109566479921341,
        -0.07308715581893921,
        -0.016445739194750786,
        -0.15315410494804382,
        -0.0016629440942779183,
        0.034332796931266785,
        0.030195144936442375,
        0.003890418214723468,
        0.032268207520246506,
        -0.027562756091356277,
        0.04236265644431114,
        0.055782537907361984,
        0.027047285810112953,
        0.014647492207586765,
        0.003999453503638506,
        -0.03724686801433563,
        -0.04405616596341133,
        0.007736093830317259,
        0.04010976478457451,
        -0.10428601503372192,
        -0.006033923476934433,
        -0.03766073286533356,
        0.045231983065605164,
        0.008069636300206184,
        0.0356343649327755,
        0.06885840743780136,
        -0.012300487607717514,
        -0.0114186592400074,
        0.03510310500860214,
        0.01799158751964569,
        0.010166560299694538,
        -0.03911111503839493,
        -0.004627781454473734,
        0.03585172817111015,
        0.0750478059053421,
        -0.06355545669794083,
        0.001966225914657116,
        0.010409669019281864,
        0.017567401751875877,
        -0.014190995134413242,
        0.08938022702932358,
        0.023249013349413872,
        -5.798398206025013e-08,
        -0.004270384553819895,
        -0.06079338863492012,
        -0.03221558779478073,
        0.020574524998664856,
        0.08516740053892136,
        0.051373884081840515,
        0.04395831376314163,
        0.09787247329950333,
        0.051862213760614395,
        0.013799663633108139,
        0.08808267116546631,
        0.008013634011149406,
        -0.06797634065151215,
        -0.03712107986211777,
        0.11827041208744049,
        0.0719245970249176,
        0.006264406722038984,
        -0.021609140560030937,
        -0.021253138780593872,
        0.07682518661022186,
        0.11921070516109467,
        0.0006090871174819767,
        0.01885591819882393,
        -0.06680101156234741,
        -0.05644836649298668,
        -0.00018461297440808266,
        -0.021781940013170242,
        -0.0154503732919693,
        0.07415986061096191,
        0.03795811906456947,
        0.005478518549352884,
        -0.0711093321442604,
        0.05203012377023697,
        0.0159799475222826,
        -0.02240465208888054,
        0.044835153967142105,
        0.029497681185603142,
        0.00257581053301692,
        0.03729716315865517,
        0.01246301457285881,
        -0.006330722011625767,
        -0.07179851084947586,
        0.03252448886632919,
        -0.00648935092613101,
        -0.09839104115962982,
        -0.0068805827759206295,
        -0.15273813903331757,
        0.06492394953966141,
        -0.021270474418997765,
        -0.06052859127521515,
        -0.011358470655977726,
        -0.08255094289779663,
        -0.009772991761565208,
        0.0663808211684227,
        0.12410447001457214,
        -0.0011805274989455938,
        0.046412836760282516,
        0.050919968634843826,
        0.10457856208086014,
        0.046809736639261246,
        0.0224468894302845,
        0.008644822053611279,
        -0.05422356724739075,
        0.03708789125084877
    ]
}