{
    "id": "wm2v6IpKXI4",
    "title": "Google I/O 2019 event in 13 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-05-07T20:01:32Z",
    "video_url": "https://www.youtube.com/watch?v=wm2v6IpKXI4",
    "category": "Science & Technology",
    "tags": [
        "google io",
        "google I/o",
        "google",
        "io",
        "I/o",
        "io 2019",
        "pixel 3a",
        "android",
        "google keynote",
        "i o",
        "google io 2019",
        "keynote",
        "google pixel",
        "2019",
        "google pixel 3a",
        "google assistant",
        "developer update",
        "android q",
        "pixel 3",
        "developers",
        "google developers",
        "2018",
        "event",
        "google io 2018",
        "chrome",
        "google chrome",
        "sundar pichai",
        "machine learning",
        "google nest",
        "nest hub",
        "smart home",
        "smart display",
        "technology",
        "tech",
        "gadgets",
        "latest updates",
        "tech news",
        "apple",
        "hands-on",
        "review",
        "verge",
        "the verge"
    ],
    "views": 1770801,
    "likes": 26292,
    "comments_count": 1628,
    "description": "At Google I/O 2019, the company announced the Pixel 3A and 3A XL, along with a new Nest Hub Max smart display that has a camera, and updates coming to Android Q and Google Assistant. In addition, Google is bringing the new Live Caption feature to videos and audio.    Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2J6rOSa",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(audience cheering) - Good morning, good morning. Wonderful to be back here at Shoreline with all of you. Last year we launched a new feature in Google News called Full Coverage, and we have gotten great feedback on it from our users. We'll be bringing full coverage directly to Search to better organize results for news-related topics. You can even now see a timeline of events, and we'll be bringing this to Search later this year. Podcasts are another important source of information. And we'll be bringing them directly to Search as well. - With computer vision and augmented reality, the camera in our hands is turning into a powerful visual tool, so today we are excited to bring the camera to Google Search. Now when you search for something like muscle flexion, you can view a 3D model built by visible body, right from the search results. Not only that, pretty cool. Not only that, you can also place it in your own space. (audience gasping and cheering) Okay, today let me show you somebody new ways that we're making Lens more helpful to you. Say you're at a restaurant trying to figure out what to order. Lens automatically highlights the popular dishes at this restaurant, right on the menu. And of course if you wanna know more, you can tap on any dish on the menu and you can see what it looks like, again, at the restaurant. And of course check out what other people are saying about it on Google Maps. By the way, when you're done eating, Lens can help pay for your meal. Not so fast, it's not picking up your tab, but it can calculate the tip and even split the total. But we're starting to think of other ways that we can connect helpful digital information with the things in the physical world. So I'm gonna give you just one example. You're flipping through a Bon Appetit magazine and you see a recipe you like. Soon, you can point your camera at the recipe and see the page come alive. - Duplex enables Google Assistant to make restaurant reservations on your behalf by actually placing a call. But now we are moving beyond voice, and extending Duplex to tasks on the web. Say you get a calendar reminder about an upcoming trip and you wanna book a rental car. You can just ask Google, book a National car rental for my next trip. The Assistant opens the National website and automatically starts filling out your information. It's acting on your behalf and helping you save time, but you are always in control of the flow. What you just saw is an early preview of what we are calling Duplex on the web, and we'll have more details later this year. - What if the Assistant was so fast that processing your voice, that tapping to operate your phone would almost seem slow. This next generation Assistant will let you instantly operate your phone with your voice, multi-task across apps, and complete your calendar will even work offline. But it also has to be personal enough to really help you. We call this feature picks for you, and it'll be launching on smart displays later this summer, starting with recipes, podcasts, and events. Now beyond your preferences, becoming more personal means the Assistant will better understand the people, places, and events that are important to you. If you shared important people, places, and events with the Assistant, you'll be able to ask for things more naturally, and rest assured, you're always in control. You can edit or delete this information at anytime in the updated you tab in Assistant settings. I'm happy to share the Assistant is also coming to ways in the next few weeks. Now I'd like to show you this future of how we're improving your mobile driving experience even more. Introducing the Assistant's new driving mode. Just put your phone in the car and say, hey Google, let's drive. Driving mode will be available this summer on any Android phone with the Assistant. - Part of the way we built for everyone is by ensuring that our products are safe and private. If you're in Search, you can tap on your photo and you can quickly access the most relevant privacy controls for Search in case your data in Search. Here, you can view and manage your recent activity, and you can easily change your privacy settings. Last week we announced auto delete controls, which you'll also be able to access right from that. Data helps make Search work better for you. And with auto delete, you can choose how long you want it to be saved. This is launching today for web and app activity. We'll be rolling it out in location history in the coming weeks. One tap access to your Google account will be coming to our major products, including Chrome, Search, Assistant, YouTube, Google News, and Maps. And speaking of Maps, if you tap on your profile photo, in addition to finding easy access to your privacy controls, you'll find a new feature, incognito mode. Incognito mode has been a popular feature in Chrome since it launched, and we are bringing this to Maps. While in incognito in Maps, your activity, like the places you search and navigate to won't be linked to your account. We wanna make it easy to enter in and out of incognito and Maps will soon join Chrome and YouTube with support for incognito, and will be bringing it to Search as well this year. - Today there are over 2.5 billion active Android devices. And this year, display technology will take an even bigger leap with foldables coming from multiple Android OEMs. Foldables take advantage of a completely new display technology. They literally bend and fold, from phone to tablet-size screen. And Q maximizes what's possible on these screens. Another exciting innovation is 5G. And Android Q supports 5G natively. Now in addition to hardware innovation, we're also seeing huge firsts in software driven by advances in on-device machine learning. All this protects user privacy. And this is OS-wide. No the same on-device machine learning powers another useful Q feature, which is smart reply. With smart reply, the OS helpfully suggests what you'll type next. It'll predict the text you'll type, even emojis, and it's a huge time saver. What's really cool is this works now for all messaging apps in Android. Now there's one more addition to Android Q that's small but you've been asking us about for a while, and that is dark theme. And we're launching it in Q. You can activate it by using the quick tile or by turning on battery saver, and in fact it will help you save battery. You should always be in control of what you share and who you share it with. In Q we've brought privacy to the top level in settings, and there you'll find a number of important controls all in one place. Activity data, location history, ad settings, and you decide what's on or off. With Q your device will give you helpful reminders whenever an app accesses location when you're not actively using that app. In Q we've brought location controls to the forefront in settings so you can quickly review every app and change location access with simple controls. We wanna help people find balance, and that's why we've created a new mode for Android. It's called focus mode. When I enter focus mode, I can select the apps that I find distracting. Focus mode is coming to devices on P and Q this fall. In Q, family link parental controls will be built right into the settings of the device, so when you set up a device for someone in your family, family link will help connect it to a parent, and you can review any apps that your child wants to install. Now there's a ton more in Q that we don't have time to cover. A ton. Everything from streaming media to hearing aids, to better connectivity, to new gesture UI, and more, so today I'm excited to announce that Q beta three is available on 21 devices. - Over the past year we've brought the Nest and Google teams together to deliver on our vision of the helpful home. And today, we're further simplifying things, bringing all of these products together under the Nest name. Introducing Nest Hub Max. It's a new product that has a camera and a larger 10-inch display. If you wanna know what's going on in your home, you can choose to use it like a Nest Cam. And just like a Nest Cam, it's easy to see your event history, enable home and away assist, and you also get a notification if the camera detects any motion or see someone it doesn't recognize in your home. The camera has a wide angle lens and it automatically adjusts to keep you centered in the frame. You can chat with any iOS or Android device, or a PC with a Chrome browser. You can also use Duo to leave video messages for members of your household. Nothing is streamed or recorded unless you intentionally enable it. And you'll always know when the camera is on with a green indicator light. You have multiple controls to disable camera features and a physical switch on the back electrically disconnects the camera and the microphones. But today we're also extending the options to personalize using the camera with a feature we call face match. For each person in your family that chooses to turn it on, the Assistant guides you through a process of creating a face model, which is then encrypted and stored on the device. Then, whenever you walk in front of the camera, Hub Max recognizes you and shows just your information and not anyone else's. And in the morning, I can walk into the kitchen and the Assistant knows to greet me with my calendar, my commuting details, the weather, and any other information I need to start my day. You're also getting full stereo sound with a powerful rear-facing woofer. And now when the volume's up instead of yelling at the Assistant to turn it down or pause the game, with the camera, it's as simple as a gesture. You just raise your hand. All this will be available on Nest Hub Max later this summer for just $229. And today, we're lowering the price of the original Nest Hub from $149 to $129. Next I wanna talk about Pixel. I wanna introduce you to the newest members of the Pixel family, Google Pixel 3a and 3A XL, designed to deliver premium features at a price people will love. They start at just $399. - Pixel 3a comes in three colors. Just black, clearly white, and a new color, purple-ish. (audience laughing) Pixel 3a supports Blue Tooth 5.0, and USBC digital audio, and we've also included a 3.5 millimeter audio jack. Pixel 3a can take amazing photos in low light with night sight. We've also enabled Pixel's portrait mode on both the front and rear cameras. And our super res zoom applies computational photography. Starting today on Pixel phones, when you use walking directions instead of staring at that blue dot on your phone, you're going to see arrows in the real world to tell you where to turn next. (audience cheering) Pixel 3a has adaptive battery, uses machine learning to optimize based on how you use your phone. So you can get up to 30 hours on a single charge. And, with the included 18-watt charger, you'll get up to seven hours of battery life with just 15 minutes of charging. On the software side, you get the latest Google security patches and updates for three years including Android Q this summer. Pixel 3a and 3axl are available in 13 markets starting today. - Thank you, and enjoy the rest of iO. - Now before I go, I wanna share a little something that a lot of you have been asking for. Check this out. (uplifting music) Stop. No hey Google needed. And it's rolling out on smart displays and Google homes in English-speaking locales starting today.",
    "transcript_keywords": [
        "Assistant",
        "Search",
        "Google",
        "Android",
        "camera",
        "Nest Hub Max",
        "Pixel",
        "enables Google Assistant",
        "today",
        "Nest Hub",
        "Nest",
        "Google Assistant",
        "Google Search",
        "Maps",
        "mode",
        "controls",
        "Good morning",
        "Full Coverage",
        "phone",
        "Hub Max"
    ],
    "transcript_entity_values": [
        "Pixel",
        "Duplex",
        "Android",
        "USBC",
        "one",
        "the next few weeks",
        "just $229",
        "Hub Max",
        "Google Search",
        "Google News",
        "three",
        "Pixel",
        "today",
        "up to 30 hours",
        "the coming weeks",
        "Google",
        "up to seven hours",
        "Nest",
        "Nest Hub Max",
        "Bon Appetit",
        "5",
        "three years",
        "Lens",
        "a Nest Cam",
        "just 15 minutes",
        "just $399",
        "3axl",
        "National",
        "Google Pixel 3a",
        "UI",
        "Nest Hub",
        "A ton",
        "jack",
        "later this summer",
        "the past year",
        "10-inch",
        "Shoreline",
        "Last year",
        "3a",
        "13",
        "One",
        "Chrome",
        "my day",
        "English",
        "Android Q",
        "this year",
        "$149 to $129",
        "Google Maps",
        "21",
        "3A",
        "Last week",
        "later this year",
        "YouTube",
        "Blue Tooth 5.0",
        "this summer",
        "3.5 millimeter",
        "18-watt",
        "XL",
        "a ton"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "FAC",
        "TIME",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "LOC",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "LANGUAGE",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.05195547640323639,
        -0.06610620766878128,
        0.05951409041881561,
        -0.06251885741949081,
        0.1360546201467514,
        -0.0028711925260722637,
        -0.08203619718551636,
        -0.022102076560258865,
        -0.019405994564294815,
        -0.0004913636948913336,
        -0.03581526130437851,
        0.02060905657708645,
        -0.03308664634823799,
        0.004616230726242065,
        0.04131246730685234,
        -0.061754461377859116,
        0.12481305748224258,
        -0.08649728447198868,
        -0.054226621985435486,
        -0.029143663123250008,
        -0.06900598108768463,
        -0.002877152292057872,
        0.08471477776765823,
        -0.013228515163064003,
        -0.015640337020158768,
        -0.008752765133976936,
        -0.03445301949977875,
        -0.11378932744264603,
        0.061823148280382156,
        -0.03069453500211239,
        0.029483623802661896,
        0.02717200666666031,
        0.08780933171510696,
        0.022476060315966606,
        -0.046743717044591904,
        -0.04231932759284973,
        0.03118724748492241,
        -0.06893637776374817,
        -0.02772480435669422,
        0.028653675690293312,
        0.055035099387168884,
        -0.08559972792863846,
        0.003620220348238945,
        -0.01826181262731552,
        0.03636310249567032,
        -0.03442053124308586,
        -0.039025258272886276,
        -0.06505975872278214,
        0.06865793466567993,
        0.04950651526451111,
        -0.06830395758152008,
        -0.1269167959690094,
        0.03487430512905121,
        -0.015097488649189472,
        -0.03421603515744209,
        0.0521121583878994,
        -0.03871055319905281,
        0.030291663482785225,
        0.07496333867311478,
        0.01723218336701393,
        0.02505454421043396,
        -0.051258839666843414,
        -0.019436227157711983,
        0.06368359178304672,
        0.016352349892258644,
        0.030835919082164764,
        0.030873015522956848,
        0.03346538543701172,
        0.03158237040042877,
        -0.071221262216568,
        -0.03210935741662979,
        0.06926777958869934,
        0.01354925986379385,
        -0.05209311097860336,
        -0.0021212869323790073,
        0.004518568050116301,
        0.03693661838769913,
        -0.004482803866267204,
        0.03389732539653778,
        -0.0538749136030674,
        0.004418778698891401,
        -0.10962837189435959,
        -0.022162843495607376,
        -0.02716640755534172,
        -0.01140162069350481,
        -0.05682707577943802,
        0.007252867799252272,
        -0.009756352752447128,
        -0.033353742212057114,
        -0.015478198416531086,
        -0.09567433595657349,
        -0.001176514197140932,
        0.0025956863537430763,
        0.021948400884866714,
        -0.009970484301447868,
        0.04115643352270126,
        -0.05641898512840271,
        -0.08492232114076614,
        0.05082192271947861,
        0.018390538170933723,
        0.006242476869374514,
        0.043727807700634,
        0.017982250079512596,
        -0.020703524351119995,
        -0.03460264205932617,
        -0.03826213628053665,
        -0.08423295617103577,
        0.027334298938512802,
        0.05194270238280296,
        0.08500448614358902,
        -0.006300156470388174,
        0.05368201807141304,
        0.02138705737888813,
        -0.0844065472483635,
        0.002143413294106722,
        0.023977171629667282,
        0.020957615226507187,
        0.00420848373323679,
        0.10017875581979752,
        0.03983694687485695,
        0.04945527762174606,
        0.026772409677505493,
        -0.06213884428143501,
        -0.08231961727142334,
        0.05695224180817604,
        0.004691561218351126,
        -0.04294788837432861,
        2.069051340716642e-33,
        0.04674234986305237,
        0.03557188808917999,
        0.008258898742496967,
        -0.001320241135545075,
        0.03936256468296051,
        0.055995501577854156,
        -0.027683965861797333,
        0.008377154357731342,
        -0.06478389352560043,
        -0.05817333981394768,
        0.005096199922263622,
        0.0591777004301548,
        -0.06486810743808746,
        -0.01232605054974556,
        -0.003971146419644356,
        -0.037622712552547455,
        -0.03355742618441582,
        0.07584479451179504,
        -0.10869096219539642,
        0.011946097016334534,
        -0.02133774198591709,
        -0.056328754872083664,
        -0.0034827650524675846,
        -0.01414576917886734,
        0.0652276799082756,
        0.02870003692805767,
        0.10131172090768814,
        -0.06412751227617264,
        0.012784166261553764,
        0.02607628144323826,
        -0.062455687671899796,
        -0.0320117250084877,
        -0.01370989065617323,
        0.012574817053973675,
        -0.01645446941256523,
        0.022422680631279945,
        -0.14148925244808197,
        -0.09282590448856354,
        0.014542565681040287,
        0.02436240017414093,
        -0.03343149274587631,
        -0.022701764479279518,
        -0.09930125623941422,
        -0.10465635359287262,
        0.008211336098611355,
        0.04126599803566933,
        0.037810489535331726,
        -0.04216666892170906,
        0.04241874814033508,
        -0.02050221525132656,
        0.04595112428069115,
        -0.006389877758920193,
        -0.1237945556640625,
        -0.056806255131959915,
        0.0026362978387624025,
        0.0034937241580337286,
        -0.00034484401112422347,
        -0.05428104102611542,
        0.013012747280299664,
        -0.0030608591623604298,
        -0.0015193638391792774,
        0.03806943818926811,
        -0.004270329140126705,
        0.05613599345088005,
        -0.12386822700500488,
        0.005588531959801912,
        0.08110372722148895,
        0.0554182268679142,
        -0.006705051753669977,
        0.09197131544351578,
        -0.0018533933907747269,
        -0.02536378614604473,
        -0.0022368854843080044,
        -0.011556874960660934,
        -0.00598008930683136,
        0.05094950273633003,
        -0.05033402889966965,
        -0.07330060005187988,
        0.01922907494008541,
        0.096566341817379,
        0.05048893764615059,
        -0.047972626984119415,
        0.043700944632291794,
        -0.027992481365799904,
        0.03182610496878624,
        -0.014777248725295067,
        0.03732677921652794,
        0.011843674816191196,
        -0.032772354781627655,
        -0.0549946129322052,
        -0.06393949687480927,
        0.03220555931329727,
        -0.006510553881525993,
        0.07570504397153854,
        -0.029760776087641716,
        -3.603357444274763e-33,
        -0.03303753584623337,
        0.03619097173213959,
        -0.04890398308634758,
        -0.028370331972837448,
        -0.04695873335003853,
        -0.04846244305372238,
        0.07821663469076157,
        0.055630676448345184,
        0.043929021805524826,
        0.016220031306147575,
        0.003787578782066703,
        -0.03016219660639763,
        -0.03478756174445152,
        -0.013487742282450199,
        -0.06167282909154892,
        -0.038086649030447006,
        0.026312580332159996,
        -0.13628844916820526,
        -0.0749209001660347,
        0.045743513852357864,
        0.013521331362426281,
        0.006718072574585676,
        -0.10598357021808624,
        0.023792605847120285,
        0.050586119294166565,
        0.000682759506162256,
        0.0962907001376152,
        0.06932693719863892,
        0.016156423836946487,
        -0.053575992584228516,
        -0.06368183344602585,
        -0.06499248743057251,
        -0.036017876118421555,
        0.021025925874710083,
        0.11402790248394012,
        0.07320316135883331,
        0.10458417236804962,
        -0.07277665287256241,
        -0.005295140203088522,
        -0.05301402509212494,
        0.02130492776632309,
        -0.013091553933918476,
        0.040059927850961685,
        0.0005644876509904861,
        -0.01825699768960476,
        0.019418418407440186,
        -0.050506919622421265,
        0.08463882654905319,
        -0.05090663954615593,
        0.028073562309145927,
        0.0011960610281676054,
        0.0025001377798616886,
        0.014088941738009453,
        0.04511377960443497,
        0.004363357555121183,
        -0.021024804562330246,
        -0.07686919718980789,
        0.01543443277478218,
        -0.02408071979880333,
        -0.01571361906826496,
        -0.028143029659986496,
        -0.012937377206981182,
        -0.03319072723388672,
        0.0012487111380323768,
        -0.039345163851976395,
        -0.023766014724969864,
        0.060545433312654495,
        -0.01812439225614071,
        -0.006868890952318907,
        0.036881815642118454,
        0.03486371040344238,
        0.0317266508936882,
        -0.008846592158079147,
        -0.06494481861591339,
        -0.06402750313282013,
        0.10193807631731033,
        0.06335244327783585,
        -0.040447037667036057,
        0.017560260370373726,
        -0.02686907723546028,
        -0.0072267185896635056,
        0.046550627797842026,
        0.061691977083683014,
        0.0066161188296973705,
        0.126283198595047,
        0.05996051803231239,
        0.03625492751598358,
        0.0711691603064537,
        -0.01771736517548561,
        -0.019249407574534416,
        -0.1136532798409462,
        0.021025527268648148,
        -0.114006906747818,
        0.08418922871351242,
        0.022158730775117874,
        -5.677368264400684e-08,
        0.013963756151497364,
        0.03403927758336067,
        -0.04405968636274338,
        -0.008207534439861774,
        0.07547888904809952,
        -0.10038171708583832,
        0.0019800213631242514,
        0.027504608035087585,
        0.026624061167240143,
        0.02437872625887394,
        -0.01403601560741663,
        -0.060827936977148056,
        -0.037749551236629486,
        0.07271545380353928,
        0.11016594618558884,
        0.0009518138831481338,
        -0.03039003163576126,
        -0.015091655775904655,
        -0.01944299228489399,
        -0.06072155013680458,
        -0.009617619216442108,
        0.02977333590388298,
        0.056901123374700546,
        -0.009537670761346817,
        0.04105895012617111,
        0.03512249141931534,
        -0.010311832651495934,
        0.04025906324386597,
        0.05346328020095825,
        -0.019575156271457672,
        -0.04313939809799194,
        -0.017683804035186768,
        -0.0871935710310936,
        -0.05027257278561592,
        0.0052855247631669044,
        -0.0273906160145998,
        0.023241378366947174,
        -0.0048003061674535275,
        0.09037713706493378,
        0.04934891313314438,
        0.05194622278213501,
        -0.015115752816200256,
        0.08414588123559952,
        0.042943354696035385,
        -0.02288771979510784,
        0.006102834362536669,
        -0.014918183907866478,
        -0.07435308396816254,
        0.0344843752682209,
        0.02556428499519825,
        -0.08216454833745956,
        -0.08469726145267487,
        0.062305547297000885,
        0.01998457871377468,
        0.061735719442367554,
        0.0606510192155838,
        0.018460119143128395,
        -0.05871765315532684,
        -0.00509267020970583,
        0.08224807679653168,
        0.09664478152990341,
        0.017835672944784164,
        -0.026900717988610268,
        0.10662918537855148
    ]
}