{
    "id": "WpgsITqoDXQ",
    "title": "Making Film Reveal its Image: the B&W Development Process (Photography Part 2)",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2021-11-05T14:02:24Z",
    "video_url": "https://www.youtube.com/watch?v=WpgsITqoDXQ",
    "category": "Science & Technology",
    "tags": [],
    "views": 694899,
    "likes": 34477,
    "comments_count": 2171,
    "description": "Developers! Developers! Developers! Developers! Developers!  Links n' stuff: The previous video:  That video on why old movies are HD and analog video isn't:  The video on phosphor dots (oh and you'll notice that the thumbnail I showed on-screen here was actually for the original video that this video was made in response to - so pedants, I know! It was on purpose because it says \"These Are Not Pixels.\" OK now here's the dang link):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   Oh, and look at these wonderful patrons! John Feldman, Ted Ledbetter, Tobias Putz, Caytlin Vilbrandt, Alex Rich, Geo (Overand), Nikhill Rao, Robert Fletcher, William PS, Douglas Geusz, Alexane Desbiens, TwoFiftyFare, Bob Frankston, Nick Kourpias, Stateless, Benhart, Douglas JM, Sammy Newton, SeaburyNorton , Zach Berger, Lew Zealand, Shaitageth, Daniel Castonguay, FirenzeFire , Mason DeBord, Jarocks, Nathaniel Robichaud, Benjamin Richards, Chris Brosz, Stewart , Kyle Burton, Jonas Lhrig, Woofy, Russell Grant, Dan Simon, cparks1000000 , Kyle, Puffin, false, Patrick B., Ellis , David Glover-Aoki, iPaq , Peter Murray, probnot, Mike West, Philipp Sa, Kenneth Perronne, The Great Geno, mini mac, Kara Durocher, Andrea Seward, Mark Lewin, Victor , Jared Fry, Nathan Bergey, Steve Davis, Keiran Hillcoat, David Lefton, Chris O'Dea, Tyler, Jason and Katie Corradino, Eric Lemar, kyhm , Alex Gartrell, Spencer R, William O'Driscoll, Sam Ellis, Christian Bikle, Christian Czekay, Andrew Backer, Jonathan Tunnell, MiNX6, Forrest P, FrenchSword , Mike, David Green, Marie and Peter, Trevor Rudolph, Kevin Rogers, Ian Greig, Jaye Martindell, UbiquitousChris, Luke Hogan, Brian Alvarez, Alex Berliner, Kevin Marty, Bram , Paul Adamski, David Joubert, Kyle Ward, Anders Madsen, Josh Jones, Chrono , Pietro Gagliardi, Kornel , Becca Roughton, Romans Bajevs, Fernando Martinez, David Carpenter, Steve Martin De Souza, Density, Joseph Shivak, Ben Douglass, Brentton Paulus, Nicholas Bellamy, Noah Kantrowitz, Lauren Nodonly, Jeremy , Paul Schermerhorn, Colleen Dunseath, Tashlin Familiy, Lellius Rose, andritolion, Adi , Christopher Berger, Nathaniel Kren, Simon J, Vamsikrishna Gopikrishna, Chris Dion, RICHARD CROWLEY, EmpiricalFox, Alexander Curtiss, Iain Cuthbertson, Thomas Schenck, Chiroplut, Windows98 , Clark Marx, Sierrajulietalpha, Rambling Nerd, James Cooper, , Joe Athman, Stewart Smith, Timothy Conard, Ron A Goldberg, HookerHeels, Jon S., Mike Dean, Matthew Hwong, Kyle Van Essen, Trevin Beattie, Hobie Thompson, Pizzafourlife, Joris Lankhorst, shitpostbotmin, Dennis Hulsman, Justin Kuemerle, Ryan Gordon, Buddy DarDar, Anton M., Steve Washington, Stainless, John F. Woods, Lianne Schroeder, Stuart Young, Logan Hetzel, Sugarschild, Justin Smith, Emerick Touilloux, Preston Chaderton, Kate Bates, William Carpenter, Seren Ward, Tyler Dare, Steve Stuart, Axel Kingsley, Nuck, RangerMankin, Ryan Young, Yuriy Taraday, Michael Kelly, Ruairi P Donaldson  00:00 Intro 01:42 What the emulsion is and how it works 04:53 Preparing the film for development 07:18 A note on developing tank styles and why I prefer plastic tanks 09:16 Loading the 120 film onto the reel 10:42 Developers! Developers! Developers! 12:24 Stand development 15:22 The development process 18:20 Fixer 20:39 Rinsing and Photo-flo 21:53 A Mishap 22:50 Image reveal 23:33 A viewing trick 24:12 Outro, credits, & bloopers",
    "description_links": [
        "https://youtu.be/wbbH77rYaa8",
        "https://youtu.be/rVpABCxiDaU",
        "https://youtu.be/Ea6tw-gulnQ",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Hello and welcome to No Effort November, a series of videos for the month of November in which I repeatedly commit to the notion of simpler videos then swiftly fail spectacularly. Its a bit of a tradition around here and were mixing things up by including a segment in an ongoing series. How novel! Youre right, theres no reason to have made this introduction but too bad I already did. Again, its traditional. So, I just made a video about the origins and early days of photography. If you havent seen it theres a clicky thing. And links are everywhere else, too. We were using this old camera, took some pictures, and finally unloaded it. Then I abruptly stopped and here we are! This roll of 120 film is ready for development and that is what were going to do in this video. By the way, apparently I need to clarify that the 120 film format is still very much in production - in fact here is some brand new film I have in both color and black-and-white . So destroying this roll wasnt hurting anything precious. Also its not that I find 120 film to be a terrible format; its just that this batch of this particular film stock I bought on eBay a decade ago absolutely is so ruining a roll left me with no hard feelings. I have no experience with this brands current production and from what Ive absorbed in comments its probably better these days. But anyway Were going to be subjecting this roll of film to a surprisingly similar (though heavily refined) chemical process to Daguerres original method. First, though, its important that we understand what this and other modern films emulsion - thats the light-sensitive layer - actually is. You may have heard the term grain before. Possibly from me back when I made that video on why old movies are HD and analog video isnt. The gelatin-based emulsion carries a whole bunch of light-sensitive silver halide crystals within it. Like a soup. But very congealed. Those crystals literally are the grain and will eventually form the final image after development. But right now theyre still almost entirely as they were before the exposure even happened. See, when it was exposed in the camera, the parts of the emulsion that were hit with light did undergo reduction reactions thats what happens when silver halides get hit with photons. But not in great amounts. In fact, the exposure to light when an image is taken hardly changes the film at all on a chemical level. Only tiny tiny bits of the silver halide crystals literally just a few molecules here and there were reduced to pure silver in the exposure. That is why the image captured on the film right now is called the latent image. Its chemically there, but not visible yet. Although its not much, the individual halide crystals that were hit with sufficient light now have what you might call a seed of pure silver within them. And a chemical developer will use that seed as a catalyst of sorts and convert the entire crystal (and any others that have that silver seed) into pure silver which will makes it visible. In a somewhat weird way, black and white film is sort of a random distribution of physical one-bit pixels. Yeah, thats kind of a stretch, and might sound weird coming from me given that I made a video on why phosphor dots in color CRTs are decidedly not pixels. But because of how the grain interacts with the developer, whether or not you can see an individual grain in the end is more or less down to whether or not it got hit with light in the exposure. When stepping back and looking at the whole image, the density of the crystals and thus the apparent darkness is affected by how much light hit that spot of the film. Dark areas got hit with a lot of light so most of the grains become activated and developed, whereas light areas had few grains get hit so only a few show up here and there. This is, by the way, the reason faster films tend to be grainier. For a film stock to be more sensitive to light, the halide crystals in the emulsion need to somehow be more prone to undergoing that initial photon-induced reduction reaction. In this world of crystals and photons its all a game of probabilities, and the simplest way to increase the chance that a crystal will undergo sufficient reduction in the exposure is to make it bigger. Making the targets larger means less light is needed to capture a latent image simply because there are more chances for each crystal to be affected given the same amount of incoming light, but the downside is that larger targets limit the resolution of the film because each element of the images underlying structure is physically larger and so there are fewer of them in a given area. So, now that we know those basics, we need to get this film in contact with a chemical which will finish the job and convert the grains with silver seeds into pure silver. But how? We cant expose it to more light or the image will be damaged or destroyed. Well, we use one of these. This is a developing tank and its pretty clever. This lid here is light-tight yet allows liquids to travel through it freely. This is done by creating a simple maze. Since light cant bend around corners, if you create a path with a series of 90 degree turns it wont get through. Make the walls of the path black and you make it even more effective. This arrangement is often called a light trap. Which is annoying because entomologists are clogging up the Googles with that search term. There are a few different designs out there, but the cross-section of this lid looks like this - liquids can easily get around these bends, but light cant. Dead simple yet effective. By the way you can make a doorless entryway to a darkroom using this method but hold your horses were not there yet. Inside the tank are a couple of film reels. This tank can develop up to two rolls of 35mm film at a time, but the reels can be expanded in width to accommodate 120 and other 60mm wide roll film formats at its largest width, and theres also an intermediary width to accommodate 127 film, a not-quite-dead format thats barely hanging on. That film is 46mm wide, by the way. Of course, you still have to get the film onto this reel and into the tank. And that has to be done in complete darkness. Now you can choose to do this in a completely dark room. Heres an approximation of what that looks like. [crinkly shuffling noises] Or you can put the tank, reel, and your film into a changing bag like this. A double-zipper creates a light-proof seal on one end and sleeves with little elastic-lined holes for your arms on the other allow you to fiddle around in there without worrying about light hitting your film. Of course, that seal around your arms isnt perfect by any means so you probably dont want to do this outside in the sun but under most indoor lighting situations its fine. But what are you actually doing in the dark? Well, since Ive already ruined this roll, I can show you. First, though, a note on developing tank styles. Generally theyre divided into stainless steel and plastic tanks, and personally I find plastic tanks the way to go because of these film reels. Theyre self-loading. A simple arrangement consisting of a captive ball bearing and a ramp creates a sort of ratchet mechanism. Film can easily slip past the ball bearing when moving forward, but if it moves backward it rolls the ball bearing up the ramp, causing it to jam the film in place. By allowing each side of the reel to move slightly, a simple repetitive twisting motion is all it takes to load the film. Here is a... blank roll of 35mm film I developed accidentally one time. Because its clear it helps reveal how this works. Each time I move the right side forward, the ball wants to roll backwards but in doing so rides up the ramp and jams against the film. So it pushes the film forward. On the stationary left side, the ball rolls forward as the film moves and so leaves room for it to pass. However, when I return the right side to the original position, the roles are reversed. The film moves back slightly, causing the left-hand ball bearing to roll up the ramp and jam the film in place, and now the right side slips past without issue. Just do this twisting motion a bunch of times and the reel pushes the film onto itself, with the film following these ridges in a spiral to the center. So, for this 120 film all we need to do is unlock the reel, pull the sides apart to their widest position, lock it again, and now its ready to be loaded. One thing I always make sure to do is use a toothpick or something to ensure the ball bearings can move freely - often they get kinda stuck when the reel dries and thats not good. While you werent looking, I wound this destroyed roll onto a second spool so its positioned as if it were run through a camera. And now Ill show you what Im about to do inside this bag. Ill start unrolling the paper and keep going until I get to the actual film. On this end its not taped to the paper. Now Ill carefully grab the end of the film and slide it into the film reel like so. The backing paper always makes this a little chaotic but were gonna do the same twisting motion that we just did and the ball bearing ratchet ramp things will do their magic. Eventually well reach the end and we have to cut off this bit of tape to free the film entirely from the paper. Then we just keep twisting to make sure its completely loaded and its ready to go into the tank. The reel needs to go onto this spool thing before we do that, though - this is actually an important part of the tanks light-tightness, as this pokey bit will go inside of it and form a light maze for the fill hole. Theres a retaining ring that I... cant find right now which you can clamp onto the spool to keep the reel from riding up but I dont really need it because of the style of development I use. Ill talk about that in just a moment but now Ive got to do what I just showed you inside this bag. Gotta make sure I have the film, a reel opened up to the 120 position, a pair of scissors, the tank bottom, the spool doohickey, and the lid all inside the bag. Now Ill zip it up. Zip it up again. Stick my arms in there, and feel around for everything and just get going. Eventually Tada! Film ready for developing. And now well get to Steve Ballmers favorite part. Here are just a few of the many black and white film developers available out there. Weve got the ol mainstay Kodak D-76 (though this pouch is long-expired), Arista Premium film developer, Adox Adonal, and R09 One Shot - those last two are purportedly the same thing. But there are so many more out there, and people have also been making their own concoctions for about as long as film photography has existed. There are even formulations using instant coffee, and so-called caffenol has long been thriving in the homebrew scene. These chemicals have a very delicate balancing act ahead of them. They contain reducing agents which ones exactly will depend on the developer which continue the process of the silver halides reducing to metallic silver, but they need to be selective. Ideally, we only want the developer to reduce the halide crystals that already have that silver seed in them from the exposure to light in the camera. Through various chemical tinkering such as adjusting the pH of the solutions, adding compounds which accelerate the reduction reaction once in-progress but also inhibitors so that it doesnt happen to crystals which dont already have that seed of silver, we arrived at these solutions. Now, when youre using many of these chemicals, you need to look up the specific film stock youre developing to get a development time and adjust for temperature. Just like most reactions more temperature equals more faster, and depending on the films properties (and also whether you want to pull- or push-process the film to a lower or higher equivalent speed) youll have a somewhat narrow time window for best results. Many films have a chart printed on the inside of their box for common developers, but I dont bother with any of this nonsense because I have been enlightened to the world of stand development. It turns out that so long as youre OK with the process taking much longer, as in an hour, you can develop pretty much any film without thinking about it. I enjoy not thinking about things on occasion, especially when it frees me from wondering whether Im doing things the quote unquote best way, so this was right up my alley. This particular developer goes by many names but traditionally its been known by its original name Rodinal. And it is a very old formulation. As in from 1891. Also, it was originally developed by Agfa. Now the One Shot on this bottle might give you a hint about what makes it kinda special. Many other developers are meant to be reused after developing a roll of film. Theyre very concentrated and usually require less than 10 minutes to develop film, so although the reduction reaction they cause does slightly weaken them by way of oxidation, it takes quite a few rolls of film for that to be noticeable. These developers, though, are much more dilute. Well actually in the bottle its very concentrated but you use a very high dilution ratio in water resulting in a pretty weak working solution which is only good for one roll. With the advised 1 to 25 and 1 to 50 dilutions the film development still happens pretty quickly, but if you go to a 1:100 dilution something vaguely magical occurs. With a 1:100 dilution ratio, what the film is and to some extent how you shot it... doesn't really matter. Itll just work. Now this is postulation on my part but I think the reason this is possible is that at such a weak concentration, theres only just enough developer in the solution to attain normal image density before it is all oxidized. Film processed this way in a sense cant be overdeveloped, or at least its really hard to do that, and the long time you leave the film in the solution ensures it will completely reduce pretty much all the crystals that should be while leaving the rest alone. Its pretty great, and will help compensate for underexposure, too, producing an end result that sort of allows you to push process individual frames within a roll. Its not perfect, and Im sure there are photographers out there that would advise against it for one reason or another, but in my experience it has simply always worked no matter what film stock Ive thrown at it (though to be fair thats only been maybe half-a-dozen). And as a bonus, Rodinal is a very shelf-stable formula. This bottle is pushing 10 years old and still works fine. And since you use so little of it with each go, its quite cheap, too. You can develop well over 100 rolls with a half-liter bottle like this. So lets get going. Welcome to this gross utility sink. Generally you want to give your film a rinse before you start developing it. Letting the gelatin soak in some water first helps to ensure development happens uniformly. Also if you noticed the bright blue color of this film, well rinsing it takes that off. I dont know if that is an anti-halation layer which some films have or what exactly it is, but water washes it away pretty quickly. Now, looking at the bottom of the tank, I need to make 590 CCs of solution to completely submerge this reel. Using a 1:100 dilution that would suggest I need about 6 CCs of Rodinal, which is what Ill go ahead and use. There is some nuance here, though. A roll of 120 film is a lot wider than 35mm film, but its also much shorter. A 36 exposure roll of 35mm film has just about the same total area as a roll of 120 film, so using 6 CCs of Rodinal in the solution could actually be more developer than we need. We need more solution in the tank because the reel is much taller, but we might not actually need any more chemical developer in the solution. I have developed a roll of 120 film using only 4 CCs Rodinal, but the negatives were kind of thin - meaning none of the film got very dark. Because of that, and because this film is pretty old, Im going to stick with 1:100 dilution and use 6 CCs. Plus, with stand development you dont agitate much so developer not near the film is probably gonna stay not near the film. I mean this is photography, its more art than science. Ooh thats gonna cause me some grief... So, heres 6 CCs of the developer. Thats really all we need. And now Ill fill this up with water to at least 590ml and we have our working solution. With the film already rinsed, we can simply pour this in, then use the little agitating stick thing that comes with tank to spin the reel back and forth and make sure everything gets sloshed together nicely (you can also put on this lid and invert the tank but that tends to leak a little bit so I prefer this method, also Im missing that retaining ring so Id rather not invert it so much), and last but not least you want to smack the tank against the bottom of the sink or some other hard surface to dislodge any bubbles that might have formed on the film during agitation. Now, just leave it alone for a half hour. Let it stand, hence stand development. This isnt very exciting, but the developers slowly seeping its way into the emulsion and latching onto the crystals which have those tiny silver molecules and finishing the job of reduction into metallic silver. After a half hour is up, agitate it again to ensure whatevers left of working developer can get where it needs to go, and wait another half-hour. Pedants wish for me to inform you that because Ive done that middle agitation, this is in fact semi-stand development. While were waiting, lets talk about fixer. You might have noticed that prior to development, film appears opaque. Thats what all the crystals of undeveloped silver halides look like suspended in the gelatin. Remember how I said in the previous video that fixing got rid of undeveloped halides? Well, watch what happens when I put this bit of film into some fixer. Before long it becomes transparent. With none of the halide crystals converted to silver by the developer, the fixer dissolves them all, leaving nothing but the gelatin base and the plastic backing. However, the fixer cannot dissolve pure silver, so whatever grains were successfully reduced in the development process will stay behind and form the image. Through the magic of video editing, our time is up. Since we used a one-shot developer, well just pour it down the drain. If we were using something like D-76, we would pour it back into the bottle for later use. Now heres an optional step. Stop bath. The reducing agents in the developer require a high pH to work effectively. If you use a stop bath, which is usually just dilute acetic acid, the pH is lowered to the point of stopping any further development action. Now, at the risk of making an opinion known online, I dont think its necessary for pretty much any film development. I just rinse the film with water and move on to fixer. If you were using a film and developer with a really sensitive development time, maybe youd want to use stop bath, but especially because I use stand development I just dont see the point. Also a lot of fixers are acidic so again yeah. Anyway, after rinsing it a few times Ill pour in the fixer. This bottle is nowhere near fresh so Im going to allow the film 12 minutes of fixing time with some agitation every minute. Thats probably way more time than I actually need. How long you should fix depends on your fixer. Ill make up fresh solution at some point. But anyway, just like we saw earlier the fixers making the film all clear-like except for where the developer made it all silvery-like and after were done with this step, we can pour the fixer back into the bottle and start rinsing. At this point the film has been developed. At least I hope so. You want to rinse the film for a good long while to make sure you get as many residual chemicals off of it as possible (well, chemicals other than water). There are products like this which you can hook up to a faucet to make this more effective and less wasteful - Fun fact, this thing is a greedy cup siphon! But since this film isnt super duper important to me, Im just gonna let the water trickle over it for a while, do some swirls, some of these maneuvers, and then theres one last step. Photo-Flo. More generically known as wetting agent, this stuff is basically rinse aid for your dishwasher. In fact Ive often wondered if there would be any harm in just using that. Anyway, its a mild surfactant which lowers the surface tension of water and makes it sheet off of the film in a film so that you dont get water spots. Technically this is optional but if you have hard water you should definitely not skip this. After youre done rinsing, you just add a few mls of the stuff to clean water, swirl the film around in it, then struggle to get it out of the tank because the Photo-Flo made it all slippery, and finally you can open up the reel and retrieve your developed film. This does not look right. Ohhhh. no. Remember how I was saying that this film is awful? Well, yeah. Shouldn't have used it. Now this could simply be because of its age. It expired in 2013 and because the films emulsion was in contact with the backing paper for a decade chemicals in the paper particularly in the ink may have leached into it and made all this nonsense happen. That makes the most sense to me because I cant figure out how else the numbers would have gotten on there. This definitely doesnt look like a light leakage problem and theyre misaligned from where they actually are behind the film when the image is taken. The 1 should be in the bottom-left corner of the first image but its not, suggesting this came from the where the printed numbers touch the film when it's rolled up. Luckily for you I decided to go back out into the wilderness and recreate the shot with a roll of this less-terrible film. And then I did the developing rigmarole again. And heres that film. And I call this is a no-effort video.... Anyway, after hanging it up and allowing it to dry (I usually wait at least a couple of hours) we can handle it, though you still want to be careful. If youre not wearing some sort of gloves you definitely want to not touch any part with an image on it, and are best to handle it by the edges. This is of course a negative image, but theres something about film thats different from the earlier plate-based methods. With film, light is transmitted through it and the silver crystals block that transmission. We dont have to come up with any tricks for making this appear as a positive because this is not the final image. Oh but, because its now, I can just do this. However, there is a trick you can do to make this appear as a positive. And its not too far off from how the Ambrotype makes an apparent positive. Although the silver in transparent films is meant to block light traveling through it, its still silver. With the emulsion side up and the film against a dark background, if you can catch light in just the right way, the silvers shine will come through and make the exposed parts appear brighter than the background. This doesnt work with all film stocks, or at least its much easier to do in some than others, and although its nifty its definitely not the optimal way to view the image. In the next video, well talk about photographic printing. You know those scenes in movies where someone's in a room with a dim red light and they make photos appear in trays of liquid? Yeah. That. Well also talk a little more deeply about 35mm film and some of the factors and innovations that made it become the dominant film format from the latter 20th century into the digital age. And also now. 120 is still alive, but 35mm is still the most mainstream film format. Despite all of Kodaks attempts to come up with something new every decade or so. People rightfully think that Kodak let the digital age sneak up on them... because they did but hey, they were trend chasers back in their day. I mean, just look at 1982s Disc film! I wonder what other thing from 1982 could possibly have inspired that logo reductively smooth jazz By the way, apparently I need to clarify that 120 film... the format. Haaghh! 120 film. The format! Then, I abruptly stopped. And here we are! Dangit. Yeah, thats kind of a [weird, disappointed mouth noises] Whether or not you can see an individual grain... in the end is more or less down to That hesitation shouldnt have been there. ...is more or less did I skip a word? Because it feels like I did. But, because of how grain no! That word is missing from the script. Because of how *the* grain. Gotta remember to put that in. Is more or less down to whether or not IT got HIT with light in the exposure. That. Why? Whether or not you can see an ind GARH But, because of how grain interact (inhales through teeth) This line has taken up like 15 minutes. Just do this twisting motion a bunch of times and the reel pushes the film onto itself. With the film following these ridges in a spiral to the center. [loud grating noises] Could you even hear me over this? Thats a great question. Well find out in the edit! It takes quite a few rolls of film for that to be noticeable. Theres a OK I want to go back in the edit and see if there was a weird noise that I made. I need to remember to do that. If this isnt in the bloopers I forgot. The first time I did the photoshoot of the tea kettle (which was done in a park) someone was walking their dog, saw me, and said hello. Explaining that I had hauled a camping stove, tea kettle, tripod, video camera, and an antique camera all to make a terrible joke on the internet was a little weird. Luckily with the re-shoot nobody saw me.",
    "transcript_keywords": [
        "film",
        "Effort November",
        "light",
        "silver",
        "roll",
        "developer",
        "films",
        "make",
        "reel",
        "crystals",
        "development",
        "image",
        "November",
        "film stock",
        "tank",
        "film reels",
        "film format",
        "Ill",
        "film development",
        "halide crystals"
    ],
    "transcript_entity_values": [
        "1891",
        "Daguerres",
        "Rodinal",
        "12 minutes",
        "early days",
        "1982s",
        "about 35mm",
        "at least 590ml",
        "1",
        "46mm",
        "a decade ago",
        "10 years old",
        "Tada",
        "two",
        "a couple of hours",
        "eBay",
        "Kodaks",
        "the month of November",
        "November",
        "Photo-Flo",
        "6 CCs",
        "Googles",
        "up to two",
        "every minute",
        "Agfa",
        "35mm",
        "Adox Adonal",
        "2013",
        "Kodak",
        "90 degree",
        "Steve Ballmers",
        "less than 10 minutes",
        "the latter 20th century",
        "36",
        "half-liter",
        "another half-hour",
        "first",
        "one",
        "127",
        "well over 100",
        "590 CCs",
        "6 CCs of Rodinal",
        "these days",
        "a decade",
        "1 to 25",
        "1 to 50",
        "their day",
        "One",
        "the Photo-Flo",
        "up like 15 minutes",
        "60mm",
        "1982",
        "120",
        "First",
        "second",
        "a half hour",
        "Ambrotype",
        "Arista Premium"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.12465690821409225,
        -0.08148433268070221,
        0.026762306690216064,
        -0.08508645743131638,
        0.08028429001569748,
        -0.01949039101600647,
        0.04932766407728195,
        0.027527963742613792,
        0.031034303829073906,
        -0.02838730439543724,
        -0.028147736564278603,
        -0.004289321601390839,
        0.0008405253174714744,
        0.05108801648020744,
        -0.06639877706766129,
        0.0028398267459124327,
        0.019214682281017303,
        -0.07870181649923325,
        -0.04638354480266571,
        -0.04873951897025108,
        0.01918555609881878,
        -0.10158362984657288,
        0.029758475720882416,
        -0.01651369407773018,
        0.06466815620660782,
        0.018853316083550453,
        -0.00919326487928629,
        -0.003955588676035404,
        0.00048203786718659103,
        -0.032445695251226425,
        -0.05313793569803238,
        0.09645918011665344,
        0.008671659044921398,
        -0.00724788848310709,
        0.004701308440417051,
        -0.010749740526080132,
        0.008655723184347153,
        -0.00997073296457529,
        -0.08182398229837418,
        -0.04785791411995888,
        0.0066459039226174355,
        -0.049107737839221954,
        0.04529580473899841,
        0.0003550419060047716,
        0.01339150220155716,
        -0.0251908116042614,
        0.0919828936457634,
        -0.06155964732170105,
        -0.03455944359302521,
        -0.06696218252182007,
        -0.10881152749061584,
        -0.04066596180200577,
        -0.024828922003507614,
        0.005373666994273663,
        -0.03994916379451752,
        -0.012094298377633095,
        0.019709432497620583,
        -0.011675192974507809,
        0.03470957651734352,
        0.024603966623544693,
        0.028010480105876923,
        -0.03012736514210701,
        -0.01721200905740261,
        0.0738159567117691,
        0.08048607409000397,
        0.025493398308753967,
        0.009332158602774143,
        0.0060294861905276775,
        0.019940348342061043,
        -0.11456388980150223,
        -0.09249905496835709,
        0.020842645317316055,
        -0.02429432049393654,
        0.005656796507537365,
        -0.010917775332927704,
        -0.0030345988925546408,
        0.03140158951282501,
        0.016429297626018524,
        0.025439370423555374,
        -0.12061966955661774,
        0.10693050920963287,
        -0.04525458440184593,
        -0.033697713166475296,
        0.007598356809467077,
        -0.00955452211201191,
        0.10173594951629639,
        0.012532372958958149,
        0.006824611686170101,
        -0.042151808738708496,
        0.006014206912368536,
        -0.0666319727897644,
        0.02785056084394455,
        0.0017279318999499083,
        0.033082108944654465,
        0.0043820892460644245,
        -0.10065236687660217,
        -0.008990190923213959,
        -0.09867670387029648,
        0.018800344318151474,
        0.0634521096944809,
        -0.018994353711605072,
        -0.03289194405078888,
        0.025744598358869553,
        -0.028470566496253014,
        -0.05397924408316612,
        -0.010937495157122612,
        0.030444994568824768,
        0.09054495394229889,
        0.07504044473171234,
        0.050546422600746155,
        -0.04225344583392143,
        0.04408690705895424,
        -0.04540032148361206,
        -0.030722396448254585,
        0.025752607733011246,
        -0.028262600302696228,
        -0.04908713325858116,
        0.03130188584327698,
        0.060873907059431076,
        -0.0849674642086029,
        -0.01892721652984619,
        -0.018139412626624107,
        -0.12529346346855164,
        -0.0599227137863636,
        0.07038886845111847,
        -0.10164405405521393,
        -0.08803370594978333,
        5.8220093592457496e-33,
        0.07418441772460938,
        0.10715756565332413,
        0.06644681096076965,
        0.029577162116765976,
        -0.004431718960404396,
        0.046395838260650635,
        -0.013254973106086254,
        0.00898877065628767,
        -0.08988339453935623,
        -0.05290616303682327,
        0.0205382052809,
        -0.04055323824286461,
        -0.042889438569545746,
        0.05171087756752968,
        -0.01796014793217182,
        -0.06752452254295349,
        -0.07537002861499786,
        -0.014276606030762196,
        -0.020409634336829185,
        -0.008996734395623207,
        -0.05142170190811157,
        0.015234436839818954,
        -0.04430138319730759,
        0.017254561185836792,
        -0.02213502675294876,
        -0.041657984256744385,
        -0.018802635371685028,
        0.02264086902141571,
        0.07640981674194336,
        0.028494101017713547,
        -0.04048772528767586,
        0.0936829224228859,
        0.04678460583090782,
        -0.03536501154303551,
        0.012342117726802826,
        -0.0695917159318924,
        -0.06229443475604057,
        -0.12059708684682846,
        0.00728088803589344,
        0.05249034985899925,
        0.0061508966609835625,
        0.045119818300008774,
        -0.06015729159116745,
        0.020901130512356758,
        -0.00927808415144682,
        0.039013899862766266,
        0.08284799009561539,
        0.027294540777802467,
        -0.027088232338428497,
        0.06550835072994232,
        0.004526528995484114,
        0.02163863368332386,
        -0.005781431682407856,
        -0.07727706432342529,
        0.011883505620062351,
        0.015200966037809849,
        0.01565924473106861,
        -0.07912103086709976,
        0.016249220818281174,
        -0.015338465571403503,
        0.03924188390374184,
        0.07811348140239716,
        -0.06968631595373154,
        -0.007931694388389587,
        -0.12701095640659332,
        0.03938679397106171,
        0.06683476269245148,
        0.06175624579191208,
        -0.029721619561314583,
        0.06999561935663223,
        -0.041987620294094086,
        0.03341464698314667,
        -0.0007806025678291917,
        -0.039742179214954376,
        0.015944045037031174,
        0.025585444644093513,
        -0.076149582862854,
        0.04677095636725426,
        0.0428900308907032,
        0.08181611448526382,
        -0.03823104128241539,
        -0.029546797275543213,
        0.018783388659358025,
        -0.049434129148721695,
        0.007601363118737936,
        -0.030415192246437073,
        -0.007367243990302086,
        -0.06402889639139175,
        0.022482946515083313,
        0.023013727739453316,
        -0.010845227167010307,
        -0.06559338420629501,
        0.012099860236048698,
        0.04491348937153816,
        -0.04410555213689804,
        -5.646817721961027e-33,
        -0.018699826672673225,
        0.011335299350321293,
        -0.06487323343753815,
        -0.0059333560056984425,
        -0.025913119316101074,
        -0.04873211681842804,
        0.063092902302742,
        0.004953029099851847,
        0.1428007334470749,
        -0.04399550333619118,
        0.06484813988208771,
        0.010597635060548782,
        -0.07748609036207199,
        -0.049563366919755936,
        -0.09019538015127182,
        -0.09371939301490784,
        0.06438318639993668,
        -0.06407786160707474,
        -0.05578979104757309,
        -0.0007049903506413102,
        0.06137954443693161,
        -0.008084960281848907,
        -0.03778800368309021,
        0.021287372335791588,
        0.019110577180981636,
        0.06087210029363632,
        0.05932754650712013,
        0.04124176502227783,
        0.019157126545906067,
        0.026380887255072594,
        0.011497348546981812,
        -0.03971126675605774,
        -0.05534033104777336,
        -0.02072017267346382,
        0.020281538367271423,
        0.014741200022399426,
        0.10458071529865265,
        -0.05491821840405464,
        -0.022444698959589005,
        -0.05652570724487305,
        0.013345814310014248,
        0.06417126953601837,
        -0.0362880676984787,
        -0.012818503193557262,
        -0.009656897746026516,
        0.004563011694699526,
        -0.022103743627667427,
        -0.005628208164125681,
        -0.09391175955533981,
        0.05274617671966553,
        0.012982072308659554,
        0.05508067086338997,
        0.06463401019573212,
        -0.07802244275808334,
        -0.0018915721448138356,
        -0.017489124089479446,
        -0.011794270016252995,
        0.0625285804271698,
        0.10551243275403976,
        0.03502500802278519,
        0.05889919772744179,
        -0.014332068152725697,
        -0.09243672341108322,
        -0.020009741187095642,
        -0.027084901928901672,
        0.013517974875867367,
        0.019231153652071953,
        0.11262309551239014,
        -0.0373639315366745,
        0.009730960242450237,
        0.03688390180468559,
        -0.03458482772111893,
        -0.014895456843078136,
        -0.04444247484207153,
        -0.006627453025430441,
        -0.06373821943998337,
        -0.01026076264679432,
        0.010549157857894897,
        -0.020990662276744843,
        0.05836821720004082,
        -0.005766470450907946,
        0.02871757186949253,
        0.10791400074958801,
        0.04420909658074379,
        0.0924188569188118,
        0.1262197345495224,
        0.020438238978385925,
        0.01886441372334957,
        -0.005006900988519192,
        0.05104302987456322,
        -0.07834938913583755,
        0.027712678536772728,
        0.018035955727100372,
        0.09787711501121521,
        0.048142530024051666,
        -6.849578682022184e-08,
        0.012910607270896435,
        0.020057130604982376,
        -0.010107768699526787,
        -0.06295764446258545,
        0.004781554918736219,
        -0.08323483169078827,
        0.015334196388721466,
        0.05980653688311577,
        0.06847815960645676,
        -0.04072051867842674,
        -0.03942371904850006,
        -0.032714325934648514,
        -0.0491148941218853,
        0.043961912393569946,
        0.12043469399213791,
        0.041943103075027466,
        -0.07787204533815384,
        0.002769740531221032,
        -0.023885931819677353,
        -0.05015340447425842,
        -0.023678606376051903,
        -0.006355553865432739,
        0.07901553064584732,
        0.007373203057795763,
        -0.03260479122400284,
        0.07152913510799408,
        0.024182680994272232,
        -0.02667647786438465,
        -0.006279427092522383,
        -0.0006456465926021338,
        -0.04018273204565048,
        0.018574215471744537,
        -0.01888931356370449,
        -0.024679036810994148,
        0.022738054394721985,
        -0.021591901779174805,
        -0.0004604665737133473,
        0.012385581620037556,
        0.043522175401449203,
        0.06276140362024307,
        -0.056206222623586655,
        -0.030914556235074997,
        0.08470454812049866,
        0.06755088269710541,
        0.09037894010543823,
        0.07501816004514694,
        0.014871989376842976,
        -0.04354506731033325,
        -0.05390211567282677,
        -0.08604439347982407,
        0.00047820108011364937,
        0.01844978891313076,
        -0.08072681725025177,
        0.03390846028923988,
        0.07475466281175613,
        -0.03475774824619293,
        0.0767555981874466,
        0.0640500858426094,
        -0.03675355762243271,
        0.07440882921218872,
        0.08897337317466736,
        0.00037268863525241613,
        0.043438155204057693,
        0.039579059928655624
    ]
}