{
    "id": "wpWFV41U5Wk",
    "title": "The iPhone 13 Pro Max has TWO Secrets inside?! - Teardown!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-10-08T13:45:02Z",
    "video_url": "https://www.youtube.com/watch?v=wpWFV41U5Wk",
    "category": "Howto & Style",
    "tags": [],
    "views": 6315896,
    "likes": 182639,
    "comments_count": 7896,
    "description": "Its time to take apart the new iPhone 13 Pro Max! Grab a Teardown skin for your phone HERE:  Apple releases a new phone  every single year. This time around Apple has hid a few Easter eggs inside the iPhone 13 pro max. The iPhone 13 is the latest series of phones from Apple, and you know we have to take them apart, even if the improvements are incremental. Have you ever gotten your phone repaired? or repaired it yourself? Let me know down in the comments.   Grab a charger for your new iPhone here:    Anker is named as the Official Charging Partner of JerryRigEverything:    Watch the iPhone 13 Pro Max Durability Test HERE:   Get my razor knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/teardown",
        "https://ankerfast.club/3CaoixW",
        "http://ankerfast.club/JREpartnership",
        "https://youtu.be/L2gT8fbEq54",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "iPhones. Today in front of us we have the iPhone 13 Pro Max. And this is the part of the intro where I convince you that there's something super new and super cool inside to check out. Even though it suspiciously looks like an iPhone 12. Well, there's definitely something super new and cool to check out, that's for sure. And now you're wondering if that was a joke or if it's really true. Or maybe I'm just killing time because these phones are a royal pain to take apart. Let's get started. [Intro] Let's be honest, Apple does some really good things like marketing or building ecosystems. But making their phones easy to repair is not one of them. In fact, Apple goes out of their way to make their phones hard to fix. It's like a really not fun game that Apple's been playing since day 1. And the people who lose are the customers and the planet. The iPhone 13 Pro Max has two pentalobe screws down at the bottom, just like usual. And then with heat and suction the screen can start to lift up and out of the stainless steel housing. This is much harder than it looks by the way, since the screen is flush with the frame. It's hard to get a good grip on that screen without breaking it, especially since glass is glass and we know what happens to glass. Keep in mind that if you ever crack the back glass on your iPhone 13 Pro Max, Apple will charge you $599 to replace it. Luckily, larger phone repair shops probably have a laser glass remover by now. So if you don't want to play Apple's game, or don't have insurance, you can always go with one of those. Now that we have the screen off, feel free to feast your eyes on these internals. It's interesting that Apple has taken time to print the A15 Bionic text on the motherboard, paying extra to print in a place that nobody is supposed to see, unless Apple's counting on people seeing it during my teardown, and by displaying that A15 Bionic branding, it brings awareness to Apple's proprietary chip manufacturing capability to millions of people using my videos, which they hate, to their own advantage. Well played, Tim, well played. I'll check the screen to make sure we didn't' toast anything. Out of warranty screen repairs are about $329 from Apple, by the way. Like the back glass, it's priced in a way that will coerce customers into getting a new phone instead of just fixing their old one...Basically off setting all the eco-friendly progress Apple's made in other areas. Not my favorite. Right underneath the A15 Bionic (I fell for it), are three tri point screws holding down the metal plate over the battery connector. I'll unplug that battery, just like a little Lego, along with the screen ribbon. The top screen ribbon is held in place by two more uncommon tri point screws, and switching screwdriver bits another time, two more Phillips head screws. We have currently used three different screwdriver bits on 9 screws. See what I mean by Apple making this difficult. If you don't keep your screws organized, it's game over. With the display removed, the screen is actually pretty thin. Apple's still using the OLED display on these new phones. They are calling it super retina. The ribbon cable on the top contains a microphone proximity sensor and light sensor up inside that top notch. The cameras and earpiece are still left inside of the phone body. Speaking of which, there are two more screws holding down a third metal plate just south of that A15 Bionic. East of the A15 Bionic we have a super large metal plate covering up the camera unit with it's 5 screws. To keep the screws organized, I lay out the screws around the metal plates on my table and then just try not to sneeze for the rest of the repair. I'll get a close up shot of the insides of this iPhone 13 Pro Max. Feel free to bump up your resolution to 4K, screenshot this, crop it, and set it as the background of your phone. That way you too can advertise the A15 Bionic. I mean, to be fair, it does look pretty cool. Continuing on. There are two more Lego-style ribbon connectors in charge of the camera units. And this is where things have changed...ever so slightly...from last year's model. The sensors are slightly larger, taking up a good portion of the phone. And yeah, we have the 12 megapixel three times telephoto lens, sticking up like Everest, with OIS. Then we have the 12 megapixel ultrawide over here in the middle which does not have OIS. And finally, we have the 12 megapixel main camera here on the bottom, which Apple says has something called sensor shift OIS. But as you can clearly see, the lens itself is not moving. Instead of moving the camera lens like every other smartphone manufacturer goes with their cameras, Apple has decided to stabilize the internal sensor. Let me show you how that works. It might sound like I'm praising Apple here for a second, because I am, but I promise I'll keep it short. Like usual, all of the cameras are locked together inside of the same housing, which makes switching between all three perspectives in the camera app much faster and more seamless. But it also means we need to resort to catastrophic analysis to see what's going on. Quick question though, do you remember those old school Lego Bionicles? I'm not sure what reminded me of those. But anyway, back to the camera. With the rear removed so we see that sensor inside it's actually shifting around in the housing. The reason this is better or more efficient is that the sensor is much lighter than the lens. It weighs less so it's much easier to move around and therefore quicker. Apple's new sensor shift technology can stabilize an image 5x faster than regular lens optical image stabilization. Last year this tech was only available on the iPhone 12 Pro Max, but this year Apple has applied the floating sensor tech to the main camera sensor of all 13 variants. You can see the four large magnets that manipulate the sensor inside of the lens. And on the sensor side are the little copper pads at each corner that can be moved by the magnetic field. Tiny, tiny tech, but makes for a pretty cool system. Large professional cameras have been using this kind of stabilization for a while now, like on the inside of my GH5. This is the same camera I used to film my videos with. The sensor moves around inside of the housing, and as far as I know, Apple is the only smartphone manufacturer to implement this style of stabilization into a smartphone. Nice work, Apple. Thumbs up for that. I'll put the sensor back into the lens. It'll be interesting to see if this thing still works when I put the whole thing back together again. One thing I'm pretty proud of actually is that we managed to incorporate that sensor shifting camera lens hardware into my Teardown Skin. And since the hardware exists in all iPhone 13 models, each one of them will have the copper accents around the main camera. I think we did a pretty good job. I'll put a link down in the description so you can grab a Teardown Skin for your own phone. Let's go deeper. To remove the motherboard, I'll unsnap, snap, snap, snap, snap, snap, snap, snap, snap, snap off 10 more ribbon cables. Just like an entire box of Legos. Pop out the SIM card tray and remove two large standoff screws with our fourth screwdriver bit. And this is it. The entire brains of the iPhone 13 Pro Max. Double stacked soldered together motherboards. Super consolidated. For some reason I can't remember the name of Apple's processor though. I think it was B14 cryogenic. I'm not good with names...but wait, there's more. A fourth camera, a lidar camera, is also sitting inside of the massive rear camera lens. Apple mostly uses this guy for low light auto focusing. Up at the top of the phone we can remove three more screws, pop off a little metal thingy, and remove a fourth standoff. And then our loudspeaker is free, along with the front facing cameras that are tucked underneath that speaker. These cameras make up the face ID scanning stuff with a dot projector and infrared camera. The regular 12 megapixel front facing selfie camera does have electronic stabilization. Down at the bottom of the iPhone 13 we have 12 more screws. Once those are gone there's a piece of tape holding down the loudspeaker to the taptic engine. Apple's fancy word for vibrator that provides haptic feedback. I'll make a dedicated video about vibrators at some point in the future. This little guy actually does some pretty cool things. At first glance the iPhone 13 Pro doesn't appear to have any balls inside that bottom loudspeaker. But if you stab it in just the right place we can indeed see the little guys. These provide more surface area inside the speaker for the sound to reverberate off of, making the speaker sound larger than it actually is. The charging port ribbon is the last ribbon down here at the bottom of the phone. And if we count there are another 8 screws spread out all over, even sticking sideways into the frame. It's pretty crazy in here, so much so in fact that all of these little bumps on the charging port ribbon say 'Apple uses too many screws' in Chinese braille. It's funny cuz you don't know if I'm joking or not, and Tim Cook's probably going to go check. Finally, the battery. [Stretching plastic sounds] Which does have magical pull tabs. [Stretching plastic sounds] Apple has expanded the battery capacity just slightly this year. And these pull tabs are the only repairable thing about this phone. Watch them be gone next year. With these two pull tabs pulled, we can lift up the battery to find two much smaller pull tabs up at the top, which we could have also enjoyed but I didn't see them. This year's iPhone 13 Pro Max has 4,325 milliamp hours. Pretty solid increase over last year's 3,687. For reference, I still need about 6,000 of these batteries to match the capacity of the electric hummer I'm building. Finally, the last layer of coolness inside of the iPhone 13 Pro Max is the wireless charging and magnets on the back. You can see the copper coils and outlines of the 20 magnets, and like, I don't want to show off, but it's all identically mirrored on my Teardown Skin from outside the phone. I'll throw down some double sided tape to keep the battery from jiggling around after it's put back together. Assembling this thing is basically exactly like the nightmare you'd expect it to be. While putting the bottom loudspeaker back into the phone I discovered that the balls are leaking everywhere. A little piece of tape will solve that problem. Another real problem though is that let's say you want to replace anything in here, the battery, the screen, or the cameras, you'll get perpetual warning messages saying that you're not using genuine Apple components, even if the components you used were harvested from a genuine Apple phone. Apple has tied every individual component to the phone it was created with, and with that capability is one step away from blocking all third party repairs, which is insane. No other industry is like this. I can change the tires on my car, or my windshield, my oil, alternator, or exhaust, or my graphics card in my computer, the memory sticks, or the colored fans. I can fix those things because I actually own them. But if I can't replace the components inside of my own iPhone without daddy Apple's permission, do I really own my iPhone? I think not. Apple still owns the iPhone you thought you paid for. Yeah, putting a case or screen protector on your phone can prolong its life and avoid paying Apple's exorbitant repair prices, but I think we can all agree it's a little messed up, especially when these phones are costing as much as my first car. Personally, I was able to harvest parts from a broken Note 10 Plus to keep my own phone around for a few more years. And Apple is doing everything they can to prevent that same situation with their phones. Apple sells about 200 million phones a year, so repairing them is a big deal. And yeah, they'd sell a few less if they allowed repairs, but it would be much better overall for your wallet and the planet if they did. It's hard to take any of Apple's environmental recycling progress seriously when they aren't doing the reducing and reusing parts first. The broken camera is in place, along with the screen. And all the metal plates are screwed down next to the A15 Bionic. And to everyone's surprise, including my own, everything still works. Sometimes you'll need to plug it in to get the screen to power up. Anker is the official charging partner of Jerry Rig Everything, so I use their fast chargers and cables. I'll get the two pentalobe screws back into the base of the phone. And even more surprising than the phone still turning on is that the bus setup module is actually still functioning, even after having ripped the sensor away from the lens. To double check, I can put my finger over the lowest lens, the one we destroyed, and it's still seeing my finger. Kind of mind blowing. The phone can definitely survive repairs if Apple would just let them happen. Have you ever repaired your own phone or had it repaired? Let me know down in the comments. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Apple",
        "Pro Max",
        "phone",
        "camera",
        "iPhone",
        "screws",
        "sensor",
        "Pro",
        "screen",
        "inside",
        "Max",
        "Bionic",
        "lens",
        "phones",
        "cameras",
        "Apple phone",
        "camera lens",
        "back",
        "snap",
        "genuine Apple phone"
    ],
    "transcript_entity_values": [
        "Anker",
        "4,325 milliamp hours",
        "iPhone",
        "9",
        "8",
        "Lego",
        "Instagram",
        "four",
        "Jerry Rig Everything",
        "two",
        "20",
        "Pro Max",
        "three",
        "all 13",
        "Chinese",
        "Legos",
        "12 megapixel",
        "599",
        "4",
        "Phillips",
        "Lego Bionicles",
        "SIM",
        "A15 Bionic",
        "the A15 Bionic",
        "Bionic",
        "10",
        "next year",
        "last year's",
        "this year",
        "Everest",
        "5",
        "year",
        "Apple",
        "3,687",
        "millions",
        "Last year",
        "about $329",
        "second",
        "first",
        "Tim",
        "about 6,000",
        "B14",
        "12",
        "third",
        "Today",
        "fourth",
        "GH5",
        "One",
        "Tim Cook's",
        "about 200 million",
        "iPhones",
        "13",
        "one",
        "Twitter",
        "a few more years"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "LOC",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.12991204857826233,
        0.07718918472528458,
        0.020166676491498947,
        -0.06969175487756729,
        0.007802961859852076,
        -0.02617870829999447,
        -0.008453448303043842,
        0.04502037912607193,
        0.007712983526289463,
        0.036297671496868134,
        0.1297781616449356,
        -0.0057099927216768265,
        -0.048222221434116364,
        0.05077245086431503,
        -0.018022798001766205,
        0.010898584499955177,
        0.02641637995839119,
        -0.012192316353321075,
        -0.09692777693271637,
        0.04909013211727142,
        -0.05103246495127678,
        -0.03920625522732735,
        0.09129820764064789,
        -0.039942819625139236,
        0.01008391659706831,
        0.07596567273139954,
        -0.035698842257261276,
        -0.03730229288339615,
        -0.05117163062095642,
        -0.07652152329683304,
        0.032540980726480484,
        0.0045799254439771175,
        0.006074659060686827,
        0.050712570548057556,
        0.09281987696886063,
        -0.004141383804380894,
        -0.0068602049723267555,
        0.0294658113270998,
        0.010456345044076443,
        -0.03698856383562088,
        -0.02358740195631981,
        0.02080557681620121,
        -0.02307029627263546,
        -0.0019249251345172524,
        0.014664347283542156,
        0.004752331413328648,
        0.023744892328977585,
        -0.02242920733988285,
        0.02989138476550579,
        0.038286708295345306,
        0.02610684745013714,
        0.04007165879011154,
        0.043679289519786835,
        0.0562315359711647,
        -0.03794794902205467,
        0.020486440509557724,
        -0.024400178343057632,
        -0.008217964321374893,
        0.07587400823831558,
        -0.023309333249926567,
        0.025749795138835907,
        0.047862499952316284,
        -0.023906350135803223,
        0.04255765676498413,
        -0.03379824012517929,
        -0.04121393337845802,
        -0.02620033733546734,
        -0.03322802484035492,
        -0.08309794217348099,
        0.03276468440890312,
        -0.06651116907596588,
        0.017080390825867653,
        -0.0174007136374712,
        -0.013074160553514957,
        0.03791624307632446,
        0.07364220917224884,
        -0.03458961471915245,
        0.041519541293382645,
        -0.08795278519392014,
        0.03752784803509712,
        0.02517654374241829,
        -0.022545482963323593,
        0.002152777509763837,
        -0.012769415974617004,
        0.06870818883180618,
        -0.006873459089547396,
        -0.023056214675307274,
        0.08000756055116653,
        -0.05561294034123421,
        -0.0624183714389801,
        0.004296555183827877,
        0.09255776554346085,
        -0.044860389083623886,
        -0.04275420308113098,
        -0.02047177217900753,
        -0.009427442215383053,
        -0.10964161157608032,
        -0.06360331177711487,
        -0.054608333855867386,
        0.04331564903259277,
        0.06881121546030045,
        -0.04353814199566841,
        0.021563062444329262,
        -0.09832632541656494,
        0.08249706774950027,
        -0.06826569885015488,
        -0.1031070277094841,
        0.0012782476842403412,
        0.0917578637599945,
        0.024956287816166878,
        0.043372299522161484,
        0.0014417580096051097,
        -0.013760004192590714,
        -0.028633762151002884,
        0.06732538342475891,
        0.07986391335725784,
        -0.11451246589422226,
        0.09441074728965759,
        0.1354653537273407,
        -0.012943710200488567,
        0.04706526920199394,
        0.002408357569947839,
        -0.06982573866844177,
        0.005448424257338047,
        -0.03425244614481926,
        0.03708707168698311,
        -0.027463939040899277,
        4.123047170193143e-33,
        0.08147169649600983,
        0.10448628664016724,
        -0.011785968206822872,
        0.03495963662862778,
        -0.07344420254230499,
        -0.017436718568205833,
        0.05910935252904892,
        0.05917086452245712,
        -0.011509697884321213,
        -0.0158851258456707,
        -0.009524648077785969,
        0.0015492609236389399,
        -0.010989001020789146,
        -0.0341215506196022,
        0.01897224597632885,
        -0.05032150074839592,
        -0.033804021775722504,
        -0.08480247110128403,
        0.020499030128121376,
        -0.02148733288049698,
        -0.03840620815753937,
        -0.03408201038837433,
        0.012428606860339642,
        0.014688878320157528,
        0.039389483630657196,
        0.05826856568455696,
        0.10707072168588638,
        0.024698609486222267,
        -0.021607115864753723,
        0.015265552327036858,
        -0.07159164547920227,
        0.029492005705833435,
        0.0518849715590477,
        0.08824259787797928,
        -0.10079159587621689,
        0.0770014151930809,
        0.08710109442472458,
        -0.086998350918293,
        0.061269085854291916,
        -0.026704875752329826,
        -0.02878103032708168,
        -0.008877201937139034,
        -0.0234981719404459,
        -0.025621751323342323,
        0.050711702555418015,
        0.01920568384230137,
        -0.02296867035329342,
        -0.005984759423881769,
        -0.026536308228969574,
        -0.07517700642347336,
        -0.02449899911880493,
        -0.11292798072099686,
        0.005305924918502569,
        -0.04274078831076622,
        -0.13274672627449036,
        0.026266632601618767,
        0.006805265322327614,
        0.010621355846524239,
        0.03845800459384918,
        0.08223306387662888,
        0.03684838116168976,
        -0.06066497787833214,
        -0.07032129168510437,
        0.12138155102729797,
        -0.0647289976477623,
        -0.005869958084076643,
        -0.01968367025256157,
        0.04782090336084366,
        -0.08298986405134201,
        0.0942230299115181,
        -0.05440452694892883,
        0.05743628367781639,
        0.003806535853073001,
        -0.04453090578317642,
        -0.0010513999732211232,
        0.024794327095150948,
        -0.023149991407990456,
        0.01986696943640709,
        0.00841822661459446,
        -0.022016117349267006,
        -0.05450378730893135,
        0.062417492270469666,
        0.0724714994430542,
        -0.0037882914766669273,
        -0.03706017881631851,
        -0.05634694546461105,
        -0.06075228378176689,
        -0.02475239522755146,
        0.07696618139743805,
        0.032821688801050186,
        -0.016005752608180046,
        -0.02713206596672535,
        -0.08629273623228073,
        -0.057674724608659744,
        0.02111213468015194,
        -6.1512759798286266e-33,
        0.014807328581809998,
        -0.02086835540831089,
        0.002311237156391144,
        -0.0199448149651289,
        0.027648642659187317,
        -0.05688087269663811,
        0.06444507837295532,
        0.08482147753238678,
        0.01590080000460148,
        -0.09101393073797226,
        -0.02555440552532673,
        0.039639029651880264,
        -0.005007030908018351,
        -0.043968912214040756,
        0.022283965721726418,
        -0.03382774814963341,
        -0.06243350729346275,
        -0.05532875284552574,
        0.08890579640865326,
        0.02486392855644226,
        0.044114258140325546,
        0.05276994779706001,
        0.04296829551458359,
        0.04129250720143318,
        -0.016575071960687637,
        -0.02161995694041252,
        0.040024131536483765,
        -0.026570336893200874,
        0.08020316064357758,
        -0.019135063514113426,
        0.025475937873125076,
        -0.12163320183753967,
        -0.02523121051490307,
        0.04791402071714401,
        -0.011300846002995968,
        0.06342702358961105,
        -0.009022677317261696,
        -0.05495136231184006,
        0.036058686673641205,
        -0.040455564856529236,
        0.01685166172683239,
        0.0071988957934081554,
        -0.020648501813411713,
        -0.02410299703478813,
        0.024423444643616676,
        -0.05028428137302399,
        -0.015980852767825127,
        -0.040308717638254166,
        0.014474311843514442,
        0.02886120416224003,
        -0.08107927441596985,
        -0.03777959197759628,
        -0.005499070975929499,
        0.05318688973784447,
        -0.12007243186235428,
        0.005515938624739647,
        0.05897778645157814,
        -0.07485295832157135,
        0.005474240984767675,
        -0.026414524763822556,
        0.11362376809120178,
        0.09114130586385727,
        -0.015625637024641037,
        -0.01527862623333931,
        -0.10068713128566742,
        -0.037595003843307495,
        0.04204156994819641,
        -0.048560068011283875,
        0.01880975440144539,
        0.06897878646850586,
        -0.026661943644285202,
        -0.0303866695612669,
        -0.05691247060894966,
        -0.06999235600233078,
        -0.020294375717639923,
        0.03201774135231972,
        -0.07214035838842392,
        -0.018675288185477257,
        -0.053973238915205,
        -0.06048683822154999,
        0.03925513103604317,
        0.016462944447994232,
        0.030460232868790627,
        0.01131687592715025,
        0.09374994039535522,
        0.035255514085292816,
        0.06752483546733856,
        0.04334636777639389,
        -0.026287417858839035,
        -0.0009950321400538087,
        -0.0717383623123169,
        -0.009127728641033173,
        -0.057685017585754395,
        0.10457208752632141,
        -0.0879141166806221,
        -5.458032958927106e-08,
        0.02370929718017578,
        0.032245807349681854,
        -0.015075904317200184,
        -0.050864528864622116,
        0.08176995068788528,
        0.0016605780692771077,
        0.005227255169302225,
        0.027606889605522156,
        0.024807138368487358,
        -0.0596151128411293,
        -0.051629528403282166,
        -0.05005846172571182,
        0.005504184868186712,
        0.02043025754392147,
        -0.02884754166007042,
        0.055608298629522324,
        0.020756855607032776,
        0.00946725532412529,
        0.011077143251895905,
        -0.013538392260670662,
        -0.11114553362131119,
        0.06482413411140442,
        0.03650711476802826,
        -0.04390610381960869,
        0.015927793458104134,
        0.05467104911804199,
        -0.1056862473487854,
        0.026607085019350052,
        0.06171979010105133,
        -0.02328963577747345,
        -0.03087565489113331,
        -0.03467576205730438,
        0.013478010892868042,
        -0.02525644749403,
        -0.03800196200609207,
        -0.0030857734382152557,
        -0.0517614409327507,
        -0.02776164561510086,
        0.08864165097475052,
        -0.014855357818305492,
        0.00316569022834301,
        -0.05309096351265907,
        -0.01984994113445282,
        0.02418942004442215,
        -0.03202233090996742,
        -0.05192261189222336,
        0.048230402171611786,
        -0.12424110621213913,
        0.011300778947770596,
        0.08675417304039001,
        -0.039363741874694824,
        -0.029977599158883095,
        -0.039341431111097336,
        -0.023291032761335373,
        0.009099379181861877,
        0.01527207437902689,
        0.01010933704674244,
        -0.006975079886615276,
        -0.01866316609084606,
        -0.02971048466861248,
        0.07716477662324905,
        -0.08308923989534378,
        0.02923760376870632,
        0.06099025905132294
    ]
}