{
    "id": "WqY1ZNTaHyo",
    "title": "Quest Pro review: stay out of the Metaverse",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-11-22T15:10:20Z",
    "video_url": "https://www.youtube.com/watch?v=WqY1ZNTaHyo",
    "category": "Science & Technology",
    "tags": [
        "meta quest pro",
        "quest pro review",
        "oculus quest pro",
        "meta quest pro review",
        "quest pro vr",
        "meta quest pro gameplay",
        "meta quest pro vr",
        "meta quest pro vr headset",
        "quest 2 vs quest pro",
        "quest pro unboxing",
        "quest pro vs quest 2",
        "quest pro hands-on",
        "meta quest pro passthrough",
        "virtual reality",
        "meta quest pro face tracking",
        "quest pro setup",
        "quest pro price",
        "quest pro hands on",
        "meta quest pro unboxing",
        "vr",
        "tech"
    ],
    "views": 197688,
    "likes": 4367,
    "comments_count": 479,
    "description": "The Meta Quest Pro is a business-oriented virtual reality headset with face tracking and passthrough mixed reality, designed to kickstart Meta's Metaverse vision. But with clunky software and limited applications for its big new features, it doesn't capture the Quest 2's magic. #questpro #meta #vr   Read more:   0:00 Intro  0:39 State of Meta 1:22 What is Quest Pro? 1:42 Quest Pro Specs & Controllers 2:13 Headset hardware and accessories (wings & mask)  2:50 Whats new? Cameras, color passthrough, face tracking 3:58 Eye tracking, foveated rendering, MR  4:42 Meta Workrooms 6:56 Meta Horizon Worlds 9:12 Chat with Adi Robertson, Alex Heath and Nilay Patel  11:32 Quest Pro hardware (comfort, battery life, screen) 12:30 Conclusion  Shop The Verge's merch here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/3Xlz93k",
        "https://shop.theverge.com/",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Imagine a future where your workplace is virtual. You don't need a big screen display because you can put virtual monitors anywhere. Instead of a set of Zoom squares, you can meet your colleagues in a virtual beach side resort where your avatars will reflect your real face. It can feel just like coming into the office but from the comfort of your home. - And then I've lost my hands again. Hey, I got my hands back. (Nilay laughs) I'm gonna be honest with you, Adi. I hate this. I hate it more than anything. - I feel so beaten down by the software. The Meta Quest Pro is supposed to be a big leap forward for the company, formerly known as Facebook. Meta has lost 9.4 billion this year on virtual and augmented reality, or the so-called metaverse. And since we started recording this video, Meta's laid off 11,000 employees or 13% of its workforce. But in his address to the company, Zuckerberg said he's still focusing on high priority growth areas like the Metaverse. It's betting everything, right down to its name. This is where Meta's VR goes from fun and games to a serious business tool. Eventually, CEO Mark Zuckerberg wants something like the Quest Pro to be your next laptop. The Quest Pro is like a very fancy version of the Quest Two, the all in one headset that Meta released in 2020. Like the Quest Two, the Quest Pro is a self-contained system with built-in cameras and tracking. It supports Quest Two apps and games and it uses the same app store. You still need a Meta account to start using it unless your workplace sets up its own login system. Most of it's internal specs have gotten a slight bump though. It uses a new Qualcomm XR Two Plus chip set instead of the Quest Two's XR Two and it's got 12 gigabytes of memory instead of six gigabytes. The Quest Two controllers featured LED bands that the headsets built-in cameras could track. Now the controllers have their own tracking camera. I haven't noticed a huge improvement in their accuracy mostly because the Quest Two was already quite good but they're more compact and they finally charge on a little plastic dock with the headset instead of burning through AA batteries. Where the Quest Two blocked out most of the light around your face, the Quest Pro offers more options. By default, it lets in a lot of light so people can't, say sneak up on you and surprise you in VR. You'd be surprised how often that happens. But it comes with rubber wings that you can magnetically snap on to block your peripheral vision and you can buy a separate full face mask that shuts out almost all light. The default option here is okay if you're sitting still at a desk, which is how Meta imagines many people using it. But it made me motion sick for anything else even typically comfortable games like Beat Saber. So I appreciate the flexibility but I spent almost all my time with those wings on. The main difference here though is the headsets cameras. The Quest Two has four tracking cameras, one on each corner and they capture black and white video. The Quest Pro has a total of 10 sensors including outward facing color cameras and internal ones that capture your eyes and face. All these cameras enable the Quest Pro's two big selling points. The first is color passthrough mixed reality, a midpoint between full immersive VR and AR glasses, where virtual items are overlaid on a live video feed. We couldn't directly film past their video. Meta says support to capture it is coming in future software updates. The second is face and eye tracking which lets an avatar mirror facial expressions like smiling and raising an eyebrow. - You look like you're sleeping all the time. - Yeah, no, it doesn't recognize that my eyes are open. - Which is weird. (Nilay laughs) Okay, there is something to be said about this experience. - Eye tracking also allows foveated rendering where software can render the pixels right where you're looking at more sharply saving on computing power. These are interesting new features but so far there isn't a lot to do with them. Foveated rendering could make more demanding games render with more detail but the Quest Pro isn't meant for games right now. So most VR developers will be building for the Quest Two. The color feed is a step up from the Quest Two's black and white, but it's still washed out and flickery, a long way from looking like the real world. There are some mixed reality apps but the mixed reality component often remains pretty basic. Meanwhile, Meta's main use for eye and face tracking is its own social platforms, particularly Horizon Workrooms. Workrooms is at the heart of Meta's new strategy. It's an app that you can sync with a desktop computer to use as an office. For personal work, you can project big screens in front of your face on top of either a full VR environment or a pass through video feed. For collaboration, you can invite other people to a virtual meeting room but Workrooms, it has some problems. - So this is the first time we've been able to make Horizon Workrooms work. We've tried it many times. It has mostly failed out, but here we are together. - I would like to caveat that there's supposed to be a third person here with us so I'm not sure I would say worked. - That's true. Alex Heath was unable to join us. The face tracking is somewhat working. Adi looks very sleepy all the time. I am talking with my hands. - The face tracking is also better than I expected, even though it's not great in a lot of ways. - Yeah, but it's like it's on the curve so it's not good enough that you are not talking with your hands. Like I'm overcompensating with my hands. - Yes. - [Nilay] I cannot tell what your face is actually doing because you keep winking and squinting at me. - Yes. I don't know, maybe this just exaggerates all of our normal expressions so we can see how weird we look all the time. I don't know. These are thoughts that I feel like would be weird for a work meeting, so... - There is zero chance that I would ever make a serious decision in this software. - It is bizarre that I have, bizarre that I have for years been connecting my Meta headset to things related to Facebook so that I can have a seamless social experience so that I can have like, oh, isn't it great that you can take advantage of the social graph? I have to go to a website, log in through an arcane-like authentication system that even I don't understand where my account is. I get on the web, I create a meeting room I invite people to the meeting room through, similarly I have no idea how or where or where these accounts are. And then maybe, maybe they get a link and then they can click on the link and then they launch themselves into the headset and maybe it works. As I said before, the Quest Pro's focus is business collaboration. So we're spending our most of our time in Meta's Workrooms app but the social app, Horizon Worlds is a big part of Meta's metaverse strategy a free VR platform for games, events and social hangouts. And my experience so far is less than stellar. - [Nilay] Adi, where are you? - [Alex] Yeah, Adi, where are you? - [Adi] Hi, yeah, sorry, I have to go. But it's nice meeting you. - [Nilay] Adi is talking to people who are not us. Alex, you have turned into just some sort of acquaintance. - [Man] She's not over 18. We need to find someone over 18. - [Alex] Oh, amazing. (indistinct chatter) - [Kid] I don't think anybody here is over 18. Xxxx. - [Boy] I'm not over 18, that's for sure. - [Nilay] I'm literally watching people try to find Adi to harass her. - [Alex] Wait, really? - [Nilay] I'm listening to people saying there's-- I'm literally listening to kids say she's the only-- - [Alex] She's the only one, that's just the dudes. - [Nilay] They're like, they found a girl and they're like chasing her. - [Adi] You too. - [Nilay] Are you kidding me? - [Alex] Wait, we gotta go see this. - [Nilay] I didn't hear that. - [Adi] Run, go, go, go, go, go, go. - [Nilay] Wait, you don't hear the gaggle of bros who are like, \"She's the only girl on the server, \"let's go talk to her.\"? - [Adi] Oh no, I didn't hear that. I was hearing the other, there was the woman who said that I look just like her. I'm gonna leave now. - Yeah, I'm gonna go too. - I wanna go home. - [Nilay] Okay. - [Alex] Where are we going? - [Nilay] I don't know. Was that Alex? That's Alex. And Alex again. I haven't seen Adi. - [Adi] I'm gonna invite you to go to my home. - [Alex] Hit the travel. - [Nilay] Okay, where do I do that? How do I do, how do I do any of this? - [Alex] Adi, send it again. Adi, send it again. - How do I get out of here? Okay, so I don't know where you were at that time but where Alex and I were standing all of the dudes around us started saying, \"There's a girl.\" And then they said, \"This is true, ask if she's over 18.\" And then somehow, I believe you told them that you were over 18 and they were like-- - I did not tell them that. I didn't know where they were. This must have been some other girl. - Well, that's not great either. And in many ways, worse. - Okay, we were finally able to get Alex Heath to join us and chat about our time so far, not in Workrooms but in Horizon Worlds. - [Nilay] Alex, was this worth $10 billion? - [Alex] This is worth negative $10 billion. I would pay $10 billion to never use this again. I wanted to have hope that we could do this and it would be fun but I mean, you guys agree this is like one of the most buggy software experiences ever, right? I mean, I have not experienced software this bad in a long time. - [Nilay] Yeah, it's a real mess. - I think bug is unfairly nice. I think bug implies that there is a working version of this that this is somehow not living up to. This is just so unintuitive. - No, I mean, like, when I tried to join the workroom with you guys, it just took me into this empty blue expanse and I couldn't even like get to the menu to restart. I had to force restart the headset from the button. I mean, even as a like a reviewer you barely want to go through it. I just, while you guys were in Workrooms, I went into a creator world by myself and it was literally just two like 10 year olds trying to figure out how to get out of the wall they were stuck in on either side of the world, talking to each other and me in a vast world. And I'm like, this is it. This is it. - [Nilay] What I keep saying is they should just put this back on the shelf and not let talk about the metaverse until something is a hundred times better than this. Is that your read of this? - [Alex] That's my read. I almost wonder if they should scrap this and just start over. I mean, I don't know what's salvageable in this experience. I mean, this is just such a bad experience. I hate to say it that way. This is the most savage I've been about a product but I really don't understand why this exists. Like, why this is like out for people to be able to use. And the fact that Workrooms was even worse and more buggy and that's the whole purpose of this Pro headset is to like spend time in Workrooms. And like I just want to acknowledge you cannot schedule a meeting in Workrooms in the headset. Like, how did that ship? I just, I don't really understand. And so it does not surprise me that the people building it don't use it because like I cannot even figure it out myself. And I write about this stuff for a living. - It's easy to see why Meta built Workrooms. It wants to own the future of not just video games, but computing in general. It has to, if it wants a business big enough to compete with its original social networking behemoth, but the Quest Pro hardware isn't ready to be your next computer. The headset weighs around 200 grams more than the Quest Two or around a hundred more than the Quest Two with its added elite strap. It balances that weight by moving its battery to the back of the headset. But the design focuses heavy pressure right at my hairline, to the point that after wearing it for a few hours I've sometimes got a painfully numb strip on my forehead. The battery lasts one to two hours compared to the Quest Two's two to three hours, which isn't great either. The Quest Pro screen is roughly the same resolution as the Quest Two's at 1800 by 1920 pixels per eye. That's pretty good for a VR headset right now but it's way too grainy to comfortably stare at a bunch of text all day. I might take the Quest Pros virtual screens over a tiny laptop screen, but not for very long. The software meanwhile is even worse. Workrooms is a huge mess that requires toggling between a web and VR app interface to set up meetings that load incredibly slowly, if participants can get into them at all. It's even clumsier than your average video conferencing setup which is already the software version of hell. And the whole Quest user interface is fine for launching games, but it's still limited as a full fledged operating system. Companies have been using VR for decades, mostly for specialized work like simulation and 3D design. The Quest Pro has potential for places that are already doing this. It's a relatively high powered standalone headset with good controllers, and it's not that expensive compared to other business focused VR headsets. But Meta needs more than that. It needs new people to adopt VR for work. People like, well, us. For most people, the Quest Two is still a better option for Meta VR. It's lighter and vastly cheaper. It's not as powerful but most game developers will still be targeting its specs. The Quest Pro's special features don't do much for the average user yet. And if you really love those more compact controllers you can even buy them for the Quest Two, although they cost $299. We know there's a Quest Three coming out next year as well and who knows what upgrades that will include. The Quest Pro has some good ideas. I hope it's upgrades appear in more of Meta's headsets but right now everyone is looking to Meta for a giant leap to save the company. And at best, the Quest Pro was a medium sized step in the right direction. - [Nilay] Like I don't know how to do it. - Three and a half. Three and a half. Okay, great. Three and a half. I can do that. My hands don't do this. - [Nilay] Yeah, no, let's try that. - Thanks everybody for watching and let me know, would you rather have one Meta Quest Pro headset or three and a half Quest Two's?",
    "transcript_keywords": [
        "Quest Pro",
        "Meta Quest Pro",
        "Quest",
        "Quest Pro headset",
        "Quest Pros virtual",
        "Meta",
        "Pro",
        "Meta Quest",
        "Quest Pro screen",
        "Quest Pros",
        "Quest Pro offers",
        "Workrooms",
        "Quest Pro focus",
        "Quest Pro hardware",
        "Quest Pro special",
        "headset",
        "Meta Workrooms app",
        "people",
        "Pro headset",
        "Adi"
    ],
    "transcript_entity_values": [
        "zero",
        "18",
        "next year",
        "18",
        "around 200 grams",
        "one",
        "third",
        "Adi",
        "the Quest Two's at",
        "four",
        "Beat Saber",
        "Horizon Workrooms",
        "Quest",
        "a few hours",
        "The Quest Pro",
        "1800",
        "Nilay",
        "the Quest Pro's",
        "six gigabytes",
        "Alex Heath",
        "Horizon Worlds",
        "VR",
        "over 18",
        "Three and a half",
        "three and a half",
        "2020",
        "Meta VR",
        "years",
        "the Quest Pro",
        "Quest Two",
        "The Quest Pro's",
        "Qualcomm",
        "Alex] Adi",
        "Meta",
        "13%",
        "around a hundred",
        "the Quest Pro",
        "VR",
        "the Quest Pro's",
        "XR",
        "two",
        "just two like 10 year olds",
        "1920",
        "Horizon Worlds",
        "all day",
        "Zuckerberg",
        "The Meta Quest Pro",
        "Two",
        "Workrooms",
        "Facebook",
        "11,000",
        "299",
        "this year",
        "AR",
        "the Quest Two",
        "Alex",
        "hundred",
        "second",
        "Quest Pros",
        "Mark Zuckerberg",
        "9.4 billion",
        "two to three hours",
        "first",
        "decades",
        "one to two hours",
        "$10 billion",
        "Meta Quest Pro",
        "12 gigabytes",
        "Quest Three",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "NORP",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "LAW",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "WORK_OF_ART",
        "FAC",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "LOC",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "NORP",
        "EVENT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "DATE",
        "TIME",
        "MONEY",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.02389879710972309,
        -0.05749079957604408,
        -0.06251827627420425,
        -0.06544441729784012,
        0.09293301403522491,
        -0.0065591903403401375,
        -0.012016844935715199,
        0.03010612353682518,
        -0.008989540860056877,
        0.08863158524036407,
        -0.07935196161270142,
        -0.010000834241509438,
        -0.027966579422354698,
        -0.0049789054319262505,
        0.0553487204015255,
        -0.024096615612506866,
        0.09944480657577515,
        -0.09384378790855408,
        0.007541246246546507,
        0.004225893411785364,
        -0.05712629854679108,
        -0.018588896840810776,
        0.0597972571849823,
        0.027990689501166344,
        -0.06642263382673264,
        -0.005517469719052315,
        -0.09756194800138474,
        -0.0245499424636364,
        -0.03508371114730835,
        -0.07174025475978851,
        -0.004812088795006275,
        0.0836016908288002,
        -0.007120541762560606,
        -0.013400087133049965,
        -0.04123757779598236,
        -0.018871359527111053,
        0.02939782291650772,
        0.024963054805994034,
        -0.14284026622772217,
        -0.07213322073221207,
        -0.05060833320021629,
        -0.021588539704680443,
        -0.12776857614517212,
        -0.03233533352613449,
        0.08272384107112885,
        -0.023819178342819214,
        0.0010994155891239643,
        -0.024669939652085304,
        0.030640926212072372,
        0.04257349297404289,
        -0.039025865495204926,
        -0.10407745093107224,
        0.0605502687394619,
        0.0857456624507904,
        -0.05652298405766487,
        0.09898432344198227,
        -0.03245992958545685,
        -0.015449170023202896,
        0.013884379528462887,
        -0.030546117573976517,
        0.011864898726344109,
        -0.061350930482149124,
        -0.025196634232997894,
        0.0500003807246685,
        -0.03732449188828468,
        0.07137735933065414,
        0.009287952445447445,
        -0.028975408524274826,
        0.04480702430009842,
        -0.09640935063362122,
        -0.12367206066846848,
        0.027798086404800415,
        -0.0030206001829355955,
        -0.05560595914721489,
        0.0468306727707386,
        0.06564995646476746,
        0.04721289500594139,
        -0.13488352298736572,
        0.0032995089422911406,
        -0.02527351677417755,
        0.08777669817209244,
        0.006423576269298792,
        -0.01937161013484001,
        0.03239143267273903,
        -0.022328726947307587,
        -0.030622944235801697,
        -0.007191116455942392,
        -0.01233577635139227,
        -0.02857283502817154,
        -0.07748431712388992,
        -0.08565106987953186,
        0.02486201375722885,
        -0.018010785803198814,
        -0.01953100971877575,
        0.0448283925652504,
        -0.009649843908846378,
        -0.05996392294764519,
        -0.05034482479095459,
        -0.0028666439466178417,
        0.06001346930861473,
        0.00865931622684002,
        -0.08221455663442612,
        -0.008655449375510216,
        -0.07154211401939392,
        -0.0020242370665073395,
        0.011125156655907631,
        0.03161035105586052,
        0.038658056408166885,
        0.04426148533821106,
        0.027186362072825432,
        -0.005023094825446606,
        0.04723342880606651,
        0.016296714544296265,
        -0.05001682788133621,
        0.08477833867073059,
        0.0971451923251152,
        0.04356324300169945,
        0.0720757395029068,
        0.06665053963661194,
        -0.02585345320403576,
        0.055048227310180664,
        0.049766141921281815,
        -0.02140483446419239,
        -0.08495400846004486,
        0.044766172766685486,
        -0.008461995050311089,
        -0.00754963792860508,
        6.849636438968178e-33,
        -0.017310136929154396,
        0.1406448930501938,
        -0.001084415358491242,
        -0.04414030909538269,
        0.07016564905643463,
        0.015367486514151096,
        0.007049956358969212,
        0.049809109419584274,
        -0.05957493185997009,
        -0.01396544836461544,
        0.03653512895107269,
        -0.015473549254238605,
        -0.03614227846264839,
        -0.01068976242095232,
        0.03873656317591667,
        -0.070277139544487,
        -0.012616658583283424,
        0.05047684535384178,
        -0.1294865757226944,
        -0.022473221644759178,
        0.0022045676596462727,
        -0.03449822962284088,
        -0.0058468361385166645,
        0.017500098794698715,
        0.047682471573352814,
        0.10974594950675964,
        0.04613618552684784,
        0.04129491746425629,
        0.021883483976125717,
        0.022085681557655334,
        -0.0846693143248558,
        0.04198478162288666,
        0.024841662496328354,
        -0.01387614756822586,
        0.04159684479236603,
        0.02165491133928299,
        0.004114823881536722,
        -0.07044383138418198,
        -0.0034868556540459394,
        0.024675853550434113,
        -0.07007773220539093,
        0.05186926946043968,
        -0.01416469644755125,
        -0.061991069465875626,
        -0.059219542890787125,
        -0.07045511901378632,
        -0.0034066641237586737,
        0.024424510076642036,
        -0.016884630545973778,
        0.07670573890209198,
        -0.02050822041928768,
        0.011251394636929035,
        -0.09283707290887833,
        -0.029525654390454292,
        -0.005806551780551672,
        -0.07111295312643051,
        0.00870427768677473,
        -0.023075131699442863,
        0.03373045101761818,
        -0.00795589480549097,
        0.06854064762592316,
        -0.0904219001531601,
        -0.03944426402449608,
        0.03254743665456772,
        -0.04172084853053093,
        0.04203316569328308,
        0.022951994091272354,
        0.026890287175774574,
        -0.0572090782225132,
        0.06954040378332138,
        -0.04660849645733833,
        0.06433189660310745,
        -0.03310928866267204,
        1.8819317119778134e-05,
        0.03743410110473633,
        0.027370179072022438,
        -0.009154296480119228,
        0.04300399497151375,
        0.02982177957892418,
        0.10426222532987595,
        -0.1012057214975357,
        0.05087525397539139,
        -0.0633791983127594,
        0.009067762643098831,
        0.03483477234840393,
        -0.08755464106798172,
        0.025249058380723,
        -0.029897602275013924,
        0.018555836752057076,
        -0.06630925089120865,
        0.017415884882211685,
        0.045379579067230225,
        -6.462392775574699e-06,
        0.03722685948014259,
        -0.03220399469137192,
        -6.418839799910888e-33,
        -0.04225469380617142,
        0.049787648022174835,
        -0.06178620085120201,
        0.03275066241621971,
        0.025118038058280945,
        -0.04435345157980919,
        0.04648898169398308,
        -0.012557209469377995,
        0.056258849799633026,
        -0.03767392784357071,
        -0.009717240929603577,
        0.01716417819261551,
        -0.04775591939687729,
        0.033625002950429916,
        0.006820952985435724,
        -0.041241344064474106,
        0.07829200476408005,
        -0.07314326614141464,
        0.027939625084400177,
        0.018645446747541428,
        0.12671741843223572,
        0.0677119567990303,
        -0.13249991834163666,
        -0.07329364120960236,
        0.002589296782389283,
        0.03780626133084297,
        0.10332436859607697,
        0.0639573335647583,
        0.03998260200023651,
        0.002417375333607197,
        -0.030406774953007698,
        0.031181272119283676,
        -0.05469564348459244,
        -0.018364695832133293,
        0.05155198276042938,
        0.09474362432956696,
        0.026163747534155846,
        -0.010343401692807674,
        -0.056389763951301575,
        -0.02185427024960518,
        0.025372005999088287,
        -0.017619609832763672,
        -0.010258420370519161,
        -0.022635340690612793,
        -0.05128789693117142,
        -0.06239834055304527,
        -0.03615942224860191,
        0.0019819249864667654,
        0.03573611006140709,
        -0.019850313663482666,
        0.00700752018019557,
        0.04200474172830582,
        -0.008270420134067535,
        -0.020014656707644463,
        -0.09140023589134216,
        -0.026441264897584915,
        -0.14021196961402893,
        0.05667677894234657,
        0.020001119002699852,
        -0.046488236635923386,
        0.03732689097523689,
        0.043923407793045044,
        -0.07478687912225723,
        -0.04918152466416359,
        0.037191227078437805,
        0.07433042675256729,
        0.05228602886199951,
        -0.018194086849689484,
        0.0009956277208402753,
        0.013917751610279083,
        -0.0470735989511013,
        -0.042741015553474426,
        0.012574096210300922,
        -0.03538799285888672,
        0.02065468207001686,
        0.032036490738391876,
        -0.004208747297525406,
        -0.0067283171229064465,
        0.003923588898032904,
        0.058893900364637375,
        0.027976270765066147,
        -0.06138312816619873,
        0.11765038967132568,
        0.022228233516216278,
        0.06170401722192764,
        0.08292960375547409,
        -0.09765443950891495,
        0.07927540689706802,
        -0.08242976665496826,
        0.04394477605819702,
        -0.004827718250453472,
        0.03022235445678234,
        -0.06045807898044586,
        0.09864769130945206,
        0.032030344009399414,
        -5.8649664680388014e-08,
        -0.002592348726466298,
        -0.009748157113790512,
        -0.04523153230547905,
        -0.009825767017900944,
        -0.0008857013890519738,
        -0.0508301667869091,
        0.0044840979389846325,
        -0.04549558833241463,
        -0.04018160328269005,
        0.0363495871424675,
        -0.012306141667068005,
        0.01632370427250862,
        0.01292361505329609,
        0.02539709582924843,
        0.05510449782013893,
        0.0629274919629097,
        -0.05551847070455551,
        0.05529505014419556,
        -0.06073456257581711,
        -0.061779364943504333,
        -0.019015509635210037,
        0.029392901808023453,
        0.026816045865416527,
        -0.10919345915317535,
        -0.007314302027225494,
        0.019194338470697403,
        -0.03367907553911209,
        -0.006601319648325443,
        0.03653223067522049,
        0.01918611489236355,
        0.025214441120624542,
        0.07161098718643188,
        -0.006817716173827648,
        -0.07076510787010193,
        -0.004849299788475037,
        -0.059161704033613205,
        -0.017188582569360733,
        0.06395745277404785,
        0.06001253426074982,
        0.012929006479680538,
        0.04240714758634567,
        -0.0328923836350441,
        0.00535596814006567,
        0.053648706525564194,
        -0.04394470155239105,
        -0.0029801283963024616,
        -0.0032287067733705044,
        -0.06643348187208176,
        -0.012756923213601112,
        -0.05319906398653984,
        -0.002190099563449621,
        -0.06941315531730652,
        0.08579414337873459,
        0.05232969671487808,
        0.015337569639086723,
        0.06626211106777191,
        0.0977814570069313,
        -0.047716546803712845,
        -0.031703442335128784,
        0.03590089827775955,
        0.05692857876420021,
        -0.04677468165755272,
        0.006296616513282061,
        0.020407922565937042
    ]
}