{
    "id": "WqzApRm0nis",
    "title": "The Longest Range Electric Truck in the WORLD... and its not even close!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-04-03T14:00:20Z",
    "video_url": "https://www.youtube.com/watch?v=WqzApRm0nis",
    "category": "Howto & Style",
    "tags": [
        "Chevy Silverado EV RST",
        "Silverado EV",
        "Silverado 4WT",
        "Chevy",
        "Electric truck",
        "Tesla Cybertruck",
        "Cybertruck",
        "Rivian",
        "Hummer EV",
        "Humvee",
        "Tesla",
        "best electric truck",
        "longest range EV truck",
        "EV Towing",
        "Electric Car"
    ],
    "views": 1524437,
    "likes": 47023,
    "comments_count": 4953,
    "description": "The new Chevy Silverado EV RST is the new long range Electric Truck KING. With an advertised range of 440 miles. Today we find out how realistic that range actually is with a 440 mile road trip from Las Vegas Nevada to Phoenix Arizona. Watch Dans video HERE:   Ambient temperature outside during this test was a rainy 68 degrees F (20C) There is about 1000ft of elevation drop between Las Vegas and Phoenix. 95% of the time we were going the speed limit on public roads (55mph to 75mph) - except for the dirt road diversion to film and do the truck walkaround.",
    "description_links": [
        "https://youtu.be/vh3ktzXARGU"
    ],
    "transcript": "Today we have the Chevy Silverado EV RST, the longest range production EV truck in existence, and it's not even close. We have a 440 mile road trip planned for today, which we're hoping to complete without needing to charge a single time. For reference, both the Cybertruck and Ford Lightning have advertised ranges of about 320 miles. The Rivian is a tad higher at 400, but Chevy claims this Silverado EV RST can go a mind-blowing 440 miles, which we're going to put to the test today. The route we're taking goes from Las Vegas, Nevada to Phoenix, Arizona, all without charging up a single time. For the most part we'll be on the freeway, but we will be doing some back country dirt roads with some city driving mixed in, just like a realistic real world road trip. Except for we've only got one shot to make it from point A to point B. This video is not sponsored, but Chevy is letting us borrow this RST just for this road trip. Little known fact though, the first vehicle I ever owned back in high school was a Chevy 1500, which I wrecked, but that's a story for another day. Interesting fact, even after having driven 100 miles, we still have more range than the Rivian Cybertruck and Ford Lightning do at a full 100% charge. The battery pack inside of this Chevy Silverado EV is ginormous. We have officially driven 200 miles at this point. This is one of the coolest displays I've ever seen. I drive a lot of electric trucks, I've been in the Lightning, the Cybertruck, the Rivian and not a single electric truck has ever given me the actual output of how much energy is leaving through the motors or how much energy is being regenerated. So right now as I accelerate, we're putting out 200 kilowatts. I didn't floor it by the way, we're trying to save range for the road test. And then as we kick on the regen, I can see that it's absorbing like 62 kilowatts. And it's always fun to see this information put out visually in a graph, but it's even cooler to see it given numerically. Eventually, I want to do a towing test because with this much range in an electric truck means that the towing range is also just going to be awesome. So we found a sweet dirt road, but we are currently, we have gone 267 miles with 234 miles left, which is freaking wild, and we have 46% battery life left. But I think now's a good time to do a little walk around. We've been driving for a really long time and it'll be nice to take a break. There are some things about this truck that are wild. Not ever seen before on any other electric truck, hardly any truck ever. It's in the bed, but I'm going to start with the front. Since there is no engine under the hood, there's a button here slightly off center from the main area of the cab with a powered hood with quite a bit of storage area inside, along with one 120 volt 20 amp plug in the front. We will close this. Another thing that differentiates this truck from other trucks is this guy right here called the sail panel. It's also seen on the older avalanches. It probably helps with aerodynamic and keeping air from getting caught inside of the bed as you're driving down the freeway. It would probably bother me a little bit if this entire back wall of the truck was not removable. And this one is, which is something I've never seen before. Dan, my buddy here, we're going to slide these two back seats down, remove the glass, and drop this entire panel out of existence so that we can extend the overall bed length past 10 feet. And hopefully we can do it before this storm comes in because it's about to start raining real hard. We just drove out of the storm as you saw in Dan's video. Dropping the entire back of the truck out is pretty easy. I can raise these two seats. Dan, if you want to grab that one over there. And then each of these headrests fold down. Dan, you can grab yours. I can pull this tab right here. And Chevy's calling this a 60-40, where the two seats can drop down as the 60 and then the single seat can drop down as the 40. And then if I jump into here and release these two panels, the window can come out, which is a little bit nerve-racking because as we know, glass is glass. Clip it into place. And then with one button press, the whole thing can come down. You want to grab that seatbelt, Dan? - One thing we didn't show is the seatbelt actually has a place. It is thought out. You put it in this little section right there, it would have been out of the way. - This is such a cool feature for holding long cargo. Obviously you're not going to road trip with this back panel down because it would be so loud But so much room for activities. Come back to the tailgate. It's so windy. I'm sorry. All right, so with the tailgate, is this the big tailgate? All right, the tailgate is modular so that if we raise this up, it can lock the material with over 10 feet of real estate between here and the driver's seat. It's a wild development in the truck world and I'm so here for it. The tailgate can also fold here as well as drop down to be a step inside of the truck. That is wild. As I've said before, a truck is a tool and this truck is a Swiss army knife with power outlets in the rear. One thing I really wish my Rivian had was a 220 volt outlet in the rear because you can run welders, you can run plasma cutters, you can run all kinds of tools with 240 volts and this truck has it. With a row of fuses and for some reason a little accessory panel. You can say it's pretty amazing. If you don't want to drop the whole tailgate down for a step, there is a step inside of the bumper which also makes getting up inside of the truck a bit easier. And while the work truck does have a spare tire, this RST does not because of aerodynamics and the drag that the spare tire brings. The spare tire normally would be right here underneath in the rear. It is so windy up here. Let's get inside the truck. Much better. As you can see we have a full panoramic glass roof in the ceiling. Everything in here is premium. This RST is going to be the top of the line Chevy Silverado EV that they sell. And with that comes all kinds of buttons. We have our normal window buttons up here. We have our ride height selector over here with trailer brakes. This RST right now out of the gate can tow 10,000 pounds. We have a driver display and it's interesting that they rolled this little arrow over from the gas powered vehicles. The arrow shows which side of the truck the charging port is on. And gas powered vehicles, cars and everything have that same little arrow. So that's pretty nifty. We also have this large display over here. It is definitely nice to have two displays. And not only do we have a front display and a larger center display, we also have a heads up display. Three displays where some other trucks only have one. The heads up display shows, you know, the GPS navigation as well as our current speed and what the speed limit is. The rear view mirror is very functional and is also a display like a computer screen. And can very easily be swapped back and forth between the two. Wireless charging for cell phones, physical air knobs, physical directional vents. And over here along with the glove compartment we also have a little phone storage bin up top. And a very large center console area which has another USB-C port inside. But the ability to drop the rear seats and open up the entirety of the truck for cargo is one of the flagship abilities of this truck and something that makes it stand out from every other truck on the market. The Silverado EV isn't here to blend in. It's making its mark in a way that no other truck has. Not everyone needs almost 11 feet of cargo space, but this truck will be incredibly useful for the right person at the right job. We're not quite done with our road trip just yet, but the official range Chevy is advertising on this truck is 440 miles, which means that charging and battery capacity is extremely important. The charging port back here is CCS and can charge at 350 kilowatts, giving it about 100 miles of range in just 10 minutes. And just like the Hummer EV, the Cybertruck, and the Rivian, the Silverado EV RST does have an adjustable air suspension, raising up about 2 inches for additional ride height. There's a light bar crossing the front right above the RST badging and the Chevy logo. When the back wall is fully restored, the entire bed length is 5 feet 11 inches, just shy of 6. Alright Dan, storm's coming. We've driven about 270 miles, which is the range of some other whole EVs. How much more distance do we have to get to Phoenix? It's about 240 miles to the charger that we want to go to that's one of the fast chargers. It says estimated we have 230 miles range. That would put us at 500 miles range for the truck, so I don't know if we're going to make it all the way to Tempe, but I am really curious to see what the actual number is tested in this weather. I don't know. It's an adventure. You want me to drive or you drive? It's all you. Let's go. So as we're doing this road trip we have another follow car that you probably saw in some of the drone footage with another Chevy Silverado EV and it's driven by some of the Chevy engineers. But as I was flying my drone following our truck, their truck got a little too close and I came down near their hood and like buzzed their windshield with my props. I bet it scared them super bad. The funny thing is it looks like you literally did a scratch test on their glass. Like it's like as a cell phone you're like, I'm going to test your windshield, where's my Mohs picks? But as we know plastic cannot scratch glass, so the glass is fine even though it looks scratched. I'll throw a picture up on screen. But Dan, you've driven almost every electric truck possible. What do you think of this one? Well, the last road trip that we did, it was you and I and it was in the Tesla Cybertruck and the range in that, I mean, we were lucky to get 300 miles. I don't know if we ever got that much range. And so I'm kind of blown away that right now we're at 288 miles that we've driven in this truck and it still says we have 206 miles estimated range left. So this is kind of blowing my mind just in that aspect alone, which is crazy because I have the off-road version of the Rivian R1-2. It's my daily driver, freaking love the truck. But as of right now, my max range is 280 miles, so I would already be done and dead on the side of the road. And we have 200 miles of estimated range left inside of the Chevy Silverado, which is wild. I think we might beat Chevy's estimated range. I mean, I'm not going to do the crazy things like hypermile to make it so that we hit that range. I'm going to drive the speed limit or just under or just over. But I'm feeling pretty optimistic that we're going to get close to that 440. Speed limit is 55 and he's going 63. So we are going with traffic on the freeway. This is a completely normal range test as if we were driving a normal vehicle. So let's see what it is. Alright I apologize for the extremely abrupt transition there. Dan is here filming a video as well and against my better judgment I let him drive towards the end of the route. And we did get 460 miles. The only problem is he ran us to zero and we died in the parking lot about 100 yards away from the charger. You are the navigator. What's your job? Navigate me. I said let's turn back. Anyway, it's actually a pretty simple solution because we do have the Chevy guys here with us. And apparently these things can do vehicle to vehicle charging through the charge port. So it won't take us very long to recharge. But let's take a look at the navigation really quick and see what our efficiencies were before Dan left us stranded. We are at 1% down here at the bottom. 460 miles on one charge which is absolutely amazing. Two miles per kilowatt hour. And now we know that when the Chevy Silverado hits 0% battery, they really mean 0% battery is left. Little behind the scenes. Got the truck charged up enough to go to a 350 kilowatt DC fast charger. This is freaking wild. It is currently pulling 294 of those kilowatts. And coming in here to the center screen, it is charging at 590 miles per hour. Which is right on par with the 100 miles of range in 10 minutes that Chevy was advertising at the beginning of this video. I am super impressed. The route we took from Las Vegas to Phoenix, Arizona did have about a thousand feet worth of elevation drop over the course of the trip, 460 miles, which is about 2 feet per mile And I don't think that diminishes the absolutely amazing accomplishment of driving 460 miles on a single tank of electricity. One of the longest range EVs in the world is an electric truck. And while that range is amazing for just everyday driving, I think it's going to be even more substantial when it comes to towing. So hit that subscribe button if you want to see me tow my electric Humvee with this truck. I have a feeling once again it's going to blow every other electric truck out of the water. If you want the full story of how Dan got us stranded here in this parking lot in real time go check out his video, as well as if you're curious of why the London Bridge is now in a weird city in Arizona, Dan has all of that information in his video. What are you talking about? London Bridge? I'm just kidding, yes it's in my video I think. Click to find out. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "truck",
        "Chevy Silverado",
        "Chevy",
        "miles",
        "range",
        "electric truck",
        "Dan",
        "Silverado",
        "RST",
        "road trip",
        "back",
        "road",
        "Rivian",
        "inside",
        "Chevy Silverado hits",
        "Cybertruck",
        "miles range",
        "Ford Lightning",
        "Chevy estimated range",
        "trip"
    ],
    "transcript_entity_values": [
        "the Hummer EV",
        "Tempe",
        "10 minutes",
        "220 volt",
        "1500",
        "two",
        "Navigate",
        "294",
        "10 feet",
        "200 miles",
        "350 kilowatts",
        "about 320 miles",
        "first",
        "RST",
        "440",
        "the Rivian Cybertruck",
        "USB",
        "CCS",
        "Chevy",
        "about 2 feet per mile",
        "almost 11 feet",
        "300 miles",
        "288 miles",
        "400",
        "about 100 yards",
        "440 mile",
        "Ford Lightning",
        "1%",
        "about a thousand feet",
        "EV",
        "over 10 feet",
        "350 kilowatt",
        "267 miles",
        "daily",
        "100 miles",
        "60",
        "Swiss",
        "206 miles",
        "Las Vegas",
        "Lightning",
        "Silverado EV",
        "one",
        "Arizona",
        "46%",
        "60-40",
        "one 120 volt 20",
        "100%",
        "about 270 miles",
        "about 240 miles",
        "Two miles per kilowatt hour",
        "590 miles per hour",
        "Phoenix",
        "DC",
        "440 miles",
        "the London Bridge",
        "Cybertruck",
        "280 miles",
        "234 miles",
        "about 2 inches",
        "Silverado EV RST",
        "40",
        "One",
        "another day",
        "500 miles",
        "Rivian",
        "London Bridge",
        "6",
        "Silverado",
        "240 volts",
        "about 100 miles",
        "460 miles",
        "10,000 pounds",
        "230 miles",
        "Mohs",
        "us to zero",
        "Humvee",
        "Three",
        "5 feet 11 inches",
        "just 10 minutes",
        "55",
        "63",
        "today",
        "Today",
        "Nevada",
        "Dan",
        "200 kilowatts",
        "0%",
        "62 kilowatts"
    ],
    "transcript_entity_types": [
        "PERSON",
        "GPE",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "GPE",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "GPE",
        "QUANTITY",
        "FAC",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "NORP",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "QUANTITY",
        "PERCENT",
        "QUANTITY"
    ],
    "vector": [
        0.03125074505805969,
        -0.011583755724132061,
        -0.04380370303988457,
        0.05042628198862076,
        0.06206878274679184,
        -0.01664886064827442,
        -0.0889338031411171,
        0.06125232204794884,
        -0.06905189901590347,
        -0.038522180169820786,
        -0.009499083273112774,
        0.05140767991542816,
        0.0471736378967762,
        0.015109146013855934,
        0.05699460208415985,
        0.021595358848571777,
        0.10310547798871994,
        -0.09884966164827347,
        -0.008919624611735344,
        0.02004488743841648,
        0.08970784395933151,
        0.02620709501206875,
        0.023715069517493248,
        -0.04331769421696663,
        0.01288426574319601,
        -0.0028572946321219206,
        -0.03352626785635948,
        0.03957372531294823,
        -0.09608316421508789,
        -0.028339538723230362,
        0.013043424114584923,
        -0.038689661771059036,
        -0.032163575291633606,
        -0.04645916447043419,
        0.01906326599419117,
        -0.008449418470263481,
        -0.06340237706899643,
        0.011750214733183384,
        0.03291637822985649,
        -0.04922977834939957,
        0.030880745500326157,
        -0.0317029133439064,
        0.017426537349820137,
        -0.01910044625401497,
        -0.01905090920627117,
        0.008211958222091198,
        -0.0039573777467012405,
        -0.0524182952940464,
        0.023263685405254364,
        -0.1023397147655487,
        0.0029887345153838396,
        0.01132201123982668,
        -0.003910190891474485,
        0.00823111180216074,
        0.014943412505090237,
        0.009905501268804073,
        -0.031404897570610046,
        -0.0464630052447319,
        -0.02507617324590683,
        -0.008671916089951992,
        -0.014096308499574661,
        0.05059212073683739,
        -0.04697688668966293,
        -0.07319555431604385,
        -0.07030418515205383,
        -0.026347002014517784,
        0.022170543670654297,
        -0.009151613339781761,
        -0.0528227761387825,
        0.004464996512979269,
        -0.038409166038036346,
        0.0574784018099308,
        -0.11527345329523087,
        0.06205034255981445,
        0.039665337651968,
        0.030684661120176315,
        0.09767647087574005,
        -0.012879247777163982,
        -0.046416543424129486,
        -0.062437184154987335,
        0.05126332864165306,
        -0.016552601009607315,
        0.031439196318387985,
        -0.03089228644967079,
        -0.03986933082342148,
        0.020752839744091034,
        0.04659539833664894,
        0.037691835314035416,
        0.007784615736454725,
        0.06437934935092926,
        0.06931380927562714,
        -0.0356980562210083,
        -0.05849788337945938,
        0.020814884454011917,
        0.014948823489248753,
        0.009476290084421635,
        -0.0188756100833416,
        -0.05937178060412407,
        0.02789510414004326,
        -0.07179583609104156,
        0.04188410937786102,
        -0.01165886502712965,
        -0.06505002826452255,
        -0.05681435391306877,
        -0.017627639696002007,
        0.02282513678073883,
        0.010840250179171562,
        0.014911030419170856,
        -0.039549924433231354,
        -0.0035507904831320047,
        0.05710616335272789,
        -0.05971674621105194,
        -0.03112802840769291,
        -0.022272301837801933,
        -0.05284476280212402,
        -0.0213510412722826,
        -0.07873863726854324,
        0.08345799148082733,
        0.0031269474420696497,
        0.03511504828929901,
        -0.02589360624551773,
        0.013032304123044014,
        0.053256869316101074,
        0.13188128173351288,
        0.07979398965835571,
        0.02477269247174263,
        0.05987391620874405,
        4.479010002167163e-33,
        -0.05271504819393158,
        0.03525886312127113,
        -0.006180683616548777,
        -0.03173573315143585,
        0.04735188186168671,
        0.07540421932935715,
        -0.00887037068605423,
        0.06857231259346008,
        -0.012232957407832146,
        0.08940453827381134,
        -0.026972126215696335,
        0.007015489507466555,
        0.041863080114126205,
        0.009707089513540268,
        0.04050327092409134,
        -0.033779241144657135,
        -0.0246429406106472,
        -0.08781745284795761,
        -0.09401301294565201,
        0.010405049659311771,
        -0.009080450981855392,
        -0.016061823815107346,
        0.06006617844104767,
        0.05176612362265587,
        0.022405223920941353,
        -0.03934985026717186,
        0.0029095588251948357,
        0.01640552096068859,
        0.002742549404501915,
        0.012464398518204689,
        -0.11460167914628983,
        0.01959255337715149,
        -0.016367889940738678,
        0.02666865661740303,
        0.0002343843225389719,
        0.006801779847592115,
        0.0007053251028992236,
        -0.05880236625671387,
        -0.08303146809339523,
        0.059911929070949554,
        0.030108584091067314,
        0.00834920909255743,
        -0.03575926274061203,
        0.02840670756995678,
        0.038659483194351196,
        0.0441853329539299,
        0.06267402321100235,
        0.05812738463282585,
        -0.0845043957233429,
        0.0560128353536129,
        -0.10636238008737564,
        0.038271214812994,
        -0.002190176397562027,
        -0.026228368282318115,
        -0.016520420089364052,
        0.06200160086154938,
        0.029778512194752693,
        -0.0033435567747801542,
        0.04937728866934776,
        0.0821881890296936,
        -0.04015428572893143,
        0.00012462990707717836,
        0.017099086195230484,
        -0.02871887944638729,
        0.009303110651671886,
        0.05420051887631416,
        -0.06532460451126099,
        -0.010254926048219204,
        0.004693347029387951,
        0.060385189950466156,
        0.13874681293964386,
        -0.08817755430936813,
        0.0710727870464325,
        -0.009715127758681774,
        0.07281055301427841,
        -0.09556882828474045,
        -0.012994226068258286,
        0.07365275919437408,
        0.06311112642288208,
        -0.025577576830983162,
        -0.13944952189922333,
        0.08354970067739487,
        0.018963541835546494,
        -0.06707046926021576,
        0.09685113281011581,
        -0.05928827449679375,
        -0.10618250072002411,
        -0.0010356279090046883,
        -0.04765145480632782,
        0.01892881840467453,
        -0.0016836171271279454,
        0.03601068630814552,
        -0.04180033504962921,
        -0.002588663948699832,
        0.061965979635715485,
        -4.510549617625679e-33,
        0.08326052874326706,
        0.03984938561916351,
        0.035586167126894,
        0.05940435081720352,
        0.05118116736412048,
        0.0021667643450200558,
        0.023611675947904587,
        0.14709995687007904,
        0.015321704559028149,
        0.05666352063417435,
        -0.04666724056005478,
        -0.04771574214100838,
        0.06660309433937073,
        -0.06172880530357361,
        0.06391898542642593,
        -0.06750533729791641,
        0.042896777391433716,
        -0.07088252902030945,
        0.033515945076942444,
        0.01164497621357441,
        0.0059226397424936295,
        0.027906669303774834,
        -0.03473493829369545,
        0.017701126635074615,
        0.08890717476606369,
        0.009769468568265438,
        -0.05864708498120308,
        0.03854251280426979,
        -0.056987762451171875,
        -0.05098729953169823,
        -0.0536298044025898,
        0.03889286890625954,
        0.030740847811102867,
        -0.01797233335673809,
        -0.03706315904855728,
        0.017258385196328163,
        0.03916072100400925,
        0.015220577828586102,
        -0.04309191554784775,
        0.07781229168176651,
        0.0763779878616333,
        -0.030813446268439293,
        0.03332332894206047,
        0.012138654477894306,
        0.028523972257971764,
        -0.006315699312835932,
        -0.04020419344305992,
        -0.02492055855691433,
        0.13038305938243866,
        0.017274584621191025,
        0.012637929059565067,
        -0.052679937332868576,
        -0.07691935449838638,
        0.1178591400384903,
        -0.011996311135590076,
        -0.1350748986005783,
        -0.03228072077035904,
        0.09058932960033417,
        -0.030171237885951996,
        -0.04408091679215431,
        0.0733150765299797,
        0.0166607778519392,
        0.07116463035345078,
        0.09402185678482056,
        0.04151735082268715,
        -0.07460613548755646,
        0.033318497240543365,
        -0.009291769936680794,
        0.019453074783086777,
        -0.02670150436460972,
        -0.040231410413980484,
        -0.05312156304717064,
        -0.006663829553872347,
        -0.0678737610578537,
        -0.09917094558477402,
        0.020290972664952278,
        0.030081957578659058,
        -0.04497778043150902,
        0.07222792506217957,
        -0.08445603400468826,
        0.0298320222645998,
        0.0180641058832407,
        -0.009112047962844372,
        -0.00976865366101265,
        8.204346522688866e-05,
        0.061636652797460556,
        -0.027258435264229774,
        -0.043916571885347366,
        -0.002234275685623288,
        0.03997686877846718,
        0.01915627159178257,
        -0.04844455420970917,
        -0.015251023694872856,
        0.01557228248566389,
        -0.0622299388051033,
        -4.686851440283135e-08,
        0.006342200096696615,
        0.12933161854743958,
        -0.034041136503219604,
        0.0037745845038443804,
        0.07212835550308228,
        -0.011480556800961494,
        0.10217244923114777,
        0.0802125558257103,
        -0.052960354834795,
        0.06831667572259903,
        0.03408446162939072,
        -0.04906533658504486,
        0.04441702738404274,
        0.06747756153345108,
        -0.0299446452409029,
        -0.008776724338531494,
        0.0012266510166227818,
        -0.012074051424860954,
        -0.013532139360904694,
        0.05682913959026337,
        -0.023917116224765778,
        0.004538830369710922,
        -0.060439568012952805,
        0.016987144947052002,
        0.015218614600598812,
        -0.017870217561721802,
        -0.05720306560397148,
        -0.03466596081852913,
        0.08385070413351059,
        -0.11083444952964783,
        -0.11719556897878647,
        -0.04359866678714752,
        -0.03052409179508686,
        -0.021496299654245377,
        -0.01670926809310913,
        -0.07186838239431381,
        -0.03238217905163765,
        0.0022043015342205763,
        0.023049363866448402,
        0.013733936473727226,
        0.03678246587514877,
        -0.08923175930976868,
        0.014932890422642231,
        -0.01583496481180191,
        -0.01378338411450386,
        -0.04006701707839966,
        -0.10136877000331879,
        -0.06706824153661728,
        -0.021342342719435692,
        0.0800199955701828,
        0.008276679553091526,
        0.0024283872917294502,
        -0.021953677758574486,
        0.00022228628222364932,
        0.06080428883433342,
        -0.04472313076257706,
        -0.050283826887607574,
        -0.03665931895375252,
        -0.05396413058042526,
        0.026157576590776443,
        0.015371445566415787,
        -0.1012718454003334,
        -0.024319855496287346,
        0.04824565351009369
    ]
}