{
    "id": "wT5QIcdYbz4",
    "title": "❤️ Valentine's Day Cake FIGHT!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-02-12T18:04:24Z",
    "video_url": "https://www.youtube.com/watch?v=wT5QIcdYbz4",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "valentine's day",
        "cake",
        "making a cake",
        "challenge",
        "blind fold decorating challenge"
    ],
    "views": 310870,
    "likes": 9449,
    "comments_count": 2401,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- How guys, how's it going? It's Justine, and this is my sister Jenna. - Hello. - And we are getting prepared for Valentine's Day, which is February 14th in case you didn't know. I think it's a silly holiday, but what I do love is celebrating by making baked goods. I love doing blindfolded challenges with Jenna, and we did a blindfold gift exchange during Christmas, and these are the only blindfolds that I could find. This is a question that I have for you guys. Wait, let me ask Nick first. Nick, what do you call these? - [Nick] Sweethearts. - Yes! - That's what you call them? - Yes, they're sweethearts! - Or are you just saying that because that's what it says? - [Nick] No that's... - That's what people call them, you call them the Sweethearts. - No! - Yes! - [Nick] The ones you got in grade school that say, like \"Kiss me,\" or like... - Or \"You're cute\" or \"Dream\"... Dream big? They do not say this. - [Nick] What did you call them? - Conversation hearts. - We came from the same family, but I don't know where your twisted little brain called them Conversation Hearts. - They're called Conversation Hearts, they've always been called Conversation Hearts. Look, fricking on the bag! - Is this a different brand other than the Sweethearts, where they're like \"We have to call it something else\"? - [Nick] Yeah, it's like... - This is sweethearts. - [Nick] It's like getting a cotton swab and not calling it a Q-Tip. - This is the authentic... - Uh-uh. - ...Sweet... - No, it's not, let me taste, I'll tell you. I'll tell you if it's authentic. - It doesn't matter if it tastes... - No, it does. - They're gonna probably taste the same. You're ruining everything, they're Sweethearts! I am 23 years old and, in my lifetime, I've never once been like \"Oh I love when a boy gives you Conversation Hearts.\" No one's ever given you a Valentine, I'm sure. That's why you... - [Nick] In grade school, they never passed around the bag of Conversation Hearts... - Yeah, it's the bag of Sweethearts. - They're called Conversation Hearts and you guys don't even know. No, they're called Conversation Hearts! It's on the bag! - That's the generic ripoff version of the Sweethearts. They can't call them Sweethearts, it's a lawsuit. - No, wait, we're gonna figure this out. \"We're proud to be your favorite candy maker for over 100 years.\" Okay, how many years have you been making candy? - Alexa, when were Sweethearts candies invented? - [Alexa] Similar to Necco Wafers, and started a candy factory.\" - 1847. - Ugh, I just wanna bash these... - [Nick] A little over 100 years. How unromantic are conversation hearts. - Conversation candies. - Oh babe, I wanna have a conversation with you tonight. - [Nick] Yeah. - Yeah, if somebody says that they wanna have a conversation I'm like \"Pff, I'm out.\" - You're like \"We're breaking up.\" Could you please admit to the camera, either one will do. - I'm wrong. - Put that on your Conversation Heart and eat it! - (screams) - [Nick] Sorry Justine, I didn't get that in focus, what did you say? - I'm wrong. So that's gonna be on one of my hearts, the other one's gonna be called \"butt slap,\" and the other one's gonna be called... - Jenna's always right. - Oh geez, okay, well the thing is... - Woohoo! - We're gonna have to write that blindfolded. So what we're gonna do is we're gonna be decorating and blindfolding and writing a conversation to each other. Okay, let's do this. - You're breaking them! - Shut up. I am sick of your mouth. \"I'm Jenna, I'm always right. Everything I say is right.\" - I'll find that on a Conversation Heart and shove it in your mouth.\" Can we get a zoom in on what this is supposed to be? - So Jenna and I are going to decorate these cakes blindfolded, and because the Conversation Hearts have words on them, conversations, we're going to write a conversation to each other. Like, that's what you do when you talk to someone. It's a conversation. - You're like, \"Oh, someone wrote me a conversation letter.\" It's like, it's a love letter. - Okay well, is it a sweetheart letter? - Well it's better than a conversation. Like, I have a conversation with Maddy, or like a tree. - Oh wow! - It's meaningless. - We've got some things to decorate, I think basically we're gonna decorate with this icing. (clinking) Oops! And then we have this, we've got a little black, and a red. - All right, blindfold on. All right, let's go, put your blindfold on. - So I need to find my... - Oh, it's so crazy, I can't find anything already. Oh, that's the cake. - Okay. - Alright, that's the cake, yes, that's the cake. - So... - So... - I feel the cakes. - You sure that's the cake? - Yeah, it's a cake. - So, I think the icing is... Let me feel around for it. - Oh I found a Conversation Heart box. Do you have the icing? - Here wait, go a little bit to the left. - My left or your left? Wait (laughs). This is so silly. - Okay, I've managed to find... - Did you find it? - Here you go, right here, I'll put it in front of you, here. Is this in front of you? - Wait, do you have it? Oh yes, yes, yes, yes, yes. - Yes, yes, yes. So, are we both... - Wait no, don't move stuff! - How'd you know I moved it? - 'Cause I felt it! - Like this was, this was, this was here. Wait, where are you at? - Watch those paws, lady. - Okay, hold on, let's move this closer. Can you feel it? - Okay, two, we've got three cakes. Ow! - Oh I'm sorry, I didn't see you there. - Okay, so this is, we're gonna ice up... Ow! - Oh sorry, I'm sorry, I'm trying to get the bowl. - Ow! - I can't see you, I'm blindfolded. - Me too, okay. I think I'm icing, I'm pretty sure. - Oops, oh no! I'm, I didn't... - Am I on the corner? - Oh no! - Okay, you're icing my arm, you pig! (playful music) Am I even icing anything right now? - I don't know, I gotta get more. Where's the bowl? - Ah, my arm! - I'm sorry, wait, that's your arm? - You're... Are you icing my body? - I mean, I'm going where the bowl is, I don't know what the problem is. - Ugh. - I can't imagine this looks good, because I can't see what I'm doing. - I wonder if anything's coming out of here. - And it's like, everything's real sticky. - Oh, yeah, it's definitely, mm, yep, definitely... Oh God, glitter gel sucks. - How do you know it's glitter? - Because I know what I picked up. - How do you know? - Oh shoot! Well I'm pretty sure it is. - I can't feel where the icing is, how... - Oh here, I can help you! I know where one is. Oh no, oh here it is. Here you go! Oh wait, you can't see. Where are you? - Wait, lower. - You're no where near me! - Is the cap on? - Yes. - Feels like the cap's on. - Oh wait, yeah, it is on. - B... - Aggressive. - U. T. But. Wow, if I just stand here, I start falling backwards. Oh! - Oh one second, I'm trying to write! What are you doing? What are you doing? What are you doing? - Where's your cake? Is this another cake? - That's another, that's bonus cake I'm assuming. I can't see. - Okay, well I'm gonna just put some more, I'm gonna just put this in my hand, 'cause I feel like I'll be able to get a better grasp of it. - Am I writing this about you, or just about like... - It's a Conversation Heart. Have a conversation. Conversation Heart, let's have a, a conversation. Are you still here? (laughs) - I just went home. - Ah! Don't push me! Oh no. - I need a little bit more icing. - Oh. Hey! - What is... You're in my way. - I'm gonna say... Did you pinch me? - Huh? I'm trying to get icing. - I'm just saying \"love.\" L. O. V. Okay. So I'm gonna do, like, a nice heart outline. Oh my God, I don't know if anything's coming out - Yeah, it's really hard to tell if anything's coming out, I can't see what I'm doing. - I know, I keep, like, I feel like it's... I'm trying to do an outline, like a heart outline. Oh no, I gotta put this down somewhere. Okay. Okay, I think I'm done. - Hold on, I'm not done. I'm not sure what I'm doing, I can't see anything. So you did two, I only got to do one. - Well 'cause you're too slow. Ready? - One, two, three. Oh, yours looks like trash. What did you write? - You (beep). - Look at your face. (laughs) - \"I'm sleepy\"? - Mine looks perfect! - What... - Yours looks like a dumpster! Was that Dexter inspired? - Did you even put your blindfold on? - Yeah, look at my mascara! - That was supposed to be a heart. That is nothing like what I thought I was doing. This one was supposed to say \"butt slap.\" - I'm sleepy. - Oh! (laughs) - I'm sorry, I'm sorry, I'm sorry. (laughs) - I was just gonna ask you if you wanted to... - All right, no more, no more, no more, no more, no more. Okay, friends. (laugh crying) - It's in my eye. I hate it so much. It's in my... (screams) - Oh, I'm so sorry, I promise I'm not this mean, I'm just... - Oh, it hurts so bad, I'm serious. I think I'm actually crying, it really hurts my eyes. This sucks so much. - What kind of a conversation... Here let me... - Shut up, no... - No, no, no, no, no, no, friendly. We're having a conversation. - It hurts so bad. It hurts so bad I can't even... So sad. It hurts so bad. - This is what happens when you keep Jenna up past her bedtime. I'm starting to feel a little bit bad. - It hurts my eyes so bad. - She even bought me dinner tonight, and this is what I did to her. (singing) What's conversation got to do, got to do with it. - Okay guys, thanks for watching. This is not fun, this is not fun. My eyes hurts really bad. - (whispering) I don't know, I'm sorry. - I don't... What do I even... I don't even know what to do right now. - [Nick] Please subscribe. - Please subscribe. Justine, I'm sorry, I didn't have my blindfold on. - Well you... I figured. You freaking wrote perfect calligraphy on your Conversation Heart. And now I look like this! - It's just a prank bro. - [Nick] Alexa, play \"When a Man Loves a Woman.\" - (singing) When a man conversates with a woman. - (laughs) (playful music)",
    "transcript_keywords": [
        "Conversation hearts",
        "called Conversation Hearts",
        "Conversation",
        "hearts",
        "Heart",
        "called Conversation",
        "Sweethearts",
        "Wait",
        "Conversation Heart box",
        "icing",
        "Yeah",
        "cake",
        "Jenna",
        "call",
        "called",
        "feel",
        "hurts",
        "Put",
        "bad",
        "heart outline"
    ],
    "transcript_entity_values": [
        "one",
        "February 14th",
        "Valentine",
        "Justine",
        "tonight",
        "Maddy",
        "over 100 years",
        "three",
        "one second",
        "Conversation Hearts... -",
        "Pff",
        "mm",
        "Nick] Alexa",
        "a Man Loves a Woman",
        "Nick] Sweethearts",
        "Dexter",
        "23 years old",
        "Conversation Heart",
        "L. O. V. Okay",
        "two",
        "1847",
        "Nick",
        "Kiss me",
        "Christmas",
        "Necco Wafers",
        "Jenna",
        "Conversation Hearts"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "TIME",
        "WORK_OF_ART",
        "NORP",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "PERSON",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.03593193367123604,
        -0.05300787836313248,
        -0.028298702090978622,
        -0.1240634024143219,
        0.016754817217588425,
        0.04821253940463066,
        0.06970904767513275,
        0.00851268507540226,
        0.003948404919356108,
        0.04055342823266983,
        0.004494262859225273,
        -0.005777646787464619,
        -0.006773372180759907,
        0.017084423452615738,
        -0.003611357184126973,
        0.03505221754312515,
        0.0037686903961002827,
        -0.02114456333220005,
        -0.026072846725583076,
        0.06266637146472931,
        -0.04399695619940758,
        -0.06188790500164032,
        0.010295743122696877,
        0.013106487691402435,
        -0.04919624701142311,
        0.10307356715202332,
        -0.01326333824545145,
        0.03192069008946419,
        -0.11067981272935867,
        -0.08238015323877335,
        -0.027560751885175705,
        0.038018617779016495,
        0.11906176805496216,
        -0.001793720992282033,
        0.008755866438150406,
        -0.06463800370693207,
        0.041491445153951645,
        0.007183200679719448,
        -0.02627108432352543,
        -0.02129935845732689,
        -0.011834241449832916,
        -0.07062996923923492,
        0.02440536767244339,
        -0.019818969070911407,
        -0.06113656610250473,
        -0.09088680148124695,
        0.006742219440639019,
        -0.05025259405374527,
        0.051145631819963455,
        0.06099003180861473,
        -0.08745535463094711,
        -0.023755518719553947,
        0.041697461158037186,
        0.02193645015358925,
        -0.08629428595304489,
        -0.00279784481972456,
        -0.0822557583451271,
        0.025129500776529312,
        0.04310183972120285,
        -0.07888034731149673,
        -0.004566998686641455,
        -0.038411740213632584,
        0.0071808528155088425,
        0.05773897469043732,
        -0.06357280910015106,
        -0.07394516468048096,
        0.026271400973200798,
        0.020270153880119324,
        -0.008412717841565609,
        0.03705720230937004,
        -0.10529570281505585,
        0.07233687490224838,
        -0.028064250946044922,
        0.027726085856556892,
        -0.014109338633716106,
        0.0682317391037941,
        0.021398333832621574,
        -0.07456611096858978,
        0.011707538738846779,
        0.06292229145765305,
        0.02443569526076317,
        -0.0416431687772274,
        -0.07998190820217133,
        -0.005376193672418594,
        0.008239995688199997,
        0.042221661657094955,
        0.013501294888556004,
        0.026109641417860985,
        -0.025036443024873734,
        -0.09632734209299088,
        -0.13317684829235077,
        0.0014771859860047698,
        0.01222627516835928,
        0.009464716538786888,
        -0.038854148238897324,
        -0.054678842425346375,
        -0.03845535218715668,
        -0.059612780809402466,
        -0.06466349214315414,
        0.10662692040205002,
        0.047317083925008774,
        -0.02667492814362049,
        -0.007911055348813534,
        -0.05812391638755798,
        0.008811024948954582,
        -0.08972759544849396,
        -0.06179851293563843,
        0.03631497547030449,
        0.00936941523104906,
        -0.020918257534503937,
        -0.04828699305653572,
        0.03958484157919884,
        -0.045632973313331604,
        -0.06931126117706299,
        0.022549469023942947,
        0.10626815259456635,
        -0.04378700628876686,
        0.08120203763246536,
        0.04495696723461151,
        0.019170409068465233,
        0.017138782888650894,
        -0.09661300480365753,
        -0.017537562176585197,
        0.05264092981815338,
        0.006742351222783327,
        0.007205558475106955,
        -0.059361107647418976,
        1.402498619950189e-32,
        -0.021583396941423416,
        0.0663725882768631,
        0.03770928829908371,
        0.07684831321239471,
        0.0021964621264487505,
        -0.022958217188715935,
        -0.009988549165427685,
        0.09968075901269913,
        -0.025670023635029793,
        0.008641018532216549,
        -0.0077249580062925816,
        0.054281383752822876,
        -0.035765327513217926,
        0.049527857452631,
        0.03342568874359131,
        -0.02554851956665516,
        -0.03985735401511192,
        -0.055373530834913254,
        -0.054958321154117584,
        -0.0015194262377917767,
        -0.007923934608697891,
        -0.03443310037255287,
        0.0035333381965756416,
        0.08456359803676605,
        0.08653493225574493,
        0.08576362580060959,
        0.06511054188013077,
        0.007924672216176987,
        0.08677973598241806,
        0.0037348000332713127,
        -0.03255029395222664,
        -0.04248538613319397,
        0.014272309839725494,
        -0.08180151134729385,
        -0.016520392149686813,
        0.0006767717422917485,
        -0.056473106145858765,
        -0.009260457940399647,
        -0.035239119082689285,
        -0.014902007766067982,
        -0.04188775271177292,
        0.002945017535239458,
        -0.10260920971632004,
        -0.0634990856051445,
        0.07493308931589127,
        0.06104549393057823,
        0.04931386560201645,
        0.07221855223178864,
        -0.021275335922837257,
        0.0229276604950428,
        -0.04611873999238014,
        0.015475406311452389,
        -0.024215837940573692,
        0.011833435855805874,
        -0.036374252289533615,
        -0.10867629200220108,
        -0.03286939114332199,
        0.027403462678194046,
        0.07498745620250702,
        0.04174112156033516,
        0.02587604522705078,
        -0.011988487094640732,
        0.0015356760704889894,
        -0.03888893127441406,
        -0.09810733795166016,
        0.08416349440813065,
        0.07292255014181137,
        -0.03746423125267029,
        0.011397859081625938,
        0.061870407313108444,
        0.022886738181114197,
        -0.002063306048512459,
        0.03693264722824097,
        -0.007898237556219101,
        0.0471828430891037,
        0.052169445902109146,
        -0.05830218642950058,
        -0.05723491311073303,
        0.038829658180475235,
        -0.04577513411641121,
        -0.08958148956298828,
        0.06526907533407211,
        -0.004297883249819279,
        0.08759566396474838,
        -0.019466424360871315,
        -0.059254761785268784,
        0.03496691212058067,
        -0.05500689148902893,
        -0.06392262876033783,
        0.022512227296829224,
        -0.04420585557818413,
        0.07479485124349594,
        -0.051553480327129364,
        -0.03564155474305153,
        -0.01316019520163536,
        -1.3332389336101213e-32,
        0.05183444917201996,
        0.029592759907245636,
        -0.02950509637594223,
        -0.014411570504307747,
        0.08905450999736786,
        -0.046184029430150986,
        0.028987141326069832,
        0.10787028074264526,
        0.08875435590744019,
        -0.06134314462542534,
        0.04576578363776207,
        -0.04885828495025635,
        -0.10696294903755188,
        -0.00403793528676033,
        -0.011432655155658722,
        -0.05782666802406311,
        -0.022355390712618828,
        -0.04489117115736008,
        0.05094217509031296,
        0.005079532042145729,
        0.06477540731430054,
        0.13185925781726837,
        0.05546289682388306,
        0.014186479151248932,
        -0.0007433631108142436,
        0.03815462440252304,
        0.04611244425177574,
        0.05556773021817207,
        0.06602999567985535,
        0.04976029321551323,
        -0.020779602229595184,
        -0.0696071907877922,
        -0.047259777784347534,
        0.017358221113681793,
        0.04269262030720711,
        0.05752682313323021,
        0.018798256292939186,
        0.031208762899041176,
        -0.00854084175080061,
        -0.06308595836162567,
        0.023148344829678535,
        -0.005003831814974546,
        -0.009743313305079937,
        0.016662204638123512,
        -0.004899852443486452,
        -0.11469238251447678,
        -0.06406418979167938,
        0.018232185393571854,
        0.015117865987122059,
        -0.0029036407358944416,
        -0.05293219909071922,
        -0.05650540068745613,
        -0.018597854301333427,
        -0.02025144174695015,
        -0.0094209099188447,
        -0.004823226481676102,
        -0.05028919503092766,
        -0.02380538545548916,
        0.028637226670980453,
        0.022319253534078598,
        0.0007254439406096935,
        -0.042851898819208145,
        -0.08302042633295059,
        -0.05181911587715149,
        -0.003621269715949893,
        -0.05680178478360176,
        0.09783414006233215,
        0.05076456815004349,
        -0.03654101490974426,
        0.03800158202648163,
        -0.017452968284487724,
        0.04319629818201065,
        0.024346018210053444,
        0.0166388638317585,
        0.024812588468194008,
        0.005762139800935984,
        -0.06488136947154999,
        0.002241311827674508,
        0.07353068143129349,
        -0.029861966148018837,
        -0.06318055838346481,
        -0.014660609886050224,
        0.03659956529736519,
        0.07399023324251175,
        0.0858607068657875,
        0.09752742946147919,
        0.07952228933572769,
        -0.03293300047516823,
        -0.0510319247841835,
        0.06398319453001022,
        0.03627549111843109,
        0.0712272971868515,
        0.06653432548046112,
        0.10955817252397537,
        -0.06864474713802338,
        -6.79979663686936e-08,
        0.03198324888944626,
        0.007638880982995033,
        -0.047481756657361984,
        -0.0053881085477769375,
        0.031449444591999054,
        -0.07956039160490036,
        -0.019328312948346138,
        -0.0037168425042182207,
        0.06265779584646225,
        -0.035734567791223526,
        0.11909431964159012,
        -0.01632707566022873,
        0.009500745683908463,
        0.10125929862260818,
        0.014710694551467896,
        0.011545566841959953,
        -0.09596966952085495,
        0.08212757110595703,
        -0.05334803834557533,
        -0.07212996482849121,
        -0.04256858304142952,
        0.06703391671180725,
        0.03452351689338684,
        -0.0600971095263958,
        0.045749880373477936,
        0.0014268439263105392,
        0.008077321574091911,
        -0.016248507425189018,
        0.025547683238983154,
        0.018328474834561348,
        -0.07068482041358948,
        -0.0018400218104943633,
        -0.011521419510245323,
        -0.031473997980356216,
        -0.04171980917453766,
        -0.042073898017406464,
        -0.06582155078649521,
        -0.031536102294921875,
        0.015534849837422371,
        -0.006613412406295538,
        -0.012153392657637596,
        -0.12664258480072021,
        -0.04159156605601311,
        -0.005945188924670219,
        0.023123644292354584,
        -0.06616365164518356,
        0.028148820623755455,
        -0.08631980419158936,
        -0.04780079424381256,
        -0.022802824154496193,
        -0.0551547110080719,
        0.041935406625270844,
        0.038405679166316986,
        -0.029790807515382767,
        0.061065852642059326,
        -0.001505343709141016,
        0.03061111643910408,
        0.06686829030513763,
        -0.003010326763615012,
        -0.004217085428535938,
        0.0458841398358345,
        -0.0026066885329782963,
        -0.062287189066410065,
        0.030505599454045296
    ]
}