{
    "id": "WVycLhE45kg",
    "title": "Facebook Sold me this Antivirus USB - FixMeStick",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-08-12T16:55:33Z",
    "video_url": "https://www.youtube.com/watch?v=WVycLhE45kg",
    "category": "Science & Technology",
    "tags": [
        "fixmestick",
        "virus",
        "malware",
        "antivirus",
        "anti-virus",
        "anti-malware",
        "backmeup",
        "startmestick",
        "facebook ads",
        "dragon's den",
        "shark tank",
        "pc repair",
        "computer repair",
        "infected computer",
        "infected pc"
    ],
    "views": 1742560,
    "likes": 59535,
    "comments_count": 1873,
    "description": "Check out Micro Centers August promotions and their new Charlotte location at the following links:     Micro Centers BYO Deals:      $25 Off Your Purchase of $100 or More for New Customers:      Micro Centers New Charlotte Location:   Create your build at   Weve been seeing a ton of ads for the FixMeStick lately, and it sounds like some kind of computer repair cure-all device. Can it really fix viruses and get your old computer running like new?  Discuss on the forum:   Check out FixMeStick here:   Bootable AV Tools mentioned in this video: Norton Life Lock Rescue Tools:  Panda Cloud Cleaner Rescue ISO:  Sophos Bootable USB:  ESET SysRescue:  Trend Micro Rescue Disk:  Avast Rescue Disk:  Avira Rescue System:  Comodo Rescue Disk:  Dr.Web Emergency Aid Kit:  Microsoft Defender Offline:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:28 In a Nutshell 4:00 How Much? 4:40 Marketing Claims 5:10 DIY 6:20 BackMeUp 7:13 StartMeStick 8:33 DIY 2.0 9:10 A Mixed Bag 10:40 Outro",
    "description_links": [
        "https://micro.center/e2b5cf",
        "https://micro.center/rwtz",
        "https://micro.center/e906f5",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1525733-facebook-sold-me-this-antivirus-usb/",
        "https://www.fixmestick.com/en-ca/",
        "https://support.norton.com/sp/static/external/tools/nbrt.html",
        "https://www.pandasecurity.com/en/support/card?id=1681",
        "https://support.sophos.com/support/s/article/KB-000033912?language=en_US",
        "https://www.eset.com/int/support/sysrescue/?ref=AFC-CJ",
        "https://www.trendmicro.com/en_gb/forHome/products/free-tools/rescue-disk.html?PID=6361382",
        "https://help.avast.com/en/av_free/17/securityrescuedisk.html",
        "https://support.avira.com/hc/en-us/articles/360007776058-Create-and-use-Avira-Rescue-System",
        "https://help.comodo.com/topic-170-1-493-5214-Downloading-Comodo-Rescue-Disk.html?af=7639",
        "https://free.drweb.com/aid_admin/",
        "https://support.microsoft.com/en-us/windows/help-protect-my-pc-with-microsoft-defender-offline-9306d528-64bf-4668-5b80-ff533f183d6c",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Ever since the channel hijack, I have been inundated with Facebook ads for the FixMeStick. They claim it will remove viruses, clean my computer, and even get my windows running like new, all in about 20 minutes. Those are some pretty bold claims, but their company got offers from all four of the investors on the Canadian version of Shark Tank back in 2014. They're sold on the shopping channel, and they're still around nearly 10 years later. They must be doing something right. How is it that I've never heard of them then? Inundated with Facebook ads, they're sold on the shopping channel, right. This thing ain't aimed at me or you. They're targeting our parents, our aunts, and our friends who keep asking for help tracking down the elusive AnyKey. But that doesn't necessarily mean that it's bad. Maybe it's a great option for those of us who are techie enough to fix our family's computers, but would rather that they just buy this and leave us alone so we can play video games. To find out, we bought one. Actually, we bought three, and I think you're going to be surprised to learn exactly what they do and what they don't do. For example, none of them were capable of making this segue to our sponsor, Build Redux. With Build Redux, you can dominate your favorite games with the perfect PC for you using simple to navigate customization options all at a price that's competitive with building it yourself. Check them out at the link down below. Hey, there it is. In a nutshell, the FixMeStick is a bootable virus removal device that's designed to find and remove any malware that's managed to slip past your PC's defenses, which is not as rare as you might think. Half a million new pieces of malware are discovered daily, and the makers of the FixMeStick claim that it finds malware on more than 80% of the computers scanned, even though virtually all of them were already running some other form of antivirus. Their main value is the user-friendly interface that they've wrapped around a bootable Linux image that needs almost no input from the user. You just boot from the stick, accept the license, and the FixMeStick will automatically connect to the internet, ask you to register, which you can skip, by the way, check for updates, load up not one, not two, but three antivirus engines, Avira, Sophos, and McAfee, and then get right to scanning with all three of them at the same time. While that's running, I guess, I should tell you about our test system. We took one part Windows 10 test bench and added a few dozen drops of threats you'd expect any decent antivirus engine to flag, you know, various forms of the iCar anti-malware tests, along with some very real, though relatively harmless, malware. Not a huge challenge, but definitely enough to prove that each of those three antivirus engines is actually doing something. As advertised, about 20 minutes later, the scans were done and the FixMeStick was asking for input. The default action is to remove all malware found, but you can also pick what happens with each flagged file. In our not terribly scientific testing, the FixMeStick caught more than 90% of our threat files, with the majority spotted by all three engines. But with that said, each one engine did miss things that were caught by at least one of the others, which I guess answers the question of why does it need to run all three? We also tested the FixMeStick against a MediCat USB stick to see if A, the FixMeStick would scan removable media at all, and B, to see if it would flag useful tools as malware. As expected, we did get false positives on some of our system utilities, but this did show us that yes, removable media is automatically scanned alongside your operating system drive. In fact, by default, FixMeStick scans all files on all partitions, whether they're on removable drives or not, you can change that behavior and some other basic options on the settings screen where you can also remove items from quarantine and even subject yourself to some targeted marketing, if you're into that sort of thing. This smooth experience doesn't come for free though. One year's use of FixMeStick on up to three PCs is gonna set you back 80 US dollars, whereas two years on five PCs is $30 more for a total of $110. That is not an insignificant amount. However, you're not necessarily stuck paying that much. It can often be found cheaper in your local big box store and they have a 30 day trial that will set you back just $20 if you pretty much just wanna use it once. However, I have a serious problem with their marketing of that trial price. They pretend to give you a special deal when you click through an ad, then at the same time, they just plainly state that the $20 trial is available on various pages all over their website. I also don't think that the FixMeStick in general quite lives up to their marketing claims. Most of their ads seem to make a big deal about speeding up slow systems and eliminating crashes and freezing. While FixMeStick can do those things, if the problems are being caused by malware, it can't do anything to clean up a full drive, repair broken Windows files, or sort out misconfigured settings. This isn't a technician on a stick. It's just an antivirus tool. As many of you I know are probably dying to contribute right now, you can make one of these on your own for free. There are plenty of bootable anti-malware tools out there that you can just slap onto your USB stick and run. Insert disclaimer about us not having validated their efficacy, so your mileage may vary. But the main issue with all of them, for Joe or for Jill Average, is that they're just not as polished as this, and they're not as fast. You will likely need to manually update your virus definitions before you run a scan, and the scan itself takes longer too. Then when it's done, you're gonna have to run more tools to catch whatever's been missed. For me or for you, that's no big deal. But for many people, time is money, and tinkering with computers isn't something that they do for pleasure, which is why I guess FixMeStick has found a market. It's not cheap, but it does cost less than a visit to the local computer shop for virus removal, and having something that you can just hand to Aunt Susie that's gonna just work on a simple infection could be worth it for her. She might even be so grateful she gets you the new PCMR hoodie from lttstore.com. Where FixMeStick really offers bang for the buck though is the back me up edition. $20 more gets you a 64 gig USB stick that also automatically backs up files from the user's folder of your system drive after scanning them, giving you at least a little bit of protection if you later get hit with something that the FixMeStick cannot resolve, something like a ransomware attack. This may actually be the simplest method that we've seen for making a backup for an average user's PC. By default, it backs up pretty much everything that a casual user might be storing, though we did notice some glaring emissions like Photoshop's PSD format. So if you're beyond a casual user, or if you need more than 64 gigs of storage, you might wanna tweak the settings to include other extensions or to target additional folders. By that point, you might as well pick up a larger external drive and then just use the only slightly more complicated tools that are built right into Windows or Mac OS. We also looked at their StartMeStick, and to many of you, this is gonna look like a pretty old idea, a simple bootable operating system that just works on any old hardware. For the folks buying FixMeSticks, though, this might as well be magic. Now grandpa can get on Facebook and check his email with things feeling nice and zippy with a lightweight operating system and a modern browser. He can even use it on any PC so he can take it with him when he travels, but there are some problems. For one thing, it's a read-only system, which means you can't screw up the OS by downloading something nasty, but on the other hand, it means that any new bookmarks or files are going to simply vanish on reboot, and it doesn't give the user any indication that that's going to happen. As you're using it, it looks like it's done what you've told it to do. Your downloads and your bookmarks hang out in temporary storage while the OS is running, but unless you add a separate external drive for storage and sign into a Google account for your bookmarks, all of it will disappear. Even worse is the fact that this means it cannot update itself. For updates, you have to boot into Windows, run the updater for your StartMeStick, then boot back into your Live OS. Convenient. The second big issue is that it's $80 and it expires if your subscription expires. Why? Anybody watching this? No, this one really is easy. You could Google something like persistent live USB and follow a guide or just download Rufus and drag the slider to the right to create a similar bootable USB stick, and that one would even let Grandpa save files in his home drive, all for the cost of a USB stick and anywhere from 10 minutes to a couple hours of time. And it would never cost you anything for updates. Or, I mean, if you just wanted to skip all of that, you could just put a simple Linux install on the system's hard drive in the first place, improving Grandpa's performance without the need for unreliable USB boot media. So then, FixMeStick's product line is something of a mixed bag. A bootable antivirus that's simple enough for almost anyone to use is actually useful. And when paired with automatic backups, it might even be something that I would recommend to the less tech-savvy user. But then at the same time, the pricing is pretty spicy. Their marketing ranges from optimistic to downright unacceptable. And whatever they might say, these tools aren't and never will be a replacement for a competent technician. They're also not a replacement for our sponsor. Micro Center, they've renamed August to Build Your Own Month in honor of the dozens of amazing new discounts on their site. Not sure if they have the legal right to do that, but here we are. New customers can get $25 off their purchase of $100 or more in store. And if you submit any custom build to their build showcase, you can get an additional 25 bucks off coupon upon approval. Wow. If you're new to PC building, Micro Center's professional staff can help you pick your parts and even build your PC all within your ideal budget. Now you might look around and think, uh-oh, I don't see any Micro Centers near me. But that might change. Their Indianapolis store just opened. They have a new Charlotte location opening early 2024 and two more stores are in the works. So check out Micro Center this Build Your Own Month and get a sneak peek at their new Charlotte location at the links below. I'm gonna miss saying August. If you enjoyed this video, you might be interested in the video we did a couple of years back, testing how antivirus programs impact your system performance. You can find that at the link down below.",
    "transcript_keywords": [
        "FixMeStick",
        "USB stick",
        "USB",
        "Shark Tank back",
        "system",
        "Build",
        "Micro Center",
        "antivirus",
        "malware",
        "stick",
        "drive",
        "user",
        "windows",
        "Build Redux",
        "back",
        "Facebook ads",
        "files",
        "Shark Tank",
        "bootable",
        "Facebook"
    ],
    "transcript_entity_values": [
        "early 2024",
        "80",
        "one",
        "two years",
        "second",
        "more than 80%",
        "Windows",
        "Aunt Susie",
        "Google",
        "first",
        "25",
        "Micro Center this Build Your Own Month",
        "Windows or",
        "August",
        "Avira",
        "80 US dollars",
        "AnyKey",
        "Rufus",
        "up to three",
        "StartMeStick",
        "Grandpa",
        "McAfee",
        "Windows 10",
        "StartMeStick",
        "30",
        "Indianapolis",
        "daily",
        "five",
        "Joe",
        "Build Your Own Month",
        "an additional 25 bucks",
        "more than 90%",
        "all four",
        "at least one",
        "Photoshop",
        "iCar",
        "just $20",
        "64",
        "Mac",
        "about 20 minutes",
        "Sophos",
        "about 20 minutes later",
        "Jill Average",
        "10 minutes to a couple hours",
        "dozens",
        "One year's",
        "three",
        "around nearly 10 years later",
        "Build Redux",
        "110",
        "Micro Center's",
        "Half a million",
        "Facebook",
        "100",
        "more than 64",
        "20",
        "a few dozen",
        "USB",
        "Shark Tank",
        "Canadian",
        "Linux",
        "Charlotte",
        "Micro Centers",
        "30 day",
        "Linux",
        "2014",
        "two",
        "Micro Center",
        "a couple of years"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "PERSON",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "FAC",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "GPE",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.1030353233218193,
        -0.012946180067956448,
        0.045608218759298325,
        -0.08288192749023438,
        0.16904737055301666,
        0.03277841582894325,
        0.03778284415602684,
        0.017015252262353897,
        -0.032759182155132294,
        0.03758982568979263,
        0.05382898449897766,
        0.08746722340583801,
        -0.0011697368463501334,
        -0.030493218451738358,
        0.01069360226392746,
        -0.018706440925598145,
        -0.007035849150270224,
        -0.07734809815883636,
        -0.02496197633445263,
        0.04003366082906723,
        -0.07770933210849762,
        0.0029033757746219635,
        -0.022876933217048645,
        -0.03575373440980911,
        -0.06503244489431381,
        -0.02230983041226864,
        -0.014692073687911034,
        -0.017221683636307716,
        -0.024167923256754875,
        -0.06822523474693298,
        -0.018899068236351013,
        -0.005861377809196711,
        0.0022248351015150547,
        0.011443562805652618,
        0.026794040575623512,
        -0.019310809671878815,
        0.0022623229306191206,
        -0.03200023993849754,
        -0.10441076755523682,
        -0.011438677087426186,
        0.03235403448343277,
        0.0014943170826882124,
        0.01218513585627079,
        0.014656725339591503,
        0.02935377135872841,
        0.03703630343079567,
        -0.013205503113567829,
        0.00883228238672018,
        0.05055809020996094,
        -0.038653723895549774,
        -0.004456242546439171,
        -0.05084662884473801,
        0.0066775064915418625,
        0.01914188452064991,
        -0.04573429748415947,
        0.04033077880740166,
        0.0038863951340317726,
        -0.00036580211599357426,
        0.031396932899951935,
        -0.00767145911231637,
        0.08412247151136398,
        -0.023807985708117485,
        -0.015870193019509315,
        0.046506620943546295,
        0.004339472856372595,
        0.0073166415095329285,
        0.013355561532080173,
        -0.055788859724998474,
        0.01589466631412506,
        0.027927745133638382,
        -0.040227342396974564,
        -0.02297787182033062,
        0.011662246659398079,
        0.13815221190452576,
        0.02049519494175911,
        0.09428437799215317,
        0.018450511619448662,
        0.04226747155189514,
        0.046001728624105453,
        -0.02415754832327366,
        -0.0153677798807621,
        -0.04565088078379631,
        0.06658985465765,
        -0.02023318223655224,
        0.02815595082938671,
        0.0148920314386487,
        -0.0004852177225984633,
        -0.08185834437608719,
        0.10075049847364426,
        -0.026168568059802055,
        0.046603210270404816,
        0.057889994233846664,
        0.08186201006174088,
        0.004107429180294275,
        0.006204485427588224,
        0.02173437550663948,
        0.04821673035621643,
        -0.012270520441234112,
        -0.05386339873075485,
        0.04595864564180374,
        -0.047040823847055435,
        -0.0490194708108902,
        0.010171596892178059,
        -0.10669616609811783,
        -0.021007224917411804,
        -0.050561197102069855,
        -0.02485690638422966,
        0.017388908192515373,
        0.041882019490003586,
        -0.011418905109167099,
        -0.04565175250172615,
        0.03332314267754555,
        -0.03184381127357483,
        0.018045026808977127,
        0.029081925749778748,
        -0.04736745357513428,
        -0.08212807029485703,
        -0.024978259578347206,
        0.024066565558314323,
        -0.05425379052758217,
        0.07937705516815186,
        -0.002155938418582082,
        0.03883035480976105,
        -0.1024298146367073,
        0.002043896121904254,
        0.04896935820579529,
        0.011241511441767216,
        2.9436341987497937e-33,
        0.018517082557082176,
        0.03206514194607735,
        -0.06535030901432037,
        -0.03833939880132675,
        -0.006460055708885193,
        0.01876276172697544,
        0.05802145227789879,
        0.014146650210022926,
        0.009704582393169403,
        -0.013746680691838264,
        -0.07625960558652878,
        0.024118291214108467,
        -0.010865317657589912,
        0.07652721554040909,
        -0.007248948328197002,
        -0.01881069503724575,
        0.02374405600130558,
        0.004431529901921749,
        -0.034360405057668686,
        -0.009211253374814987,
        0.053160350769758224,
        0.0300945732742548,
        -0.012267169542610645,
        -0.0552138015627861,
        0.10465101897716522,
        -0.029200248420238495,
        -0.0039106677286326885,
        0.03514648601412773,
        0.1767279952764511,
        -0.01764599233865738,
        -0.12781676650047302,
        0.08383771777153015,
        -0.0007674614316783845,
        -0.043778058141469955,
        -0.028450997546315193,
        0.01177108846604824,
        -0.03802216053009033,
        -0.07242091000080109,
        -0.011089115403592587,
        -0.03873507305979729,
        0.0373862087726593,
        0.004407287575304508,
        -0.06075223162770271,
        -0.04687418416142464,
        0.028154822066426277,
        -0.001082235132344067,
        -0.08175593614578247,
        -0.02330406755208969,
        0.012309600599110126,
        -0.043956950306892395,
        -0.08964361250400543,
        -0.002723779994994402,
        -0.00011419899965403602,
        0.027401916682720184,
        -0.09235274791717529,
        0.029851842671632767,
        0.003175715683028102,
        -0.02060122601687908,
        0.03972047194838524,
        -0.04553494602441788,
        0.08858512341976166,
        -0.04171973839402199,
        0.13993267714977264,
        -0.042652059346437454,
        -0.03321922570466995,
        -0.030544083565473557,
        0.07721241563558578,
        0.035192061215639114,
        -0.04978732392191887,
        0.012168394401669502,
        -0.021700171753764153,
        -0.05179400369524956,
        0.029170313850045204,
        -0.042431849986314774,
        -0.03212222456932068,
        -0.010273163206875324,
        -0.05378708243370056,
        -0.051931533962488174,
        -0.08434338122606277,
        -0.03654657304286957,
        -0.03299667686223984,
        -0.07516392320394516,
        0.08382586389780045,
        0.021791275590658188,
        0.03331493213772774,
        -0.01503368653357029,
        -0.04682128131389618,
        -0.009694378823041916,
        -0.038751959800720215,
        -0.05391800031065941,
        0.02530536614358425,
        0.029710251837968826,
        -0.004228508565574884,
        0.08320415765047073,
        -0.06105213984847069,
        -4.347888750120722e-33,
        -0.08463674038648605,
        -0.0452660396695137,
        0.054528310894966125,
        0.004667251370847225,
        -0.03943384811282158,
        0.03403118625283241,
        0.007311616558581591,
        0.031105980277061462,
        0.01924108900129795,
        -0.015123718418180943,
        -0.039830852299928665,
        -0.015369056724011898,
        -0.03995531052350998,
        -0.08760444074869156,
        0.016974851489067078,
        0.01232325378805399,
        -0.02529754862189293,
        -0.023809900507330894,
        0.04769221320748329,
        -0.024236194789409637,
        0.007609608583152294,
        0.030666792765259743,
        -0.0011644484475255013,
        0.02387174218893051,
        0.02558697573840618,
        0.02139522321522236,
        0.04129408672451973,
        0.08483676612377167,
        -0.048397209495306015,
        0.036373626440763474,
        0.08901992440223694,
        -0.06105602905154228,
        0.0018373681232333183,
        0.04983845725655556,
        0.1190262883901596,
        0.028300469741225243,
        0.09629499912261963,
        -0.08592396974563599,
        -0.007676384411752224,
        -0.13295425474643707,
        0.04870573431253433,
        -0.0056882877834141254,
        -0.02882353961467743,
        0.031105784699320793,
        0.04105426371097565,
        -0.03148370236158371,
        -0.016041656956076622,
        -0.047882165759801865,
        -0.002476522233337164,
        0.06640200316905975,
        0.048095546662807465,
        -0.09169332683086395,
        0.07562213391065598,
        0.06481793522834778,
        -0.061332639306783676,
        -0.01118413545191288,
        0.018795298412442207,
        0.039373353123664856,
        -0.07449695467948914,
        0.0002566940675023943,
        -0.019273752346634865,
        0.02604733221232891,
        -0.05567041411995888,
        -0.05498557537794113,
        0.036924734711647034,
        0.07289853692054749,
        0.1226690262556076,
        0.04265119507908821,
        -0.09238208830356598,
        -0.027645515277981758,
        -0.003872761968523264,
        0.06644915789365768,
        -0.034157294780015945,
        -0.054894812405109406,
        0.017742827534675598,
        0.03961673006415367,
        0.02924221381545067,
        -0.08292663097381592,
        -0.09141944348812103,
        0.004795192740857601,
        -0.008603557012975216,
        -0.09871768951416016,
        -0.012654305435717106,
        0.005537122953683138,
        0.013550938107073307,
        -0.07006039470434189,
        0.06505560129880905,
        0.04103590548038483,
        0.02782726287841797,
        0.041746124625205994,
        -0.09948651492595673,
        -0.05932461842894554,
        -0.021237650886178017,
        0.042967893183231354,
        0.0703171044588089,
        -4.894997118753963e-08,
        0.044477708637714386,
        0.02784494310617447,
        -0.008168524131178856,
        0.045796532183885574,
        0.03834877535700798,
        -0.07853490859270096,
        -0.07679154723882675,
        0.02994893118739128,
        -0.020006557926535606,
        -0.014408264309167862,
        0.014078622683882713,
        -0.028427286073565483,
        -0.0404403880238533,
        0.0038931122981011868,
        -0.012096838094294071,
        -0.017656750977039337,
        -0.09108252823352814,
        0.11425940692424774,
        -0.04684814065694809,
        -0.09236611425876617,
        0.012649848125874996,
        0.04533829540014267,
        0.03233758732676506,
        -0.04184451326727867,
        0.05474981665611267,
        0.005870503839105368,
        0.02909199148416519,
        0.056917499750852585,
        0.03730764240026474,
        -0.0613887757062912,
        -0.15569375455379486,
        -0.021995702758431435,
        0.10258770734071732,
        0.05624783784151077,
        -0.008760145865380764,
        -0.018015947192907333,
        0.0356590636074543,
        -0.0215784702450037,
        0.09914076328277588,
        0.029743146151304245,
        0.04901989549398422,
        0.00028085208032280207,
        0.0008434468763880432,
        -0.027090582996606827,
        -0.02802063524723053,
        -0.028079655021429062,
        -0.08305361866950989,
        -0.05793443322181702,
        0.043446071445941925,
        0.006991978734731674,
        0.0019498583860695362,
        0.0722728818655014,
        -0.016376592218875885,
        0.079255111515522,
        -0.019181925803422928,
        -0.05369244143366814,
        -0.04827294126152992,
        0.037562355399131775,
        0.09015437960624695,
        0.10692448168992996,
        -0.012093917466700077,
        -0.1345442235469818,
        0.0604247972369194,
        0.05345602333545685
    ]
}