{
    "id": "Wwc9vy6BIII",
    "title": "Why is EVERYONE buying this monitor??? - Sceptre E248W-19203RT",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-02-02T22:36:49Z",
    "video_url": "https://www.youtube.com/watch?v=Wwc9vy6BIII",
    "category": "Science & Technology",
    "tags": [
        "Sceptre",
        "Display",
        "Monitor",
        "IPS",
        "VA",
        "HP",
        "Viotek",
        "1080p",
        "Pixel Response Time",
        "LTT",
        "LMG",
        "Linus",
        "Amazon",
        "Best Seller"
    ],
    "views": 2317747,
    "likes": 67005,
    "comments_count": 3942,
    "description": "Save 15% with code LinusTechTips at   Try Zoho One free for 30 days with no credit card required here:   Wanna know why everyone on Amazon is buying the Sceptre E248W-19203RT? We did too, so we bought one! Is it any good? Guess we're just going to have to find out.  Discuss on the forum:   Check out the monitors featured in this video:  Sceptre 24\" 248W-19203R:   Koorui 22\" 22N1:  Koorui 24\" 24E4:  Viotek 24\" GFV24CB:  Acer 22\" SB220Q:  ASUS 24\" VA24DQ:  HP Pavilion 22\" 22CWA:  LG UltraGear 34\" Curved QHD 34GP83A-B:  ASUS ROG Swift 27\" QD-OLED PG27UQ:  Alienware 34\" Curved QD-OLED AW3423DW:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   COME TO LTX 2023:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:12 Sceptre E248W-19203RT 3:00 Last Decade's Champion 4:10 Gaming On It 6:40 It's Perfectly Adequate 8:26 Bad Reviews 9:30 Other Options 11:10 Conclusion 13:17 Outro",
    "description_links": [
        "http://vessi.com/LinusTechTips",
        "https://www.zoho.com/one/lp/linus.html",
        "https://linustechtips.com/topic/1485708-why-is-everyone-buying-this-monitor/",
        "https://geni.us/MTb2Cz",
        "https://geni.us/gggm74S",
        "https://geni.us/UEhfR9",
        "https://geni.us/7CrZqZC",
        "https://geni.us/4Awyc",
        "https://geni.us/CJRM",
        "https://geni.us/C2xSpSr",
        "https://geni.us/E8DLql",
        "https://geni.us/tpzMjP",
        "https://geni.us/A3AD",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(bright music) (glass clanking) - Guess I need a new one. (wind whooshes) (wind whooshes) - This is the god king of gaming monitors. - I can't afford that, Linus, mm. - Wait, you don't need the god king of monitors, I know we talk about expensive stuff all the time but you can get a really decent display for as little as 100 bucks these days. - Yeah, right, $100? - Yeah. I mean, sure, it's only 75Hz and 1080p, but look at all these reviews. - Isn't this some hunk of junk? - Hey, come on. Will the people steer you wrong? Tell you what. Let me figure out why the (beeps) everyone is buying this thing. Gimme a few days and I'm gonna get back to you, and while you're waiting, nice backpack, by the way. Why don't you check out our sponsor? Zoho One. No more worrying about using multiple platforms and software to manage your business. With Zoho One you'll have a single unified platform that's both comprehensive and easy to use. Start your free 30-day trial using the link down below. (upbeat music) (computer beeping) (energetic bright music) Introducing the Sceptre E248w 19203R, or rather, the 19203RT. We ordered the first one and we got the other one, they have the exact same specs, so we think it's either a newer revision or maybe a regional thing. Whatever this thing is, it's got over 25,000 reviews on Amazon with 76% of you giving it a five-star rating, that is really impressive. There's not too much to it, two HDMI ports, VGA, audio in and out, and a barrel plug for power, no display port is kind of odd for a PC monitor, and has some drawbacks, we'll talk more about that later. The stand attaches with a couple of screws, and in terms of adjustment, features this, and that's about it. We've got our speaker grills on the back, my hopes are not too high for these. A Kensington lock, and then navigation buttons for the OSD. They're labeled, but they're labeled on the back, which is better than nothing but not as good as being labeled on the front. As for the overall feel, well, it's light and cheap, but it's kinda what we like about it. And there's a lot more to like, 1080p resolution isn't cutting edge, but at 24 inches it's definitely enough, and while 75Hz refresh rate is less than you might expect for a gaming-first monitor these days, it is noticeably better than the 60Hz that was standard for so many years. It's also VESA mountable, includes speakers, supports variable refresh rate, really? That's cool. And boasts 3ms gray-to-gray pixel response times, 95% coverage of the sRGB color space, 250- it peak brightness, all on VA panel. Hmm, VA panel. The HP that you guys were buying last time we did this was IPS, and it was just 90 bucks, did we take a step backwards here? Well, it might seem like it on the surface, and the Pavilion 22cwa is still a valid choice all these years later, but last decade's champion is only 21.5 inches, is stuck at just 60Hz, its gray-to-gray response times also weren't great, and the stand was pretty weird. Its main draw really was just being an IPS panel for cheap, which was unheard of back then. Let's see if our newcomer can hold up. This is not bad. We measured them, the Delta Es are eight out of the box and six with calibration, meaning nah, you're not gonna be doing any color-accurate work on it, but, like, it's poppy. I mean, VA can be a drawback in terms of pixel response time, we're gonna play around with that once I actually get in game, but it's a benefit when it comes to contrast. Like, obviously it's not OLED, but it pops? You know what blows my mind? This is better in every way than my first, like, large format monitor. It was a Dell 2405FPW, and it was 16 X 10, and had a better stand obviously, but it did not look anywhere near this good. I spent like 6, $700 on that thing, second hand, and this just craps on it in terms of the image quality. Oh, hold on a second, David. Oh my god, are you seeing this motion blur on the high contrast edges here? - [David] Yeah. - [Plouffe] This is still playable though. - Oh, it's playable for sure. Oh, what just happened? Okay, hold on, I gotta pay attention here. Where's my freaking oddball at? Ah, no, don't shoot me, don't shoot me. No! Damn it! Okay, sorry, I'm paying attention. I was busy, I was busy observing the smearing. Okay, come check this out, guys. Oh man, you see how it kind of, aside from the tearing, okay? Let me find, I gotta find like a, oh, shoot. Ah, dang it. I'm trying to look, I'm trying to benchmark here. Okay, it's two things, okay? It's the blurriness on the trailing edges we're moving, and then it's also the overdrive artifacting on the leading edge, so it's just a mess when it's in motion. See that? Something that really stands out to me is that, compared to our last pick, 24 inches is kind of the threshold to me for immersion, it doesn't feel small, and it might not have the sharpness of a higher pixel density display, but this is super easy to drive with an inexpensive GPU, and at 1080p you really wanna stick to your native resolution, at 4k, 5k, the interpolation is not as distracting but at this res, it doesn't look great. This smeariness doesn't look great under any circumstances, it's pretty rough. (gun banging) (Spartans grunting) - [Plouffe] Would you pay 100 bucks for this? - 100 bucks? Easy. That's like the easiest decision ever. You know what? The 2405FPW was also VA, and also had wicked motion blur. I remember it stood out to me the most in \"Freelancer.\" This is basically my first awesome monitor but it's $100 now. Like, yeah, how can you argue with that? It's compelling. - [Plouffe] How does a 75Hz feel compared to 60Hz. - 75Hz is markedly better than 60? Like, it's a huge difference. Hey, I got 'em, yes, ha-ha! Sorry. Look, I haven't played in a while, okay? It's taking me a sec here. (TV beeps) It's not a gaming monitor. If competitive shooters are your bread and butter, I'd consider ponying up the extra $25 for this KOORUI model. But it never claims to be, and it's perfectly adequate for just about anything else, and in my opinion, good enough for gaming anyway, but enough about what I think, what do you guys think? The five-star folks, it seems, are really loving the value. They like the picture quality, the size, the value, how skinny it is, how easy it is to set up, and the value, did I mention the value? It seems like a common use case for these things is to buy a carton of them for a cheap and cheerful multi-monitor battle station with multiple users pointing out its amazing utility for things like security systems. Some of you're upgrading from smaller screens and just don't wanna go too big, while others are looking for an inexpensive secondary monitor that is both easy to mount and not total garbage. We did find some valid complaints about missing screws or lackluster durability, but overwhelmingly, you all still gave it five stars. Does the E248-19203RT get anything wrong? Yes, and the most reasonable complaints come mostly from the four-star crowd. You guys are still loving the price, compared to a basic gaming monitor like this Viotek, but the coffee and donut that you bought with your savings are long gone, leaving behind only sticky packaging and a bitter aftertaste. There is bad smearing, the stand isn't all that adjustable, it does feel cheap and plasticy, and the speakers, well, they're present but they're not very good, still though, for the most part, you guys seem pretty pleased too, and four and five star reviews make up about 92% of all user reviews, bringing us to the other 8%. Almost all of the one to three star reviews were about bad quality control. Bad HDMI cable, panel deterioration, broke after a move, dead pixels, the RMA process sucked, crappy stand, and then a lot of people with similar complaints to the four star crew, but just louder and angrier, that's only 8% of all reviews, even on a premium product that would be a pretty impressive rating. And outside of failures, which typically can be RMAd within the first year, even if the process for it isn't great, there just aren't a lot of complaints. I mean, the quality isn't exceptional like the clothing on lttstore.com, especially our new Henley shirt. Ooh. But at least with the Scepter, you know you're buying the value option, whether it's a three-pack for a $300 battle station set up, or just a simple terminal monitor that only needs to display text. I've seen enough at this point to give it the should-be-fine award of sufficiency. But if you've made it this far in the video, you might be shopping for a monitor in this range and you probably wanna know if there are other options that could be a better buy, eh, and there might be. There's a saying that you might have heard a few times on this channel, there's no such thing as a bad product, just a bad price, and at anything higher than the price we paid for this, it would be a bad price and you'd be better off shopping elsewhere. The reality is that, while this thing is gonna give you exactly what it says for cheap, as soon as it goes back to its current Amazon list price of $125, it gets drowned by the competition. This KOORIU monitor, don't ask, I've never heard of them, buy at your own risk, is only 22 inches, but it's less than $80. They've got a 24-inch model on sale too that's 165Hz, for $125. That's about the same as the Viotek that I showed you guys before. And if you don't need high refresh rate anyway, this Acer model is also just $100 at the time of writing, with even more positive reviews. The main drawback of that one though? Is that it can't be VESA mounted, really takes away that battle station capability. For $150, regularly on sale for more like 125 to 130 you can get the VA24DQ from Asus, same size, resolution, and refresh rate, but it is IPS, with better pixel response times and you're not limited to AMD graphics cards if you want variable refresh rate support thanks to the display port connection. It should be noted that while Nvidia can do variable refresh rate over HDMI, it's only on HDMI 2.1, which (laughs sarcastically) this monitor does not support. And if you don't like Asus for whatever reason, in the 1, 2, $125 price range, there are a lot of options with basically those same specs from a number of different brands, which I think leads us to a really good point here. Whether you guys keep buying the Scepter E248w 19203RT, or you end up swapping to basically any other brand with similar specs around the same price, what matters is that decent secondary displays have reached the point where they are truly cheap now. The fact that this little guy can be VESA mounted and quickly incorporated into your setup, means that just about anyone who can afford a computer can also afford a multi-monitor setup that isn't crap, which has a huge impact on productivity, which actually leads us into another important point. Don't get drawn into spending more than you intended with this kind of thing. I mean, a lot of alternative options we mentioned were only, you know $20 to $30 more, but that's a 20 to 30% price increase, and when you consider how fast display tech is moving these days, that might not be worth it for you, and that's especially true if you're picking up two or three of these things and paying that extra 20% each time. So the Scepter E248w-19203RT then, it may not be the god king of monitors, but it's also not the peasant deuce. So maybe keep buying them then? Just don't pay more than $100. We ran some tests and yep, you get what you pay for. But let's be real, your security camera feed doesn't need Delta Es of 2 or 120Hz and HDR to see that I'm about to segway to our sponsor. - Vessi. Do you ever struggle to figure out what you're gonna wear on your feet in unpredictable weather? Vessi says that their shoes are 100% waterproof, keeping your feet dry in the wettest of weather. Their lightweight and easy-to-pack sneakers offer you reassurance when the snow and the rain start coming down, and putting them on and taking 'em off is super easy 'cause they're slip-ons. Their shoes are made from cruelty-free products right down to the glues. Whether it's a rainy city or a rocky trail, the herringbone tread design is there to help you from slipping all over the place. So treat your feet with Vessi and save 15% off with our offer code. LinusTechTips at vessu.com/LinusTechTips. - If you guys liked this video, make sure to check out the others in this series. Maybe the HP monitor we looked at almost five years ago, it was okay.",
    "transcript_keywords": [
        "monitor",
        "guys",
        "refresh rate",
        "thing",
        "price",
        "bad",
        "reviews",
        "time",
        "display",
        "easy",
        "god king",
        "response times",
        "refresh",
        "rate",
        "cheap",
        "pixel response times",
        "HDMI",
        "things",
        "times",
        "back"
    ],
    "transcript_entity_values": [
        "only 8%",
        "almost five years ago",
        "20 to 30%",
        "one",
        "Acer",
        "Viotek",
        "Vessi",
        "165Hz",
        "eight",
        "300",
        "5k",
        "Zoho",
        "VGA",
        "Henley",
        "only 21.5 inches",
        "GPU",
        "as little as 100 bucks",
        "19203RT",
        "KOORUI",
        "IPS",
        "1",
        "VA",
        "only 22 inches",
        "AMD",
        "Zoho One",
        "2405FPW",
        "three",
        "the Pavilion 22cwa",
        "Linus",
        "100 bucks",
        "VA24DQ",
        "Viotek",
        "just $100",
        "first",
        "25",
        "24 inches",
        "19203R",
        "VESA",
        "Bad HDMI",
        "the Delta Es",
        "over 25,000",
        "Amazon",
        "16 X 10",
        "the first year",
        "six",
        "sec",
        "120Hz",
        "LinusTechTips",
        "1080p",
        "last decade's",
        "four",
        "less than $80",
        "HP",
        "30",
        "150",
        "David",
        "125",
        "five",
        "E248",
        "four and",
        "100%",
        "20%",
        "6, $700",
        "2.1",
        "30-day",
        "8%",
        "HDMI",
        "15%",
        "mm",
        "95%",
        "KOORIU",
        "75Hz",
        "two",
        "OSD",
        "more like 125 to 130",
        "these days",
        "these years later",
        "90 bucks",
        "second",
        "RMA",
        "Asus",
        "Delta Es",
        "4k",
        "24-inch",
        "VA",
        "Spartans",
        "more than $100",
        "about 92%",
        "Kensington",
        "Nvidia",
        "2",
        "100",
        "76%",
        "60Hz",
        "a few days"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "PERCENT",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "ORDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "NORP",
        "MONEY",
        "PERCENT",
        "GPE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.06253312528133392,
        -0.011623669415712357,
        -0.021066812798380852,
        -0.012498515658080578,
        0.10874025523662567,
        0.058335453271865845,
        -0.02307761460542679,
        0.021625487133860588,
        0.07342720031738281,
        0.01989823952317238,
        0.018709229305386543,
        -0.005930365063250065,
        0.047105152159929276,
        -0.04841669276356697,
        -0.010883497074246407,
        -0.04242313653230667,
        0.040771473199129105,
        -0.1471472531557083,
        -0.003961760085076094,
        -0.023372897878289223,
        -0.009200853295624256,
        -0.027992838993668556,
        -0.019808100536465645,
        -0.015616627410054207,
        0.02475341036915779,
        0.021345699205994606,
        -0.04549666494131088,
        -0.04030855372548103,
        -0.022832317277789116,
        -0.041364990174770355,
        0.030459506437182426,
        0.1148291751742363,
        -0.015516270883381367,
        0.06929724663496017,
        -0.059138551354408264,
        -0.13005004823207855,
        0.01501261442899704,
        -0.02375015616416931,
        -0.029013976454734802,
        -0.0631052777171135,
        -0.029912753030657768,
        -0.00491749495267868,
        -0.016611704602837563,
        0.019037462770938873,
        -0.0014017355861142278,
        -0.012892195023596287,
        -0.05096551030874252,
        -0.0433613583445549,
        -0.04493192955851555,
        -0.03641314432024956,
        0.009745010174810886,
        -0.0654352456331253,
        0.03480355069041252,
        -0.0729290023446083,
        -0.02644413337111473,
        0.02468949742615223,
        -0.03466878831386566,
        -0.090284064412117,
        0.06864999234676361,
        -0.003998612519353628,
        0.07747671008110046,
        -0.11244270950555801,
        -0.023654939606785774,
        0.0373629666864872,
        -0.012149682268500328,
        -0.03667321428656578,
        -0.008026327937841415,
        -0.06857716292142868,
        -0.057095687836408615,
        -0.01660093478858471,
        -0.013957152143120766,
        0.011679195798933506,
        0.05868702381849289,
        0.05207277089357376,
        0.019355904310941696,
        0.011781183071434498,
        0.055901918560266495,
        -0.07532238215208054,
        0.06428591161966324,
        -0.0007000037003308535,
        0.031336624175310135,
        0.00010868263780139387,
        -0.009694080799818039,
        0.04771536588668823,
        0.06687882542610168,
        -0.013918244279921055,
        0.05149684101343155,
        0.003964407369494438,
        0.05020643770694733,
        -0.0575801320374012,
        0.001516539603471756,
        0.04586075618863106,
        0.0010373882250860333,
        0.053065087646245956,
        -0.05403189733624458,
        -0.004183197859674692,
        0.05761207267642021,
        -0.03645633906126022,
        -0.015593026764690876,
        0.04633798450231552,
        0.02515517547726631,
        0.054572541266679764,
        0.13375484943389893,
        -0.04453837499022484,
        -0.022044925019145012,
        -0.0416189469397068,
        0.021181726828217506,
        0.047349657863378525,
        -0.05000020191073418,
        0.040329914540052414,
        -0.02244870364665985,
        0.030388034880161285,
        -0.011587387882173061,
        0.0043427771888673306,
        0.0416831336915493,
        0.052164677530527115,
        -0.07236996293067932,
        -0.027624407783150673,
        0.09190399199724197,
        -0.017878994345664978,
        0.03251877427101135,
        0.002967765787616372,
        -0.08349967002868652,
        -0.02289332076907158,
        -0.03594734147191048,
        0.030048461630940437,
        -0.05733715742826462,
        8.957764334313022e-33,
        -0.0274882223457098,
        0.06609899550676346,
        -0.09796477109193802,
        -0.07132835686206818,
        0.0039024485740810633,
        0.11021984368562698,
        0.02882843278348446,
        0.09205107390880585,
        -0.017206870019435883,
        0.022968126460909843,
        -0.07521361857652664,
        -0.021354645490646362,
        -0.03942159190773964,
        0.06581435352563858,
        0.015792669728398323,
        0.013643600977957249,
        -0.010924304835498333,
        0.0646107867360115,
        -0.026263492181897163,
        0.04383062943816185,
        0.06624755263328552,
        -0.06555051356554031,
        0.016424670815467834,
        -0.06494811922311783,
        -0.022291084751486778,
        -0.05417853593826294,
        0.023847278207540512,
        0.03525432571768761,
        0.08191633969545364,
        0.01099709328263998,
        -0.005063394084572792,
        -0.019058609381318092,
        0.061989568173885345,
        -0.0059280493296682835,
        -0.0052147069945931435,
        -0.08779634535312653,
        -0.012395988218486309,
        -0.069858118891716,
        -0.020698096603155136,
        -0.01785835064947605,
        0.025852657854557037,
        0.11555308103561401,
        -0.049152810126543045,
        -0.06512681394815445,
        -0.005028941668570042,
        0.04336300119757652,
        0.0471680723130703,
        -0.004670955240726471,
        0.03682192042469978,
        0.11202572286128998,
        -0.09331652522087097,
        0.045874398201704025,
        -0.037695810198783875,
        -0.021871885284781456,
        -0.03800995275378227,
        0.015888798981904984,
        0.024000734090805054,
        -0.07537664473056793,
        -0.0031238067895174026,
        0.0008938873070292175,
        -0.06104857102036476,
        -0.034778282046318054,
        -0.022797200828790665,
        -0.03791232407093048,
        -0.06767085194587708,
        0.01560783851891756,
        0.07919799536466599,
        0.06667699664831161,
        -0.16414567828178406,
        0.03300175070762634,
        -0.03063451685011387,
        0.012988760136067867,
        0.02641223557293415,
        -0.06904217600822449,
        0.020558685064315796,
        -0.041963979601860046,
        -0.05220721662044525,
        0.07568813115358353,
        -0.009389218874275684,
        -0.05097416043281555,
        -0.015592014417052269,
        0.03191206604242325,
        0.05932138115167618,
        0.023709701374173164,
        -0.0031737505923956633,
        0.02065269462764263,
        0.005372941959649324,
        0.006148163694888353,
        -0.0017537716776132584,
        -0.022259926423430443,
        0.03987303376197815,
        -0.09195234626531601,
        -0.030146894976496696,
        0.0036664975341409445,
        0.02333342842757702,
        -8.739095936437184e-33,
        0.018770236521959305,
        -0.011373752728104591,
        -0.056344982236623764,
        -0.04524955898523331,
        0.024980630725622177,
        0.003679972141981125,
        -0.012868130579590797,
        0.05962076038122177,
        0.043438684195280075,
        -0.06580781936645508,
        0.06551861763000488,
        0.050639353692531586,
        -0.07132641226053238,
        -0.009972532279789448,
        0.06281474232673645,
        -0.054453443735837936,
        -0.007224072236567736,
        -0.10680156201124191,
        0.05013974756002426,
        -0.06798382848501205,
        0.06211822107434273,
        0.030108807608485222,
        0.0014592015650123358,
        -0.011524436064064503,
        0.01309299934655428,
        0.03220552206039429,
        0.014075391925871372,
        0.0009303500992245972,
        0.008097493089735508,
        0.1111118495464325,
        0.014571581967175007,
        -0.07876325398683548,
        -0.005914265755563974,
        0.0837104544043541,
        0.059052351862192154,
        -0.0387127511203289,
        0.029820360243320465,
        0.006823739968240261,
        0.015653904527425766,
        0.0008547684410586953,
        0.011378951370716095,
        0.14262734353542328,
        0.02378859929740429,
        0.007620287127792835,
        0.010574521496891975,
        0.04340466111898422,
        0.027007214725017548,
        -0.0898900255560875,
        0.024711456149816513,
        -0.017661673948168755,
        -0.05951256677508354,
        -0.02013196423649788,
        0.024039752781391144,
        -0.0178705882281065,
        -0.050438571721315384,
        -0.03358747065067291,
        -0.05077218636870384,
        0.11018156260251999,
        0.016171380877494812,
        -0.026298459619283676,
        0.07305533438920975,
        0.03253999724984169,
        -0.11787959933280945,
        -0.04101766645908356,
        0.018234286457300186,
        0.006460148375481367,
        0.011873471550643444,
        0.02699795365333557,
        0.06860281527042389,
        -0.02158242091536522,
        -0.09908251464366913,
        -0.09123964607715607,
        -0.1124744638800621,
        -0.08230839669704437,
        -0.014781857840716839,
        0.017512332648038864,
        0.018096784129738808,
        -0.0017925344873219728,
        -0.01976431906223297,
        -0.003970413934439421,
        0.01441376656293869,
        -0.03139795735478401,
        0.08374630659818649,
        0.0032536082435399294,
        0.05593596771359444,
        -0.053817372769117355,
        -0.00554391834884882,
        0.0027035244274884462,
        0.013979636132717133,
        0.027627283707261086,
        -0.07396310567855835,
        0.02472073584794998,
        -0.05950180068612099,
        0.004596628714352846,
        0.07650315016508102,
        -4.7329951513575e-08,
        -0.009993236511945724,
        0.01359922531992197,
        -0.04608526825904846,
        0.06376820802688599,
        -0.01310466043651104,
        -0.14573965966701508,
        0.046969037503004074,
        0.018705256283283234,
        0.02840534597635269,
        0.0019238298991695046,
        0.024624183773994446,
        -0.11923399567604065,
        -0.045056164264678955,
        0.001584807876497507,
        0.053481318056583405,
        -0.018685968592762947,
        -0.0789087563753128,
        0.09007517248392105,
        -0.02121724560856819,
        0.04910753667354584,
        0.022646676748991013,
        0.021170631051063538,
        0.08572158962488174,
        -0.06971728056669235,
        0.007129779551178217,
        0.0539398230612278,
        0.014475423842668533,
        0.0593094602227211,
        0.0442582443356514,
        -0.03047652542591095,
        -0.02405627630650997,
        0.006208118982613087,
        0.04448065534234047,
        -0.046932484954595566,
        0.08738169819116592,
        -0.03026408515870571,
        -0.07875046879053116,
        0.018741771578788757,
        0.1391635686159134,
        0.07136104255914688,
        -0.0009748683078214526,
        -0.08439213782548904,
        -0.08719131350517273,
        0.014778443612158298,
        0.07984001189470291,
        0.0022558891214430332,
        -0.037999559193849564,
        -0.04601018503308296,
        0.026479704305529594,
        0.014195939525961876,
        -0.07303310185670853,
        -0.0406147800385952,
        0.011904772371053696,
        0.03364280238747597,
        -0.018068529665470123,
        -0.07024435698986053,
        0.025610633194446564,
        0.054691798985004425,
        0.03373080864548683,
        0.06069236993789673,
        0.06817883998155594,
        -0.08977745473384857,
        -0.008447199128568172,
        0.09232574701309204
    ]
}