{
    "id": "WwjHonzRd4E",
    "title": "AirPods 4 Review: Which Ones To Get?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2024-09-16T12:05:08Z",
    "video_url": "https://www.youtube.com/watch?v=WwjHonzRd4E",
    "category": "Science & Technology",
    "tags": [
        "AirPods",
        "AirPods with noise cancellation",
        "AirPods vs",
        "AirPods 4",
        "Airpods 4 review",
        "MKBHD",
        "AirPods 4 with noise cancellation",
        "AirPods noise cancellation",
        "AirPods 4 vs",
        "AirPods ANC",
        "AirPods with ANC",
        "which airpods"
    ],
    "views": 2604532,
    "likes": 89921,
    "comments_count": 3504,
    "description": "AirPods 4 now come in 2 versions: Regular and with Noise Cancellation. Are they any good?  Get dbrands new Area 51 skins at   MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   Headphones provided by Apple for review.  ~",
    "description_links": [
        "https://dbrand.com/store/area51",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - So there's two types of people in this world: Either AirPods fit in your ears or AirPods don't fit in your ears. There's two types of people in this world: You either love silicon-tipped in-earbuds or you hate silicon-tipped in-earbuds. There's two types of people in this world: people who really need noise cancellation and people who don't really care about it. But Apple wants both people's money. So there's two versions of the new AirPods this year. It was kinda confusing the way they announced it at the keynote, but essentially, for 129 there's the base AirPods 4, but then for 179 there's AirPods 4 with noise cancellation. But that is not the only difference between them. So now that I've been testing 'em for a few days, I can give you the verdict on them, what the differences are, and if they're actually worth it. So first of all, let's just start with the AirPods themselves. They've tweaked the shape of these buds again, and so they've gotten some new curves and some new angles, and the driver points a little bit more directly into your ear with less reflections. The stem is also a little bit shorter, but otherwise, I mean, yeah, they still look like AirPods. They're very familiar. They have IP54 dust and water resistance, up from IPX4 last year. And they still have the in-ear detection, there's still microphones all the way around, but my biggest question personally, before anything else, was actually just, does this slightly new shape actually fit better in my ear? Because I have not had any luck with hard-tipped AirPods ever really, since they first came out. The latest version was the closest, like I could put them in my ears, but if I jogged for more than about 10 seconds, they would just slowly fall out. So are the 4s actually better for me? Slightly, but not really. I put 'em in my ears. I was trying to, okay, let's see if this is actually better. I kind of twist 'em a little bit, do the classic, like, you know, get 'em seated in my ear, but it's not for very long. They still slowly, even when I'm just sitting around, slowly feel like they're coming outta my ear. So I think if you had problems with previous AirPods, you'll probably still have problems with these, but if they fit in your ears, then these will also fit in your ears. Now, all of what I've said so far is true about both the base AirPods and the active noise-canceling version. They're the same size, shame shape and everything. Like, you can't tell the difference from the outside of the buds. Where the differences start, though, is this new case. So let's look at the case. The case is a little bit smaller. It is USB type C, thank God. But with the base version, that's it. It's just a case with USB-C. With the noise-canceling headphones, the case also gets a small speaker at the bottom so they can chime when it's charging and they make a noise when they're lost, and they have wireless charging on the back as well, (AirPods chime) which is super convenient. One thing I've noticed, though, it doesn't have MagSafe anymore, I think because this case is literally just slightly too small now. So the last generation of AirPods, the case with wireless charging would actually align and stick to the back of a MagSafe charger, which is really convenient for just like dropping it on the charger, not thinking about it. But this year's case, you know, slightly smaller. I think it's just a little bit smaller than the magnetic ring. So that's gone. So it'll still charge on any cheat charger, but it does not stick to it for any sort of alignment, which is kind of a bummer. So if you've got one of those upright chargers, then you try to stick it to it, it'll just slide off now. So USB type C, upside. MagSafe gone, downside. I also have noticed, and maybe it's just 'cause they're brand new, but it feels like the magnets holding them into the case just feels more secure. I think that's a good thing. And this case still works with Apple Watch puck chargers, by the way, fun fact. This isn't a normal cheat charger at all. It literally only charges Apple Watches and AirPods. But hey, they still do magnetize, so maybe that's worth something. And then for the hidden feature that nobody's mentioned in any of the presentations or keynotes or anything. Remember the back of AirPods 3, there was a little pairing button? So if you were manually pairing it to a phone or something like that, you would hit this button. That is gone from the new AirPods 4 case. So where did that go? And it turns out now it's a hidden capacitive touch area, kind of right underneath the pairing light on the front. So you can double tap here, then it starts blinking, and that initiates the pairing mode. And actually, a triple tap will allow you to start a factory reset of the buds. So no longer a physical button, kind of a hidden trick. The more you know. But the biggest question that I'm sure most people are actually wondering is, how good is the Active Noise Cancellation on these new AirPods? Should you actually choose to get it without going AirPods Pro with silicon tips? Is it actually good? So my point of reference is going to be AirPods Pro 2. You know, obviously there's lots of other earbuds that have ANC, but just sound quality, apples for apples wise, that's probably the most direct comparison. And I'll say, while these are impressive, they are definitely not as good as the Pros. They're just not. And this is most definitely because of physics. So, since the hard tip doesn't absolutely perfectly fit inside my ear one-to-one, it just means there's a little bit of air gaps around the outside of it, just a little. There's a little bit of sound that can make it from the outside into my ear, literally around the earbud. So whether it's white noise, or street sounds, or voices, the ANC clearly works, and it does a good job of basically lowering the background noise so you can hear whatever you're listening to better, but it's not quite gone. So I feel like if AirPods Pro are like an 8 outta 10 for noise cancellation, just based on how much of the background noise it's removing, these hard-tipped AirPods are around like a four, maybe four or five. It's less noise cancellation and more noise reduction, if that makes sense. Like, still very useful, but it's most useful in particularly loud environments. Like, if you're on a train or on a plane or with like a lot of loud voices or street sounds around you, that's when you'll most appreciate the reduction in noise because you can hear what you're actually trying to listen to better. But if you're in a quiet room, or a library, or something like that, it doesn't actually make that much of a difference. But then, probably just as important as noise cancellation, is every pair of headphones that has that should also have transparency mode. And these do. And this might be the best transparency mode I've ever heard on any AirPods. Sounds supernatural probably because literally some of the outside environment noise is already getting in, and so what it boosts in through the microphones should sound just like it. Some other small tidbits about these: Battery life does technically get slightly worse with ANC on. So it's rated for four hours, still respectable, but a total of 20 hours with the case with noise cancellation. These also now join AirPods Pro with USB-C as the only other headphones to have the ultra-low latency support for Vision Pro. So thanks, H2 chip. And then precision finding is useful, but that speaker does really help if they're kind of underneath something, or inside a bag, or you need to find it but don't really have a visual on it. Love having the speaker on the case. And then if you were paying really close attention in the last Apple keynote, you might have caught that there was actually also an AirPods Max refresh alongside these. But I use the word refresh like very lightly just because all they really did was make it USB type C and some new colors, and that's it. Literally, that's it. They didn't do any other, no mesh updates, no case updates, no on/off switch, no material updates, no driver updates, no sound quality changes, no new features, no H2 chip, just USB-C. That's absolutely ridiculous. And I will not be reviewing those headphones, but what I did see is some comments of people asking, like, \"Wait, what is the H2 chip even all about? Like, does it matter that the new ones didn't get the H2 chip?\" So let me just break down what that's for. The H2 chip inside these AirPods is basically doing all of the processing, especially from these microphones. So all of the improved background noise reduction for phone calls, all of the Active Noise Cancellation, Transparency mode, and Adaptive Audio. And it also now lets you nod or shake your head to answer Siri questions. So if there's like an incoming call and it announces a new call, you can literally nod your head to answer it instead of talking out loud. Or if you get a text and Siri asks, \"Do you wanna respond,\" but you don't want to, you literally just shake your head. It actually works super well. But then it's also just a matter of principle. Like, there's no way your brand-new, flagship, $550 over-ear noise-canceling headphones shouldn't have all the latest and greatest parts internally and externally, but here we are. But anyway, the sound quality of these new AirPods is perfectly solid. Some people were surprised at my opinion about this last time, but the AirPods 3 did take a pretty respectable step up. And while there still is no EQ anywhere and there's not a whole lot of customization to the sound, they do a good job of sort of being decent at everything. 'Cause these have to do phone calls and podcasts, which have a lot of vocal frequencies, but they also have to do movies, and they also have to do music, and they're kind of just tuned to be solid at everything. So overall, 129 for the base AirPods, 179 for the AirPods with Active Noise Cancellation. Now you know all the differences. Now you know what they do and how good they are at it, and you can choose which one you want for yourself. Me personally, I'm still a silicon ear tips person just for my own EarPods. Like, they fit in my ears so much better, the seal is so much better, it makes the noise cancellation dramatically better. So I'm still leaning AirPods Pro for myself. Matter of fact, you can get AirPods Pro on Amazon for like 199 right now, so it's only 20 bucks more than these. But I still think people will happily save the 20 bucks and get the hard-tipped ones. They still get beat in individual categories by others in the wide world of other earbuds available out there. Like, some will have a better fit in the ear, which will be better for working out and running and stuff. Some others will have better battery life, and even some others will have better sound quality, especially for music. But these are still AirPods, which means they work best with the ecosystem, with the seamless switching between all of the Apple devices in your life. And they still have that sort of generic useful frequency response across the range for everything. That's what they're good at. Now, if you're thinking of picking up a new pair of AirPods but you don't love the dental floss look, well then channel sponsor dbrand has you covered with their new Area 51 case. And this isn't just some regular printed design. This topographical pattern has a crazy like 3D-printed texture that you can actually feel. I honestly, I'm not sure how they did this, but the 3D ink, it's super durable. It adds this extra layer of grippiness that's hard to describe. And this isn't just some random pattern. Apparently, dbrand put an actual topographical map of Area 51 on here, because of course they would. So there are three different colorways of it. There's red, yellow, and black. And I'm usually all in on matte black, but this is a nice yellow, it looks pretty sick. And these new Area 51 skins are available for a ton of different devices. So I'll leave a link below in the description if you wanna pick one up for yourself. But that's basically it. Thanks for watching, and I'll catch you very soon in the next one. Peace. (bright upbeat music)",
    "transcript_keywords": [
        "AirPods",
        "noise cancellation",
        "AirPods Pro",
        "noise",
        "Active Noise Cancellation",
        "case",
        "cancellation",
        "Pro",
        "ear",
        "people",
        "ears",
        "Active Noise",
        "fit",
        "good",
        "sound",
        "bit",
        "Apple",
        "base AirPods",
        "kind",
        "USB type"
    ],
    "transcript_entity_values": [
        "H2",
        "IPX4",
        "USB-C.",
        "Apple",
        "20 hours",
        "20 bucks",
        "three",
        "year",
        "four hours",
        "AirPods 3",
        "550",
        "four",
        "One",
        "ANC",
        "IP54",
        "only 20 bucks",
        "8",
        "AirPods 4",
        "129",
        "this year",
        "4s",
        "Siri",
        "Love",
        "AirPods Max",
        "179",
        "Apple Watch",
        "first",
        "AirPods",
        "the Active Noise Cancellation",
        "199",
        "Pros",
        "Adaptive Audio",
        "EQ",
        "Vision Pro",
        "AirPods Pro",
        "MagSafe",
        "the Active Noise Cancellation",
        "more than about 10 seconds",
        "a few days",
        "51",
        "Amazon",
        "Apple Watches",
        "two",
        "a ton",
        "last year",
        "USB"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "MONEY",
        "CARDINAL",
        "DATE",
        "TIME",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "LAW",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG"
    ],
    "vector": [
        0.0052663180977106094,
        -0.05093112215399742,
        0.0427318811416626,
        0.004937606398016214,
        0.029042253270745277,
        -0.029436247423291206,
        0.13103321194648743,
        0.049710456281900406,
        -0.05550477281212807,
        0.03856907784938812,
        0.03851676359772682,
        -0.010845937766134739,
        -0.020577795803546906,
        -0.05829443410038948,
        -0.007079209201037884,
        0.005715509876608849,
        0.07493610680103302,
        -0.07918920367956161,
        0.011577536351978779,
        0.02185743860900402,
        -0.07732551544904709,
        -0.006892822217196226,
        0.07704447954893112,
        0.05626741051673889,
        -0.028582124039530754,
        -0.019711757078766823,
        -0.0392020046710968,
        -0.09721449017524719,
        -0.08962006121873856,
        -0.04691462591290474,
        -0.0002895375364460051,
        0.0774102583527565,
        0.07508211582899094,
        -0.03239862993359566,
        0.0374809205532074,
        -0.11643063277006149,
        0.0942949652671814,
        0.026798348873853683,
        -0.02769705094397068,
        -0.020810963585972786,
        -0.0071279932744801044,
        -0.023265039548277855,
        -0.030689122155308723,
        0.018004314973950386,
        -0.027711309492588043,
        -0.08462706953287125,
        -0.021063048392534256,
        -0.08794703334569931,
        0.0026262986939400434,
        0.06919588893651962,
        0.008521503768861294,
        -0.07087992131710052,
        0.04150141403079033,
        0.02793494239449501,
        -0.013848627917468548,
        0.004949082154780626,
        -0.05633503198623657,
        0.07739542424678802,
        -0.020155129954218864,
        0.025929903611540794,
        0.11026033759117126,
        -0.0781383216381073,
        0.011606812477111816,
        -0.06245908886194229,
        0.009903048165142536,
        0.02433077245950699,
        0.0017981231212615967,
        0.035103414207696915,
        0.06971056759357452,
        0.02490505576133728,
        -0.04995063692331314,
        0.07113458216190338,
        -0.012345579452812672,
        0.003623455995693803,
        0.05795242637395859,
        0.025254489853978157,
        0.029563236981630325,
        -0.04649761691689491,
        -0.0036773900501430035,
        0.1005275696516037,
        -0.006363830994814634,
        -0.023182258009910583,
        0.01111561618745327,
        -0.14612051844596863,
        -0.002615593373775482,
        -0.023828594014048576,
        -0.04749033972620964,
        -0.05091947317123413,
        -0.10077258944511414,
        0.004270022734999657,
        -0.03333893045783043,
        0.06911525130271912,
        -0.009797358885407448,
        -0.022599874064326286,
        0.0671582892537117,
        0.016304435208439827,
        0.026390260085463524,
        0.050067950040102005,
        0.043339941650629044,
        -0.005429374519735575,
        0.029548946768045425,
        0.048375535756349564,
        -0.03490347042679787,
        -0.02649376541376114,
        0.05621041730046272,
        -0.0663691833615303,
        -0.0997442752122879,
        -0.061599552631378174,
        -0.005962211173027754,
        0.038299016654491425,
        -0.0019197503570467234,
        -0.030606985092163086,
        0.020851457491517067,
        0.02037185989320278,
        -0.05505037307739258,
        0.012703878805041313,
        0.02165108732879162,
        0.06935595721006393,
        0.06718136370182037,
        -0.016780436038970947,
        -0.004954522009938955,
        0.025941433385014534,
        0.055695541203022,
        -0.05283870920538902,
        -0.08861743658781052,
        0.01123019214719534,
        -0.17044346034526825,
        4.063038918267634e-33,
        -0.008644147776067257,
        0.012641231529414654,
        0.007851450704038143,
        -0.008684384636580944,
        -0.03506499528884888,
        -0.05262121558189392,
        -0.03382362797856331,
        -0.0291068647056818,
        -0.03625134378671646,
        0.08057688176631927,
        -0.09835980087518692,
        -0.0349222831428051,
        -0.014303428120911121,
        0.007963085547089577,
        0.08080332726240158,
        -0.04508164897561073,
        -0.12226363271474838,
        0.02522657811641693,
        -0.08916625380516052,
        0.04413170740008354,
        0.0014827125705778599,
        0.06933915615081787,
        -0.04217013344168663,
        0.12730096280574799,
        0.076908640563488,
        -0.06383781135082245,
        0.04204205051064491,
        0.004711027257144451,
        -0.007897352799773216,
        0.01419496163725853,
        -0.05750257894396782,
        0.024677442386746407,
        0.06926783919334412,
        -0.014585264958441257,
        -0.025417229160666466,
        0.0033079604618251324,
        -0.027812771499156952,
        -0.012513015419244766,
        -0.019032135605812073,
        -0.13667337596416473,
        -0.023539632558822632,
        0.05670890584588051,
        0.0010203884448856115,
        -0.026283275336027145,
        0.08756812661886215,
        0.1300087422132492,
        -0.015124025754630566,
        -0.0413164459168911,
        0.0891803577542305,
        -0.06380333751440048,
        -0.05202798545360565,
        0.018566608428955078,
        -0.06607818603515625,
        0.05403834208846092,
        0.0433124415576458,
        -0.09683875739574432,
        -0.004877336788922548,
        -0.020126139745116234,
        -0.018700838088989258,
        0.012373760342597961,
        0.03497658297419548,
        0.043872103095054626,
        -0.018866250291466713,
        -0.07472391426563263,
        -0.06554030627012253,
        0.06950724124908447,
        0.03689522668719292,
        -0.012940961867570877,
        -0.10892204195261002,
        -0.018038485199213028,
        0.06533732265233994,
        0.06910452991724014,
        -0.0035521704703569412,
        0.008102061226963997,
        0.00526329455897212,
        -0.075481116771698,
        -0.03627677634358406,
        -0.029742619022727013,
        0.018324296921491623,
        -0.030565397813916206,
        0.04236095771193504,
        0.06534425914287567,
        0.0003862699668388814,
        0.031042160466313362,
        -0.0011053280904889107,
        -0.018170731142163277,
        0.01555803045630455,
        0.001720052445307374,
        0.05700227618217468,
        0.012431091628968716,
        -0.018103063106536865,
        0.06706280261278152,
        -0.010819350369274616,
        0.0011281284969300032,
        -0.05537959188222885,
        -5.0099958614549603e-33,
        0.06663524359464645,
        0.013239108957350254,
        -0.011775990948081017,
        0.04999732971191406,
        -0.04207955300807953,
        0.10475363582372665,
        0.052903130650520325,
        -0.010487975552678108,
        0.0615861751139164,
        -0.02754746749997139,
        -6.747478619217873e-05,
        -0.003063532989472151,
        -0.03530306741595268,
        0.03247356414794922,
        -0.0018602593336254358,
        -0.07006627321243286,
        -0.060207147151231766,
        -0.11466353386640549,
        0.04925079643726349,
        0.0369289331138134,
        0.033993106335401535,
        0.015826433897018433,
        0.005456364713609219,
        -0.0187513567507267,
        -0.090756356716156,
        -0.029613688588142395,
        -0.05831019952893257,
        0.030212540179491043,
        0.02153879590332508,
        -0.04154294356703758,
        -0.02343263477087021,
        0.01331004686653614,
        -0.036058686673641205,
        0.03970342501997948,
        0.0668799877166748,
        -0.03964080661535263,
        -0.06977645307779312,
        0.017890147864818573,
        0.017141519114375114,
        0.005177495535463095,
        -0.057470615953207016,
        0.021832704544067383,
        0.004987853579223156,
        -0.08731857687234879,
        0.014730350114405155,
        -0.02484627440571785,
        -0.022491024807095528,
        0.029030589386820793,
        -0.04261235147714615,
        -0.06531728804111481,
        -0.008988606743514538,
        0.011290157213807106,
        -0.016202853992581367,
        -0.0021392747294157743,
        -0.06446652859449387,
        -0.007274025119841099,
        -0.03909711539745331,
        0.025419779121875763,
        0.007456256542354822,
        0.03449482470750809,
        -0.0007042341167107224,
        -0.02841535210609436,
        0.06169276311993599,
        0.019190605729818344,
        -0.13786983489990234,
        0.05537572130560875,
        0.014613015577197075,
        0.10528919845819473,
        -0.02896924316883087,
        -0.031453587114810944,
        -0.02575886808335781,
        -0.04055016115307808,
        -0.0034558167681097984,
        0.026374289765954018,
        0.05012026056647301,
        0.03682670369744301,
        -0.04015328735113144,
        0.006036464124917984,
        0.061242155730724335,
        0.0293141957372427,
        -0.09060457348823547,
        0.08975618332624435,
        0.011360072530806065,
        0.06925255060195923,
        0.040504224598407745,
        0.07312256842851639,
        0.01214867364615202,
        -0.0374656617641449,
        -0.08248930424451828,
        0.12381377071142197,
        0.030541518703103065,
        -0.023585189133882523,
        0.0018052150262519717,
        0.06301615387201309,
        0.055008918046951294,
        -4.80970037131101e-08,
        0.07080738991498947,
        0.01584818959236145,
        0.03790603205561638,
        -0.045559097081422806,
        -0.05783689022064209,
        -6.158936594147235e-05,
        -0.034603189677000046,
        0.05627916008234024,
        0.020794441923499107,
        0.004495315253734589,
        0.020620718598365784,
        -0.007449083495885134,
        -0.060663629323244095,
        0.039580561220645905,
        0.049646615982055664,
        0.030657891184091568,
        -0.11322105675935745,
        0.05593250319361687,
        -0.026666462421417236,
        -0.0504220649600029,
        -0.03061864897608757,
        0.06699666380882263,
        0.01243868563324213,
        -0.07693445682525635,
        -0.018837930634617805,
        0.05485386401414871,
        -0.006244544871151447,
        0.04899466037750244,
        -0.009874981828033924,
        0.012476325035095215,
        -0.05564818158745766,
        -0.010146326385438442,
        -0.05616870895028114,
        -0.026173289865255356,
        -0.009377513080835342,
        -0.060189392417669296,
        0.02187913842499256,
        -0.014646117575466633,
        0.005845682695508003,
        0.0699671134352684,
        -0.004208158235996962,
        -0.0761125385761261,
        -0.009728539735078812,
        0.03027091547846794,
        0.07303296774625778,
        -0.06828862428665161,
        0.0555429682135582,
        -0.024673009291291237,
        -0.05614326149225235,
        0.08582140505313873,
        -0.02200418896973133,
        0.03141148388385773,
        0.0015792065532878041,
        0.0266276802867651,
        0.039071936160326004,
        0.06496667116880417,
        -0.02332569658756256,
        0.017808688804507256,
        -0.05745311081409454,
        0.0680268257856369,
        0.014619937166571617,
        -0.08651260286569595,
        -0.016602162271738052,
        0.12958396971225739
    ]
}