{
    "id": "WWvSw-HUksI",
    "title": "This Under Water Drone Conquers the Ocean... in 4K!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-09-29T21:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=WWvSw-HUksI",
    "category": "Howto & Style",
    "tags": [
        "Under water drone",
        "Submarine drone",
        "underwater camera",
        "isla de las mujeres",
        "cancun",
        "travel",
        "drone",
        "Power vision",
        "Power ray",
        "CES award",
        "Technology",
        "4k drone",
        "4k submarine",
        "Remote control submarine",
        "Fish finder",
        "powerray",
        "under water robot",
        "robot",
        "fishing drone"
    ],
    "views": 4403560,
    "likes": 46657,
    "comments_count": 2451,
    "description": "Get more info (and buy a PowerRay) HERE:  Explore the ocean with this NEW under-water Drone called the PowerRay from the company Power Vision. This little guy can hang out underwater for 2 hours without needing to recharge, and can find fish, drop bate, and more importantly take some awesome video with its  4K stabilized camera.   Like I mention in the video, this makes a great underwater tool, BUT I would like it to have a side motor to push it along parallel to a subject that I am trying to film. It is amazing what technology can do. Exploring the Isla De Las mujeres, near Cancun, with an Underwater drone is pretty incredible.   Check out The Jurgys Vlog of our day!:  WhatsInside's Underwater Drone Vlog:   More Power Vision stuff: Instagram  Facebook   Youtube       Awesome iPhone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://store.us.powervision.me?ref=59cea99db6094",
        "https://youtu.be/mDApXzwA_UA",
        "https://youtu.be/xImdTUUzrso",
        "https://www.instagram.com/powervision.usa/",
        "https://www.facebook.com/powervisionme/",
        "http://www.youtube.com/c/PowerVisionGlobal",
        "http://amzn.to/2xu8VBL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "[Zack] Okay, I'm dropping it. Ready? [Dan] Yeah, go ahead. So right now I'm in a place called the Isla De Las Mujeres, right next to next to Cancun. There's this place called the Underwater Museum where there are a bunch of statues buried down to kind of help, you know, the wildlife and stuff under the ocean. Normally when I review drones, they are the kind of drones that fly around in the air. Today, we have an underwater drone that films things underwater in 4K. It should be pretty interesting. So after we check out the footage, we'll take the drone apart and see what the water protection is actually like. Let's get started. [Intro] One of the things that's really hard with this actually...cuz like with the drone you can actually see which way it's oriented in the sky... you know, the lights on the propellers and stuff like that. With this, you don't really know what direction that it's going when you're in the water because there's no way to orient yourself except for when it reaches the surface. [Music] [Dan] I've got to check this out for myself. I'm going in! [Music] Inside the box we have the drone itself. This thing is legit. Here we have one of the vents for the propellers. So when it's sinking down, it's sucking the water up and shooting it out the top of the drone. Then we have the connector here which goes to the tether into the battery pack. And the signal where it stores all the information. We have the propellers in the back here. Underneath the drone, here's the propeller that brings it up and down. This is a sonar fish finder. It tells us the water temperature and finds fish down to one hundred and thirty feet. And then this is a little magnet on the front, so if you had like bait or something and you need to drop while fishing, you can just release this from the controller and drop the bait. In the front of the drone we have two headlights LED it looks like and then we have a 4K camera. And that camera is on a 2 axis gimble. The tether's 225 feet and it goes into that receiver there. Then the controller is kind of like the DJI set up where you have the mount for your phone, and then you have the controllers there on the side. Pretty sweet. So this thing right here is called the base station. It's actually like the WiFi emitter, cuz signals underwater don't travel. So Bluetooth and WiFi just don't work under water very far. So with the tethering cord that's why we have that. And then this transmits WiFi into the controller just like the DJI controller does. Data storage for the footage and things, that's all stored inside the drone with internal storage. So there's no removable SD card slot. It makes sense though because the whole thing is waterproof instead of water-resistant. So having the SD card slot would have been really inconvenient as far as waterproofing that goes. One of the hugest perks about this whole set up though, is that the charging port, which is also the same thing for the tether, the battery inside this thing can last for 2 hours. Imagine a drone in the sky being able to last that long. Probably one of the reasons the battery lasts so long is that the water is holding most of the weight of the drone, and it doesn't need to support itself in the sky. And the propellers are pretty small. [Zack] Okay, I'm dropping it. Ready? [Dan] Yeah, go ahead. [Music] When you're driving the drone, you can't go left or right to circle around something, you can only go forward and back and then like twist the front left and right. So it's a little bit different than flying in the air. So it does make things a little bit harder to control, but it's not too bad. This thing lights up blue, but like I was explaining earlier, it doesn't really orient yourself when you're in the water because you literally can't see it. So basically you're just looking around you in the water, maybe you can find the bottom of the boat you're in, but it's really hard to tell distance and stuff when you're flying this underwater. [Music] So now that' we've seen what this can do and we've explored the outside of it, you know it's time to explore the inside. Let's take this thing apart and see what makes it so waterproof. One thing to remember as we take apart this PowerRay is that it's waterproof to 30 meters, or 98 feet, depending on what part of the world you're diving in. Water-resistant cell phones like the iPhone or the Galaxy phones, are only water-resistant to 1 or 1 and a half meters. That's a huge difference. It will be interesting to see what's inside. There are several screws holding down the exterior plastic. These are mostly for decoration and physical protection, since there's no waterproofing around the exterior edges. It'll unsnap from the lower body exposing the more important components. There are some weights attached to the lower shell. This might keep it oriented in the water, bottom side down. Or it might also be because this is a preproduction unit that isn't quite finished. There is a final version for sale on Amazon today, already, and I'll link that in the description. But this one's just a functional prototype. The three different propellers are now exposed. All the motors are concealed inside the watertight back plastic housing. The other side of the white shell can also pull away from the watertight internals. And now it's definitely looking more like a submarine than a drone. There are a total of 46 hexagonal 2.0 screws holding the two plastic halves together after. After all those screws are out, the top half can lift away. There's still wires attached to that top tethering point. As far as waterproofing goes, a thick green rubber ring surrounds the entire outer lip of the PowerRay. That rubber gets smashed by the 46 screws around the edge, keeping all of the water from ingressing. There's also a shiny grease covering that outer lip as well. Water and oily substances don't mix, so there are multiple waterproofing barriers at work here. There are 4 screws holding down the main board to the plastic body. And this would be a good time to mention that any time you take something waterproof or water-resistant apart, it'll never be water-resistant again until it's resealed. So with this particular project, I don't plan on reassembling this drone since it's already been compromised. I'll just keep it for parts. I unplugged a few of the signal cables. Interestingly enough, there's an Ethernet port on the motherboard. That explains the long tether and how that signal works. I've never seen that inside of a drone before. There are a few more plugs leading off for the fish finders and front camera, and then the whole motherboard lifts off exposing the battery. Now this is pretty interesting. The battery that's held in place by the 4 smaller hexagonal 1.5 screws is the same battery that fits inside the Power Egg, and aerial drone made by the same company. Inside the underwater drone, the battery is not removable, but inside the Power Egg, it is. It's smart using the same battery across multiple products, it saves a lot of money. All three of the propellers have black wires connecting to the small circuit board in the front, right next to that 4K camera and the front LED headlights. The drone is already pretty sweet, but if I could add one more thing, it would be the ability to float sideways instead of just forward and backwards. It would require additional motors, but it would be nice to have more control while filming. It was super fun to take apart something that's actually waterproof. The waterproofing on this PowerRay is pretty intense, and I think it's time to go wash my hands. I'll toss a link in the video description with current pricing for this thing. Whether it's just for fun or actual industrial underwater inspections, it's a pretty useful little tool. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "drone",
        "water",
        "thing",
        "Inside",
        "battery",
        "Underwater",
        "underwater drone",
        "pretty",
        "propellers",
        "things",
        "front",
        "screws",
        "waterproof",
        "waterresistant",
        "waterproofing",
        "Las Mujeres",
        "Isla De Las",
        "controller",
        "place called",
        "screws holding"
    ],
    "transcript_entity_values": [
        "the Isla De Las Mujeres",
        "225 feet",
        "iPhone",
        "the Power Egg",
        "Zack] Okay",
        "SD",
        "two",
        "three",
        "46",
        "DJI",
        "1",
        "the Underwater Museum",
        "2 hours",
        "half",
        "4",
        "Amazon",
        "4 smaller hexagonal 1.5",
        "30 meters",
        "98 feet",
        "PowerRay",
        "one hundred and thirty feet",
        "today",
        "1 and a half meters",
        "Today",
        "One",
        "Galaxy",
        "Cancun",
        "one",
        "Ethernet",
        "2"
    ],
    "transcript_entity_types": [
        "FAC",
        "QUANTITY",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.063197061419487,
        0.06354834884405136,
        -0.0329703651368618,
        -0.041949570178985596,
        0.008675877004861832,
        -0.05493498593568802,
        0.01728380098938942,
        -0.012954030185937881,
        -0.047944288700819016,
        0.0195829588919878,
        0.060694389045238495,
        -0.06223481893539429,
        -0.00792704802006483,
        0.061952631920576096,
        0.004432298708707094,
        0.0935935452580452,
        0.0673617348074913,
        0.050176363438367844,
        -0.0022577412892132998,
        0.04733240231871605,
        0.07233431935310364,
        0.049589045345783234,
        0.05195148289203644,
        -0.05898046866059303,
        -0.08439784497022629,
        0.041004057973623276,
        0.015328049659729004,
        0.01770482026040554,
        -0.08647653460502625,
        -0.04750442877411842,
        0.005899777635931969,
        0.031377583742141724,
        -0.08351428061723709,
        -0.04970908537507057,
        0.0733264908194542,
        0.020460713654756546,
        0.02556430734694004,
        0.015829460695385933,
        -0.03295374661684036,
        0.0241568461060524,
        -0.04032974690198898,
        0.024907665327191353,
        0.09073127806186676,
        0.007425275631248951,
        -0.048337534070014954,
        0.002040439983829856,
        0.06368860602378845,
        0.019977470859885216,
        0.059974148869514465,
        -0.021004244685173035,
        -0.09658036381006241,
        -0.13526998460292816,
        0.04508940503001213,
        -0.016372032463550568,
        -0.02557198330760002,
        -0.0023672820534557104,
        -0.05219724401831627,
        -0.054941464215517044,
        0.04453560337424278,
        -0.0756494402885437,
        0.11009575426578522,
        0.012558814138174057,
        -0.023448212072253227,
        0.006929132621735334,
        -0.012501750141382217,
        -0.06961911171674728,
        -0.0027602340560406446,
        -0.007464583031833172,
        -0.027740830555558205,
        -0.0400535985827446,
        0.0025154585018754005,
        -0.016642075031995773,
        0.02658962830901146,
        -0.0167489442974329,
        -0.08310270309448242,
        -0.032956428825855255,
        0.09556140750646591,
        0.006586323957890272,
        -0.004228658974170685,
        0.00951117929071188,
        0.07809195667505264,
        -0.06552232801914215,
        -0.0612134225666523,
        0.017264308407902718,
        0.05162476375699043,
        0.0687798485159874,
        0.0005355810862965882,
        0.04782117158174515,
        -0.008938665501773357,
        -0.003833807772025466,
        -0.04154007136821747,
        -0.037510402500629425,
        -0.08394987136125565,
        -0.08032670617103577,
        0.046450961381196976,
        -0.12544244527816772,
        -0.0654430016875267,
        -0.07654137909412384,
        -0.04855822026729584,
        0.012687555514276028,
        0.045052334666252136,
        -0.06514907628297806,
        -0.0183885358273983,
        -0.08068039268255234,
        0.00402264017611742,
        -0.0384083054959774,
        0.014369831420481205,
        0.08200324326753616,
        0.07638363540172577,
        -0.016983915120363235,
        -0.09159419685602188,
        0.03390943259000778,
        -0.0429605171084404,
        0.026516471058130264,
        0.023707188665866852,
        0.07286631315946579,
        -0.06665892153978348,
        0.02388439141213894,
        -0.020260760560631752,
        0.01114245131611824,
        0.054857004433870316,
        -0.07336977124214172,
        0.026942342519760132,
        0.05164608731865883,
        0.11020474880933762,
        0.019783126190304756,
        -0.0034251264296472073,
        1.907732189810553e-33,
        0.010932659730315208,
        0.031143296509981155,
        -0.022671224549412727,
        -0.0066242516040802,
        0.05752585083246231,
        0.014646992087364197,
        0.06487508863210678,
        0.023000439628958702,
        -0.07595933973789215,
        0.023302895948290825,
        0.010263672098517418,
        0.02015776000916958,
        -0.030827907845377922,
        0.09420250356197357,
        -0.00037750834599137306,
        -0.14741110801696777,
        0.054681453853845596,
        -0.08650387078523636,
        -0.06705615669488907,
        -0.022287962958216667,
        0.027481207624077797,
        -0.04361215606331825,
        0.02174697257578373,
        0.022403741255402565,
        0.040416669100522995,
        -0.004675679840147495,
        0.013182071037590504,
        -0.003922112286090851,
        0.11290931701660156,
        0.06298863887786865,
        -0.02751641348004341,
        -0.003950751386582851,
        -0.021460654214024544,
        -0.014439759775996208,
        -0.022588202729821205,
        0.01948363333940506,
        -0.0458952970802784,
        -0.07691381871700287,
        -0.0425383560359478,
        0.03176631033420563,
        -0.03748120740056038,
        0.05265221372246742,
        -0.057292647659778595,
        -0.10112094134092331,
        -0.02053884230554104,
        -0.06524793058633804,
        0.008642882108688354,
        0.1054125726222992,
        -0.011956792324781418,
        0.01710241660475731,
        0.043612174689769745,
        -0.029080744832754135,
        -0.06936255842447281,
        -0.06610772758722305,
        -0.05622068792581558,
        0.054080478847026825,
        -0.012769755907356739,
        0.01334496308118105,
        -0.012290778569877148,
        -0.048181500285863876,
        -0.05840751901268959,
        0.0007043784135021269,
        -0.057324375957250595,
        -0.015076084062457085,
        -0.08439610153436661,
        0.04295797273516655,
        0.07958874106407166,
        0.03096028044819832,
        -0.002045397413894534,
        0.03519254922866821,
        -0.06588300317525864,
        -0.027588531374931335,
        -0.0020692553371191025,
        -0.059850603342056274,
        0.01865019090473652,
        0.0861658900976181,
        -0.03540986031293869,
        -0.023782629519701004,
        -0.0011828563874587417,
        0.06784681230783463,
        -0.0798717811703682,
        0.0767994150519371,
        0.07629584521055222,
        0.028836941346526146,
        0.0021772775799036026,
        -0.004186323843896389,
        -0.042121510952711105,
        0.03259637579321861,
        0.03150862827897072,
        0.026033494621515274,
        0.01000952161848545,
        -0.02459770254790783,
        -0.05677718669176102,
        -0.0825607106089592,
        0.01846284605562687,
        -3.68045518000932e-33,
        0.004342082887887955,
        -0.02281796932220459,
        -0.01622864417731762,
        0.02257526107132435,
        0.0910903587937355,
        -0.02458775043487549,
        0.10212692618370056,
        0.056768354028463364,
        0.016403937712311745,
        -0.0467468723654747,
        -0.07108423113822937,
        0.024045925587415695,
        -0.04643411934375763,
        0.02543986216187477,
        0.08523912727832794,
        0.042508482933044434,
        -0.033895839005708694,
        -0.031176581978797913,
        0.06126001477241516,
        0.024964671581983566,
        0.07398166507482529,
        0.05211077630519867,
        0.12513136863708496,
        0.02412337437272072,
        -0.02588508464396,
        0.04998038336634636,
        -0.004469079896807671,
        0.003840365679934621,
        0.0662052184343338,
        -0.05750033259391785,
        -0.06156047806143761,
        -0.02394058369100094,
        0.07440656423568726,
        0.024651337414979935,
        -0.07512416690587997,
        0.041317570954561234,
        0.015387202613055706,
        -0.007218332029879093,
        -0.0219420175999403,
        -0.014202184043824673,
        0.0052238041535019875,
        -0.007452557794749737,
        0.0018838329706341028,
        -0.02269579842686653,
        -0.052864547818899155,
        0.02414827048778534,
        0.03438734635710716,
        0.031598325818777084,
        -0.05615915358066559,
        0.005723460577428341,
        -0.06121591478586197,
        0.03512166440486908,
        -0.013044924475252628,
        0.030880939215421677,
        0.05143367499113083,
        -0.07889557629823685,
        0.046103984117507935,
        -0.020616576075553894,
        -0.007480239029973745,
        0.05430900305509567,
        0.024771539494395256,
        -0.017312409356236458,
        -0.03646959364414215,
        -0.01801912486553192,
        0.006126715335994959,
        0.05069161579012871,
        0.03152158483862877,
        0.057542480528354645,
        -0.004955502226948738,
        0.006035972386598587,
        0.028307296335697174,
        0.004481045994907618,
        0.012055514380335808,
        -0.03717205300927162,
        -0.020058752968907356,
        -0.008796295151114464,
        -0.08221004158258438,
        -0.02053023874759674,
        0.03328120335936546,
        -0.009261543862521648,
        0.03376750275492668,
        -0.0025059403851628304,
        -0.014882408082485199,
        -0.0030150790698826313,
        0.07814846187829971,
        0.04725039005279541,
        -0.007939946837723255,
        -0.015300792641937733,
        0.005088327452540398,
        -0.010546911507844925,
        0.005631100386381149,
        -0.04089699313044548,
        0.003857253585010767,
        0.042473550885915756,
        -0.0024522191379219294,
        -4.92919838279704e-08,
        -0.01117528136819601,
        0.02262124791741371,
        0.08105522394180298,
        -0.018732083961367607,
        -0.04053163155913353,
        -0.05895735323429108,
        0.03968926891684532,
        0.03434859216213226,
        0.07665244489908218,
        -0.12670965492725372,
        -0.027984799817204475,
        -0.09561287611722946,
        0.09126888960599899,
        0.04245125129818916,
        -0.01372462697327137,
        -0.0012790494365617633,
        0.021968543529510498,
        -0.020653625950217247,
        -0.016536327078938484,
        -0.005801439750939608,
        -0.03329366073012352,
        -0.031302858144044876,
        -0.017560815438628197,
        0.04869401082396507,
        -0.041441380977630615,
        0.08686211705207825,
        -0.142823725938797,
        -0.05973261967301369,
        0.05111260339617729,
        -0.05148092284798622,
        -0.016505641862750053,
        0.005130256991833448,
        -0.031675148755311966,
        0.0319625549018383,
        -0.0387381911277771,
        -0.03765932098031044,
        -0.12530630826950073,
        -0.016252875328063965,
        -0.04863050580024719,
        0.07961805909872055,
        -0.010930687189102173,
        0.010669762268662453,
        -0.007977904751896858,
        0.023848390206694603,
        -0.00034283087006770074,
        0.022032761946320534,
        0.04330802336335182,
        -0.19841130077838898,
        -0.07020089030265808,
        0.03262573853135109,
        -0.03070845641195774,
        -0.020731063559651375,
        0.03257868066430092,
        0.04364962875843048,
        0.06846696883440018,
        0.1607518196105957,
        0.04140491783618927,
        -0.11115951836109161,
        -0.09681961685419083,
        0.034227728843688965,
        0.002405826933681965,
        0.002570401644334197,
        -0.039378996938467026,
        0.06459151953458786
    ]
}