{
    "id": "WwxQiCU3IiM",
    "title": "Apple Watch Series 5 Unboxing and Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-09-18T10:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=WwxQiCU3IiM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "apple",
        "apple watch series 5"
    ],
    "views": 2653354,
    "likes": 52244,
    "comments_count": 3233,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- We've got the Apple Watch Series 5 right here. We're gonna unbox it and test it out. This is the gold aluminum case in Pink Sand Sport Band, and this is the 40 millimeter version. So, in addition to this one, they also launched the new titanium and a titanium black, which both looked really awesome. I got a chance to check those out at the Apple event. I personally ordered the ceramic one so I'll probably be doing an unboxing of that one as soon as it comes in. But, for now, we have this pink aluminum one to check out. So let's just unbox. (sighs) This is always so exciting, unboxing a new Apple Watch. Their packaging is so thoughtful. (package opening) (gasps) Here it is! Oh, and here's all the new watches too, on their little packaging. Here it is. Here's the watchband. Okay. This is so great. Are you ready? (gasps) Oh, it even has like a little pink little dust cover on it, too. Oh wow. Okay now, now maybe I want this one. Super into the pink aluminum. Comes with, obviously, the Apple Watch charger and the five-watt charging brick. Now we need our watch band. (cardboard sliding) If they didn't launch the new ceramic, If they didn't launch the new ceramic, this probably would be the color that I would have chosen. I just love this little cute little cover. I'm gonna save this. So, obviously, put your Apple watch and hold it near the camera. Setting up the new Apple Watch on the new iPhone. So one of the new things in this Apple Watch is it has an Always-On Display, which is great because I think that you guys are very familiar, especially if you've used Apple watches before, of this gesture, to activate it. So, it's the Raise to Wake. So, I'm enabling the Emergency SOS. Another thing that is new in this Apple Watch is you can use the Emergency Calling international, if you have the cellular enabled. So, looks like this is still syncing. So, I'm gonna let it sync. It said it'll give me a notification when it's done, and we have a lot of new stuff to test out. I guess, as soon as this gives me a notification, I'll be back and, we'll be in a new location. (upbeat music) So, I've been using the Apple Watch now for two days, and I cannot stress enough how much I love the Always-On Display. Obviously, it is the newest feature in the Apple Watch Series 5 but it's something that I didn't realize how much I wanted until I have it. I went hiking this morning, and that was the first time that I got a chance to actually put this Apple Watch to use. (gentle upbeat music) It's really fun to be making this video because the Apple Watch has helped me, personally, get in shape. I love hearing all the stories of how the Apple Watch has changed people's lives, and I am definitely one of them. So, the Apple Watch is definitely one of the best devices out there for tracking these types of things. There are others. So whatever it is that you decide to use, if it helps you get motivated and keep yourself accountable, then use that. But, for me, it is the Apple Watch. It's also been crazy to see the progress that you make because you have all of that data with you. I just tested out the new compass feature which is really cool because, it'll tell you what direction you're going, it'll show your elevation, it'll give you your longitude and latitude, and it'll also be able to orientate you when you're in the maps. Which is pretty awesome, especially if you're using cellular, and you don't have your phone on you. I also love being able to keep track of my heart rate because I know that I'm starting to feel a little exhausted or something and I can check my heart rate, and know that, yes, my heart rate is high so the feeling that I'm having is completely normal. (upbeat music) One of the things that I've always loved so much about the Apple Watch is being able to track your heart health. So being able to take a ECG, always have consistent data. I mean, I have a health data for the past, like, five years that I've been wearing an Apple Watch. So, it takes about 30 seconds, and, with that, it'll give you what the rhythm of your heart is. So I have the sinus rhythm. So it takes about 30 seconds and it'll give you your result here, and then it'll send a PDF to your phone. And that's where I think the new health research app is gonna be really cool. So, basically you can opt in to share your data so researchers and analysts can go through all of that data and make sense of it. And the latest update to the watchOS, they have a decibel meter. Pretty neat. I haven't tried this out yet. So you guys are witnessing the first time trying this. I have to be really, to be really annoying and loud. So I'm probably gonna turn this volume down, but you guys can watch on the decibel meter. (buzzing) Said repeated long-term exposure to that sound (laughing) could give you hearing damage. (gentle upbeat music) (sighs) Namaste. Hope you guys enjoyed that fake yoga workout for the sake of filming this video. One of the things that I love so much is Peloton, and I have the treadmill. I did a video about that a while ago. I probably should do a follow-up because one of the things that I love so much about the Peloton treadmill is the fact that Peloton has a digital app. They have all kinds of classes. They have outdoor running, just regular running, cycling, strength training, yoga. They even have meditation, stretching, and they also have a really cool bootcamp. This will give you a combination of running and also strength training exercises. So I've been a huge fan of this app. I love it, especially when I'm traveling. I always have something with me on-the-go. I can yoga. I can do my running classes, even if I don't have the treadmill. Let's go do some more fake working out for the sake of this video. (upbeat music) We're at the climbing gym now and I'm so excited to do some tests here with the Apple Watch. And, of course, testing out the ultra-wide angle because Jenna took a picture of me earlier, and she's like, \"Oh my gosh, it looks like you're hanging \"off the side of El Cap with the ultra-wide.\" It looks pretty cool. But Jenna's climbing now. There she is. Let's do a zoom. Do a zoom. - Oh, true. - [Justine] There she goes. (gentle upbeat music) We just finished climbing. Jenna, did you have fun? - So much fun. It's so great. - Tyler is on his way up. And, that's it. That's the climbing test of the new Apple Watch with Always-On Display. I have two new Apple Watch bands to check out. This is Clementine. And this is one of the new Sport Loops. This is the Pomegranate Sport Loop. The new Sport Loops have this little contrasting band along the edges. This looks nice. Let's put this on. I love the Sport Loops. This looks awesome. I love that they have the new two-tone. So, when you put it on, you have two different colors. This is actually exactly the color that I'm wearing. I promise you I did not plan this. Even though you would think that I did. (cardboard sliding) This is pretty much my shirt. (laughing) It's even got the perforated holes and everything. And that's what it looks like, next to the Pink Sand and, next to my current one. Well thank you guys so much for watching. I love the Apple Watch, and when I say that this thing actually did get me to start working out again, like Jenna, come here. Can you just, can you just let them know what a lazy bum I was. Like, it was bad. - Okay. - Picture a potato and picture that potato on a couch. Picture the face of Justine on that potato on the couch. - Guess what. I have a face of me on a potato, thanks to Ro. - Potato Justine is completely done. Let me show you off what I got. - Okay. - Ready? - Okay. (laughing) Boom! Final look. - I'm so glad you got the shoes! (laughing) Look at those shoes! The only time that I would like get off the couch, or anything, was to go do work. - Or get ice cream. You were having like two ice creams a day. (gasps) - This was two years ago. I still eat ice cream and still eat a lot of snacks, but at least I'm active. - For sure. - Remember that first hike that we went on? The Temescal one. Which I did today and I was kind of flashing back to the time that- - You're heart rate was like 190. I was like, \"Are you okay?\" - I said no. And I cannot wait for you to get yours because the Always-On Display, like, look. - Let me see. - [Justine] Did yours turn off? - [Jenna] Yeah. Wait, does it blur text messages when you- - Yeah, it does. Look at that. - [Jenna] Oh! - [Justine] Look at this! Blurred. Okay, I think that's the end of my video now. - Kay, bye. - Well, thank you guys for watching. I will see you guys soon in my next video. Bye-bye. (gentle upbeat music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Series",
        "Apple",
        "Watch",
        "Apple Watch bands",
        "Apple Watch charger",
        "Watch Series",
        "love",
        "Sport Loops",
        "Sport",
        "guys",
        "AlwaysOn Display",
        "Pink",
        "give",
        "heart",
        "watch band",
        "video",
        "Display",
        "Pink Sand Sport",
        "things"
    ],
    "transcript_entity_values": [
        "Pink Sand Sport Band",
        "Sport Loops",
        "the Apple Watch",
        "the Pomegranate Sport Loop",
        "one",
        "El Cap",
        "Temescal",
        "two years ago",
        "the Sport Loops",
        "Apple",
        "Namaste",
        "Justine",
        "this morning",
        "iPhone",
        "Peloton",
        "the Apple Watch Series 5",
        "the 40 millimeter",
        "Said",
        "about 30 seconds",
        "Clementine",
        "five-watt",
        "the Pink Sand",
        "this Apple Watch",
        "today",
        "ECG",
        "this Apple Watch",
        "two",
        "the Always-On Display",
        "five years",
        "first",
        "Apple Watch",
        "190",
        "Jenna",
        "two days",
        "One"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "FAC",
        "QUANTITY",
        "PERSON",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "LOC",
        "ORG",
        "DATE",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.03319782018661499,
        -0.08827827870845795,
        -0.018948698416352272,
        -0.08349272608757019,
        0.03726186603307724,
        0.07700739800930023,
        0.024312814697623253,
        -0.02016671746969223,
        -0.002163347089663148,
        0.04355718567967415,
        -0.01677306741476059,
        0.028050022199749947,
        -0.049918729811906815,
        -0.022663455456495285,
        -0.024171994999051094,
        0.015508885495364666,
        0.046488404273986816,
        -0.06329552829265594,
        -0.0057982043363153934,
        0.04102249816060066,
        -0.0063765873201191425,
        -0.0737009048461914,
        0.04108123108744621,
        0.03623543307185173,
        -0.005536543671041727,
        0.06980077922344208,
        0.02239116281270981,
        0.03081180714070797,
        -0.0946241021156311,
        -0.0729626715183258,
        -0.02610919065773487,
        0.009148524142801762,
        0.07640150189399719,
        0.00028637086506932974,
        -0.0025213949847966433,
        -0.04367702454328537,
        0.031786005944013596,
        0.0003269656444899738,
        -0.06524553149938583,
        -0.046474356204271317,
        -0.00417629349976778,
        -0.014280533418059349,
        0.0007731219520792365,
        0.03718051686882973,
        -0.055224694311618805,
        -0.0560799315571785,
        -0.010009036399424076,
        -0.04412334784865379,
        0.054152317345142365,
        0.065358966588974,
        -0.05851832404732704,
        -0.0033847906161099672,
        0.05046062916517258,
        0.029020115733146667,
        -0.03374283388257027,
        -0.043644409626722336,
        -0.07659564912319183,
        0.002860693959519267,
        0.04319194704294205,
        -0.07896783202886581,
        0.045949120074510574,
        -0.046334158629179,
        -0.027398264035582542,
        0.03760882839560509,
        -0.060236185789108276,
        -0.025304574519395828,
        -0.0037351015489548445,
        0.021986747160553932,
        0.03952234983444214,
        0.008340594358742237,
        -0.10987911373376846,
        0.04469483718276024,
        0.0293659046292305,
        0.017994996160268784,
        0.012297417968511581,
        0.0545085184276104,
        0.021487781777977943,
        -0.1124657467007637,
        -0.0016084196977317333,
        0.05517522618174553,
        -0.03195266053080559,
        -0.04557133838534355,
        -0.0656270980834961,
        0.015052299946546555,
        0.02613776922225952,
        0.011165226809680462,
        0.002726523904129863,
        0.009193467907607555,
        -0.04754453897476196,
        -0.05237739533185959,
        -0.04861332103610039,
        0.02560059353709221,
        0.026260582730174065,
        -6.057123755454086e-06,
        0.011935986578464508,
        -0.031934551894664764,
        -0.052279822528362274,
        0.01106888148933649,
        -0.05534634366631508,
        0.026928480714559555,
        0.0620286799967289,
        -0.04248906299471855,
        0.0005486931768245995,
        -0.03179020434617996,
        -0.005125244613736868,
        -0.15585020184516907,
        -0.04031261056661606,
        0.012348787859082222,
        0.016409745439887047,
        0.0763918086886406,
        -0.038320381194353104,
        0.03011021763086319,
        -0.08303789794445038,
        0.0039050744380801916,
        -0.0051788329146802425,
        0.13662521541118622,
        -0.05381830409169197,
        0.07274775952100754,
        0.03677242994308472,
        0.04215969517827034,
        0.03653343766927719,
        -0.06203005835413933,
        -0.024578223004937172,
        0.0381171852350235,
        -0.0022727674804627895,
        0.011054878123104572,
        -0.05310314893722534,
        1.181784053751553e-32,
        -0.0656382292509079,
        -0.0010841699549928308,
        -0.012956379912793636,
        0.07419537007808685,
        -0.0017990785418078303,
        -0.03537847474217415,
        -0.011190438643097878,
        0.1098717674612999,
        0.006964679341763258,
        0.08023638278245926,
        -0.0052143605425953865,
        0.06743399053812027,
        -0.05561134219169617,
        0.0268687903881073,
        0.03725370392203331,
        -0.073585145175457,
        -0.013424010947346687,
        -0.041627489030361176,
        -0.04408326372504234,
        -0.0001928673591464758,
        -0.008226333186030388,
        0.004602138418704271,
        -0.02635846473276615,
        0.06126338616013527,
        0.036985259503126144,
        0.09261240065097809,
        0.03264302387833595,
        0.003668113611638546,
        0.09608587622642517,
        0.020679829642176628,
        -0.046898163855075836,
        -0.08483882248401642,
        0.006600650493055582,
        -0.08017002791166306,
        0.010108240880072117,
        -0.005907744634896517,
        -0.05579008534550667,
        0.04408211633563042,
        -0.005488906055688858,
        0.006586160510778427,
        -0.0217905156314373,
        -0.02199375629425049,
        -0.061979759484529495,
        -0.10000468790531158,
        0.10262669622898102,
        0.0147161316126585,
        0.054550159722566605,
        0.07369823753833771,
        -0.031392961740493774,
        0.0030602614860981703,
        0.0018274107715114951,
        -0.025815196335315704,
        -0.023448515683412552,
        -0.052918415516614914,
        -0.030805181711912155,
        -0.04357216879725456,
        -0.02252630516886711,
        0.043492481112480164,
        0.023574216291308403,
        0.04620027542114258,
        -0.003662198781967163,
        -0.0016471653943881392,
        0.018187396228313446,
        -0.014693167991936207,
        -0.07123347371816635,
        0.11403343826532364,
        0.04907069355249405,
        -0.05656702443957329,
        -0.02200097218155861,
        0.06895998120307922,
        0.004113826900720596,
        0.05241317301988602,
        0.04069279879331589,
        0.018853988498449326,
        0.014470869675278664,
        0.05877633020281792,
        -0.04828716441988945,
        -0.027290567755699158,
        0.010326509363949299,
        -0.020117951557040215,
        -0.06634943187236786,
        0.0657636746764183,
        0.01889454573392868,
        0.11370313912630081,
        -0.04845164716243744,
        -0.02742896042764187,
        0.004159209784120321,
        -0.024226529523730278,
        -0.03715785592794418,
        0.015351232141256332,
        0.05066253989934921,
        0.06962822377681732,
        -0.06592267751693726,
        -0.06309100985527039,
        -0.04839697480201721,
        -1.1968548464182547e-32,
        0.04024139791727066,
        -0.01957213692367077,
        0.024450773373246193,
        -0.0690767914056778,
        0.05106616020202637,
        0.0028574098832905293,
        -0.0015530692180618644,
        0.09369814395904541,
        0.08236383646726608,
        -0.05246047303080559,
        0.03919137269258499,
        -0.08914702385663986,
        -0.12805409729480743,
        0.05141893029212952,
        -0.04717982932925224,
        -0.016013171523809433,
        -0.04073714092373848,
        -0.05179337412118912,
        0.03741342946887016,
        -0.02668333426117897,
        0.11094753444194794,
        0.11112659424543381,
        0.11034248769283295,
        -0.015557575039565563,
        0.031984928995370865,
        -0.004098139237612486,
        0.03723738342523575,
        0.06322699785232544,
        0.04979385808110237,
        0.04617193341255188,
        -0.0017023856053128839,
        -0.07048589736223221,
        0.014130539260804653,
        0.013807244598865509,
        0.02824409492313862,
        0.038498587906360626,
        0.022601326927542686,
        0.04053208604454994,
        -0.0179867185652256,
        -0.06796811521053314,
        0.03860093280673027,
        0.04652285948395729,
        -0.003586056176573038,
        -0.012521184049546719,
        0.03545601665973663,
        -0.08466226607561111,
        -0.07925435900688171,
        0.11397171020507812,
        0.011440381407737732,
        -0.010003241710364819,
        -0.089033342897892,
        -0.06916560232639313,
        -0.04505173861980438,
        -0.03113170526921749,
        -0.07808708399534225,
        0.059213973581790924,
        -0.028585737571120262,
        -0.013537753373384476,
        0.04921950399875641,
        0.004328683950006962,
        0.02925684303045273,
        -0.03184272348880768,
        -0.07702691107988358,
        -0.08206792175769806,
        0.015653245151042938,
        -0.056906964629888535,
        0.07407716661691666,
        0.009221252053976059,
        -0.021052980795502663,
        0.0014412087621167302,
        -0.029447417706251144,
        0.019981320947408676,
        0.0034210316371172667,
        -0.037972938269376755,
        0.05365106090903282,
        0.013750717043876648,
        -0.05769725888967514,
        -0.009444578550755978,
        0.030001923441886902,
        -0.043042540550231934,
        -0.06275910884141922,
        0.03015267290174961,
        0.032539963722229004,
        0.05924023315310478,
        0.11565755307674408,
        0.09426932781934738,
        0.10714561492204666,
        -0.019117172807455063,
        0.0020299963653087616,
        0.08158132433891296,
        -0.008480350486934185,
        0.03479159623384476,
        0.06629001349210739,
        0.10588879138231277,
        -0.1076926738023758,
        -5.975270767066831e-08,
        0.01797426864504814,
        0.0143960639834404,
        -0.025718657299876213,
        -0.04083215817809105,
        0.0027436118107289076,
        -0.08673032373189926,
        -0.08097758889198303,
        0.010460910387337208,
        0.08395873010158539,
        -0.030592788010835648,
        0.09684542566537857,
        -0.040868569165468216,
        -0.09365926682949066,
        0.1162090077996254,
        0.008422577753663063,
        -0.016862649470567703,
        -0.08241016417741776,
        0.09521717578172684,
        -0.03043678030371666,
        -0.043392080813646317,
        -0.024033309891819954,
        0.047729361802339554,
        0.02972947433590889,
        0.0024121087044477463,
        0.04583355784416199,
        0.02968517504632473,
        -0.026172829791903496,
        -0.02370048128068447,
        0.0523001030087471,
        0.014673987403512001,
        -0.060586441308259964,
        0.02974381484091282,
        0.008830370381474495,
        -0.018572738394141197,
        -0.09266363084316254,
        -0.06680342555046082,
        -0.03991176187992096,
        -0.013923612423241138,
        -0.0060262857005000114,
        0.04865557700395584,
        0.03669717535376549,
        -0.12752997875213623,
        -0.06393788754940033,
        -0.006246206816285849,
        0.0008810821454972029,
        -0.11562104523181915,
        0.06365156918764114,
        -0.0886848196387291,
        -0.01788434199988842,
        -0.040140558034181595,
        -0.013998642563819885,
        0.025766436010599136,
        0.03742966428399086,
        -0.036656852811574936,
        0.07201928645372391,
        -0.008148892782628536,
        0.047265250235795975,
        -0.0005159473512321711,
        -0.036295440047979355,
        0.005038473755121231,
        0.05790150538086891,
        0.015086510218679905,
        -0.06929148733615875,
        0.028650349006056786
    ]
}