{
    "id": "WXp4g-KzdAI",
    "title": "I've NEVER Seen a Memory Stick Like THIS - CAMM Explained",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-11-19T18:06:13Z",
    "video_url": "https://www.youtube.com/watch?v=WXp4g-KzdAI",
    "category": "Science & Technology",
    "tags": [
        "CAMM",
        "Dell",
        "Memory",
        "Laptops",
        "Mobile",
        "RAM",
        "DDR5",
        "DDR6"
    ],
    "views": 1031566,
    "likes": 40421,
    "comments_count": 1107,
    "description": "Try Zoho One free for 30 days with no credit card required here:   Check out The Ridge's new Beveled Ring Collection at   Although Dell has a long and storied history history of proprietary BS.. but CAMM is different.  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Dell have done it again! 0:40 - Ridge! 0:53 - Dell's recent blunders 1:35 - Why SO-DIMM Sucks 3:58 - CAMM and why it is good 5:18 - Similarities to SO-DIMM 6:23 - Potential problems 8:24 - The Precision 7670 10:05 - Zoho One! 10:50 - Outro",
    "description_links": [
        "https://www.zoho.com/one/lp/linus.html",
        "https://Ridge.com/Linus",
        "https://linustechtips.com/topic/1468636-dell%E2%80%99s-proprietary-laptop-ram-is-a-good-thing-hear-me-out/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Oh, would you look at that? Dell's done it again. It wasn't enough to have proprietary motherboards, power supplies, cases, and an upgradeable laptop, that never actually got an upgrade, now you have to have proprietary memory, as well? Ugh. Stop it. Geez. What? What? (paper crumpling) Oh. Wait. So anyone can use this memory center they invented? This changes everything. In fact, this Dell Precision 7670 might be the most important laptop of 2022. That's because, without it, the ability to upgrade memory on a laptop, at all, could have become a thing of the past. Don't believe me? Well, you will soon, after you believe this segue to our sponsor. - The Ridge, their new beveled rings come in premium materials like carbon fiber, tungsten, and 24 carat gold, and include two lost and resizing protection exchanges. Get yours at the link down below. - I don't blame you for being skeptical. Dell has a long and storied history of completely bogus proprietary crap. One of the most recent ones being the Alienware Area 51 app, a laptop that Dell said would be upgradeable, until it came time to actually offer the upgrades, and then they got all, \"Well, technically, it was as long as you stay within the same hardware generation on us.\" So what makes me trust that the upgradeable memory we're talking about today will actually be upgradeable? It's because, rather than going it alone, Dell is working with JEDEC, and by extension, JEDEC members, to get their new memory module turned into an open standard for laptop memory going forward, and it is super cool. The first thing that jumps out when we remove the bottom panel of the Precision 7670, is the massive green memory module here that looks like no memory module I've ever seen before. This is the CAMM module, or compression attached memory module, and looks pretty cool, I guess, but why? Well, currently the memory in your laptop is probably more like what's in this XPS 15. SODIMM, or small outline DIMM modules, have been around for 25 years, and that's one heck of a run for technology. But with the speeds we're expecting to see in the coming years, they're simply running out of gas. Why? Good old signal integrity. The longer the wire, the greater the signal loss, and the greater the latency. Look at the fastest memory products on the market. HBM, or high bandwidth memory, is mounted right on the package, mere millimeters away from the processor that it serves. The GDDR6 memory on a 4090. all of that is within a couple centimeters of the GPU dye. This keeps the wires as short as possible. By comparison, the chips on a SODIMM might as well be in Narnia, with a minimum wire length of around seven and a half centimeters. This is super easy to see on our XPS 15. The CPU is soldered to the motherboard right here, and the traces need to travel all the way underneath these memory modules, back up through the connector, and then around, finally, into the package dyes. There are DDR5 SODIMMs and laptops, however, if you're paying close attention, you've probably noticed that machines with soldered RAM have been enjoying a speed advantage compared to their SODIMM competitors. For current gen DDR5, it's not an insurmountable problem. The theoretical max for SODIMM is about 10,000 mega transfers per second, but it's already proving to be pretty difficult in the real world to get those kind of speeds, and DDR6 will definitely surpass even that theoretical limit. You're probably wondering why we can't just simply turn these SODIMM connectors around. That's a good question, and our best guess is that it just becomes impractical to pack enough zigzagging traces in this small little area so that every single wire is the same length, something that is crucial to maintain perfect signal timing. Now let's turn our attention to CAMM. We've got the CPU right here, and the connector, uh, yeah, you can't get much closer than that. Even with the largest CAMM modules, we're looking at a 50% reduction in distance to the CPU. That is fantastic. But there's another big reason laptop manufacturers have been soldering down RAM, physical size. If you're looking to make the thinnest and lightest machine you can. The SODIMM connectors can easily end up being the tallest component on your motherboard. So if even a couple of millimeters can be saved by soldering down that RAM, it's gonna happen. Unfortunately, such devices are completely unupgradable, and very difficult to repair. Thankfully, CAMM moves that excuse, as well, or at least, helps mitigate it. On top of supporting much higher memory speeds. CAMM is 57% thinner than SODIMM. That helps not only keep devices thinner, but even helps facilitate better airflow over the memory packages. Back to speed for a second. For the moment, CAMM only has a speed advantage at 128 gigabytes of RAM, but Dell wasn't trying to set any speed records on its first outing. Annoyingly, the business users that use the Precision lineup, want stability, instead of all performance, so we'll have to wait until CAMM shows up in Alienware, or something, to see how fast it really can go. Not everything about CAMM is radical though. Mechanically, this design is very novel, but electrically, it is very similar to SODIMM. The bill of materials between the two is nearly identical, so switching between CAMM and SODIMM, is purely just a packaging problem. There's even a CAMM to SODIMM adapter, they're so electrically interoperable. This is also pretty cool. See how there are two SODIMM slots on a single CAMM adapter? That's because CAMM supports two memory channels per module, using shared ground pins, to reduce the total number of connections. And because of these similarities and simplifications, CAMM shouldn't be more expensive than SODIMM in the long term. Currently, you can expect to pay about $1 per gigabyte more for CAMM than SODIMM, but there are no licensing phase to use the design. So as the one years of economies of scale come into play, and more of these modules get made, we can expect the price to come down to match, or even slightly undercut, SODIMM. Just like how we've undercut ourselves by making the color block hoodie only $50. lttstore.com. It's not perfect, though. CAMM offers a less flexible upgrade path than SODIMM. For instance, if you want to go to 64 gigabytes, from 32, there's no way to reuse the RAM that's already in your laptop. The CAMM module, you just remove it, (whoosh) and then you have to put a whole new one in. That assumes that the new one even fits. Like motherboards and power supplies, all CAMM modules should come in standard sizes, but there are more than one standard size. For instance, this 128 gigabyte module is much larger than the 32 gigabyte one we have in our system. But then again, SODIMM users can run into similar issues, as well, especially when it comes to double sided modules. Another point worth mentioning, is that the standard doesn't appear to be 100% nailed down. So we could potentially end up in a Draft N sort of situation. Those of you that aren't elder nerds, back in 2006, wireless networking was in a similar spot to where laptop memory is now. Router manufacturers wanted to continue pushing the envelope for speed and network capacity in their products, but thanks to a bunch of bickering between Intel, Broadcom, Texas Instruments, and others, the 802.11n, now called WiFi 4, only existed as a draft standard. In spite of this, router brands started selling Draft N products anyway, only some of which ended up being compatible with the 802.11n standard when it was finalized later. This led to some customers buying bleeding edge routers that promptly turned into e-waste. The same thing could happen with this current iteration of CAMM. To be clear, I doubt the specifications for CAMM are going to change very much, but we know that ECC support is still coming, and all it takes, is for one pin to go from ground to signal, or something like that, to make the memory in this laptop incompatible with future modules you might buy on New Egg, or wherever, in the future. So with that in mind, should you take a risk on this machine? Well, first of all, the Precision 7670 probably wasn't made for you anyway. This is a machine you get your boss to buy for you. It has a bunch of features you can easily pitch to a business, like smart card reader for greater security, systems management, certified drivers, that sort of stuff. It's the kind of product where, realistically, you're buying a whole fleet of them with a service contract, anyways. So, (grunts) you know, upgrading something for your IT department to worry about. The good news is that if you do end up with one of these through work, it's a sick machine to take home and play with off hours. The star of the show is, absolutely, the 16 inch 4K OLED display. I'm pretty sure this is the same panel that's found in the XPS 15, and it is possibly one of the best laptop displays on the market. It has excellent color accuracy, near perfect blacks, and low input lag, to make gaming much more enjoyable than other business laptops. Our model supports a Quadro A2000 GPU, which is, essentially, an RTX 3050ti that is down clocked, slightly, to improve stability under extended loads. Ours is the slim version here. So this is a, not exactly thin, or light, by any means, at 5.75 pounds, but if you want even chunkier version, well the performance version has a GPU that can go up to a Quadro A5500, which has similar performance to a laptop RTX 3080ti. This thing is going to be a sleeper gaming beast. The rest of the laptop is business, as usual, for Dell's business division. Excellent keyboard, loads of IL, and, surprisingly, good track pad to boot. Now it's time for business, as usual, at ltt, telling you about the segue to our sponsor - Zoho One. If you run a business, you know how hard it is to keep everything organized, but Zoho One is designed to help run your entire business through a single unified platform. You can replace your patchwork of cloud applications, legacy tools, and paper-based processes, with one operating system. Zoho One allows your team to collect leads in one place, close deals quicker, create quotes and invoices, sign contracts digitally, and track every key metric along the way. And when you're outta the office, you can use their mobile apps to work on the go. Ha! I'm working still. Whether it's sales, marketing, finance, analytics, or support, Zoho One has got you covered. Sign up for Zoho One today, using the link below, and get a free 30-day trial with no credit card required. - So if you like this video, maybe watch our review of the XPS 13 Plus. It is very strange, but I also liked it.",
    "transcript_keywords": [
        "CAMM",
        "SODIMM",
        "memory",
        "laptop",
        "memory module",
        "CAMM module",
        "Dell",
        "module",
        "modules",
        "laptop memory",
        "business",
        "SODIMM connectors",
        "RAM",
        "Zoho",
        "largest CAMM modules",
        "Precision",
        "standard",
        "speed",
        "XPS",
        "Dell Precision"
    ],
    "transcript_entity_values": [
        "GDDR6",
        "Router",
        "one",
        "second",
        "Ridge",
        "first",
        "Intel",
        "2022",
        "25 years",
        "One",
        "32 gigabyte",
        "Texas Instruments",
        "32",
        "XPS",
        "Zoho",
        "a couple centimeters",
        "128 gigabyte",
        "ECC",
        "New Egg",
        "51",
        "only $50",
        "a couple of millimeters",
        "Quadro",
        "GPU",
        "Broadcom",
        "today",
        "57%",
        "Narnia",
        "Precision",
        "Dell",
        "4090",
        "Draft N",
        "HBM",
        "RAM",
        "SODIMM",
        "802.11n",
        "JEDEC",
        "100%",
        "15",
        "the Precision 7670",
        "Zoho One",
        "CAMM",
        "SODIMM",
        "about $1",
        "16 inch",
        "CPU",
        "30-day",
        "DIMM",
        "Zoho One",
        "Alienware",
        "the one years",
        "around seven and a half centimeters",
        "128 gigabytes",
        "50%",
        "24",
        "2006",
        "two",
        "the coming years",
        "about 10,000",
        "the Precision 7670",
        "64 gigabytes",
        "IL",
        "5.75 pounds",
        "more than one"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.06047595292329788,
        -0.033057887107133865,
        -0.12893731892108917,
        0.01912062242627144,
        0.043977510184049606,
        0.007953448221087456,
        0.09389913827180862,
        0.09249581396579742,
        0.010046870447695255,
        -0.056470878422260284,
        0.05237583443522453,
        0.00882677547633648,
        0.004680661950260401,
        -0.02467191033065319,
        0.02134362980723381,
        0.01310052815824747,
        0.009345228783786297,
        -0.022600511088967323,
        0.05044267326593399,
        0.014669219963252544,
        0.03039364516735077,
        -0.04807455092668533,
        0.008635195903480053,
        0.049773748964071274,
        -0.04842232167720795,
        0.04986870288848877,
        -0.0030388596933335066,
        0.0010609256569296122,
        0.020015373826026917,
        -0.02422146312892437,
        -0.004500377923250198,
        0.08574499189853668,
        -0.022620191797614098,
        0.0032794990111142397,
        0.039386533200740814,
        -0.01849624142050743,
        -0.0627961978316307,
        0.004302593879401684,
        -0.09954236447811127,
        -0.1538832187652588,
        0.0010185489663854241,
        0.021891476586461067,
        -0.014970379881560802,
        -0.020730258896946907,
        0.08493643254041672,
        0.07327772676944733,
        0.010731970891356468,
        -0.006809455342590809,
        -0.02015211433172226,
        -0.041881706565618515,
        -0.03634215146303177,
        -0.011628394946455956,
        -0.010176954790949821,
        0.02277158387005329,
        -0.02670341357588768,
        0.02853499725461006,
        0.03603781759738922,
        -0.013658193871378899,
        0.012904740869998932,
        0.014631010591983795,
        -0.0056765116751194,
        -0.0756019726395607,
        0.03126182779669762,
        0.03539431467652321,
        -0.018676823005080223,
        0.02015029639005661,
        0.013443912379443645,
        0.06864236295223236,
        -0.055209387093782425,
        -0.0013156888308003545,
        0.01015098299831152,
        -0.0057895611971616745,
        -0.03724643588066101,
        0.039211828261613846,
        -0.005972336977720261,
        0.05783575773239136,
        -0.004005984868854284,
        -0.019343329593539238,
        -0.0684637501835823,
        -0.05217784643173218,
        -0.010039087384939194,
        -0.021760014817118645,
        0.04777275398373604,
        -0.011227654293179512,
        0.09831247478723526,
        0.09630867093801498,
        0.06693977117538452,
        -0.011831412091851234,
        -0.04038344696164131,
        -0.09381308406591415,
        -0.03848935291171074,
        0.10571225732564926,
        0.00456444825977087,
        -0.08661537617444992,
        0.006193296052515507,
        -0.06699062883853912,
        0.052724339067935944,
        -0.04563610628247261,
        -0.040753092616796494,
        0.05831688269972801,
        0.08342597633600235,
        0.042233455926179886,
        -0.004776217974722385,
        -0.01011907123029232,
        0.005859161727130413,
        -0.03615407645702362,
        0.03057253174483776,
        0.08090467751026154,
        0.008977759629487991,
        0.02053729258477688,
        -0.048078231513500214,
        0.02551286295056343,
        -0.036747872829437256,
        -0.06105981394648552,
        0.02118108421564102,
        -0.04187800735235214,
        -0.05744105949997902,
        -0.02152133733034134,
        -0.0016097609186545014,
        -0.019301211461424828,
        0.012948042713105679,
        -0.07832733541727066,
        -0.0930924192070961,
        -0.052548978477716446,
        -0.06277693808078766,
        -0.0022291105706244707,
        0.005313746631145477,
        1.7643819394247212e-33,
        0.005446725990623236,
        -0.014342003501951694,
        -0.07715115696191788,
        -0.04577730968594551,
        0.027648817747831345,
        -0.03267349302768707,
        0.019825737923383713,
        -0.018078597262501717,
        -0.07220279425382614,
        0.06219754368066788,
        0.02418806031346321,
        -0.04377259314060211,
        -0.057366546243429184,
        0.07605002075433731,
        0.042889222502708435,
        -0.12285308539867401,
        -0.06773530691862106,
        -0.024420354515314102,
        0.016877977177500725,
        -0.03925933316349983,
        -0.02101118117570877,
        0.04544098675251007,
        -0.0073152282275259495,
        -0.05018407106399536,
        0.08284758031368256,
        0.02258916012942791,
        -0.04301714524626732,
        -0.004125324077904224,
        0.05892379581928253,
        0.025827260687947273,
        -0.06370875984430313,
        -0.009094714187085629,
        -0.01813335157930851,
        -0.1366785764694214,
        0.061242371797561646,
        -0.004720951896160841,
        -0.06822165101766586,
        -0.0874411016702652,
        -0.01150071807205677,
        -0.13231854140758514,
        0.09210160374641418,
        0.002342564519494772,
        -0.0658809244632721,
        -0.06808476150035858,
        -0.04020407423377037,
        -0.032144345343112946,
        0.11659221351146698,
        0.06848113238811493,
        0.07755354046821594,
        -0.029640860855579376,
        -0.031960997730493546,
        -0.030346857383847237,
        -0.13592387735843658,
        -0.04368805140256882,
        -0.03242938593029976,
        -0.04029788449406624,
        -0.02529728412628174,
        -0.013165812008082867,
        0.0740276426076889,
        0.04565136134624481,
        0.02949969843029976,
        0.011949998326599598,
        -0.016446536406874657,
        -0.05392948165535927,
        -0.07871795445680618,
        0.08063367754220963,
        0.04558589309453964,
        0.06153721362352371,
        -0.06513208895921707,
        -0.017582189291715622,
        0.016189200803637505,
        -0.04629245772957802,
        -0.009914206340909004,
        -0.011538009159266949,
        -0.006345696747303009,
        0.008111651055514812,
        -0.03488561511039734,
        -0.051030974835157394,
        -0.07031358778476715,
        -0.017312081530690193,
        -0.023742234334349632,
        -0.06344591826200485,
        0.007975638844072819,
        0.04340648651123047,
        -0.01372541394084692,
        0.040736373513936996,
        0.11237771809101105,
        -0.05469821020960808,
        -0.05119127780199051,
        -0.01126014068722725,
        -0.014358674176037312,
        -0.029223952442407608,
        0.0685315877199173,
        -0.04926338419318199,
        -0.10227018594741821,
        -4.965337729041268e-33,
        -0.05168977752327919,
        -0.0036349627189338207,
        0.026184823364019394,
        0.03576277941465378,
        0.01148162316530943,
        -0.06361157447099686,
        -0.029042601585388184,
        0.04510515183210373,
        -0.015389891341328621,
        -0.09344766288995743,
        0.0053442795760929585,
        0.040695175528526306,
        -0.061161261051893234,
        0.01741688698530197,
        -0.008460883982479572,
        -0.0036673860158771276,
        -0.013401386328041553,
        -0.02776857651770115,
        0.012412208132445812,
        0.01372668519616127,
        0.03785209730267525,
        0.022123336791992188,
        0.0628926008939743,
        0.039723534137010574,
        -0.06022221967577934,
        0.07567471265792847,
        0.04288136959075928,
        0.0623626634478569,
        0.025437716394662857,
        0.050692539662122726,
        0.015344230458140373,
        -0.01963992416858673,
        -0.04070845618844032,
        0.008922410197556019,
        -0.01752534694969654,
        -0.08702677488327026,
        0.0828995630145073,
        -0.031499505043029785,
        -0.03944022208452225,
        -0.06390819698572159,
        -0.00839930772781372,
        0.035110075026750565,
        -0.02488955296576023,
        -0.03704500198364258,
        0.022344613447785378,
        -0.03337059170007706,
        -0.048775043338537216,
        0.051615554839372635,
        0.004956346936523914,
        0.021335899829864502,
        -0.03344791755080223,
        0.009078199043869972,
        -0.0005194088444113731,
        -0.006717216689139605,
        -0.04621211066842079,
        -0.03976554051041603,
        6.704614497721195e-05,
        0.03618098050355911,
        0.040125686675310135,
        -0.09333944320678711,
        0.05447416007518768,
        -0.035553038120269775,
        -0.03400527685880661,
        -0.09962555021047592,
        0.08927391469478607,
        0.04787534847855568,
        0.1358695924282074,
        -0.006387617439031601,
        -0.13936088979244232,
        0.038132812827825546,
        0.009555830620229244,
        0.04712262377142906,
        -0.03868939355015755,
        -0.05588240548968315,
        -0.00807774905115366,
        0.048659082502126694,
        -0.015974298119544983,
        0.008906482718884945,
        -0.03787289559841156,
        -0.08949282020330429,
        -0.017076587304472923,
        -0.0010763030732050538,
        0.04118986800312996,
        0.03648762404918671,
        0.012130318209528923,
        -0.004020254127681255,
        -0.06632371991872787,
        -0.02627328224480152,
        -0.04635070636868477,
        -0.01675882190465927,
        -0.06712214648723602,
        -0.03311397135257721,
        -0.02005613036453724,
        0.07693415880203247,
        -0.001549260108731687,
        -6.178287748070943e-08,
        -0.040911708027124405,
        0.009729701094329357,
        0.024639982730150223,
        -0.01564725860953331,
        0.03863639384508133,
        -0.10165714472532272,
        -0.015705270692706108,
        -0.03209177032113075,
        0.0647222250699997,
        -0.06598101556301117,
        0.07044550031423569,
        -0.04184415936470032,
        -0.07235254347324371,
        -0.039112500846385956,
        0.019138546660542488,
        0.07728468626737595,
        -0.056446194648742676,
        0.0014744078507646918,
        -0.004415531642735004,
        -0.0663798600435257,
        0.012796957977116108,
        -0.017819777131080627,
        0.12073320150375366,
        -0.07995671033859253,
        0.029284188523888588,
        0.01389282289892435,
        0.024302367120981216,
        0.09894213825464249,
        0.12238983064889908,
        -0.0568283274769783,
        0.006375651340931654,
        0.014412757009267807,
        0.1261693686246872,
        -0.055828653275966644,
        0.11605221778154373,
        -0.044881951063871384,
        -0.06383918225765228,
        0.06944507360458374,
        0.06024956330657005,
        0.012422870844602585,
        0.02381266839802265,
        -0.03552023693919182,
        0.049487870186567307,
        0.06741497665643692,
        -0.03600708767771721,
        0.01662311889231205,
        0.025308026000857353,
        -0.07694274932146072,
        0.03859760984778404,
        0.004996027797460556,
        -0.016977181658148766,
        -0.01842755824327469,
        0.026070278137922287,
        0.061388883739709854,
        0.04875103756785393,
        -0.06331421434879303,
        0.012568088248372078,
        0.07117195427417755,
        0.01863524131476879,
        0.055328451097011566,
        0.047717612236738205,
        -0.038032416254282,
        -0.00801258347928524,
        0.11419984698295593
    ]
}