{
    "id": "wZK3fs39kmI",
    "title": "Pixel 7 & 7 Pro review: small, but essential updates",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-10-21T14:00:29Z",
    "video_url": "https://www.youtube.com/watch?v=wZK3fs39kmI",
    "category": "Science & Technology",
    "tags": [
        "pixel 7 pro",
        "google pixel 7 pro",
        "pixel 7 review",
        "google pixel 7",
        "pixel 7 pro review",
        "pixel 7 pro camera",
        "google pixel 7 pro review",
        "pixel 7 pro unboxing",
        "pixel 7 camera",
        "google pixel 7 pro camera test",
        "google pixel 7 pro unboxing",
        "google",
        "google pixel 7 review",
        "pixel 7 unboxing",
        "pixel",
        "google pixel",
        "pixel 7 vs pixel 7 pro",
        "pixel 7 price",
        "google pixel 7 unboxing",
        "tech",
        "the verge"
    ],
    "views": 184313,
    "likes": 5162,
    "comments_count": 300,
    "description": "Googles marketing the Pixel 7 and Pixel 7 Pro as the scary-helpful, super smart devices that will make your life easier. While this new generation does learn some new tricks, the real treat is that theyre just a little better than the 6 and 6 Pro  and that makes a big difference.  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3VKaQLw",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- All right, let me show you my favorite feature on this new Google Pixel 7 phone. (alarm rings) Silence. Look at that. (catchy instrumental music) A few years ago, you might have thought of the Pixel phones as \"the phones with the really good cameras\", but Google wants you to think of them a little bit differently now. Like, \"the phones that are super smart and helpful\". Maybe even spooky helpful. It's spooky season, I had to. I'm not gonna leave you hanging, these new Pixel phones are really good, but they're not quite the creepy good, super intelligent devices that Google is marketing. They're slightly better versions of the Pixel 6 and 6 Pro, in some important ways. They're not gonna radically change how you use your phone. They just do pretty much everything a flagship phone should do. And at 599 and 899, they cost a little less than the competition. There's nothing scary about that. (thunder rumbles) That was weird. Did y'all hear that? The design is a little different this year. It's still the same overall concept as last year with the prominent camera bar, but the colors are a little more muted. The camera bar kind of flows into the side rails and it all has this metallic finish. The camera bar on the Pixel 6 was this heavy, contrasty black that looked clunkier. I just like this better. It's nice. Oh, and I know we're talking about the exterior, but on the inside is probably the Pixel's biggest update. Tensor G2. It's the newest version of Google's custom chip set. More on that in a bit. On the front panel, the screens on the 7 and 7 Pro are slightly different too. The Pixel 7 has a 6.3 inch screen with smaller bezels than the 6.4 inch screen on the Pixel 6. The 7 Pro still has a huge 6.7 inch display, with up to 120 hertz refresh rate, so everything looks super smooth as you use the phone. The Pixel 7 still maxes out at 90 hertz which is just a little behind the times. Some mid-range Android phones come with 120 hertz screens. You know, unlike certain other $800 phones. Both screens are 25% brighter this year, and they're both comfortable to use outside, even in bright daylight. There's all the other stuff a flagship phone should have, like 5G and IP68 rating for water resistance, and good battery life. Even with a battery hungry screen on the 7 Pro, I still got through an entire day of use. One of the best improvements this year is the addition of face unlock. The Pixel 6 phones only had fingerprint scanners for biometric unlocking, and they're pretty slow. Fingerprint scanning on the 7 and 7 Pro feels more responsive, and when you double up with face unlock, it means your phone just unlocks quickly, one way or the other. I haven't had to think twice about unlocking either phone as I've been using them. They just work like they should. (whimsical music) So the basics are all covered, but Google wants the Pixel to be your helpful personal assistant, and there are a few updates to its voice and helper features. There's \"Direct My Call\" which Google introduced last year, and it tries to help you cut through the customer service phone tree menus faster by displaying options on screen. This time, it actually shows you the options before they're spoken. It's neat when it works, which it obviously does for a few numbers that Google suggested we try it out with. But it doesn't work like that with my usuals like PetSmart and Walgreens, so at least right now I'm still stuck wading through a bunch of menu items while I'm sitting outside waiting for curbside pickup. There's a couple of other voice recognition improvements, but they're pretty minor. The phone can automatically transcribe voice messages if you have one weird friend who likes to send voice messages, and not text. And assistant voice typing is better at understanding which emoji you're trying to use. It's good, but it's not perfect. Dancing lady emoji. Lady who is dancing emoji. The emoji of the dancing lady. Nothin'. (catchy bass music) There are a lot of little things that the Pixel was already good at, like the Recorder App, which is incredibly handy. So the Pixel 7 does have some really useful features you won't find anywhere else, but none of this year's assistant improvements are like, scary good. (thunder rumbles) Okay, did you hear that? I swear. Google might be more about the intelligence features lately, but the cameras are still a big deal, and I actually think that this is where the interesting updates are this year. Both cameras use the same 50 megapixel main sensor, but there's a new trick this year, a two times zoom mode. Apple did this with the iPhone 14. It uses the 12 megapixels at the middle of the sensor, so it gets a two times telephoto crop without using the upsampling that digital zoom uses. That's what the Pixel 6 was doing with its two times zoom mode. The 7 Pro also gets an extra 10 times crop mode by doing the exact same thing with the five times telephoto camera. The results are pretty good, but they don't quite stand up to what the Samsung S22 Ultra can do with its dedicated 10 times lens. So the Pixel 7 Pro's ultra wide gets auto-focus this year, which means it can double as a macro camera. And it's actually pretty good. I was a little skeptical, 'cause I've seen so many frighteningly bad macro modes on smartphone cameras, but this one's pretty good. It's tough to judge if your subject isn't in focus, but when it gets it, it really nails it. And after the sun goes down, there's night sight to help illuminate the things that go bump in the night. And there's really good news here, it's a lot faster. Previous versions of night sight needed like five or six seconds to make an exposure. Pixel 7 has shaved like a solid two or three seconds off of that time, so that's very helpful if you're taking a picture of anyone with a pulse. Per usual, some of the computational magic happens after you take the picture. This year, Google added photo unblur, which is a tool you can use on any blurred photo taken with any camera, not just a Pixel. It's a Google Photos feature exclusive to the Pixel 7 and 7 Pro, and in a couple of instances, I can see it working pretty well. It sharpens up these low res images I took at a tennis tournament many years ago. Look at this up and comer, Novak Djokovic. But on other photos, the results are kind of meh. They're either too blurry to start with, or photo unblur gives them an over-processed look that I don't like. I feel the same way about magic eraser. It's still here, and with the right image, it works pretty well. But most of the time, it's just not that magical. Anyway, image quality in general is really good. There's still a little more of a cool color cast on photos than with Apple or Samsung cameras, but it's capable of some really impressive things. My kid was moving so much here that I was sure I didn't get a sharp shot, but I actually did. And I prefer the harder contrast of the Pixel camera than Apple or Samsung's. Like how it handles this portrait with some back lighting. They're bright enough, but it keeps them shadow detailed dark. Which is great, because nothing is scarier than bad HDR. (thunder rumbles) Did you hear that? (whimsical music) Video mode is still good overall, and there's the new cinematic blur mode that's a whole lot like Apple's cinematic mode. It's basically a portrait mode effect for video, and it does the job okay, but in tricky situations, it kinda looks like a beta feature. Apple's is pretty far ahead here, and its cinematic mode isn't perfect, but it's a lot more convincing. So that's the Pixel 7 and 7 Pro. Google really had one job here, and that was to address some of the Pixel 6's weak points. And it did. Unlocking the phone is faster, the camera is more competitive with Apple and Samsung, and the design is a little more appealing. It's been a year of new phones with iterative updates, and in this case at least, it makes a lot of sense. The Pixel 6 and 6 Pro ushered in a new era for Google's mobile devices. And with the 7 and 7 Pro, they're just a little better in ways that matter. The new speech and assistant tricks aren't that impressive, but overall, the Pixel 7's a pretty good treat. So, instead of having to say, \"Hey, Google!\" I can just do this. Silence. (alarm rings) Silence! (Allison chuckles) Did it. (Allison chuckles)",
    "transcript_keywords": [
        "Pixel",
        "Google",
        "Pro",
        "Pixel phones",
        "good",
        "phone",
        "year",
        "Google Pixel",
        "phones",
        "pretty",
        "camera",
        "pretty good",
        "mode",
        "times",
        "Apple",
        "Pixel camera",
        "cameras",
        "Google Photos feature",
        "voice",
        "camera bar"
    ],
    "transcript_entity_values": [
        "last year",
        "90",
        "Pixel",
        "Android",
        "Allison",
        "6.4 inch",
        "one",
        "Apple",
        "Walgreens",
        "two or three seconds",
        "Tensor G2",
        "Pixel",
        "PetSmart",
        "many years ago",
        "the Pixel 7 Pro's",
        "Google",
        "year",
        "12 megapixels",
        "599",
        "120",
        "5",
        "the Pixel 7 and 7 Pro",
        "A few years ago",
        "a year",
        "hertz",
        "Lady",
        "Samsung",
        "Nothin'",
        "7",
        "25%",
        "two",
        "Google Pixel 7",
        "One",
        "6",
        "6.3 inch",
        "This year",
        "this year",
        "The Pixel 7",
        "five or six seconds",
        "Novak Djokovic",
        "the Pixel 7's",
        "6.7 inch",
        "five",
        "50 megapixel",
        "iPhone",
        "899",
        "an entire day",
        "10"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "GPE",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.08587675541639328,
        -0.08259490877389908,
        0.10626371204853058,
        -0.04440316930413246,
        0.061653632670640945,
        0.004818731918931007,
        0.06658428907394409,
        0.028778327628970146,
        -0.025022292509675026,
        0.030874138697981834,
        -0.0335664264857769,
        0.05387018620967865,
        -0.030203310772776604,
        -0.03294166177511215,
        0.00581354321911931,
        -0.035184893757104874,
        0.0817379578948021,
        -0.05009639635682106,
        -0.07050134986639023,
        0.029814476147294044,
        -0.04798782244324684,
        -0.05527176707983017,
        0.07642535865306854,
        0.08441776782274246,
        0.03434588387608528,
        -0.0012871114304289222,
        -0.022434379905462265,
        -0.007031022105365992,
        0.002096151001751423,
        -0.06418167799711227,
        -0.03581085801124573,
        0.13383272290229797,
        0.08129113912582397,
        0.022718217223882675,
        -0.06913727521896362,
        -0.03990263119339943,
        0.0935262069106102,
        0.07636179029941559,
        -0.05872166529297829,
        0.008584425784647465,
        0.04120810329914093,
        -0.04397009313106537,
        0.031661663204431534,
        -0.0973462164402008,
        -0.016136761754751205,
        -0.04517015442252159,
        0.032773200422525406,
        -0.07963412255048752,
        9.754285565577447e-05,
        -0.07087922841310501,
        -0.028033249080181122,
        -0.06614603102207184,
        -0.024551160633563995,
        0.02756413072347641,
        -0.07738611102104187,
        0.026413051411509514,
        3.2141906558535993e-06,
        -0.03073987551033497,
        0.04478456825017929,
        0.06561266630887985,
        -0.0061917915008962154,
        -0.07038963586091995,
        0.0012560819741338491,
        0.06930813193321228,
        -0.030597487464547157,
        0.02525845728814602,
        -0.0339757576584816,
        -0.03983334079384804,
        -0.02303234301507473,
        -0.00505127664655447,
        -0.06998498737812042,
        0.06888282299041748,
        0.03123166784644127,
        0.026989875361323357,
        -0.006727549713104963,
        0.058428190648555756,
        0.005887558218091726,
        -0.08076538145542145,
        -0.03206450864672661,
        -0.06828290969133377,
        0.0397007130086422,
        -0.0334186889231205,
        -0.023899318650364876,
        0.028956251218914986,
        0.03487161546945572,
        -0.05955282226204872,
        0.02712618000805378,
        0.07240153104066849,
        -0.05347052589058876,
        -0.09010793268680573,
        0.004186662845313549,
        0.12114108353853226,
        0.019600512459874153,
        -0.0008028580341488123,
        -0.0071249608881771564,
        0.02113201655447483,
        -0.05152394622564316,
        -0.10889067500829697,
        -0.05929139629006386,
        0.013410928659141064,
        0.013346225023269653,
        0.0026531240437179804,
        0.01611666940152645,
        -0.025445381179451942,
        0.05200258642435074,
        -0.04725345969200134,
        -0.06804482638835907,
        0.05803278833627701,
        0.04415713995695114,
        0.019042685627937317,
        -0.0220361165702343,
        0.04674825444817543,
        -0.018382694572210312,
        0.03463013842701912,
        -0.015502993017435074,
        -0.03326991945505142,
        -0.018010970205068588,
        0.05189498886466026,
        0.16972501575946808,
        0.00034746402525343,
        0.04290340840816498,
        0.05173775181174278,
        -0.04810452088713646,
        -0.07775364071130753,
        0.005194503348320723,
        0.00145429908297956,
        -0.0745198130607605,
        2.7342979403225375e-33,
        0.009176873601973057,
        0.09092223644256592,
        0.0028452107217162848,
        -0.01083561684936285,
        -0.030826490372419357,
        0.015127839520573616,
        -0.04586660861968994,
        0.01563538797199726,
        0.022714819759130478,
        0.008361360058188438,
        -0.016659758985042572,
        0.01048869639635086,
        -0.03324909880757332,
        -0.011438998393714428,
        0.12173064798116684,
        0.0009687396232038736,
        -0.06451554596424103,
        -0.018741600215435028,
        -0.0318838506937027,
        -0.019926078617572784,
        0.02004798874258995,
        -0.038995154201984406,
        -0.03942420706152916,
        0.03873520717024803,
        0.04949688911437988,
        0.0306863933801651,
        0.04830620810389519,
        0.02308502607047558,
        -0.013341712765395641,
        -0.021076200529932976,
        -0.09278761595487595,
        0.03762705251574516,
        0.12235314399003983,
        0.03965657949447632,
        -0.01247686892747879,
        0.03918783366680145,
        -0.05839250981807709,
        -0.03246542066335678,
        0.016799479722976685,
        0.011343431659042835,
        -0.04709959402680397,
        0.006350579671561718,
        -0.08949209749698639,
        -0.04177865758538246,
        0.07430844008922577,
        0.051971253007650375,
        0.016928527504205704,
        -0.030841253697872162,
        0.012152100913226604,
        0.03381079435348511,
        0.05461797118186951,
        -0.01868070662021637,
        -0.055957306176424026,
        0.007094870321452618,
        -0.03135683760046959,
        -0.017431285232305527,
        0.021689753979444504,
        -0.01758207567036152,
        0.060677602887153625,
        -0.03838261216878891,
        0.029317323118448257,
        0.008031835779547691,
        -0.06657768785953522,
        -0.029874224215745926,
        -0.03597632423043251,
        0.05072429031133652,
        0.05251777172088623,
        0.045091934502124786,
        -0.09207341074943542,
        0.01562245562672615,
        -0.058070387691259384,
        0.0036796079948544502,
        0.0317046120762825,
        -5.1287704991409555e-05,
        -0.016273271292448044,
        0.008094854652881622,
        -0.10119755566120148,
        -0.07579636573791504,
        -0.02816455438733101,
        -0.00038868660340085626,
        0.037596601992845535,
        -0.016101010143756866,
        -0.022390101104974747,
        0.04225765913724899,
        -0.0020292201079428196,
        -0.014920421876013279,
        0.022332269698381424,
        -0.06123433634638786,
        -0.07784795016050339,
        0.00391346262767911,
        -0.048719506710767746,
        -0.052606675773859024,
        -0.05223580077290535,
        0.09266682714223862,
        -0.08486981689929962,
        -3.200834383090626e-33,
        -0.03503946587443352,
        -0.013488754630088806,
        0.02670644409954548,
        0.05747569724917412,
        -0.05020735412836075,
        -0.05194348096847534,
        0.09784652292728424,
        0.05522556230425835,
        -0.022117730230093002,
        -0.04137243330478668,
        -0.010404258035123348,
        0.05435992404818535,
        0.02988848276436329,
        0.03087744489312172,
        -0.01850239187479019,
        -0.07045441120862961,
        0.014200078323483467,
        -0.07117483764886856,
        0.009642834775149822,
        -0.016671769320964813,
        0.06605717539787292,
        0.01567072980105877,
        -0.12291710078716278,
        0.034021515399217606,
        -0.008284098468720913,
        0.03287408500909805,
        0.03791799023747444,
        0.011085604317486286,
        0.021587790921330452,
        -0.0486689992249012,
        -0.006867445074021816,
        -0.054682180285453796,
        0.015544810332357883,
        -0.008084085769951344,
        0.09143563359975815,
        0.0072979615069925785,
        -0.014653204008936882,
        -0.08061359077692032,
        -0.0075352005660533905,
        -0.05516006797552109,
        -0.036960918456315994,
        0.011532837525010109,
        0.05778156593441963,
        -0.10326072573661804,
        0.047848038375377655,
        -0.03186536580324173,
        0.049207188189029694,
        0.04252201318740845,
        -0.04179561138153076,
        0.09763842821121216,
        0.0474846176803112,
        0.060427967458963394,
        -0.06693337857723236,
        -0.028711970895528793,
        -0.11016100645065308,
        -0.0782550498843193,
        -0.026528622955083847,
        -0.03284424915909767,
        0.07541529834270477,
        0.009125950746238232,
        0.02693360485136509,
        -0.003762540640309453,
        -0.04805003106594086,
        -0.034040722995996475,
        -0.07635962963104248,
        0.06476262211799622,
        0.0424487479031086,
        0.05276643484830856,
        0.007867105305194855,
        0.002259693806990981,
        -0.024500278756022453,
        0.005526685621589422,
        -0.010043877176940441,
        -0.10194404423236847,
        -0.036996956914663315,
        0.0031890494283288717,
        -0.049414604902267456,
        -0.030617570504546165,
        -0.06883270293474197,
        -0.00794919952750206,
        0.003780875587835908,
        -0.014591056853532791,
        0.05737770348787308,
        0.014585860073566437,
        0.07494847476482391,
        0.06156096234917641,
        0.05639812722802162,
        0.0010426962981000543,
        -0.004008838441222906,
        0.03638974204659462,
        -0.05192331224679947,
        0.03913772478699684,
        -0.06233537197113037,
        0.06465743482112885,
        -0.005867430474609137,
        -5.388260149175039e-08,
        0.06622634083032608,
        -0.0718110129237175,
        0.05140230432152748,
        -0.05848126858472824,
        0.10337690263986588,
        -0.11956515163183212,
        -0.0203132014721632,
        0.02966512180864811,
        0.08296465128660202,
        -0.012144495733082294,
        0.037918269634246826,
        -0.08035412430763245,
        -0.05750489979982376,
        0.10257063806056976,
        0.04397616907954216,
        0.061345286667346954,
        -0.0060796234756708145,
        -0.04287499561905861,
        0.001221787417307496,
        -0.025735478848218918,
        0.026502566412091255,
        -0.009484064765274525,
        -0.012422583997249603,
        -0.02841462381184101,
        0.056126344949007034,
        -0.018959730863571167,
        -0.009929131716489792,
        0.011890391819179058,
        0.03354829177260399,
        -0.03797448053956032,
        -0.0169584508985281,
        -0.021635133773088455,
        0.05322110652923584,
        -0.019131435081362724,
        -0.0016957686748355627,
        0.011131150647997856,
        0.0836811289191246,
        -0.06608666479587555,
        0.14552481472492218,
        -0.0005836907075718045,
        0.03838806971907616,
        -0.09080289304256439,
        0.036299481987953186,
        0.03875834867358208,
        -0.029903803020715714,
        -0.06419999897480011,
        0.029094040393829346,
        -0.08528852462768555,
        0.02122524380683899,
        0.11150950938463211,
        -0.03857315331697464,
        0.007458968553692102,
        0.008433060720562935,
        -0.017801841720938683,
        0.11668211966753006,
        -0.0378887914121151,
        0.059809815138578415,
        0.020726539194583893,
        -0.006731692235916853,
        0.0915674939751625,
        0.10126176476478577,
        -0.024875961244106293,
        0.018539568409323692,
        0.09488359838724136
    ]
}