{
    "id": "x3kKibGUkiw",
    "title": "This should have been discontinued... - M2 MacBook Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-06-28T22:29:54Z",
    "video_url": "https://www.youtube.com/watch?v=x3kKibGUkiw",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "macbook",
        "pro",
        "m2",
        "m1",
        "unboxing",
        "comparison",
        "first impressions",
        "thoughts",
        "anthony",
        "ltt",
        "mac address",
        "mac",
        "tim cook",
        "laptop",
        "school",
        "wfh",
        "new",
        "tech",
        "gadget",
        "work"
    ],
    "views": 861560,
    "likes": 25450,
    "comments_count": 1318,
    "description": "Get a Grip right now from dbrand at   Anthony's taking a look at the new M2 MacBook Pro to see if M2 can deliver increased performance and if we can figure out who this touch bar Mac is for.  Buy 2022 Apple MacBook Pro M2:   Buy Apple MacBook Pro M1:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Apple's box confusion 0:57 Unboxing and hardware impressions 2:18 Comparing to the 2020 MacBook Pro 2:37 Port overview 3:43 Sponsor - brand 4:37 What's the same? 6:13 Webcam/Microphone comparison 6:48 Speaker comparison - 2022 v 2020 7:20 Speaker comparison - 2022 13\" vs 2021 14\" 8:35 The big question 9:22 Can Mac Address explain the difference? 11:01 Cinebench benchmark drag race 12:16 Final thoughts 13:08 Outro",
    "description_links": [
        "http://dbrand.com/shortlinus",
        "https://geni.us/r1W0",
        "https://geni.us/MYQB",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- You know what? It's about time that Apple's caught up to the PC world. Welcome to the M dot 2 revolution. Is that not what this is? This is an M dot two MacBook, right? - [Bell] Something like that. - That's what it is? If only. No, this is the M2 MacBook Pro, which is in fact identical to the M1 MacBook Pro. You'll note that these are very similar on the back, so similar in fact that it's tough to actually tell. But at least this one does say \"with M1 chip\" over here. And this one says just 13-inch MacBook Pro, which could mean anything. Thank you, Apple, for going back to the stupid... (fists banging) (host sighing) Please give them model numbers. Maybe you can even just put like a year there. M2 isn't on here at all, I don't think. Let's take a look at this. 10-C GPU, so that I guess tells you that it's an M2. But M2, I don't think is even like... You wouldn't even find M2 on here. That's cool. Thank you, Apple. As you may or may not know, this is in fact the exact same chassis as the other MacBook Pro, the 13-inch MacBook Pro, I should say. This is the 13-inch MacBook Pro M1, or M2, god. (plastic tearing) It's all already... (plastic tearing) Apple, I thought we've been over this. This is supposed to just come right off. Ugh, all right. (plastic tearing) In the box, we just have a Type-C cable, not MagSafe. Why would it be MagSafe? And what is this? This smells like... (host sniffing) This all smells kind of musty. Yeah, it smells old, smells like my aunt's car. 67-watt charger. They should just all be GaN at this point, gallium nitride. But much like the chassis, I'm sure they have plenty of these that they still need to sell. And that's kind of the thing. This has... (computer booting) Shut up, you. This has the good old low-profile... (computer humming) (Bell laughing) Anyway, it's got the good old low-profile key switches. It's got the good old Touch Bar. It's got the good old touch ID sensor right there. It does have an Escape key thankfully like the most up-to-date 13-inch MacBook Pros do. I mean, what else is there to say about it physically? Like, it is identical to this one. Let's get this outta the box here. I can probably shuffle these and you wouldn't know the difference. Yeah, look at this. It is literally the same machine. (finger tapping) This one's dead. So I will use the new charger to charge it up. Okay, now we got that charging. And it turned on immediately. Thank you, Apple. So we got two USB Type-Cs on the side here. These are Thunderbolt. I believe they're both Thunderbolt on the MacBook Pro. There are no other ones over here, just a combo headphone microphone jack here. You need to use one of these up for charging, which is a bummer because that means that when you're charging or docked you only have a single Thunderbolt port to use, which is kinda why I don't understand why this particular form factor even exists anymore other than Apple just has a bunch of them that they need to sell. Yeah, some people are religious about the Touch Bar. They really love the Touch Bar. And I like the concept of the Touch Bar, but not at the expense of the F keys. Give me the 14-inch here with the F keys. Maybe we could just take this and put it up here, best of both worlds. But we all know that that's not why Apple did that, which is the same reason they haven't bothered changing the lightning connector on iPhones, despite the fact that they've changed over to Type-C for literally everything else. They just need to sell through. There is really no putting it off any further. I need to get into this thing and show you the software experience, maybe run a benchmark or two. But first, I need to talk to you about Dbrand. Dbrand wants us to talk about the Galaxy S22 Ultra cases that they didn't send us for the video on the M2 MacBook. - [Bell] They didn't even send it to us? - Anyway, the S22 Ultra cases are now available from Dbrand. It's not the Atomic Edition, whatever that is. As of today, they're selling the original grip case for the S22 Ultra, same one I use on my... Oh, same one I used to use on my phone. I mean, for the S22 Ultra, come on. You're not gonna use MagSafe for that, right? I do like the grip case. It's nicer feeling in the hand than this is. It's way more grippy. Like, this is slick. (grip case sliding) Whoa, Dbrand. Do this with your phone, and see what happens. If it shoots outta your hand, then you need to get a grip. (host laughing) Check it out at the link below. Yeah, I'm already getting them mixed up. My questions are, is the display the same, are the speakers the same, is the microphone and/or webcam the same. So far, it looks like the old screen may be brighter. Let's turn off True Tone and automatically adjust brightness. Let's drop the brightness down and bring it back up just so, you know, we're in good shape. Okay, so it looks like we did get an eight-gigabyte of RAM model, which is not great. It's the base model. But we do have 512 gigs of storage, which is a good thing because I'm not sure if you've seen yet. But the 256-gig base model actually runs like half the speed in terms of storage performance as the 512. This is a result of Apple no longer using 128-gigs chips, as they do on the original M1 MacBook Pro. Now, they use 256-gig chips, which means that there are fewer channels available to the Flash controller and Flash cannot perform multiple actions simultaneously. It has to kinda take it one at a time. We're looking at much worse performance in terms of memory or storage, exactly what you wanna see out of an upgraded SKU. So if you buy one of these, make sure that you get the 512 gig of storage unless you really don't care about how fast your computer is, which is strange. In that case, you should probably just get the MacBook Air or buy from the refurbished shop instead. Or get a Chromebook. I don't care. So displays are basically the same. I think they're exactly the same. Is the webcam any different? I think it's literally the same. Yeah, 720p FaceTime HD camera. So it's exactly the same camera as well. I don't know if the microphone sounds any different. Let me just move them apart and address them one by one so that you can actually hear what the microphone sounds like in each individual case. I'm gonna move over here now. This is what the microphone sounds like on the new one. So if it sounds any better, then Apple actually did upgrade the array. If not, then Apple didn't, which I don't expect they did. But you never know. And maybe there's better signal processing in the M2. You never know, but probably not though. And it's disappointing, right? Like, I would've preferred to have some kinda anything new other than just the CPU. Let's listen to some Crab Rave. - [Video character] Please. (control buzzing) - Stop it. Ads are the worst. - [Bell] You know what's not the worst? The new ShortCircuit Hoodie. - The new ShortCircuit Hoodie, yes. Oh, it's got like blue on the inside. That's kinda neat. - Unmute (energetic pop music) - All right? (energetic pop music) It's pretty much the same. Like, if I were to load up Crab Rave on the 14-inch here, (energetic pop music) (louder energetic pop music) this sounds a lot better. There's a lot more oomph to it. I mean, obviously it's not great either because it's got a very V-shaped curve. The 16-inch is way, way superior. Or, well, it sounds better either way. They didn't upgrade the sound in this at all. Now, that being said, this used to be kind of a benchmark in terms of audio quality for laptop speakers. But things have changed a lot since Apple first improved those sound drivers. Now, we have this, and thing about this, it's not even appreciably larger in terms of its footprint. It is thicker, but then you have to think about what you're getting in this thicker form factor. Like, how would Apple make this better for me? The TLDR is this is a much nicer looking and feeling machine. That being said, it's a fair bit more expensive. Like, the base model for this is like 1,299, if I'm not mistaken. - [Mr. Horst] Correct. So for an extra 700 bucks, you get honestly quite a bit more computer. I don't know why this exists in a world where the M2 MacBook Air exists. Now, that being said, the M2 MacBook Air isn't shipping yet as far as I know. The M1 was more or less just as fast on the Air as with the Pro unless you hit it with a sustained workload that, you know, would require some kind of cooling. You could theoretically cool the MacBook Air if you needed to. I don't know why this exists except to pander to people who like the Touch Bar and to push more of these chassis out the door. I like my function keys. Like, I can do a lot more in terms of interacting with the computer at a given point in time with this function row than I can with this. Now, that being said, the things that I can do with this can be more flexible. I can adjust the display brightness just like that. Okay, Mr. Horst. - [Mr. Horst] Oh! - First of all, which one's which? (lips smacking) - Wait, they're the same model number? (host laughing) They're both A2338. - That's hilarious. - What? No! (indistinct) Okay, I know because just looking at the doc... - Well, yes. - It's this one. - Yes, I should have turned displays off. What is this machine for? - So the reviews have been out from real publications and... - Oh, real, oh, oh. (Mr. Horst laughing) - I'm just kidding. It seems like the best angle they can come up with is you want the most amount of power with the most amount of battery life. - Okay, but the new Air though. - Well, I don't think the battery's gonna be as robust. We're doing a project out in the Serengeti. And we don't want to use the Jackery, I guess. Make sure it's charged before you leave. - Literally, the only difference is the SOC. - I think it's this. It's either you want a long battery life or you truly love the Touch Bar, which I would not discredit anyone for 'cause I found myself surprised at how much I like the Touch Bar when I used it. - Yeah, no, well, I mean the Touch Bar is fine. I just don't wanna lose my function keys, so... - But they're function keys. - Yeah, but did you see how long it took you to get them out? - Yes, I know. Well, no, you can do this, mmm, mmm. - Yeah, you can. Yeah, okay, so that's faster. But if I wanted to like say quickly mute my mic, it's done. - Why does it exist? Thank you for updating it. (Mr. Horst laughing) That's what it is. - Now that that interruption is over, we will do a drag race of Cinebench. And again, Cinebench isn't the be-all end-all benchmarks, especially on Apple, but between Apples to Apples, it should be a pretty decent comparison. So let's just go ahead and hit all of them now. - [Mr. Horst] Oh yeah. - Oh, well, the M2 does seem to be working a fair bit faster than the M1. And this is just on the CPU test. They have the same number of cores, and this is an M1 Max. So it's got two more cores anyway for the CPU. So it's gonna be a little bit faster, but yeah. This is well out ahead of what the M1 is doing here. And I started them all off at the same time. We'll see what the final score looks like. 12,365 on the M1 Max. Oh no, this is running a... Oh no. This is running a throttle test. Why would it be doing that? I didn't set it up at all. (host sighing) Fine. I'll start this over. The M1 was 7,841 points. The M2 is 8,737, so almost a thousand, so 900-ish points. That's not nothing. So I'm looking forward to the M2 Pro and M2 Max. That's what I'm looking forward to. I don't see any reason why you should pick up this unless you are absolutely married to the Touch Bar and you want the absolute best Touch Bar-equipped Mac you can get because the advantages to this are just so many. Like, this is M1 Max, just to be clear. This is M1 Max, but they both have this... Like, M1 Pro and M1 Max both have the same CPU core arrangement. And that was the performance difference. They have the same actual like clock speeds and everything. So now, I don't see how this is worth $1,200 or $1,300, sorry, 1,299, when you can get a MacBook Air. Obviously, you can't get the MacBook Air today. But I wouldn't buy this today instead of the MacBook Air if I needed something in this class. If I didn't need something in that class and I needed something more powerful, I would get this, bottom line. That's gonna do it for this ShortCircuit. Make sure you get subscribed and maybe go check out our previous M1 MacBook Pro review or not review but unboxing overview kinda thing. I did take that one apart. I said I was gonna take this one apart. But quite frankly, I don't think it's worth it.",
    "transcript_keywords": [
        "MacBook Pro",
        "Touch Bar",
        "MacBook Air",
        "MacBook",
        "Apple",
        "Pro",
        "Touch",
        "Bar",
        "Air",
        "Yeah",
        "kind",
        "MacBook Pro review",
        "Max",
        "MacBook Air exists",
        "MacBook Air today",
        "sounds",
        "good",
        "model",
        "Ultra",
        "keys"
    ],
    "transcript_entity_values": [
        "the M1 MacBook Pro",
        "MacBook Pros",
        "12,365",
        "the Galaxy S22 Ultra",
        "TLDR",
        "M2",
        "USB Type-Cs",
        "RAM",
        "M1 Pro",
        "Chromebook",
        "one",
        "Thunderbolt",
        "14-inch",
        "Serengeti",
        "M2",
        "M2",
        "the S22 Ultra",
        "67-watt",
        "Crab Rave",
        "8,737",
        "like half",
        "Bell",
        "some Crab Rave",
        "13-inch",
        "the M2 Pro",
        "1,200",
        "SOC",
        "Touch Bar",
        "ShortCircuit Hoodie",
        "Horst",
        "M1 Max",
        "7,841",
        "today",
        "1,300",
        "MagSafe",
        "SKU",
        "iPhones",
        "128",
        "Dbrand",
        "256",
        "10",
        "M2",
        "first",
        "eight-gigabyte",
        "M1",
        "two",
        "almost a thousand",
        "Jackery",
        "1,299",
        "F",
        "MacBook Pro M1",
        "M1 MacBook Pro",
        "Mac",
        "512",
        "MacBook Pro",
        "the MacBook Air",
        "Flash",
        "Cinebench",
        "Air",
        "ShortCircuit",
        "M1 Max",
        "CPU",
        "jack",
        "MacBook",
        "the Touch Bar",
        "the MacBook Air",
        "ShortCircuit Hoodie",
        "16-inch",
        "MacBook Air",
        "Apple",
        "GaN",
        "the MacBook Pro",
        "MacBook Air"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "PRODUCT"
    ],
    "vector": [
        -0.03229418396949768,
        -0.08372430503368378,
        0.06535141170024872,
        -0.10148647427558899,
        0.12434159219264984,
        0.016115445643663406,
        -0.03616185486316681,
        0.0006636151229031384,
        -0.021742545068264008,
        0.03807057440280914,
        0.031552787870168686,
        0.014402731321752071,
        0.009792075492441654,
        -0.03354809060692787,
        0.04653960466384888,
        -0.0028871195390820503,
        0.07502410560846329,
        -0.08592555671930313,
        0.006049917079508305,
        0.05141010507941246,
        0.0024362511467188597,
        -0.05243714153766632,
        0.0289295744150877,
        -0.03434935584664345,
        -0.05738392844796181,
        -0.03206271678209305,
        0.031197993084788322,
        -0.04131593927741051,
        -0.04691161960363388,
        -0.054517555981874466,
        0.003967443015426397,
        0.04559652879834175,
        0.015483218245208263,
        -0.02443862147629261,
        -0.010949825868010521,
        -0.11840814352035522,
        -0.012827078811824322,
        -0.11672552675008774,
        -0.11172421276569366,
        -0.08371532708406448,
        -0.03958691284060478,
        -0.00229447684250772,
        0.0848042443394661,
        -0.02654222957789898,
        0.02198290079832077,
        -0.0053955381736159325,
        0.08895546197891235,
        -0.058313995599746704,
        0.029103122651576996,
        0.027182869613170624,
        0.016615362837910652,
        -0.07838752865791321,
        0.03999964892864227,
        -0.007898090407252312,
        -0.012848659418523312,
        0.006408709567040205,
        0.0013266406022012234,
        -0.03549567982554436,
        0.052912961691617966,
        0.04072605445981026,
        0.028160160407423973,
        -0.043663375079631805,
        -0.031260836869478226,
        0.041497375816106796,
        0.0912429615855217,
        -0.004350102040916681,
        0.07556217163801193,
        0.07954177260398865,
        -0.033623915165662766,
        0.006185172125697136,
        0.03836774826049805,
        -0.025096775963902473,
        0.0388798750936985,
        0.08130525052547455,
        -0.03700120747089386,
        -0.05988695099949837,
        0.009291855618357658,
        0.010591561906039715,
        -0.00841725617647171,
        0.03297508507966995,
        -0.019490087404847145,
        -0.03163424879312515,
        0.02277889847755432,
        -0.05153217911720276,
        0.03622327744960785,
        -0.030679702758789062,
        0.005445175804197788,
        -0.028727253898978233,
        -0.05728547275066376,
        0.004649549722671509,
        -0.06451882421970367,
        0.09835163503885269,
        0.004967274144291878,
        0.0022106121759861708,
        -0.04784499853849411,
        -0.08818800747394562,
        -0.046267349272966385,
        -0.0263980682939291,
        -0.040489744395017624,
        0.06061563640832901,
        0.048231031745672226,
        0.09853732585906982,
        0.044996507465839386,
        -0.06765711307525635,
        -0.03978247940540314,
        -0.0690060406923294,
        0.029704038053750992,
        0.08501917123794556,
        0.00898116547614336,
        0.11846555769443512,
        0.007917030714452267,
        -0.014253516681492329,
        -0.0942869782447815,
        -0.029191825538873672,
        0.006447398103773594,
        -0.01605621911585331,
        -0.010206244885921478,
        -0.01603437028825283,
        0.07179450243711472,
        -0.013273369520902634,
        0.03561438247561455,
        0.0033277668990194798,
        -0.03655530884861946,
        -0.057520121335983276,
        -0.036073509603738785,
        0.05749693512916565,
        -0.037635885179042816,
        -1.4065353834932265e-35,
        -0.013302464969456196,
        -0.06209021434187889,
        -0.04885706305503845,
        -0.038661889731884,
        0.10926907509565353,
        -0.002690344350412488,
        0.023327266797423363,
        0.0015605242224410176,
        -0.02689461037516594,
        -0.0681426152586937,
        -0.05859481915831566,
        -0.07151678204536438,
        -0.07304032146930695,
        0.0502089187502861,
        0.036412812769412994,
        -0.07628463208675385,
        0.006064720451831818,
        -0.021450800821185112,
        -0.02177896723151207,
        0.029148636385798454,
        0.01807868294417858,
        0.03348023071885109,
        -0.004592100623995066,
        -0.020336132496595383,
        0.012830664403736591,
        0.09414588660001755,
        0.09988909959793091,
        -0.00928589142858982,
        0.10144368559122086,
        0.05650114640593529,
        -0.07943489402532578,
        -0.05396393686532974,
        0.00769107136875391,
        -0.15121105313301086,
        -0.009617448784410954,
        -0.04197872430086136,
        -0.04795487970113754,
        -0.0794011801481247,
        0.06736329197883606,
        -0.028313415125012398,
        -0.02168142981827259,
        -0.0661938339471817,
        -0.07077963650226593,
        -0.06980986148118973,
        -0.03714168444275856,
        0.018964853137731552,
        0.07760084420442581,
        0.0347609668970108,
        0.011853144504129887,
        -0.028061114251613617,
        0.003112749895080924,
        -0.023542392998933792,
        -0.030826520174741745,
        -0.08654351532459259,
        -0.047345295548439026,
        -0.030130907893180847,
        -0.030093645676970482,
        0.05580584332346916,
        0.04904278740286827,
        0.02432442270219326,
        0.04104273021221161,
        0.04607042297720909,
        0.04654214531183243,
        0.02075396664440632,
        -0.07395215332508087,
        0.08305318653583527,
        0.038164813071489334,
        -0.0011962876887992024,
        -0.09259695559740067,
        -0.0035898915957659483,
        -0.05992034822702408,
        0.007252809125930071,
        0.0723569244146347,
        -0.05764445289969444,
        0.028389275074005127,
        -0.018236715346574783,
        -0.08659771084785461,
        -0.047265272587537766,
        -0.052919626235961914,
        0.06846315413713455,
        0.013213577680289745,
        -0.047515496611595154,
        0.059166647493839264,
        -0.004503562580794096,
        0.002451858017593622,
        -0.009817009791731834,
        0.09217801690101624,
        -0.022765690460801125,
        -0.08072640746831894,
        0.013125445693731308,
        -0.02102970890700817,
        0.06736720353364944,
        -0.04349337890744209,
        0.02525997906923294,
        -0.0261938888579607,
        -3.234029241531893e-33,
        0.01010899618268013,
        0.04175738990306854,
        -0.010505776852369308,
        0.02364908717572689,
        0.03607834503054619,
        -0.018987298011779785,
        0.053568072617053986,
        -0.011483595706522465,
        -0.05192152410745621,
        -0.06757217645645142,
        -0.015457458794116974,
        -0.04102806746959686,
        -0.09154040366411209,
        -0.022308630868792534,
        -0.03323452174663544,
        0.007850420661270618,
        -0.02412658929824829,
        -0.0729556456208229,
        -0.04441821575164795,
        -0.09805873036384583,
        0.10841202735900879,
        -0.009004583582282066,
        0.104576975107193,
        0.034330833703279495,
        -0.04613955318927765,
        -0.05839882418513298,
        0.06941410899162292,
        0.07559087872505188,
        0.023954268544912338,
        -0.020193805918097496,
        0.029317496344447136,
        -0.011851218529045582,
        0.0001776788558345288,
        0.004095702897757292,
        0.0004757240822073072,
        0.04837242513895035,
        0.04684421420097351,
        0.00514759449288249,
        -0.019903268665075302,
        0.008140956051647663,
        0.057822078466415405,
        0.01671173796057701,
        -0.0165997501462698,
        -0.07991592586040497,
        0.019510937854647636,
        0.013188524171710014,
        -0.09262879192829132,
        -0.014619315043091774,
        0.050139203667640686,
        -0.0905199721455574,
        -0.0179295614361763,
        0.031789630651474,
        0.07064401358366013,
        -0.020510585978627205,
        0.008249858394265175,
        -0.04154287278652191,
        -0.07254142314195633,
        0.026443641632795334,
        0.053016770631074905,
        0.019961120560765266,
        0.022040922194719315,
        0.0007668855250813067,
        -0.02974916249513626,
        -0.0788678377866745,
        0.05354791507124901,
        0.035655878484249115,
        0.07105565071105957,
        -0.013803263194859028,
        -0.015596634708344936,
        0.05420485511422157,
        -0.0040709394961595535,
        0.02143804170191288,
        -0.014308257959783077,
        -0.06323982775211334,
        -0.01900956965982914,
        0.11470810323953629,
        0.0019645888824015856,
        -0.06794862449169159,
        -0.019580813124775887,
        -0.05394835025072098,
        -0.005670960061252117,
        -0.008737536147236824,
        0.10096701979637146,
        0.02394128032028675,
        0.04033299908041954,
        0.02013160102069378,
        0.044313203543424606,
        -0.004296623170375824,
        -0.04088956117630005,
        0.09150074422359467,
        -0.058808334171772,
        -0.0056752366945147514,
        -0.03703790158033371,
        0.01779116317629814,
        -0.02054588869214058,
        -5.901451771705979e-08,
        -0.06311254948377609,
        0.00391888152807951,
        0.026984993368387222,
        0.017419619485735893,
        -0.010922673158347607,
        0.01692909002304077,
        0.021611018106341362,
        -0.0305975079536438,
        0.13484659790992737,
        -0.009989388287067413,
        -0.022271495312452316,
        -0.12106364965438843,
        -0.060599956661462784,
        0.04697413370013237,
        0.014926605857908726,
        0.024240532889962196,
        -0.017257394269108772,
        0.0672546923160553,
        -0.02430332638323307,
        -0.007267969660460949,
        0.008607751689851284,
        0.029956605285406113,
        0.09930900484323502,
        -0.03776251897215843,
        -0.021163219586014748,
        0.051857367157936096,
        -0.036719195544719696,
        0.09375174343585968,
        0.03658021613955498,
        -0.0750117227435112,
        -0.11546077579259872,
        -0.005103257950395346,
        -0.03579731285572052,
        -0.03819113224744797,
        0.018043281510472298,
        -0.06013122946023941,
        -0.08927473425865173,
        0.0923018828034401,
        0.020172981545329094,
        0.0265028215944767,
        0.005013876128941774,
        -0.08917000889778137,
        0.0018665649695321918,
        0.020024709403514862,
        -0.0008910759934224188,
        0.010335656814277172,
        -0.018519913777709007,
        -0.013591283932328224,
        -0.04476606845855713,
        0.03991574048995972,
        0.027388714253902435,
        -0.025541717186570168,
        -0.010458901524543762,
        0.0706866905093193,
        0.01893194019794464,
        0.050259895622730255,
        0.023874636739492416,
        0.006075461395084858,
        -0.028964655473828316,
        0.042287323623895645,
        0.13316892087459564,
        -0.09584841132164001,
        -0.045130472630262375,
        0.11410936713218689
    ]
}