{
    "id": "X4_J7lS7Di4",
    "title": "NEVER Build a Gaming PC like this...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-09-04T17:31:19Z",
    "video_url": "https://www.youtube.com/watch?v=X4_J7lS7Di4",
    "category": "Science & Technology",
    "tags": [
        "gaming pc",
        "gaming pc build",
        "pc build",
        "challenge",
        "micro center",
        "microcenter",
        "intel",
        "amd",
        "core i7",
        "radeon",
        "gaming computer",
        "computer build",
        "build a pc",
        "build pc",
        "gaming computer build",
        "build",
        "unboxing",
        "review",
        "tech",
        "gaming",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 431212,
    "likes": 18388,
    "comments_count": 778,
    "description": "Our sponsors Micro Center and Intel challenged me to a gaming PC \"speed\" build  Find the best prices & best selection at Micro Center:  Intel Gamer Days:   Win a $500 Gift Card! PC Build Showcase Contest:  Micro Center Intel Custom PC Builder:  Micro Center Custom Built PCs Service:  Need Help Choosing Parts?:   Intel Core i7-10700K:  Noctua NH-D15 Brown CPU Cooler:  ASUS Z490-I ROG Strix ITX Motherboard:  PowerColor Radeon RX 5700 XT Red Devil:  Corsair Vengeance LPX 32GB (2 x 16GB) DDR4-3200 RAM:  WD Black SN750 1TB SSD NVMe:  EVGA SuperNOVA 650 GM 80 Plus Gold SFX Power Supply:  Lian Li TU150 Mini-ITX Computer Case  Silver:   Check out the Relay.fm fundraiser for St. Jude!   My new podcast The Test Drivers!  Our second channel @This Is!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://rebrand.ly/962khp3",
        "https://rebrand.ly/qqtyhv0",
        "https://rebrand.ly/hmuiow4",
        "https://rebrand.ly/m3tzgmb",
        "https://rebrand.ly/t5ksqq3",
        "https://rebrand.ly/d12k1da",
        "https://rebrand.ly/hg9qqwq",
        "https://rebrand.ly/3rtpj90",
        "https://rebrand.ly/neijb4m",
        "https://rebrand.ly/y483dk3",
        "https://rebrand.ly/48wfpxe",
        "https://rebrand.ly/b9hfbzf",
        "https://rebrand.ly/lfsp7vi",
        "https://rebrand.ly/zykzq62",
        "https://www.stjude.org/relay",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey, what's going on guys, Ken here. So, today, our channel sponsor Micro Center and Intel wanted us to celebrate Intel Gamer Days 2020 by issuing Austin Evans a challenge. And that is to see how fast you can build a PC. - Oh, okay. Fast? - Fast? - I'll be done in like, 15 minutes. - Ready? Set. Go! - Okay. 5700XT Red Devil, we have a Noctua D15, 650Y, is that SFX power supply? I should probably put my glasses on. Okay, what do we have here? We have Core i7-10700K, Z490I, so this is a TU150, okay, got it! - I've always wanted Austin Evans to build a PC for me, oh my god! (laughing) All right! So, right here, - Oh, there's a wheel? No, I don't want the wheel! - Right here, I have a list of obstacles for Mr. Austin Evans. - Wait, wait, let me see here. So, blindfold, spin again plus money, oh! Is that the St. Jude thing? - So, yes. So, on the The Test Drivers, Austin Evans, wait is it The Test Drivers? - It is, yes, that's the name of the podcast (bleep) So right now, my podcast, The Test Drivers, is helping to raise money for the St. Jude's Children Hospital through Relay FM. Every time I land on this, I will donate an extra $100 to St. Jude. - Also, every 15 minutes that this build goes on for, you're also donating $1000. - That's a lot of money! - It is a lot of money. And... (spinning wheel) what have we got? - Blindfold! All right, what's up? Where's my blindfold? - That's a pretty easy one. - So my plan right now is while I can't see, something that will be really easy to deal with would be to actually get my motherboard mostly setup. Line up here. Seems like a questionable idea to install CPU blindfolded, but it'll be fine, I'm sure. (alarm sounding) Damn! - All right! - Okay. - All right. (spinning wheel) Blindfold again! Damn, I actually don't want to do blindfold again. - Well, too bad. - So what I'll do is, in my blindfold timer, I'll just do as much stuff that's really simple and that's just gonna like burn time as possible, so I'll get my graphics card out. Okay, where's my case? Where'd my case go? How did I lose my case? Did you steal my case, Ken? - Ken: No. - My case was right here. - Ken: No, everything is on the table dude. - Where is my SSD? (alarm sounding) Oh! Okay. How far off was I? Oh, my SSD was on top! (spinning wheel) Oh no! Not the spicy chip! I have to eat the spicy chip! - Ken: Oh, that sucks. So, the challenge for this particular thing, is that you're supposed to eat the whole chip, and it's the spiciest chip, but in this particular case, since we only have one, and we have to potentially do it more. - Do it multiple times? - Yeah, so we're going to give you a piece of the chip. - God, that's so strong. All right, ready? Okay, here we go. (crunching chip) - [Narrator] It was at this moment, he knew, he (beep) up. - Oh my god, (beep) (beep) (beep). Aww oh, (coughs) - Ken: Now would be a bad time to point out that Austin Evans has a doctors appointment in two hours, which is part of the reason why today was perfect. - I think I'll throw up. - Ken: Oh no - I'm gonna throw up. - Ken: Oh go go! (retches) (throws up) damn that chip is, that chips not good, dude. - Austin: No, this is bad. - Ken: We gotta lock this up in the safe. - Hello and welcome back to day two. I am feeling much much better with a little bit of sleep and we have upgraded my wheel with new punishments. Including dark mode and instead of the evil chip, I now just have to spin again and donate more money to St. Jude. So seems like a win, win. - Here we go. - Hands behind back. - Oh all right, cool. - So I should really look to the system before I got started today. It was a bad idea but I'm gonna do it anyway. Hands behind back doesn't mean hands on a desk. This is a bad idea I can't reach the motherboard into the case all the way there so I'm gonna do it down here. Plus I can see it better here. - Ken: How's your physical yesterday? - They didn't give me a physical. - Ken:Oh. - He was just like come back in four months, I was like thanks doc. I appreciate it. I probably was in no shape, anyway yesterday. Wow, this is actually much harder than I thought. (timer ringing) OKay, that's fine. I got one screw in. I don't consider that to be a success. - Austin: So the things that are left, I have to finish screwing in the motherboard. I need to install my graphics card and make sure that it fits, which might be a little tight in its case. I also need to install my CPU cooler. Should I have done that before I put the ? There's a backplate on that, isn't there? I need to do CPU cooler. Probably should've thought of that, okay. (spins wheel) Dark mode! Okay, so unlike what we did yesterday. Instead of being blindfolded, were just gonna turn off all the lights. Make it pitch black in here. You have the night vision camera? - I do. - Okay (high pitched noise) So this is what it looks like to the naked eye on the camera, and this is what it looks like using our night vision camera. This camera can see a lot better than my eyes can see right now. The good thing is, I have both of my eyes available, so this cooler is what some might call beefy. I really need to quickly decide if I need to take this aah, that sounded horrible. - Ken: Don't scratch our table, dude. - I just destroyed the table man. I made a grave error in screwing the motherboard in. I really should've thought about my build, I just jumped right into it today. Some of this down here, oh that's a lot. Oh my God that's so much, I couldn't see. - Ken:You can wipe some of that right? - Austin: Nope, nope , it's fine. Ken: Is it? Are you sure? (timer ringing) - Ahhh, this is gonna suck. (wheel spinning) Oh! Money and spin again, so that's 100 dollars for St. Jude. - Yep - All right, I get to spin it though. It says spin again, I get to do it. - Okay (spinning wheel) - Hands behind back! NO! I'm not gonna be able to do this with my hands behind my back. (timer ringing) No! AH, I thought it was gonna be done in 20 minutes. This is gonna be like the four hour long build at this rate. (spinning wheel) - What is it? - Hands on back again? This is rigged. - For the sake of variety. - what's that? - No thumbs? Thanks for taking pity on me. I don't know if that's actually pity though. So stupid - Ken: This is very sad, is this one of those things where you learn not to take things for granted. Like your thumbs? - Yeah, I'm glad I have thumbs. Thumbs are really helpful. (timer ringing) I accomplished nothing. (laughing) (spinning wheel) Dark mode! - Ken: Eh, that's a little helpful. - You know dark modes my favorite, I'll take dark mode. - Ken: All right, let's go dark mode. (high pitched ring) - So, my plan now is to go very very quickly and accomplish what I could not accomplish before thanks to the magical power of my thumbs. I definitely have lost some of my screws, damn. That sucks (sighs) Oww, the camera is hard. I can't see anything. - Ken: If there's any proof that the room is very dark. - Austin: Yeah. Its not on the board is it? No, oh I found it on top of my motherboard. I couldn't see it, its okay nevermind. All right let's go. Let's go, let's go boys, let's go. - Ken: I can't wait for Josh to replay the footage of us seeing it the whole time. - It's dark in here, just cause the camera can see it, doesn't mean we can see it. Oh wait, what is that? Why am I not? Wait. What am I hitting? - Ken: That's a lot of play - I know it's a lot of play. (sighs) (timer ringing) - Ken: You hate to see it. (spinning wheel) - I can't even look at my build for a second. (laughing) What is it? No thumb? (laughing) I lied, this is actually a bit hard. I actually think this will be kinda hard even if I had thumbs right now. - Ken: You know who has thumbs? - Who has thumbs, Ken? - Ken: The wonderful PC builders at Micro Center - Josh: Those PC builders will their thumbs to build your computer for a small fee, you can also use Micro Centers intel custom PC builder, which is what Ken used. We chose the parts for this system, which of course includes that tenth gen intel core I7CPU. As well as with the intel custom PC builder you can see exactly what's in stock at your nearest Micro Center. Add it to your cart and arrange same day in store pickup. You can even use their forum to give or receive advice for which parts you wanna pick for your build. Maybe I should've checked there to see if anyone had advice on how to build PCs with no thumbs. Oh! It bend and popped back off! Oh I got it, I got it, we're in. (spinning wheel) (laughing) Oh look at how easy this is with thumbs. - Ken: You can even do it behind your back. - All right which way do I have to stand to go - Ken: Where we dropping boys? - That sounds right, yeah. How is that? - Ken: You are literally tittering on the edge of cheating. - Nope I'm fine. (timer ringing) (wheel spinning) Dark mode! Excellent! All right, I needed that. I needed the dark mode. Okay, so now that I can hopefully get some work done. I need to move very very quickly. Oh my God, we'll need a second fan. I don't care that I'm not gonna have both fans. Cause I'm gonna lose my mind if I keep trying to do that anymore, That's really loose, but were gonna consider that to be installed. (timer ringing) Oh my God! (wheel spinning) Hands! So down here, think I can do this. Got it. Great, great. Is than in? I don't think it's in. Yeah, I'm in. - Ken: Oh, look at that. Good for you. - Thanks. Appreciate it. No! - Ken: Nope Nope. (timer ringing) - What are you doing? What are you doing? No, what? - You have one free space. - Oh! So if I do this? - Ken: No, absolutely not. (wheel spinning) - Okay, so definitely a piece of the wheel just flew off and hit me. Does it count that the knot fell off of the wheel when I spin it? I feel like I get to spin it again. The wheel was broken. (wheel spinning) (gasp) YAY! I'm free! Free falling! - Ken: The comments are gonna say that was rigged. - This is actually gonna be really tough though. Um, I need to like minimize my hands to get in here. I'm definitely cutting myself on the cooler right now, and I don't care. Ow! Got it, I got it, I got it. Don't worry about all of the extra wires. I did it, I just need to make sure it posts. But I did it. (timer ringing) Hey! Things are happening, things are happening. It's very exciting. Not completely broken. - Ken: It actually looks so cool - It does look so cool. Oh look at that! It immediately comes up. Z490I I710700K 32 gigs of ram. And so our Intel Gamer Day computer is finally complete. So what better way to celebrate Gamer Day, then by gaming. See what I did there? - Ken: Wow, you're hitting 250 frames per second. - Am I really? - Ken: Yeah - This is actually pretty well turned up, obviously were playing at 1080P. There we go, I got to 131. I mean its not good, I'm 55,000 down the leaderboard. I'll see if we do a little better than that. Kinda feel like I can sorta just put my foot, (yells) I saw that one coming. Okay so look. Am I the greatest F1 2020 player in the world? Absolutely not. I am 52,000 fastest, apparently. But thanks to our wonderful friends at Intel Micro Center I have a wonderful new PC build, and if you guys are curious on not only how to build this specific PC with the configurator in the description, but if you need some help picking your own components Micro Center has a wonderful forum available that you can check out with all kinds of helpful guides and tutorials. We've also made a video or two on how to build a PC. But thank you very much for watching and thank you very much for subscribing to Austins Racing Corner, where I am 52,000th in the World.",
    "transcript_keywords": [
        "Ken",
        "Austin Evans",
        "Micro Center",
        "Austin",
        "build",
        "thumbs",
        "dark",
        "dark mode",
        "Test Drivers",
        "back",
        "Intel",
        "Micro",
        "Evans",
        "Hands",
        "Jude",
        "case",
        "Micro Centers intel",
        "Intel Micro Center",
        "god",
        "Center"
    ],
    "transcript_entity_values": [
        "15 minutes",
        "Austins Racing Corner",
        "F1 2020",
        "every 15 minutes",
        "Relay FM",
        "Austin Evans",
        "I7CPU",
        "tenth",
        "Gamer Day",
        "Noctua D15",
        "Ken",
        "250",
        "St. Jude",
        "The Test Drivers",
        "Austin",
        "yesterday",
        "2020",
        "two",
        "four months",
        "20 minutes",
        "intel",
        "Intel Micro Center",
        "one",
        "second",
        "four hour",
        "Micro Centers",
        "131",
        "52,000",
        "650Y",
        "two hours",
        "Micro Center - Josh",
        "Intel",
        "55,000",
        "CPU",
        "SSD",
        "1000",
        "an extra $100",
        "100 dollars",
        "today",
        "the St. Jude's Children Hospital",
        "TU150",
        "Micro Center",
        "Josh"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "LAW",
        "TIME",
        "ORG",
        "PERSON",
        "GPE",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "PERSON"
    ],
    "vector": [
        0.0010519511997699738,
        0.014985046349465847,
        0.027137426659464836,
        0.011929684318602085,
        0.0575643926858902,
        -0.02598384954035282,
        0.013595887459814548,
        -0.015143191441893578,
        -0.04482989013195038,
        -0.006017652805894613,
        -0.0477515384554863,
        -0.030501099303364754,
        -0.05117517337203026,
        -0.008256725035607815,
        0.013015766628086567,
        0.03742636367678642,
        0.12190958112478256,
        -0.04310912266373634,
        -0.037877701222896576,
        0.007673929445445538,
        -0.06659883260726929,
        -0.0727623924612999,
        -0.06376291066408157,
        -0.03749774023890495,
        0.0036065103486180305,
        0.05488324537873268,
        0.08410216122865677,
        0.047583241015672684,
        -0.04089216887950897,
        -0.04189681261777878,
        0.04213116317987442,
        0.01531339343637228,
        0.028122197836637497,
        0.01989448443055153,
        0.0402345210313797,
        -0.03742889687418938,
        0.04019305109977722,
        -0.07118392735719681,
        -0.005697423592209816,
        -0.07615430653095245,
        -0.04741460084915161,
        0.011557042598724365,
        0.013031515292823315,
        0.0973641499876976,
        0.0042259967885911465,
        0.03157319873571396,
        0.005631488747894764,
        -0.07204332947731018,
        0.03918394818902016,
        -0.018494928255677223,
        -0.04924263060092926,
        -0.07860168069601059,
        0.025438038632273674,
        -0.04173678532242775,
        -0.08584104478359222,
        0.04413850978016853,
        -0.031203914433717728,
        -0.08199205994606018,
        0.06106290966272354,
        -0.10086037963628769,
        0.039450753480196,
        -0.1550704389810562,
        0.01945481449365616,
        0.03763415291905403,
        -0.021222952753305435,
        -0.012691427953541279,
        0.00366129819303751,
        -0.0013426161604002118,
        0.015129413455724716,
        0.023163950070738792,
        0.03939763456583023,
        0.054001834243535995,
        -0.002393000992015004,
        0.030222104862332344,
        -0.005254683084785938,
        0.06025794893503189,
        0.09500996768474579,
        -0.10301633924245834,
        0.04494406282901764,
        0.02573569118976593,
        -0.029907843098044395,
        0.0008868683944456279,
        -0.000980127020739019,
        -0.03874988481402397,
        0.026005424559116364,
        0.005614590831100941,
        0.05396641418337822,
        0.011440122500061989,
        -0.026223160326480865,
        -0.06868556886911392,
        -0.0011560502462089062,
        0.08509920537471771,
        0.09373845160007477,
        -0.025368519127368927,
        0.07024497538805008,
        0.06451752781867981,
        0.0049532316625118256,
        -0.12303529679775238,
        -0.04064108058810234,
        0.05369209870696068,
        -0.033604372292757034,
        0.06083527207374573,
        0.12639795243740082,
        0.06197628378868103,
        -0.0186021588742733,
        -0.011633281596004963,
        -0.12489788234233856,
        0.05092286691069603,
        -0.048093557357788086,
        -0.01714237965643406,
        -0.03383142501115799,
        0.031470220535993576,
        -0.042051464319229126,
        -0.007048238534480333,
        0.05842498689889908,
        -0.019171932712197304,
        -0.040142353624105453,
        0.05176129937171936,
        0.06321337819099426,
        0.046730902045965195,
        0.03835390508174896,
        -0.030231622979044914,
        -0.07269488275051117,
        0.034210626035928726,
        0.046665724366903305,
        0.04421088099479675,
        -0.08588500320911407,
        1.0747494891058265e-32,
        0.0049676173366606236,
        0.0629754588007927,
        -0.04918006807565689,
        0.015705136582255363,
        0.014444041065871716,
        0.0053587849251925945,
        0.06027781590819359,
        0.014206641353666782,
        -0.007472680415958166,
        0.03467286750674248,
        -0.029480012133717537,
        -0.03308393433690071,
        -0.05516085773706436,
        0.09854868054389954,
        0.05045955628156662,
        -0.09255161136388779,
        0.02848147414624691,
        -0.04804380238056183,
        -0.05430708825588226,
        -0.0023637472186237574,
        0.034542009234428406,
        0.014294378459453583,
        0.03171470761299133,
        -0.034762583673000336,
        0.053525421768426895,
        -0.047921035438776016,
        0.0064843990840017796,
        -0.03831607848405838,
        0.036684997379779816,
        0.00027539519942365587,
        -0.06636208295822144,
        -0.10105427354574203,
        0.007648376747965813,
        -0.0011423396645113826,
        0.03986143320798874,
        0.0025626549031585455,
        -0.047280069440603256,
        -0.07662878185510635,
        -0.010440023615956306,
        0.046944741159677505,
        -0.04750431329011917,
        0.05867772921919823,
        -0.08264973014593124,
        -0.0795428603887558,
        -0.02859303541481495,
        0.026726389303803444,
        -0.03641859069466591,
        -0.032773569226264954,
        0.01755552738904953,
        0.0006537646986544132,
        -0.08591992408037186,
        0.07535379379987717,
        0.02140396647155285,
        0.026907172054052353,
        -0.01889841817319393,
        -0.06433486193418503,
        0.05301016569137573,
        -0.015760134905576706,
        0.08953531086444855,
        0.08948884159326553,
        -0.042150016874074936,
        -0.0390235036611557,
        -0.013852604664862156,
        0.0001814694987842813,
        -0.03521148860454559,
        0.02805425226688385,
        0.054145075380802155,
        0.06260953843593597,
        -0.07467828691005707,
        0.004808290861546993,
        0.035208601504564285,
        -0.05548183619976044,
        0.07703429460525513,
        -0.01810898445546627,
        0.0538703054189682,
        0.041166752576828,
        -0.10319581627845764,
        -0.06367827951908112,
        -0.07486507296562195,
        -0.07797770947217941,
        -0.05790211632847786,
        0.05573486536741257,
        -0.10275203734636307,
        0.03854424133896828,
        0.03976723924279213,
        0.015579970553517342,
        -0.029560772702097893,
        -0.008775275200605392,
        0.008901971392333508,
        -0.05309462547302246,
        -0.05828660726547241,
        -0.0003665955737233162,
        0.07613041996955872,
        0.05274461582303047,
        -0.021918097510933876,
        -9.512816603723983e-33,
        -0.07259165495634079,
        -0.08431657403707504,
        0.001221748418174684,
        0.09874511510133743,
        0.056618086993694305,
        0.001960818422958255,
        0.030749203637242317,
        -0.02602054364979267,
        0.039998482912778854,
        0.004959801211953163,
        0.009922893717885017,
        0.05246775597333908,
        -0.031495314091444016,
        0.006262098904699087,
        -0.038116905838251114,
        0.010527830570936203,
        0.0017558594699949026,
        -0.025191573426127434,
        0.09223811328411102,
        -0.008041003718972206,
        0.03840705379843712,
        0.0660572499036789,
        -0.0351012647151947,
        -0.028996597975492477,
        0.00010264637239743024,
        0.017817877233028412,
        0.03147704154253006,
        -0.03917679190635681,
        0.03955341503024101,
        0.03965107351541519,
        -0.010246017016470432,
        0.03775085508823395,
        0.0382172055542469,
        0.05468503385782242,
        0.0754787027835846,
        0.027607131749391556,
        0.03993948921561241,
        0.017600446939468384,
        0.02372005023062229,
        -0.01096405927091837,
        0.04211629927158356,
        0.01894741877913475,
        -0.012560810893774033,
        0.037272948771715164,
        0.022827811539173126,
        0.02394702471792698,
        -0.00042106659384444356,
        -0.08015615493059158,
        0.05422036722302437,
        0.03268125653266907,
        -0.04181968420743942,
        -0.04965866357088089,
        0.02018394134938717,
        0.009484479203820229,
        -0.023455139249563217,
        -0.10188768804073334,
        -0.017992468550801277,
        0.056177906692028046,
        0.058604273945093155,
        -0.04460717365145683,
        0.051113441586494446,
        0.030657142400741577,
        -0.014789905399084091,
        -0.02595343254506588,
        0.0403195358812809,
        -0.05726835876703262,
        0.04530277103185654,
        0.03575309365987778,
        -0.028566772118210793,
        -0.048928938806056976,
        -0.16465434432029724,
        -0.043827638030052185,
        -0.043872568756341934,
        -0.0597321093082428,
        -0.054496072232723236,
        0.03293170407414436,
        0.032804399728775024,
        0.019179195165634155,
        0.08879297971725464,
        0.026066306978464127,
        -0.04795575141906738,
        -0.002086135558784008,
        -0.008952118456363678,
        -0.003733758581802249,
        0.057035911828279495,
        -0.037021834403276443,
        0.012527590617537498,
        0.04419513791799545,
        -0.01877199113368988,
        -0.0805249884724617,
        -0.011827347800135612,
        0.037669818848371506,
        0.02675321325659752,
        0.03555969521403313,
        -0.047386106103658676,
        -5.6835506967445326e-08,
        0.07138676941394806,
        -0.0719556212425232,
        -0.045406680554151535,
        0.05563824623823166,
        0.07388615608215332,
        -0.07929480820894241,
        0.020211322233080864,
        -0.04125557094812393,
        0.02343950793147087,
        0.01507723331451416,
        0.093172088265419,
        -0.0764598622918129,
        0.0019208109006285667,
        -0.0186326764523983,
        0.0186542309820652,
        0.005987086333334446,
        -0.08236344158649445,
        0.06682641059160233,
        -0.020633907988667488,
        -0.09624026715755463,
        -0.006137819495052099,
        0.07025836408138275,
        0.053031500428915024,
        -0.021980121731758118,
        -0.06261281669139862,
        -0.028046056628227234,
        0.02648485265672207,
        -0.01185725536197424,
        0.028381654992699623,
        -0.01200129184871912,
        -0.06153983250260353,
        0.017594752833247185,
        0.02924535982310772,
        -0.08809638768434525,
        0.05267816036939621,
        -0.02312370203435421,
        0.043491944670677185,
        0.10799303650856018,
        0.16004909574985504,
        -0.003059028647840023,
        -0.044194646179676056,
        -0.09937714785337448,
        -0.01640964113175869,
        -0.05254850909113884,
        -0.026962164789438248,
        -0.020549196749925613,
        -0.11394081264734268,
        -0.08450186997652054,
        -0.011522960849106312,
        0.026123983785510063,
        -0.043683890253305435,
        0.008223437704145908,
        -0.01905699633061886,
        0.047938406467437744,
        0.07861926406621933,
        0.001928925164975226,
        -0.0383823998272419,
        0.09063398092985153,
        0.07657763361930847,
        -0.001693784142844379,
        0.052040908485651016,
        -0.05166275426745415,
        -0.10387711971998215,
        0.01245754025876522
    ]
}