{
    "id": "x4AE5yOF9pE",
    "title": "Python nmap port scanner",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-03-15T16:50:07Z",
    "video_url": "https://www.youtube.com/watch?v=x4AE5yOF9pE",
    "category": "Science & Technology",
    "tags": [
        "python",
        "port scanner python",
        "port scanner",
        "port scanning",
        "port scanner download",
        "port scanning explained",
        "python tutorial",
        "python hacking",
        "wifi",
        "scanner",
        "wifi scanner",
        "python scan",
        "hacking",
        "hackers",
        "ethical hacker",
        "ethical hacking",
        "hacker",
        "hacking course",
        "learn hacking",
        "ethical hacking tutorial",
        "ceh",
        "kali linux",
        "oscp certification",
        "elearnsecurity",
        "ine",
        "ctf",
        "how to hack",
        "learn ethical hacking",
        "python wifi",
        "python 3",
        "learn python",
        "nmap",
        "nmap python",
        "nmap scan network",
        "nmap tutorial"
    ],
    "views": 94258,
    "likes": 3284,
    "comments_count": 241,
    "description": "Learn how to create both a Python sockets and a Python nmap port scanner. These are the beginning of a journey into Python Ethical hacking.  ================ Scripts using regex: ================ Socket method:   nmap method:   ==================== Scripts using IP address: ==================== Socket method:  nmap method:   Menu: Python port scanner nmap and sockets: 0:00 This is a journey: 0:20 Sockets on Windows: 1:09 Download and install Python: 1:40 Run python socket port scanner: 2:40 Test against a web server: 4:07 Timeout to check connection: 5:00 Kali Linux example: 5:25 Test sockets Python script on Kali Linux: 6:06 Catching mistakes: 6:42 Sockets Python Code: 7:08 nmap script on Kali: 7:38 Troubleshooting nmap issues: 8:18 Python nmap port scanner: 9:22 Comparison of the scripts: 10:04 Sockets script explanation: 10:50 nmap Python script explanation: 13:25  ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    ================ Support me: ================ DavidBombal.com: CCNA ($10):   Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   ====================== Special Offers: ====================== Boson software: 15% discount Link: bit.ly/boson15 Code: DBAF15P  nmap python nmap nmap scan nmap scanner python hacking python python wifi python network scan python port scanner port scanner port scan python scanner python scan oscp  elearnsecurity  oscp certification ethical hacking ceh oscp ine try hack me hack the box hacking ethical hacker ctf for beginners  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #python #nmap #hacking",
    "description_links": [
        "https://github.com/davidbombal/red-python-scripts/blob/main/port_scanner_regex.py",
        "https://github.com/davidbombal/red-python-scripts/blob/main/nmap_port_scanner.py",
        "https://github.com/davidbombal/red-python-scripts/blob/main/port_scanner_ip_obj.py",
        "https://github.com/davidbombal/red-python-scripts/blob/main/nmap_port_scanner_ip_obj.py",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10"
    ],
    "transcript": "- In this video, I'm gonna show you how to create a basic port scanner using Python. I'm going to show you two ways to do this. The first method is to use a built in function within Python and the second method is to use nmap. You can use the sockets method directly on Windows or within Kelly. If you want to use the nmap script, you have to install nmap. Now, please note these scripts are very simple. I'm hopefully gonna be taking you on a journey. We're gonna start with simple Python scripts, and then we're going to make them more and more powerful. Learning Python can really open doors for you. Doesn't matter if you wanna be an ethical hacker. As an example, you want to write a fencer scripts that can break into networks. So you wanna be part of the red team, or if you wanna use Python to make sure that there aren't vulnerabilities in your network. So you wanna be part of the blue team. Or if you just wanna become a better developer. It's really well worth your time learning how to code in Python. Okay, let's get started. (upbeat music) I'll demonstrate the first script in Windows, and then I'll show you what it can do on Kelly. You're gonna get similar kind of results, whether you use the sockets method or you use nmap. So on Windows, I'll open up a command prompt. In my example, I've stored my scripts in the downloads Python directory. Here's my port scanner nmap Python script and my port scanner socket script. So the version of Python that I'm using, and I can verify that by using the command Python dash dash version is 3.9.1. You can download Python from the python.org website. So if you haven't got Python installed on Windows, go to python.org, go to downloads. And in this example, I could download Python 3.9.2. It's a very simple installation. Now, note this is really important. What you're gonna wanna do is you're gonna wanna click this option, add Python 3.9 two PATH. So make sure that install launcher for all users is selected. Make sure that add Python two PATH is selected, and then you can click install and click yes to install the software. Software is now installing so you just have to wait for that installation to complete. Installation has completed, so I'm gonna click close. So back in my command prompt, if I typed Python dash dash version, my version is now Python 3.9.2. I'll clear the screen. DOR once again, shows me my two scripts. I've got my nmap scanner and my socket scanner. I'm gonna type Python portscanner, press Tab because I wanna run the portscanner of sockets application. Script runs, we can see some details about the script, but the important part is enter the IP address that you wanna scan. It's gonna be 192.168.248 in my example. This is once again, a very simple scanner. Notice I'm running it on Windows. All I installed was Python. This is a device in my network. So I press enter, the script checks that I've entered a valid IP address, which I have. And then it asks me the range of port numbers to scan. So in my example, I'll say 20 to 24, for example and press enter. As you can see here, port 22 and port 23 are open. That is a switch in my network. Port 23 is SSH, port 23 is Telnet. I shouldn't be running Telnet on devices today. So that tells me that there's a problem. Let's run the script again, I'll scan the same device. This is a device in my local network, but you could scan a device on the internet if you wanted to. Let's specify a range such as 80 to 80. And as you can see, that port is open. I'm running a web server on that switch. I shouldn't actually be doing that. Now, I could ping a website. So let's say davidbombal.com. IP address of that website is this. So let's test the script against that website. This is a public facing website on the internet. So 217.160.069. Is port 80 open on that website? And as you can see, it is open. Now you could run the script against many, many ports, but be careful doing that 'cause it'll take a long time. So if I scan my local switch once again and scan ports 20 to 80, that will take time because it's gonna try and connect to every single port and see if it's open. Now, if we look at the actual script, what the script has been written to do, and I'll talk about more of the details in a moment is it's using a timeout of 0.5 seconds. So half a second is the amount of time that it takes to connect to a port and see if it's open. So if you use a long range or a wide range of port numbers, it's gonna take time to scan those ports. But in this example, we can see that on the switch port 22, 23 and 80 are open. Now you may prefer to run this on Kelly, Linux or on a Linux server. So I'll log into my Kelly Linux server. This is running as a virtual machine on Windows. So I'm actually demonstrating everything on this Windows laptop, running within Windows and now running within Kelly. Alice here shows me that I have no script so I'll create a script called portscan-sockets.py And what I'll do is copy the script into Kelly, Control + X to save that. So I've used nanobot Bur you could use VI or something else to edit the script. But once again, if I type Python3--version, you can see that I'm running 3.9.1. You should be using Python 3 today. So I'm using Python 3 in this example. In this case, I'm using the latest release of Kelly at the time of this recording 2021.1, but let's say Python3 portscan-sockets.py. I'll scan the same switch and I'll use ports 20 to 25 just to demonstrate that it also works on Kelly. Now, the script has been written so that if you make a mistake, so you put in the wrong IP address. So you put in your IP address something like this as an example, it's gonna tell you that you've made a mistake and you need to fix the IP address. Same with ports, if you do something like this, it's gonna ask you to use the right format. So 20 to 80 as an example. So the script is once again using sockets within Python. So the actual code is very, very simple, but what I've done to try and make it better for you is I've put a lot of comments on the code. So most of the script is just comments. Rather than me trying to explain every single line and making this video very, very long, I've put a link in the description and pin comment on this video so you can download the script from my GitHub and have a look at it. And there you go, you can see that port 22, 23 and 80 are open on the switch. But that's the first script, but you may prefer using nmap. Now to run the script, you need to install Python3-pip if it's not installed and installed Python-nmap. So if I copy the script onto my Kelly server, I'll clear the screen. I've currently got this portscan sockets script, but let's create a portscan and let's call this nmap.py. And I'll paste that script in Control + X, Y to save. So I've got two scripts now, let's run this script. So Python3 portscan-nmap.py. Notice we're told that this command is not a valid. I need to install nmap. Now in map is installed by default in Kelly. And I'll just point that to more. So I've got nmap installed, but I need to use the Python version of nmap. So I need to use that pip (indistinct). So let's see if pip is installed on this Kelly server. So clear the screen, and I'll paste that in. Notice we're told that pip is not installed. So I can use this command to install it. So I'll select that and right click and paste it in. So sudo apt install Python3-pip, I'll put in my Kelly password and say Y to install pip. Pip is now installed so I can use the command pip install Python-nmap. So pip is installed so hopefully I can run portscan-nmap.py. And there you go. So I'll scan the same device, similar port range, but notice here, we're getting more information. The nmap script is more powerful. It's telling us if a port is filtered or if it's closed or if it's open. And as you can see the port 22 and 23 are opened. If I run that script again, and I did say 20 to 80. This tells you if a port is blocked once again or if it's filtered or if it's opened. And all you need to do now is wait for that script to run. So while that's running, let's have a look at the script. The main difference between the two scripts is this last portion where I use either nmap, or I use basic socket port scanning. Nmap is more powerful, but it does require that you have nmap installed. Most of the first part of both of these scripts is the same, very, very similar. Once again, not gonna spend a lot of time going through all the details. There's a lot of comments in the scripts to help you understand what every single line does. You could strip the comments out as an example, and then your script will be very, very small. But one of the issues I often see with scripts on the internet is they don't explain what they're doing. They just have the code. So I've tried to give you a lot of information about what every line of the script does. So the first thing we're gonna do is import socket. This is required to make a socket connection to a device. In other words, connect to its IP address and port number. We are then importing regular expressions. Regular expressions are used to allow us to recognize an IP address. So once again, if you typed in your IP address incorrectly, the script would know that. So if I just typed in some random number here, it's gonna ask me to type in the IP address again because I've made a mistake in the IP address. So this regular expression is used to recognize IP version four addresses. At the moment, the script is only scanning IP version four addresses, but if you're interested, I'll create an IP version six version of this port scanner. Here is a port range. This regular expression allows us to specify the lowest and maximum port range. These two just initialize the port numbers, but we change those values later. Now, please note, this is a very basic script. It doesn't differentiate between faulted and closed ports. So if you've got an access list blocking traffic to a specific port, that's not differentiated in the script. Where's the nmap script allows us to determine the difference. This is a basic user interface. You could delete all of this if you wanted to. We are then asking the user to enter the IP address, and that's what runs over here. So I'll cancel that script and run it again. So that portion of it is where we asking the user to put in the IP address, something like that. We determined that it's a valid IP address. You can see that we printing that out here and then we breaking this while loop and then we have another loop checking for port numbers. So notice we told to put in the port range. So once again, I'll just do 20 to 25 and then when I press Enter, it actually connects to the device to determine if the ports are opened or closed. So while true, we checking the port range to make sure that the port range is correct and then we connect to the device using a socket object. Timeout is half a second. We connect to the IP address that the user entered and the port number, and then we grouped together the open ports so that we can print that information out later. Now, again, there are a lot of comments in the code to help you read this and understand what every line does. Have a look at the GitHub link that I've put below if you wanna download the script. On the nmap script, something very similar gets done. This is the nmap portion. We basically looping through the ports in the specified range. And then we are using this nmap command in the background to connect to the device to see if it's open. So we are basically scanning through a list of port numbers that the user specified and then connecting using nmap and then we either print the port status or if we can't access the port. Now this video is getting too long. So I'm gonna end it now. Use the links below to download these scripts. Please let me know if you enjoy this top of content. If you do, please like this video, please consider subscribing to my YouTube channel and clicking on the bell to get notifications. I'm David Bombal, wanna wish you all the very best. (upbeat music)",
    "transcript_keywords": [
        "Python",
        "script",
        "port",
        "Kelly",
        "nmap",
        "scripts",
        "Windows",
        "address",
        "nmap Python script",
        "ports",
        "open",
        "port range",
        "nmap script",
        "installed",
        "range",
        "download Python",
        "run",
        "simple Python scripts",
        "port numbers",
        "Python scripts"
    ],
    "transcript_entity_values": [
        "first",
        "2021.1",
        "six",
        "Linux",
        "Bur",
        "192.168.248",
        "Python",
        "Kelly Linux",
        "20 to 25",
        "SSH",
        "Nmap",
        "VI",
        "half",
        "Kelly, Control + X",
        "80",
        "two",
        "four",
        "Y",
        "second",
        "Kelly",
        "Tab",
        "YouTube",
        "3",
        "23",
        "today",
        "Kelly",
        "IP",
        "Windows",
        "Python",
        "3.9.2",
        "0.5 seconds",
        "one",
        "Learning Python",
        "Linux",
        "GitHub",
        "Alice",
        "Python",
        "3.9 two",
        "Control + X",
        "3.9.1",
        "python.org",
        "Windows",
        "20 to 80",
        "David Bombal",
        "Pip",
        "Port 23",
        "22",
        "20"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "FAC",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.03170491009950638,
        -0.016734721139073372,
        -0.08629702776670456,
        -0.006117377430200577,
        -0.03485799580812454,
        -0.12316426634788513,
        -0.020604286342859268,
        -0.08641142398118973,
        -0.07602202892303467,
        -0.04501689225435257,
        0.05870182439684868,
        0.01461903378367424,
        0.08336305618286133,
        -0.0008724380168132484,
        -0.03138197958469391,
        -0.005448554176837206,
        -0.0071835811249911785,
        -0.03632340952754021,
        0.08537294715642929,
        -0.06462077796459198,
        -0.06154179573059082,
        0.049492768943309784,
        0.022603070363402367,
        -0.06540602445602417,
        -0.09727467596530914,
        -0.019537614658474922,
        0.03571193292737007,
        -0.019894961267709732,
        -0.033410314470529556,
        -0.001542898709885776,
        0.014809388667345047,
        0.06503556668758392,
        -0.10744096338748932,
        0.030452705919742584,
        0.035189855843782425,
        0.015763070434331894,
        0.019090063869953156,
        0.06569816172122955,
        -0.06826838850975037,
        -0.030666710808873177,
        0.016184713691473007,
        -0.07410699874162674,
        0.027842290699481964,
        0.010161301121115685,
        -0.03436984121799469,
        -0.05651867762207985,
        -0.07674717903137207,
        -0.0011300868354737759,
        0.051656320691108704,
        -0.11879760026931763,
        -0.0942455530166626,
        -0.023600349202752113,
        -0.050646863877773285,
        -0.004744531121104956,
        0.03773878142237663,
        -0.041877631098032,
        -0.044022783637046814,
        -0.03273463994264603,
        -0.0335569866001606,
        -0.02215377800166607,
        -0.0014043012633919716,
        0.03003602847456932,
        -0.013177976943552494,
        -0.015850361436605453,
        0.0015270350268110633,
        -0.01913122832775116,
        0.0034072839189320803,
        0.01127892080694437,
        0.049523789435625076,
        0.017962617799639702,
        -0.08722743391990662,
        -0.05576567351818085,
        -0.014652063138782978,
        0.03978554904460907,
        -0.01253014337271452,
        0.030273322016000748,
        0.02269016019999981,
        -0.03829873725771904,
        -0.02983151189982891,
        -0.017255108803510666,
        -0.07505414634943008,
        -0.06395929306745529,
        -0.0717950314283371,
        0.09002784639596939,
        -0.005543745122849941,
        0.026994485408067703,
        -0.1045733094215393,
        0.01244508195668459,
        0.022627828642725945,
        0.016531523317098618,
        0.0007525847177021205,
        -0.002819833578541875,
        -0.12041176110506058,
        -0.04616857320070267,
        0.0566706545650959,
        0.020151037722826004,
        0.009730840101838112,
        0.028392137959599495,
        -0.056437671184539795,
        0.03964875638484955,
        0.04930404946208,
        -0.05672251060605049,
        -0.0691695436835289,
        -0.045294761657714844,
        0.04028112813830376,
        0.033362142741680145,
        0.07260702550411224,
        -0.03188919648528099,
        0.06794733554124832,
        0.039889004081487656,
        -0.05783733353018761,
        0.03584242984652519,
        -0.0031727212481200695,
        -0.06756134331226349,
        -0.007171342149376869,
        0.08847232908010483,
        0.03353474661707878,
        0.14442263543605804,
        0.030336258932948112,
        0.09617190062999725,
        0.0007008489919826388,
        0.004826568067073822,
        -0.029690712690353394,
        -0.0693054348230362,
        -0.01225863303989172,
        0.02496563270688057,
        0.06566710770130157,
        6.416019348152884e-33,
        0.01892690919339657,
        0.037885986268520355,
        0.0030712815932929516,
        -0.014121254906058311,
        0.024052798748016357,
        0.020564796403050423,
        -0.011917739175260067,
        0.037105780094861984,
        -0.0524955615401268,
        0.04003928229212761,
        -0.10789653658866882,
        0.01675764098763466,
        -0.027789020910859108,
        0.014337184838950634,
        0.024025246500968933,
        -0.00771255511790514,
        0.042663950473070145,
        -0.008904087357223034,
        -0.007826898247003555,
        -0.04827466607093811,
        0.039329223334789276,
        -0.10531327873468399,
        0.010199345648288727,
        -0.0051744719967246056,
        0.05995798856019974,
        -0.0013236382510513067,
        -0.11372295767068863,
        -0.0038002964574843645,
        0.025822928175330162,
        0.027627596631646156,
        -0.03362983837723732,
        -0.0041513447649776936,
        -0.088888980448246,
        -0.019896598532795906,
        0.020948944613337517,
        -0.0547993965446949,
        -0.03435169905424118,
        -0.03349916636943817,
        -0.06000658497214317,
        -0.10696922987699509,
        -0.07795025408267975,
        -0.034626554697752,
        -0.0129440538585186,
        -0.05289416387677193,
        0.00992721226066351,
        -0.03532524034380913,
        -0.1352059543132782,
        0.04019847512245178,
        0.06643594056367874,
        0.07894285768270493,
        -0.030356494709849358,
        -0.052811961621046066,
        0.014803832396864891,
        -0.02449236810207367,
        -0.03706541284918785,
        0.026671595871448517,
        0.08738098293542862,
        0.06999102979898453,
        -0.02085375040769577,
        0.05731295794248581,
        -0.023532787337899208,
        0.018583014607429504,
        0.0315297394990921,
        -0.010796870104968548,
        0.10741682350635529,
        -0.031066248193383217,
        0.010629058815538883,
        0.059598978608846664,
        -0.03128848597407341,
        0.0867554321885109,
        -0.024878475815057755,
        0.04125677049160004,
        -0.008636307902634144,
        0.016789792105555534,
        0.0034952920395880938,
        -0.04279233142733574,
        0.03950543701648712,
        0.014824861660599709,
        0.0001967666030395776,
        -0.012812560424208641,
        -0.003640789771452546,
        0.01314394548535347,
        0.02506205253303051,
        -0.06339751183986664,
        0.046125832945108414,
        -0.013131320476531982,
        0.005182542838156223,
        0.00011321964848320931,
        -0.03642800450325012,
        0.10269036889076233,
        -0.09381738305091858,
        0.08002383261919022,
        0.0016377844149246812,
        -0.035228848457336426,
        -0.06259292364120483,
        -1.15133338687228e-32,
        -0.040807146579027176,
        0.04647514596581459,
        0.026364028453826904,
        -0.05119523033499718,
        -0.022954143583774567,
        -0.13590063154697418,
        -0.001558265881612897,
        0.004087293986231089,
        -0.01610339619219303,
        0.006936489138752222,
        -0.06112988665699959,
        -0.0623939223587513,
        0.11138328909873962,
        -0.029899973422288895,
        0.020403064787387848,
        -0.058725617825984955,
        -0.049228183925151825,
        0.013578969985246658,
        0.06247767433524132,
        0.07267843186855316,
        -0.09498900920152664,
        0.16271618008613586,
        -0.027719058096408844,
        -0.06310998648405075,
        -0.08540965616703033,
        -0.020720532163977623,
        0.0024501848965883255,
        0.03810812532901764,
        -0.04275042191147804,
        0.043881628662347794,
        0.00030028936453163624,
        0.05561499297618866,
        -0.016962219029664993,
        0.05662135034799576,
        0.010852139443159103,
        0.0696946531534195,
        0.08366622775793076,
        0.04077615216374397,
        0.06811533123254776,
        -0.004750242922455072,
        0.10278739780187607,
        0.06986597180366516,
        -0.04860825091600418,
        0.03852575272321701,
        0.025796551257371902,
        -0.03955990821123123,
        -0.016023928299546242,
        0.10385118424892426,
        -0.08575709909200668,
        -0.06803928315639496,
        0.022408377379179,
        0.021821293979883194,
        -0.0058749970048666,
        0.07335660606622696,
        -0.018938496708869934,
        0.0741419717669487,
        0.019097575917840004,
        0.012545314617455006,
        0.034739892929792404,
        -0.02187923714518547,
        -0.01235745195299387,
        -0.1572500616312027,
        -0.07161806523799896,
        0.05893095210194588,
        0.026708824560046196,
        0.00022393798280972987,
        -0.026475951075553894,
        0.014720616862177849,
        -0.02757391892373562,
        -0.0701017826795578,
        -0.0004909635172225535,
        -0.020408254116773605,
        0.0073655941523611546,
        0.03344267979264259,
        0.00021611849660985172,
        0.0292571559548378,
        -0.03837481513619423,
        0.06322027742862701,
        -0.07290545850992203,
        0.03716123849153519,
        -0.012343340553343296,
        0.005632816813886166,
        -0.06017249822616577,
        -0.012497536838054657,
        -0.028016310185194016,
        -0.0067261988297104836,
        0.0044600702822208405,
        0.023411335423588753,
        0.005306617356836796,
        -0.07505985349416733,
        0.012291102670133114,
        0.05313672497868538,
        -0.04461300000548363,
        0.010289989411830902,
        -0.010557685978710651,
        -5.563432736721552e-08,
        0.0489753894507885,
        0.003971060737967491,
        -0.028941186144948006,
        0.03247593715786934,
        0.01014996599406004,
        0.0561041459441185,
        0.002708902582526207,
        -0.05133454501628876,
        -0.03790546581149101,
        0.046797048300504684,
        0.010918499901890755,
        -0.036868687719106674,
        -0.04973297566175461,
        0.009222828783094883,
        0.0321061834692955,
        0.039519671350717545,
        -0.08780453354120255,
        -0.019249524921178818,
        -0.0005602947785519063,
        0.021266566589474678,
        0.0850541815161705,
        -0.018915604799985886,
        0.009105034172534943,
        0.0654643103480339,
        -0.05197649449110031,
        -0.0011806651018559933,
        0.023808643221855164,
        -0.02554936520755291,
        -0.09577333182096481,
        -0.040951330214738846,
        -0.0016422357875853777,
        -0.06163792312145233,
        0.032320983707904816,
        0.014709456823766232,
        -0.048033662140369415,
        0.048889074474573135,
        -0.028628818690776825,
        -0.0065783788450062275,
        0.022905386984348297,
        0.12165376543998718,
        -0.09540962427854538,
        -0.02960967645049095,
        -0.10754907131195068,
        0.003073996864259243,
        -0.0607115663588047,
        0.007454955019056797,
        0.01190232764929533,
        0.06121943145990372,
        0.008960934355854988,
        0.0011491015320643783,
        -0.0036113238893449306,
        -0.09729345142841339,
        0.06346051394939423,
        -0.1237320825457573,
        0.034890301525592804,
        0.037491798400878906,
        0.014464815147221088,
        -0.06435705721378326,
        -0.0155789228156209,
        0.028874412178993225,
        0.05591388791799545,
        0.09710578620433807,
        0.02116825245320797,
        -0.02011098898947239
    ]
}