{
    "id": "x4JWyZvGUo8",
    "title": "the SMALLEST gaming PC!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-06-17T18:54:10Z",
    "video_url": "https://www.youtube.com/watch?v=x4JWyZvGUo8",
    "category": "Science & Technology",
    "tags": [
        "gpd win max",
        "gpd",
        "gpd win",
        "win max",
        "laptop",
        "gaming laptop",
        "smallest laptop",
        "smallest gaming laptop",
        "small",
        "smallest",
        "mini laptop",
        "notebook",
        "unboxing",
        "review",
        "tech",
        "indiegogo",
        "kickstarter",
        "gaming pc",
        "pc gaming",
        "windows",
        "windows 10",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 1482453,
    "likes": 49923,
    "comments_count": 2738,
    "description": "It might be tiny but there is NOTHING else like it. The GPD WIN Max on Indiegogo:  The ULTIMATE laptop graphics upgrade   My new podcast The Test Drivers!  Our second channel @thisis!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://igg.me/at/gpdwinmax",
        "https://www.youtube.com/watch?v=YwUiOpZP9ZU",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Inside this box is something I am very excited about, the brand new GPD WIN Max. And you may have see it in a couple of videos on this, but if you haven't, the idea is that this is the world's smallest gaming laptop. Asterisk, that could play actual games unlike some small laptops that, suck. So of course, standard disclaimer applies. GPD were very kind enough to send this out early so it is a pre-production sample. There will likely be some things that will change between now and the actual full shipping date, but like many GPD products we've taken a look at in the past, there's always a lot of very unique and cool decisions inside. And they also use lots of yellow tape, lots and lots of yellow tape. All right, so we have the WIN Max itself. Oh, look at that, look at the triggers built in. So this is a very unique hybrid. - [Ken] Wait, wait. - Yeah, actual like legit triggers built in. So the thing that makes this unique, is that it's essentially a laptop, a mini laptop with a trackpad and the keyboard, but we also have joysticks, we have X, Y, A, B buttons, we have a little Xbox button. Essentially, this is like, if a small laptop and an Xbox controller and a Switch got together, you would have the GPD WIN Max, it's a very unique device, but inside you're getting something which can play actual PC games. So while yes, this certainly does not have an RTX 2080 fit inside, but what it does have is a still reasonably powerful Intel Ice Lake processor. So in this case, it's the i5 with the Iris Pro Graphics. Iris Pro, Iris Plus, Iris Plus Graphics. That might not sound impressive if you're used to the old school Intel integrated graphics of yester year, but this actually has roughly the same sort of level of performance as like a low end laptop dedicated GPU, which means that especially considering that we have a 1280 by 800 display, you can actually probably play a lot of games at that resolution with no worries. I just realized, the screen actually goes totally flat so you can play it like this. That hinge actually feels pretty decent. So the keyboard immediately is usable but a little odd. So obviously the main layout isnt bad, right? Like these keys are a little bit small, but as someone who uses the Surface Go and the iPad Pro a lot, I'm kind of used to a little bit of a smaller keyboard. What I'm not used to though is that we have a sort of split top row where we have like the number row and the function keys sort of together. Those are really small, but I don't think a lot of people are probably gonna be using a laptop like this as their main sort of essay writing machine. It's much more so a small gaming console slash gaming PC slash Ken's dream laptop. You would use this though, right? - [Ken] Oh, I was gonna ask. - Yeah, I feel like you steal every little tiny laptop that we get in the office. - [Ken] I do. - Pretty accurate statement. So around back, we have not only full-sized HDMI, two USBA, a USBC and a Thunderbolt 3 port, on an eight inch laptop. You know we're gonna get into some shenanigans with that. On top of that, we have a full size ethernet jack, we have a micro SD card slot and we have a little toggle switch on the side, which will move it between mouse mode, as well as a sort of game pad Xbox mode. You can actually open this thing up and you do have access to at least the M.2 slot. So if you ever wanted to upgrade the SSD, you can. A lot going for a eight inch tiny gaming laptop. So I will say opening the GPD WIN Max is not the easiest thing in the world, the screws are actually pretty far inset, so a lot of my bits weren't even fitting and it's impressively machined in that it's very hard to even get sort of separation on the bottom chassis. So, the first thing I noticed is that we have our three cells battery, which is actually attached to the bottom of the chassis. That's actually a really big battery for something which is this small. I believe this is 60 Watt hours, which if that's true is roughly what you get on a lot of like 13 inch laptops. So inside immediately you see that you have dual fans with, I see one heat pipe, I'm assuming there's a second heat pipe on this side. So you can really see that you're cranking this thing, it's just pulling clear air straight through the bottom, and it's exhausting it out the back here. So this is very much sort of designed to get as much air flow through it as possible to cool that Core i5 underneath. Something else I noticed we do have our soldered down Wi-Fi card, but it does have Wi-Fi 6, which is nice. Now we cannot upgrade the RAM, so it does have 16 Gigs, I believe of LPDDR4 memory on the motherboard underneath this heat sink, but that's fine honestly, 16 Gigs should be plenty. I've got to say they've actually done a really good job with sort of the layout of this board. I mean, we've got obviously ethernet, all of these ports, you have what are obviously these huge PCBs for what you need to actually make those thumb sticks work. And considering that we have such a thick, beefy battery, I'm legitimately really impressed. For a small device, there's a lot going on here. So after about a week with the WIN Max, there are a few things that really come to mind. First of all, this is lot of hardware for less than $800. With that Ice Lake Core i5, it means that we're getting solid graphics and plenty of performance to really rival a lot of full like, Core i5 and Core i7 laptops. Now, there are some downsides to the hardware. So this is a pre-production sample, I will definitely give the caveat too, but it doesn't feel incredibly sturdy. There's a little bit of flex, I can't really hear it too much, but there's a little bit of flex to it. And beyond that the actual coating they have on the outside, I don't know if you can see, but it's actually gotten slightly scuffed up. Now, mind you, I will say that's partially my bad, I did put this in a bag with my sort of metal laptop, but it did end up getting a little bit scuffed up on the outside. Ultimately, I feel like that's not a huge issue and certainly at the price and considering the specs, it's not a big deal, but something to consider. Now, one thing I do have a slight issue with is the screen. Now I get that they made this decision because this is really focused on gaming, with the 1280 by 800 resolution, that's not really great for Windows 10. It doesn't give you a lot of screen real estate, it's barely wide enough for a lot of sort of apps and websites. It would be nice to have seen something like a 1080p display. I get why they did this, It is a solid panel, but the problem is, that it just doesn't really feel great for anything beyond just pure gaming, right? I definitely would like to see a little bit higher and something else I'd like to see higher, is a higher refresh rate. Now, as we'll see here in the games in a minute, this thing is capable of pushing some pretty impressive frame rates, especially on sort of more Esports oriented titles that aren't really that heavy. And because of that, I would've love to see something like 120 FPS display. But, if I could have any real change on this, it would definitely be at least a 1080p display. I think that would make a difference just in the general usability. So our first game is CS:GO, which admittedly is a terrible game to play with the controller. However, with a little bit of tweaking, it does work. And even with the settings crank to high, we're still looking at 100 frames per second. 90 as I'm walking through here, which honestly is not bad. Mind you, we are playing at 1280 by 800. But this isn't really a game where I feel like we could really benefit from being able to take advantage of higher frame rates. Okay, I need like 100% more sensitivity. Oh! Oh, God, everyone's sucks, me included. I can't believe I'm about to say this, but this is actually like fun and playable. Performance is not an issue at all, and the screen resolution really makes sense for this size screen. It's not perfect, right? I don't think anyone should ever play CS:GO with the controller, but this is a PC. If I want, I can plug in a mouse and keyboard if I have the space. And if I'm on the go, I can just play over Wi-Fi and have no problems. So the next step we have Overwatch, which we're going to try to play at 1280 by 800 at low settings and see what it looks like, which it does immediately look like it's playable. It is a little bit loud though, I don't know if you can hear that, but like. It's definitely cranking, but that's fine. We're playing handheld gaming PC stuff, so that's okay. Ooh, yeah. So we get these weird stutters. So it's like huge frame time spikes. Our FPS is fine though, it's like sort of hovering 40 50 or so, which, I mean, even though we're on low settings on the smaller display, it really does kind of help sort of, cover up the lack of super high graphical fidelity. But the problem though is it that sort of frame rate, whenever dips below 60, it kinda gets just sort of, we see these like yeah, like stutters like that, where we'll just drop significantly for like half a second. Oh, okay, there we go, see that? Yeah. Everyone comes out and we're just, it's a slide show. Yeah and that's playable. Hmm. So it's a little bit inconsistent. Now, I will say that there are different modes available for the WIN Max, So you actually can go into the BIOS and manually turn up the TDP. If you feel comfortable with that fan really cranking and the system getting a little bit warmer, you can turn it up to get more performance, which would probably help out here. But yeah, this is a little bit, a little choppy. Like it runs smoothly until it doesn't. We're getting like these weird lags spikes. I wonder if I plug it in, if that helps, let me go grab a power cable and see, because the battery is getting low. Oh, okay, oh, okay, okay. Oh wait, what? Oh no. How do I shift? How do I shift? Oh, there we go. Oh, no, that was terrible. So the only thing I'll say about this immediately for F1, is that they're the triggers have no, it's just a button, right? So unlike like say the Xbox controller where you have the finesse, it's either full throttle or nothing, which means that it's fine for something like a first person shooter, when it comes to a racing game, all it means is you're either flooring it, there's no sort of room for finesse. Oh God, that's really hard to drive. Okay, this is admittedly, if you're wanna use this for racing games, this is pretty much a deal breaker for me. So here's the thing, the GPD WIN Max has a lot going for it, but also has some major compromises. So, I think the best way to solve them is actually with a very simple little life hack. And that is to take advantage of this. The Thunderbolt 3 port to plug in a full GPU, that is where this comes in. So this is a liquid cooled RTX 2080 TI Thunderbolt gaming box. Now we've done an entire video about this previously, but what I like about it is that for what is admittedly, a very large amount of money, you can add some incredible graphics horsepower to literally anything with a Thunderbolt port, including our tiny little gaming PC. This is a dumb idea. Literally zero people on earth are going to plug this into a 2080 TI, but let's see what happens when we take the world's tiniest gaming laptop and give it the most powerful graphics card that we can. All right, so with the GPD WIN Max plugged in with the single Thunderbolt cable to our 2080 TI, while the 2080 TI is powerful, we're being bottlenecked, first of all, by Thunderbolt, which always knocks a little bit of performance off, but also by the fact that this is a mobile quad core processor in a tiny gaming PC. So we're probably gonna get good performance. I think it will be playable, but this is really sort of a very extreme example of what this PC is technically capable because of that Thunderbolt port. So something I haven't actually realized, this actually does a good job of cooling it. We sit at 3.3 gigahertz really consistently while the fans a little bit loud, it actually isn't bad. So as far as Red Dead goes, we're just gonna go full out, right? So we are setting it to the quality setting. So it's pretty much maxed out at 4K, the only thing is we don't have MSAA or anything, but we're already taking advantage of their TAA. There's a couple of a medium settings in here. And by a couple, I mean, there's one. So why don't we run the benchmark and see what this is capable of? I anticipate we're probably gonna be looking at sub 60 FPS on full ultra. Oh yeah, 40 FPS. That being said, that looks nice. Yeah, we're pegging the CPU. Our GPU is at 300, like no, sorry. 3800%, so at 3000% GPU usage, that's pretty solid. Yeah, we're looking at like 40 FPS, which is perfectly reasonable considering that this is a modern AAA game 4K, full ultra settings. I mean, if this was in a dedicated desktop with like a real sort of gaming CPU, we probably wouldn't be looking at that much more performance, probably like 60 FPS or so, but this is really impressive. The fact that we're taking advantage of Thunderbolt with this tiny little gaming PC, means that theoretically, you can get a lot more performance if you want. Now, the thing with the GPD WIN Max, is it there are a couple of ways of looking at this. On one hand, you're looking at a sort of handheld gaming PC with the controller built in and when you look at it like that, there's a lot going for it. Now, if you were also wanting to use this as say your computer, a lot of the compromises are much more difficult to deal with. I mean, I still, even after a week have not gotten used to this sort of weird arrangement of the number row and the function keys. It's very much sort of like the bare basics for what you would expect out of PC. But if you're looking for like a laptop replacement, unless you're a very specific kind of person, this is not it. You really need to think about this as a handheld gaming PC first and everything else second. And by that metric, there is a lot going for it.",
    "transcript_keywords": [
        "GPD WIN Max",
        "WIN Max",
        "GPD WIN",
        "sort",
        "lot",
        "gaming",
        "laptop",
        "WIN",
        "Max",
        "bit",
        "GPD",
        "thing",
        "Thunderbolt",
        "Yeah",
        "gaming laptop",
        "FPS",
        "play",
        "performance",
        "full",
        "small"
    ],
    "transcript_entity_values": [
        "13 inch",
        "100",
        "Ken] Wait",
        "three",
        "2080",
        "like half a second",
        "Red Dead",
        "3.3 gigahertz",
        "300",
        "first",
        "Gigs",
        "RAM",
        "Overwatch",
        "3000%",
        "Core",
        "TAA",
        "800",
        "about a week",
        "GPD",
        "F1",
        "Core i5 and",
        "two",
        "1280",
        "Windows 10",
        "Thunderbolt",
        "Switch",
        "Esports",
        "the iPad Pro",
        "Xbox",
        "Y",
        "HDMI",
        "Iris Plus Graphics",
        "USBC",
        "an eight inch",
        "60 Watt hours",
        "Wi-Fi",
        "100%",
        "Thunderbolt",
        "one",
        "the Iris Pro Graphics",
        "60",
        "Max",
        "second",
        "TI Thunderbolt",
        "4",
        "yester year",
        "a eight inch",
        "90",
        "Intel",
        "16",
        "AAA",
        "SD",
        "CPU",
        "SSD",
        "zero",
        "3800%",
        "a week",
        "Asterisk",
        "less than $800",
        "Wi-Fi 6",
        "TDP",
        "40 50 or so",
        "Thunderbolt",
        "slash Ken's",
        "40 FPS",
        "a minute",
        "60 FPS",
        "Intel Ice Lake",
        "FPS",
        "2080",
        "M.2",
        "GPU",
        "First",
        "USBA",
        "3"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.011281343176960945,
        0.007735348306596279,
        0.01754095032811165,
        -0.04283379018306732,
        0.04361976310610771,
        -0.015947384759783745,
        -0.029984215274453163,
        0.03873785212635994,
        -0.056403763592243195,
        0.10884454846382141,
        -0.03487910330295563,
        0.07171681523323059,
        -0.04361305385828018,
        0.0004954680916853249,
        0.02427598461508751,
        -0.005719692446291447,
        0.1415378600358963,
        -0.11340177059173584,
        -0.07375966012477875,
        -0.04659479483962059,
        -0.053927745670080185,
        -0.07835908234119415,
        -0.017186135053634644,
        0.004729941487312317,
        0.014893396757543087,
        -0.0158150065690279,
        0.014551989734172821,
        -0.01580355130136013,
        -0.03360160067677498,
        -0.007692451123148203,
        -0.019729530438780785,
        0.039140086621046066,
        0.034342676401138306,
        0.0517335869371891,
        0.03481804206967354,
        -0.0356593020260334,
        0.07637787610292435,
        -0.07812152057886124,
        -0.024399615824222565,
        -0.11298544704914093,
        -0.02580130286514759,
        -0.05500311404466629,
        0.009954576380550861,
        0.0787075087428093,
        0.05858694761991501,
        -0.06404171139001846,
        -0.019243868067860603,
        -0.026875276118516922,
        -0.03274869918823242,
        -0.01920224167406559,
        0.03115902654826641,
        -0.034151408821344376,
        0.020945576950907707,
        -0.08816342055797577,
        -0.04727194830775261,
        -0.014720394276082516,
        0.011717099696397781,
        -0.056689776480197906,
        0.02632611058652401,
        0.02029762789607048,
        0.041335579007864,
        -0.1208687350153923,
        -0.012936575338244438,
        0.06581692397594452,
        -0.01855359971523285,
        -0.06913543492555618,
        0.026409417390823364,
        -0.0014981580898165703,
        -0.008061697706580162,
        -0.029725659638643265,
        0.00636649364605546,
        0.059615608304739,
        0.010987037792801857,
        0.038084179162979126,
        0.008081899955868721,
        -0.04235324636101723,
        0.0019621748942881823,
        0.022725120186805725,
        0.04365694150328636,
        0.06274920701980591,
        0.009327929466962814,
        -0.009564053267240524,
        0.02526942640542984,
        -0.037553541362285614,
        -0.0591764934360981,
        -0.010092406533658504,
        -0.019483549520373344,
        0.016791975125670433,
        -0.014397027902305126,
        -0.050835106521844864,
        -0.027982402592897415,
        0.07902301102876663,
        -0.018022343516349792,
        0.09304265677928925,
        -0.03232273831963539,
        -0.005894424393773079,
        -0.001334868255071342,
        -0.11200014501810074,
        -0.04235316067934036,
        0.04940256103873253,
        0.004877871833741665,
        0.08534081280231476,
        0.09546037763357162,
        -0.0021836012601852417,
        0.01165236346423626,
        -0.0002673414128366858,
        -0.043962955474853516,
        0.031131112948060036,
        -0.0054331254214048386,
        0.01149864960461855,
        -0.06968790292739868,
        -0.013813148252665997,
        -0.007488061673939228,
        0.03195817768573761,
        0.010615972802042961,
        0.04553869739174843,
        -0.027570707723498344,
        0.0472324974834919,
        0.03910719230771065,
        0.03866039216518402,
        0.02052275277674198,
        0.001288075465708971,
        -0.007777111604809761,
        -0.025704631581902504,
        0.04619278386235237,
        0.1332576721906662,
        -0.031596552580595016,
        2.4466520849534236e-33,
        0.08563876152038574,
        0.006916401907801628,
        -0.06103825196623802,
        -0.02523927576839924,
        0.0027859066613018513,
        0.042333513498306274,
        0.0608578696846962,
        -0.028398258611559868,
        -0.048491064459085464,
        0.02327842451632023,
        -0.03316732868552208,
        0.02153782732784748,
        -0.047599051147699356,
        0.05007688328623772,
        0.12170897424221039,
        -0.05686285346746445,
        -0.06883025914430618,
        0.03164174035191536,
        -0.0344766229391098,
        -0.014874833635985851,
        -0.00248160888440907,
        0.04750654846429825,
        0.021267959848046303,
        -0.05650319904088974,
        0.01687215454876423,
        0.009141103364527225,
        -0.08934196084737778,
        -0.011204185895621777,
        0.06509963423013687,
        0.025832246989011765,
        -0.07930649816989899,
        -0.09735145419836044,
        -0.0847378671169281,
        -0.025254441425204277,
        -0.00660980399698019,
        0.048742469400167465,
        -0.05789445713162422,
        -0.09637754410505295,
        0.049467314034700394,
        0.042068105190992355,
        -0.04154340550303459,
        0.024120837450027466,
        -0.05679674446582794,
        -0.12764757871627808,
        -0.050489675253629684,
        0.04165986552834511,
        -0.004936295095831156,
        -0.019528141245245934,
        -0.026286950334906578,
        -0.010939695872366428,
        -0.11636011302471161,
        0.042819567024707794,
        0.0022912072017788887,
        0.008911439217627048,
        -0.016476010903716087,
        -0.02210712805390358,
        0.07306736707687378,
        -0.0743861272931099,
        0.0976356714963913,
        0.029442086815834045,
        0.0027840908151119947,
        -0.023697486147284508,
        -0.021737631410360336,
        0.07829830795526505,
        -0.07718311995267868,
        0.03268452733755112,
        0.10336621105670929,
        -0.0013815817655995488,
        -0.053983062505722046,
        0.01637079007923603,
        0.04283875599503517,
        -0.025004619732499123,
        0.017702385783195496,
        -0.060332708060741425,
        0.15555793046951294,
        -0.03616616129875183,
        0.05209276080131531,
        -0.03405638039112091,
        -0.020145632326602936,
        -0.02501044049859047,
        -0.035061467438936234,
        0.024779312312602997,
        -0.05662510544061661,
        -0.02345247007906437,
        -0.01200901810079813,
        0.06256557255983353,
        -0.016497747972607613,
        -0.030013086274266243,
        -0.041906774044036865,
        -0.017531100660562515,
        -0.11832768470048904,
        -0.016041109338402748,
        -0.011717841029167175,
        0.09051170945167542,
        0.09477778524160385,
        -3.8929404775998336e-33,
        -0.009968200698494911,
        -0.057291846722364426,
        0.05844271555542946,
        0.050477709621191025,
        -0.012233707122504711,
        -0.013542619533836842,
        0.04308958351612091,
        0.07252201437950134,
        -0.014936101622879505,
        -0.04523489251732826,
        -0.009718848392367363,
        0.07618873566389084,
        0.048968322575092316,
        0.033981986343860626,
        -9.061952005140483e-05,
        -0.07089821994304657,
        0.037231069058179855,
        -0.07422640919685364,
        0.12950055301189423,
        -0.02100382372736931,
        0.05210816115140915,
        0.01574392430484295,
        -0.08768956363201141,
        0.05575510114431381,
        0.06970999389886856,
        -0.029349032789468765,
        -0.0334014892578125,
        -0.08705113083124161,
        -0.027750933542847633,
        -0.017964977771043777,
        0.08710462599992752,
        -0.022297779098153114,
        -0.02252781018614769,
        0.07076919078826904,
        0.11752308905124664,
        -0.005256581585854292,
        0.06341641396284103,
        -0.025898149237036705,
        -0.031476642936468124,
        0.03648374602198601,
        0.04040689766407013,
        -0.0010818627197295427,
        -0.034333787858486176,
        0.022477855905890465,
        0.10747634619474411,
        0.02477935142815113,
        -0.03301332890987396,
        -0.08673808723688126,
        0.04258761182427406,
        -0.04448064789175987,
        0.009293361566960812,
        -0.010920039378106594,
        0.06863158941268921,
        -0.011211303062736988,
        -0.04415631294250488,
        -0.11815318465232849,
        -0.07347594201564789,
        0.037674497812986374,
        0.022523613646626472,
        0.00938948430120945,
        0.033794037997722626,
        -0.014630182646214962,
        -0.0526084303855896,
        -0.021191606298089027,
        -0.040997833013534546,
        0.0010025955270975828,
        0.055604372173547745,
        0.0577453188598156,
        -0.000984190497547388,
        -0.027551662176847458,
        -0.049417804926633835,
        -0.004515556618571281,
        -0.0827191099524498,
        -0.011774270795285702,
        -0.08220599591732025,
        0.05729620158672333,
        0.03981053829193115,
        -0.004195454530417919,
        0.029208196327090263,
        0.029349764809012413,
        0.010261806659400463,
        0.054182764142751694,
        0.05330367386341095,
        0.023588089272379875,
        0.06324393302202225,
        -0.03927077725529671,
        0.06876819580793381,
        -0.04266607388854027,
        -0.07912703603506088,
        0.005877230782061815,
        -0.007772671524435282,
        0.08811859786510468,
        -0.047947581857442856,
        0.019683092832565308,
        -0.025263039395213127,
        -5.7015355992007244e-08,
        -0.012967710383236408,
        0.0008335403399541974,
        0.024309271946549416,
        0.040327444672584534,
        0.03531697019934654,
        -0.02251446060836315,
        0.05813561752438545,
        -0.03223063796758652,
        0.05341687425971031,
        0.012610012665390968,
        0.029655376449227333,
        -0.07809709757566452,
        0.0010380763560533524,
        -0.01612003892660141,
        0.03490273281931877,
        0.0690799281001091,
        -0.040240149945020676,
        0.021134305745363235,
        -0.006646657828241587,
        0.011233807541429996,
        -0.0017627597553655505,
        0.04862623289227486,
        0.08791306614875793,
        -0.08487971872091293,
        -0.022987963631749153,
        -0.07263441383838654,
        0.03740079700946808,
        -2.63718993664952e-05,
        0.027376733720302582,
        0.00855234544724226,
        -0.0559832863509655,
        0.009063921868801117,
        0.027103768661618233,
        0.01151818223297596,
        0.026448985561728477,
        -0.04595578461885452,
        0.009674130007624626,
        0.07706400007009506,
        0.09293477237224579,
        0.03153635188937187,
        -0.07690875977277756,
        -0.08129077404737473,
        -0.0007768041105009615,
        -0.05457019433379173,
        -0.045750003308057785,
        -0.007707302458584309,
        -0.13294126093387604,
        -0.11881482601165771,
        -0.042790524661540985,
        0.027278535068035126,
        0.04636673256754875,
        0.026216860860586166,
        0.04653225466609001,
        0.03872813284397125,
        0.08973386138677597,
        0.0540495291352272,
        -0.03851160779595375,
        0.053456347435712814,
        -0.018093841150403023,
        0.006359858904033899,
        0.03264313191175461,
        -0.019741257652640343,
        -0.06562399864196777,
        0.1126391813158989
    ]
}