{
    "id": "x4UHVeLk3b4",
    "title": "ASUS ROG did what Microsoft couldn't - Flow Z13",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-03-07T20:29:15Z",
    "video_url": "https://www.youtube.com/watch?v=x4UHVeLk3b4",
    "category": "Science & Technology",
    "tags": [
        "ASUS",
        "Republic of Gamers",
        "ROG",
        "Tablet",
        "Microsoft",
        "Surface Pro",
        "Performance",
        "Compact",
        "Form Factor",
        "RGB",
        "High end",
        "Intel",
        "12th gen",
        "NVIDIA",
        "RTX",
        "3050 Ti",
        "eGPU",
        "XG Mobile",
        "Connection",
        "Microsoft Surface Pro sucks now"
    ],
    "views": 2354576,
    "likes": 51189,
    "comments_count": 4461,
    "description": "Thanks to ASUS ROG for sponsoring this video! Check out the ASUS ROG Flow Z13 at   The ASUS Flow Z13 laptop/tablet might look a bit confusing at first glance, as once tablets aren't really known to be for performance or gaming, but it sure does look like a Microsoft Surface Pro. Well, ASUS actually did it, and well, it's a bit more powerful than what you think.   Buy an Xbox Wireless Controller:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS ---------------------------------------------------   0:00 - ASUS Crate arrives 0:26 - Unboxing 1:29 - XG Mobile connector 2:07 - Unboxing continued 2:47 - Exterior impressions 3:57 - Power it on 4:15 - Trackpad and keyboard impressions 5:20 - Size impressions 5:30 - ASUS Flow Z13 Specs 6:03 - Pricing 6:19 - Connecting the Xbox wireless controller 7:20 - Display specs 7:40 - Gaming performance impressions 8:15 - Speaker impressions 8:40 - XG Mobile gaming time!  10:25 - Vapor Chamber cooling information 11:09 - Upgradeability 11:44 - Can't open it, but we'll tell you about it 12:15 - Webcam and microphone impressions 12:39 - Outro",
    "description_links": [
        "https://geni.us/eHQAbr",
        "https://geni.us/pKKdx",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(gentle music) - Oh Fancy. ASUS has made an incredibly powerful and incredibly small laptop, tablet kind of thing, but they seem to want to overcompensate a bit 'cause the first time, it was inside of the mothership and this time it's an even bigger package, ROG Bounce. Doesn't bounce, proved them wrong. Anyway, let's get into it. This is sponsored by ASUS ROG. Oh, let's see what we have in here. So first of all, we have a Game Pass Ultimate subscription. The code's there. Editor, please blur that out. John O put it in the comments. Someone gets this. Yeah, we also have some headphones. I didn't know these were in here, so that's pretty cool. So we have got the Fusion II 500, apparently it has surround sound and RGB. And also in here we get the Xbox wireless controller. It's vinyl wrapped with an ROG little design on it. And how do we get at it? Where's where's the laptop. Okay, nevermind. ASUS ROG super overcompensated and this box only had the peripherals in it. Like, did they send us one of their GPUs, Jono? - [Jono] Guess so. - That's sick. This is the XG Mobile. And it connects to the Flow Z13 and allows you to have like a full blown Z dedicated GPU. Well, I think it's a mobile GPU actually in a little enclosure, but at the same time it is very powerful. We'll have to test this out later. - [Jono] What's that connecting thing though? - What's the connector thing. - [Jono] Yeah. - Oh, so this right here is their XG mobile connector. And what we have is we have, I believe this is Thunderbolt. It might just be type C but we also have is PCIe Gen Three 5/8 connector right here. So that allows us to get the full bandwidth or pretty much the full bandwidth of this GPU to the laptop. Whereas if you did it over Thunderbolt or something like that, you would have way more latency and also just lower bandwidth, which sucks. Bandwidth over Thunderbolt is only good for about 10/60, 10/70. So when you're putting a 30/80 in there it would really impact your performance. Anyway, moving on. Here's the star of the show, the power brick. - [Jono] What, why? - Because, I'm this is what Galien Knight tribe. Hundred watts over type C. This thing's wicked, Jono, star of the show. Absolute unit. No, here's the actual star of the show. Are we allowed to call it just a Surface Pro but good, Jono? Yeah, this is essentially a Surface Pro, but good. Microsoft has struggled a lot to cool, you know, two, four cores in a CPU and not turn the back of the chassis into a frying pan. So the first thing that's super cool about this design is see through plastics. Love it. I absolutely adore that that's coming back. It just looks cool. And it's kind of nostalgic while also just being freaking awesome. We also have fan intakes here and here, it looks like. What do we have here for call on activity? It looks like we have Thunderbolt four. This right here is the XG GPU port. Although I believe you can use that as a type C. There we go. Rubber thing, super easy to get out. There's our XG connect port. And if you want, there is another USB type C on the side of it that you can use. Right on the other side we have our power button, volume button, full size type A port; that's pretty impressive. And headphone microphone combo jack. How did they fit in so much performance and also completely destroy the Surface Pro's IO Jono? - [Jono] They actually listened. - Ooh, let's open her up though. - [Jono] That looks so cool. - Yeah, this does look really cool. I have to say I was kind of skeptical about this thing because like tablets, but it looked sweet. - [Andy And Jono] Ooh. - [Jono] It glows, whoa, RGB on the back. - [Andy] RGB on the back. - What are you guys seeing? Oh, that is really fancy. Okay, yep. Keyboards working fine. Edge is not working. That's great. Thank you, Microsoft for your incredible software. The first thing I was concerned about with this laptop is the super small track pad. Out of the box, I wasn't a huge fan but after disabling mouse acceleration, it's not bad. I'm sure you'll get used to it in a second. Also the keyboard: keyboard's great. Like it's the kind of thing where obviously it's not as good as an actual laptop. Like you can see here, Andy, probably there is some flex in it, but I also have seen worse in laptops. And if you want, you know the traditional clam shell design, they have the Flow X13. And so you should just buy that if you want a traditional clam shell design. If you do go for a traditional laptop, though what you can't do is this: remove the keyboard. So that allows you to, you know, not have a keyboard. You could put whatever keyboard you want right here use that, or just, you know, use it very simply as a tablet. This also would probably be awesome to have on a plane cuz you're always just running out of space there. This I see is kind of like the dorm room hero of a little laptop. This thing would be awesome to have with a bunch of your friends, just like plop it anywhere. Good, we can play some games. As I've alluded to the really impressive thing about this laptop are the specs like look at how thick this is, Andy, it's a tablet, but it's got 20 threads. What the hell? So in this we have an i9 12900H, that's a 45 watt processor, again in a tablet. We also have a NVIDIA RTX 3050Ti, along with 16 gigabytes of RAM at 5,200 mega transfers per second that has to be DDR5, one terabyte SSD, Intel WiFi 6E, basically all of the best stuff. I'm guessing it's also incredibly expensive and it is very expensive. This unit right here is 1899. You can definitely get more power for the price but you know, look at it. Those are much, much bigger. Now, one thing I was curious about is how Xbox controllers play with this. I'm assuming that they have batteries in the controller first of all, but I would assume that they have an Xbox controller dongle integrated into this, which would be awesome because otherwise we need one of those big old wireless, Xbox controller dongles hanging out of the side whenever we want to use it. That's not very elegant. So I just pressed the pair button here. It immediately popped up on this that I wanted to connect and did it? Failed to pair, okay. That wasn't as flawless as I was hoping. So wait, does that mean that you can just pair Xbox series controllers over Bluetooth to your laptops? - [Jono] Guess so. - That is sick. Ha ha. Controller's ready to go. Wow, it's amazing how things just work once you've updated everything. Okay, do we get to game on it? I think we finally get to game on it. Heck yeah. Oh, here we go. Excellent. 120 Hertz gotta enable that. So we have a 1920 by 1200p display going at 120 Hertz 16 by 10, fricking love that, we also have an eight bit color depth. And what did you say? Hundred percent DCI-P3. Okay, don't know exactly what the color space is but it has Dolby vision support and it's Pantone Validated. So all the colors should be nice and accurate, yeah. So we're here in Forza Horizon 5, 10 ADP. It looks like that we're getting 60 to 70 FPS on low. Now that might not sound amazing but this game looks really good. Even on low settings. And remember, this is, this is a tablet. Like it is absolutely incredible that we can play a game that looks like this record it at the same time and still be getting 70 FPS. Like this is incredible. What it's doing right now. It's also nearly silent. I'm really impressed with how it's not making absolute racket. How are the speakers on this? That's really quite good. Like this is loud enough. - [Game] Go Team Motorcycle. - That you could very easily, if you're playing a game with a couple of your friends - [Game] Daredevil bikers. - You know, use these speakers effectively while having a group of dudes around it. Or gals. Yeah, like as far as just like a casual gaming experience goes, this is very good. There is a chance though that you saw that and we're like 60 FPS. What is this? I'm a PC gamer. I can't live with that. And I want to give ASUS a whole bunch more money. That's where the XG mobile comes in. Oh, so this is pretty sweet. Now you've got your multi-monitor display. You can look at lttstore.com and at the same time you can boot up your games on the other screen. So we go to Start Manager GPU RTX 30/80. Oh yeah. So now we've got our lttstore.com open. We've got Forza up top, which is a 1440p on high. I think that's what we'll get away with, with a mobile 30/80, which to be clear, the 30/80 in this eGPU is not a desktop 30/80. Like, you're probably wondering how the heck is it so small and it's 30/80. It isn't a 30/80, it's more like a 30/70 on the desktop but they call it a 30/80 in laptops. It's the same dye. 16 gigs is a big RAM though, pretty sweet. Okay, Andy, you have to say, this is pretty sweet. - [Andy] Oh yeah. - Oh, one-sixty, a hundred sixty FPS. You cannot complain about that. We could probably increase the graphics a little bit but I'm one to go for 160 FPS over ultra quality and 140 FPS. This is clearly very awesome. Especially that you have that's, it's running off a tablet. Like, can you guys believe that? - [Jono] And an eGPU. - Yeah, it's a tablet and an eGPU. But like if you have bolder tier cash this is a really awesome way to have like your cake and eat it too with a laptop. Now, one thing that makes this so sweet is that it has a vapor chamber in there. So instead of having heat pipes that might dedicate a certain amount of your cooling to the GPU, certain amount to the CPU the vapor chamber's able to just take all that heat and sort of put it wherever it needs to go. It doesn't really care. So when you have it as a tablet the GPU and the CPU are going to be vying for all of that heat dissipation. Whereas in a setup like this, the GPU is basically off and the CPU gets all of the, you know thermals that this has built into it. So that's why you're able to have a super awesome situation where you're doing 160 FPS on a mobile CPU with an eGPU. Okay, so this thing is clearly a small gaming beast. What I'm curious of is can you upgrade it? Can you repair it? I don't know. It's the kind of device where I don't expect it to really, you know be upgradeable, but if it is, that's a massive bonus. I do see screws on the back. One thing that I didn't notice before is that there appears to be a little SD card reader right here. So you could slot one in for additional storage. So it looks like with just one screw you can take this little cover off and have access to your SSD for upgrading. That's pretty awesome. Look at that Andy. Yeah, I'm getting real if we want to get into this we gotta break out the heat gun vibes and I'm not in a heat gunning this and destroying it kind of mood right now. It is too bad that we couldn't open it up. I really wanted to check out the big old vapor chamber that goes all the way along here. Underneath it there is liquid metal. That's how you keep your parts all nice and cool. And also there is a muck switch so that your GPU goes directly through your CPU and doesn't have, you know the associated losses with that. Before we head out, I just want to quickly see how good this webcam is. Okay, front facing camera looks pretty good. This is more than acceptable for your typical like tablet or laptop. Let's see about the back facing. Okay, yeah. So this is actually pretty decent. It's pretty much, you know what you'd expect from a normal phone camera except it's in a laptop. So that makes it way more impressive. Cuz they're always so (bleep) on laptops. Anyway, Flow Z13. Huge thanks to ASUS for sponsoring this video. Oh, Jona wants me to mention that there's a 4k 60 Hertz version. Don't buy it. If you do, you're an idiot. Thanks for watching. Goodbye, have a good day.",
    "transcript_keywords": [
        "thing",
        "GPU",
        "laptop",
        "Yeah",
        "good",
        "ASUS ROG",
        "pretty",
        "FPS",
        "tablet",
        "CPU",
        "ASUS",
        "ASUS ROG super",
        "awesome",
        "Surface Pro",
        "ROG",
        "kind",
        "cool",
        "Xbox",
        "Game",
        "ROG Bounce"
    ],
    "transcript_entity_values": [
        "16 gigabytes",
        "Forza",
        "FPS",
        "Galien Knight",
        "Thunderbolt",
        "Intel",
        "DDR5",
        "Hertz",
        "1920",
        "Forza Horizon 5",
        "RAM",
        "One",
        "60",
        "one",
        "4k",
        "USB",
        "NVIDIA",
        "ASUS ROG",
        "Three 5/8",
        "Fusion II 500",
        "ROG Bounce",
        "3050Ti",
        "John O",
        "1200p",
        "30/70",
        "160",
        "Andy",
        "1899",
        "second",
        "10/70",
        "about 10/60",
        "Dolby",
        "Hundred percent",
        "Microsoft",
        "Jono",
        "ROG",
        "45 watt",
        "DCI-P3",
        "10",
        "a good day",
        "first",
        "ADP",
        "16",
        "the Surface Pro's",
        "two",
        "120",
        "the Flow X13",
        "one-sixty",
        "5,200",
        "70 FPS",
        "four",
        "Controller",
        "GPU",
        "60 FPS",
        "30/80",
        "Jona",
        "XG",
        "the XG Mobile",
        "RGB",
        "Hundred watts",
        "XG",
        "Xbox",
        "CPU",
        "SD",
        "140",
        "ASUS",
        "eight",
        "a hundred sixty FPS",
        "20",
        "SSD"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.09303673356771469,
        -0.009152742102742195,
        -0.04497571289539337,
        -0.08496875315904617,
        0.06977065652608871,
        0.02008972130715847,
        0.056516554206609726,
        0.0481412410736084,
        -0.025626087561249733,
        0.06668553501367569,
        -0.008933077566325665,
        0.033743467181921005,
        0.0006042168824933469,
        -0.0075351037085056305,
        0.0005017159273847938,
        0.037515778094530106,
        0.07263797521591187,
        -0.06369834393262863,
        -0.04410182684659958,
        0.029448198154568672,
        0.014703638851642609,
        0.023118888959288597,
        0.047561269253492355,
        -0.04189247265458107,
        0.024660956114530563,
        -0.010551029816269875,
        0.02088656835258007,
        -0.042346738278865814,
        -0.0027162504848092794,
        0.015193093568086624,
        -0.018261687830090523,
        0.003837802680209279,
        -0.009932437911629677,
        0.001800844445824623,
        -0.014337915927171707,
        -0.09360258281230927,
        -0.04226590692996979,
        -0.03878664970397949,
        -0.09214401245117188,
        -0.11637021601200104,
        -0.060315292328596115,
        -0.015882685780525208,
        0.007651355117559433,
        -0.01902306079864502,
        0.027869002893567085,
        -0.040515728294849396,
        0.003202043706551194,
        -0.024447927251458168,
        -0.011046147905290127,
        0.10490969568490982,
        0.027687476947903633,
        -0.07125648856163025,
        0.024518266320228577,
        -0.050561871379613876,
        -0.09926557540893555,
        0.006409658584743738,
        -0.036262813955545425,
        0.01803010143339634,
        0.03872041404247284,
        -0.021753285080194473,
        0.06848021596670151,
        -0.07468307763338089,
        -0.011240980587899685,
        0.03490850329399109,
        -0.0325021967291832,
        0.005115298088639975,
        0.009063506498932838,
        0.010745239444077015,
        -0.01191669050604105,
        -0.04832611605525017,
        -0.03617660328745842,
        0.00927781779319048,
        0.026682084426283836,
        -0.000604633882176131,
        0.010671275667846203,
        -0.013509594835340977,
        0.03026524931192398,
        -0.0006654401076957583,
        -0.03836670145392418,
        0.03265341371297836,
        0.006751709152013063,
        0.047427091747522354,
        -0.03344475105404854,
        0.011086814105510712,
        0.030485978350043297,
        -0.02764231711626053,
        0.014208887703716755,
        0.05069177597761154,
        -0.043852537870407104,
        -0.055229995399713516,
        -0.06131448596715927,
        0.09837599098682404,
        0.007911811582744122,
        0.01541763823479414,
        -0.03653716295957565,
        -0.08995385468006134,
        0.05838771164417267,
        -0.09682983160018921,
        -0.051433537155389786,
        0.06855243444442749,
        -0.008555513806641102,
        0.07609523832798004,
        0.06386445462703705,
        -0.011903565376996994,
        -0.025401460006833076,
        -0.08424343913793564,
        0.011116991750895977,
        0.01245073787868023,
        -0.02395881526172161,
        -0.011050759814679623,
        -0.030128441751003265,
        -0.038528624922037125,
        -0.08475057780742645,
        -0.02117975614964962,
        0.037246618419885635,
        0.006319954060018063,
        -0.06049022451043129,
        0.017444783821702003,
        0.05942317098379135,
        -0.022511089220643044,
        -0.012084505520761013,
        -0.01360238902270794,
        -0.049038998782634735,
        -0.043689608573913574,
        0.057902608066797256,
        0.06944157928228378,
        -0.035322610288858414,
        2.7717671900969825e-33,
        -0.03401117026805878,
        0.05018478259444237,
        -0.02167319320142269,
        -0.05910138785839081,
        0.025195078924298286,
        0.01034835446625948,
        0.054003000259399414,
        0.000491226208396256,
        0.09153322130441666,
        0.020827246829867363,
        -0.09557725489139557,
        0.015946850180625916,
        -0.09480137377977371,
        0.05409274622797966,
        0.0056677632965147495,
        -0.11916615068912506,
        0.02016911469399929,
        -0.022690515965223312,
        -0.04321657866239548,
        0.007502295542508364,
        0.01758146844804287,
        -0.02983318641781807,
        -0.0018337926594540477,
        -0.0745309516787529,
        0.02790897898375988,
        0.010340903885662556,
        -0.009744633920490742,
        0.06979723274707794,
        0.07757600396871567,
        0.024229003116488457,
        -0.049835070967674255,
        -0.0925564095377922,
        -0.07603789120912552,
        -0.09060947597026825,
        -0.009388015605509281,
        -0.025185484439134598,
        -0.09847564995288849,
        -0.11034169793128967,
        0.13186602294445038,
        0.029889661818742752,
        -0.07731236517429352,
        -0.03703709691762924,
        -0.03986649215221405,
        -0.048538848757743835,
        -0.015680793672800064,
        -0.025670360773801804,
        -0.0036050176713615656,
        0.015839679166674614,
        -0.023243555799126625,
        -0.041429344564676285,
        -0.01365366019308567,
        0.020063569769263268,
        -0.05613918974995613,
        -0.009604678489267826,
        0.00755492364987731,
        -0.1339387446641922,
        -0.029905734583735466,
        0.09228162467479706,
        0.07445741444826126,
        0.1078006848692894,
        0.05116131529211998,
        -0.07138101756572723,
        -0.019150974228978157,
        0.018070003017783165,
        -0.07994191348552704,
        -0.010554003529250622,
        0.14421607553958893,
        0.03107599727809429,
        -0.10570621490478516,
        -0.08314214646816254,
        -0.01427031122148037,
        0.05640200525522232,
        0.03129735216498375,
        -0.07809854298830032,
        -0.0023586158640682697,
        -0.025520628318190575,
        -0.014793501235544682,
        -0.009530720300972462,
        -0.05983218550682068,
        -0.0445837564766407,
        -0.07224874198436737,
        0.07309155911207199,
        -0.007496859412640333,
        0.0074154227040708065,
        -0.06664538383483887,
        -0.020297029986977577,
        -0.005188648123294115,
        -0.10125800222158432,
        -0.06666762381792068,
        0.003337747883051634,
        -0.05656299367547035,
        0.022598423063755035,
        -0.05668078362941742,
        -0.022731877863407135,
        0.02433086186647415,
        -5.400104967610445e-33,
        -0.11917844414710999,
        -0.020868076011538506,
        -0.03878755122423172,
        -0.0011152204824611545,
        -0.006971290335059166,
        -0.01588089019060135,
        0.1005692258477211,
        -0.016374792903661728,
        -0.03805479034781456,
        -0.09555944055318832,
        0.0075800069607794285,
        0.058278270065784454,
        -0.019520040601491928,
        0.0047514429315924644,
        0.04203536733984947,
        -0.013966611586511135,
        0.012491397559642792,
        -0.04526496306061745,
        0.08680091798305511,
        -0.017496710643172264,
        0.0596015602350235,
        0.053294818848371506,
        0.04607187956571579,
        0.03578338772058487,
        -0.014366861432790756,
        -0.031678054481744766,
        0.03983340784907341,
        -0.01128050871193409,
        0.006866152863949537,
        0.10384855419397354,
        0.021662980318069458,
        0.001309855724684894,
        0.048578500747680664,
        0.008877935819327831,
        0.06135200336575508,
        0.020388083532452583,
        0.0801234021782875,
        -0.04748029261827469,
        -0.060281649231910706,
        -0.05862190201878548,
        0.07693158090114594,
        -0.053734712302684784,
        0.007491414900869131,
        -0.011765279807150364,
        0.08506369590759277,
        5.5926720960997045e-05,
        -0.07066889107227325,
        -0.01885008066892624,
        -0.008865234442055225,
        0.010313550941646099,
        -0.00941088330000639,
        -0.009909422136843204,
        -0.02791895717382431,
        -0.032258618623018265,
        0.03937925770878792,
        -0.049185559153556824,
        0.02268179878592491,
        -0.024470360949635506,
        -0.03736107423901558,
        -0.08479013293981552,
        0.04901764541864395,
        -0.009104120545089245,
        -0.020380038768053055,
        -0.010045526549220085,
        0.01872566156089306,
        0.1140977293252945,
        0.12832581996917725,
        -0.0157318152487278,
        0.04120113328099251,
        0.09714234620332718,
        -0.04535440355539322,
        -0.013191803358495235,
        0.0008531419443897903,
        -0.04027283191680908,
        0.0005988118937239051,
        0.055373236536979675,
        0.057391464710235596,
        0.021808898076415062,
        -0.04242640361189842,
        -0.07169928401708603,
        -0.011218671686947346,
        -0.010277948342263699,
        0.10131688416004181,
        -0.045934051275253296,
        0.010182380676269531,
        -0.020455408841371536,
        -0.0012471515219658613,
        -0.06313367933034897,
        -0.06857512146234512,
        0.08223406225442886,
        0.011119507253170013,
        -0.04755687341094017,
        -0.034387871623039246,
        0.11457297205924988,
        0.020939160138368607,
        -5.648590573059664e-08,
        -0.0010694032534956932,
        0.05115342140197754,
        0.07912994176149368,
        -0.01062861643731594,
        -0.06783704459667206,
        -0.006708164233714342,
        0.09560414403676987,
        -0.0563909076154232,
        0.025483902543783188,
        -0.041542280465364456,
        -0.01745344139635563,
        -0.1004352793097496,
        0.046728409826755524,
        0.018436318263411522,
        0.0722237154841423,
        0.15100982785224915,
        -0.01949045993387699,
        0.09070324897766113,
        3.479436054476537e-05,
        -0.047346580773591995,
        0.03487033024430275,
        0.053239595144987106,
        0.031019436195492744,
        -0.02082114852964878,
        0.08415717631578445,
        0.031550973653793335,
        -0.07461947947740555,
        0.06848827749490738,
        0.07187061756849289,
        -0.06904852390289307,
        -0.04014332592487335,
        -0.05520477145910263,
        0.06958130747079849,
        0.002770235063508153,
        0.019714869558811188,
        -0.04227953776717186,
        -0.004825378302484751,
        0.034417808055877686,
        0.05047990009188652,
        0.059110745787620544,
        -0.0402175635099411,
        0.011304576881229877,
        -0.060254037380218506,
        -0.01797865517437458,
        0.014782105572521687,
        0.007465909235179424,
        -0.02475414052605629,
        -0.05960611253976822,
        0.010878854431211948,
        0.0792735293507576,
        -0.022327661514282227,
        0.028968937695026398,
        0.062357958406209946,
        0.04295448586344719,
        0.019574342295527458,
        0.058482084423303604,
        -0.021820684894919395,
        0.007836193777620792,
        -0.0214683935046196,
        0.05781019106507301,
        -0.07013814896345139,
        -0.010580221191048622,
        -0.02141062542796135,
        0.07957907021045685
    ]
}