{
    "id": "X595hwVa5f4",
    "title": "This year will be huge for electric cars. Here’s why.",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-02-16T15:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=X595hwVa5f4",
    "category": "Science & Technology",
    "tags": [
        "electric cars",
        "cars",
        "ev",
        "tesla",
        "cybertruck",
        "trucks",
        "electric",
        "rivian",
        "lucid",
        "new electric cars",
        "elon musk",
        "rivian r1t",
        "lucid air",
        "rivian r1s",
        "range",
        "price",
        "technology",
        "gadgets",
        "hummer ev",
        "tech",
        "tech news",
        "verge",
        "the verge",
        "hummer",
        "electric cars 2020",
        "nissan ariya",
        "electric cars 2021",
        "best electric cars",
        "amazon",
        "electric vehicle",
        "electric truck"
    ],
    "views": 256968,
    "likes": 7901,
    "comments_count": 601,
    "description": "2021 is shaping up to be a blockbuster year for electric cars. Nearly three dozen EVs from 20 automotive manufacturers are expected to go on sale this year. We zero in on seven of those EVs to talk about what they mean for the future of electric mobility.   Learn more:   0:00 Intro 0:37 Tesla Cybertruck 1:43 GMC Hummer EV 2:58 Rivian R1T and R1S 4:06 Rivian Amazon Delivery Truck 4:20 Volkswagen ID.4 6:22 Ford Mustang Mach-E 7:10 Nissan Ariya 9:04 Lucid Air 10:14 EV Startups 10:48 Tesla Model S and X Interior Updates 11:07 Conclusion  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/3rWsaNK",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- We hear a lot about electric vehicles these days, but EV's are still just a tiny fraction of the overall car market. According to the international energy agency plugging cars account for about 1% of US car sales and about 2.6% of global auto sales. - But experts are predicting that 2021 will be a crucial year for EV adoption, thanks to more options and growing interest from car buyers. So, we thought we'd zero in on seven different EVs that are coming out this year. And talk about what they tell us about where things are headed in the future, because this wouldn't be a Verge video if we weren't talking about the future. (gentle music) - There's probably no more polarizing electric vehicle coming this year than Tesla's cyber truck. The stark steel body and blade runner inspired design are unlike anything else on the market right now, gas or electric. Something Tesla has been really good at over the years is pushing legacy automakers out of their comfort zones. without Tesla, we probably wouldn't see wide adoption of touchscreen displays in cars or have so much hype around self-driving tech and without Tesla, it's hard to imagine any of these big OEMs seriously investing billions of dollars into electric vehicles. Will the cyber truck inspire similar changes? Probably not, but it is refreshing to see something so different coming to market. So, if the cyber truck is successful maybe it'll give some of these automakers just a little bit more wiggle room to try something new in their designs. The cyber truck will also just help prove out the market for large electric SUV's and trucks which is a potential goldmine just based on the popularity of their gas counterparts. More will come later like the electric F-150 or the Hummer EV, but Tesla says it's already collected more than half a million 100 dollar deposits for the cyber truck. So, that market's already off to a pretty good start. - I couldn't believe it when I first heard that GM was resurrecting the Hummer brand as an EV. The gas guzzling symbol of pre-recession excess as an electric pickup truck, forget about it, but GM did it. And the Hummer EV is expected to crab walk into dealerships by the end of this year. It will come with a 24 module double stacked Ultium propulsion system. Ultium is GM's modular battery platform and that is expected to deliver at least 350 miles of range. With three motors and two drive units. The Hummer EV is expected to get up to a thousand horsepower and an estimated 11,500 pound feet of torque, but it won't be cheap starting at $80,000 for the base model and over $110,000 for the highest spectrum. GM went overboard with the tech in this thing, adaptive air suspension that can raise the vehicle six inches, 18 cameras, including front and rear under body cameras to spy any Rocky obstacles. The ability to charge 100 miles in 10 minutes. And of course, crab walk mode, which enables all four wheels to turn in the same direction and move the vehicle sideways. Look at that Hummer scuttle. After more than a decade of working in the shadows, EV startup Rivian is finally ready to release it's R1T pickup and it's R1S SUV later this year. the R1T is an ultra modern rethink of what a pickup truck should look and feel like, without going outside the box, like the cyber truck. The R1S is a Land Roverish SUV, that's a little more familiar. Both started around $70,000, offer at least 300 miles of range and are decked out in fun, outdoorsy features. Like an optional pop-out camping kitchen. Delivery's start later this year. A few years ago there were EV startups popping up left and right, all claiming to be the next Tesla. And one of the reasons they never accomplished that is just money. It takes a lot of money to design, test, and build cars at scale. Rivian, meanwhile has raised more than $8 billion to date including from really big backers like Amazon and Ford. It's applied that money well so far. It's developed new battery technology that it thinks is going to help set it apart from other entries on the market. It's also gone all out in developing this very particular branding of affluent off-roading adventure that appeals to buyers with deep pockets. Rivian's also making a delivery truck for Amazon as part of that investment. That's already being tested on public roads right now. And while that's maybe not as alluring as the pickup truck, it just might be the first electric vehicle driving through your neighbor. (light music) - We've seen the Porsche Taycan and we've seen the Audi e-tron and e-tron GT, but the ID.4 is arguably the most important EV for the Volkswagen group. Which is the second largest automaker in the world. First introduced in 2020, the ID.4 is VWs first long range EV for the U S. VW expects to deliver over a 100 thousand ID.4s in 2021, a third of which to US customers. And it's the second car to use VWs modular MEB platform for EVs after the ID.3, which is only available in Europe and China. The ID.4 is interesting, because it has all the SUV DNA that car buyers really crave these days. It's the right size. It has the right styling. And when you factor in federal state and local tax credits the price drops to that mid $30,000 range, that's generally considered to be the sweet spot for most American car buyers. That's cheaper than the Tesla Model Y, which VW will be competing with. But it's important to remember how the ID.4 got here, Dieselgate. In addition to nearly $35 billion in settlements and fines, VW vowed to spend billions more on a whole new lineup of electric vehicles in the hopes of rescuing its damaged reputation. Now, the automaker has promised to sell over a million battery electric vehicles by 2025 to make up for illegally concealing how much pollution it's diesel vehicles were creating. And it's also pumping millions more into an EV charging station expansion through its subsidiary, Electrify America. Better charging infrastructure will go a long way towards speeding up the adoption EVs, but only if VW can actually meet its goals. Now, there's a good argument that could be made that if VW had not got caught cheating on its emissions test that the ID.4 would not be rolling out to dealerships this year, if ever. And those EV charging stations could still be on the drawing board. It's funny how culpability works like that. - What are you driving? - An electric Mustang. - What the? That is so sweet. - Ford made a huge bet with the Mustang Mach-E, and while it's still early, it looks like that bet could pay off. The Mustang Mach-E is a really good electric car and will be one of the best for a while until the market really fills out. It has the kind of tech that early adopter customers tend to love, but without the obvious problems that usually surface when old automakers test new waters. I got really into the details with the Mustang Mach-E in my review which you should definitely go watch if you want to learn more. But best of all, for Ford, they've really excited a whole bunch of different conversations with this car. Is it a Mustang? should a Mustang be electric? Should a Mustang be an SUV? There are more people asking those questions than ever really paid attention to Ford's fairly weak early electric vehicle efforts. So, that's exciting. Cars like the Mustang Mach-E don't come around often. - One EV that's flown under the radar so far, is the Nissan Ariya, another compact SUV with a little less than 300 miles of range. The Ariya is expected to go on sale in Japan in mid 2021 followed by the US and Europe later in the year. Everyone gives Tesla credit for making EVs popular and Tesla certainly deserves it, but Nissan has long been an unsung leader in EV sales. Despite really only having one EV. The highly functional, mostly uninspiring Nissan LEAF. And don't forget Renault the French car maker, that's allied with Nissan and Mitsubishi, has been pumping out miniature Zoe's for years now with a high degree of success, but now Nissan is readying it's sequel. The Ariyas drive train is what really differentiates it from the LEAF. Rather than opt for a simple front wheel drive arrangement, the Ariya will come in multiple configurations, including a two-wheel drive version and a twin electric motor set up that will enable all wheel drive performance, which Nissan is calling the e-4orce. with a four instead of an F, because everything needs a ridiculous brand name. This is not an over-designed car. If anything, it's exceedingly normal looking, which for an EV can be a relief. The Ariyas wheels certainly stand out, but nothing else about this vehicle screams electric. Which could help lure or potential buyers who are weighing whether to make the switch from gas powered vehicles. Like the ID.4, the Ariya is expected to retail from around 30 to $35,000 after factoring in tax credits. Now, Nissan is claiming this is the most technologically advanced car that it's ever made. And the tax credit is sure to soften the blow for some customers, but Nissan is quickly approaching the threshold of 200 thousand EVs sold in the US and after that the credit begins to phase out. And then the value proposition on a 40 thousand dollar EV that can't travel as far as a Tesla in a single charge, starts to dwindle. (light music) - Not every electric vehicle coming to market this year is a truck or an SUV. Believe it or not, some companies are still making sedans. One EV startup that's releasing a luxury sedan this year is Lucid Motors. Which will finally start selling the Air The interior of the Air is inspired by a private jet, according to Lucid, but the car doesn't skip on specs either. With up to a thousand horsepower and over 500 miles of range. Lucid Motors has a long history for an EV startup, having been founded in 2007 as a battery company. And it's currently helmed by a former Tesla executive who helped bring the model S to light. But the path to now hasn't been easy. The company almost went under a few years ago, because it pretty much ran out of money. Lucid Motors ultimately turned to ironically, oil rich Saudi Arabia. Now, the startup is looking at building another factory in Saudi Arabia and its future is sort of indefinitely tied to the kingdom. Lucid Motors may not be around today without that money, but if it had been able to hang on for just a little while longer, it might've had another option, merging with a special purpose acquisition company or SPAC. These types of mergers have become really popular over the last year as interest swelled in electric vehicles. As a result, a few billion dollars has been directed at previously struggling or under funded startups like Variety Future, Cando, Nikola, and Fisker. It's the kind of development that could really change the course of the budding electric vehicle market, but right now it's just a little too early to say how. (light music) - Many of these vehicles have been on the horizon for years. And all of them are expected to go on sale this year not withstanding any more delays, but while these EVs help us understand where things are headed, the automotive industry is still lumbering through a gigantic sea change right now. - Like Tesla's existing vehicles which are growing, ever popular. And the company even just went back and did a big redesign of it's a model S sedan and model X SUV. Or then there's China, which is the biggest market for electric vehicles in the world and is really driving a lot of the things that we're seeing happening here in the US. There are some really interesting cars being made there, like the Polestar 2 and there are just a lot of really interesting startups there, like NIO and Xpeng. We'd actually love to talk more about that. So, if that's something you want to see us make a video about, let us know in the comments below. - If you haven't already definitely watch our review of the Ford Mustang Mach-E - Check that out, we had a lot of fun making that video and be sure to like, and subscribe.",
    "transcript_keywords": [
        "electric",
        "electric vehicles",
        "Tesla",
        "cyber truck",
        "year",
        "Mustang",
        "truck",
        "car",
        "electric vehicle coming",
        "Mustang MachE",
        "Tesla cyber truck",
        "vehicles",
        "SUV",
        "Nissan",
        "market",
        "vehicle",
        "electric vehicle market",
        "Lucid Motors",
        "Hummer",
        "years"
    ],
    "transcript_entity_values": [
        "zero",
        "American",
        "e-4orce",
        "ID.3",
        "three",
        "millions",
        "Air",
        "F-150",
        "Fisker",
        "Nissan LEAF",
        "A few years ago",
        "EV",
        "the end of this year",
        "six inches",
        "Ariya",
        "One",
        "billions of dollars",
        "100 miles",
        "Variety Future",
        "nearly $35 billion",
        "an estimated 11,500 pound feet",
        "Cando",
        "up to a thousand",
        "2025",
        "40 thousand dollar",
        "SPAC",
        "Electrify America",
        "18",
        "Mustang",
        "S",
        "GT",
        "the last year",
        "GM",
        "Porsche Taycan",
        "around 30 to $35,000",
        "Audi",
        "over $110,000",
        "more than $8 billion",
        "at least 300 miles",
        "more than half a million 100 dollar",
        "2020",
        "later in the year",
        "Tesla",
        "The Hummer EV",
        "VW",
        "Hummer",
        "Nikola",
        "Xpeng",
        "around $70,000",
        "this year",
        "China",
        "first",
        "Polestar 2",
        "Roverish",
        "Mustang",
        "Renault",
        "Rivian",
        "80,000",
        "about 2.6%",
        "Tesla Model Y",
        "Ariyas",
        "30,000",
        "VWs",
        "Tesla",
        "about 1%",
        "US",
        "at least 350 miles",
        "mid 2021",
        "Saudi Arabia",
        "over a million",
        "more than a decade",
        "a thousand horsepower and over 500 miles",
        "100 thousand",
        "Ultium",
        "billions",
        "Zoe",
        "these days",
        "later this year",
        "second",
        "2021",
        "First",
        "Ford",
        "the Hummer EV",
        "one",
        "a crucial year",
        "four",
        "a few billion dollars",
        "Volkswagen",
        "today",
        "Europe",
        "F",
        "years",
        "the years",
        "a few years ago",
        "Mitsubishi",
        "200 thousand",
        "Nissan",
        "two",
        "Amazon",
        "French",
        "24",
        "Lucid Motors",
        "a third",
        "Japan",
        "Dieselgate",
        "MEB",
        "the U S. VW",
        "10 minutes",
        "Rivian",
        "2007",
        "Mustang Mach-E - Check",
        "seven",
        "Ariyas"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "GPE",
        "ORDINAL",
        "PRODUCT",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERCENT",
        "ORG",
        "LOC",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "GPE",
        "QUANTITY",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "LOC",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "NORP",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.01725281961262226,
        0.006611798889935017,
        0.057421229779720306,
        -0.0003370362101122737,
        0.09136035293340683,
        0.016198642551898956,
        -0.04466396942734718,
        0.059544797986745834,
        -0.023132553324103355,
        -0.0038390883710235357,
        -0.0095797348767519,
        0.018210818991065025,
        0.03662838041782379,
        -0.008494289591908455,
        0.04467203840613365,
        -0.03887271136045456,
        0.02307487092912197,
        -0.1150524765253067,
        -0.0006265933625400066,
        0.010788229294121265,
        -0.03932207450270653,
        0.024380555376410484,
        0.013124443590641022,
        -0.03340694680809975,
        -0.028599783778190613,
        0.030314235016703606,
        -0.02845037914812565,
        -0.011271936818957329,
        -0.06572844833135605,
        -0.054173242300748825,
        0.0026471824385225773,
        0.07025494426488876,
        0.010802218690514565,
        -0.029227806255221367,
        -0.03356676921248436,
        -0.06780090928077698,
        -0.00889703631401062,
        -0.017213160172104836,
        0.04414917156100273,
        -0.06863629817962646,
        -0.012438947334885597,
        -0.13216890394687653,
        -0.0354791060090065,
        -0.05725619196891785,
        0.026340462267398834,
        -0.04315076023340225,
        0.09004509449005127,
        -0.07754506170749664,
        0.03823590651154518,
        -0.06963680684566498,
        -0.01236814446747303,
        -0.07065431028604507,
        0.04536512494087219,
        -0.04067331925034523,
        -0.042244333773851395,
        -0.01895115338265896,
        -0.01975073292851448,
        -0.020574424415826797,
        0.018575962632894516,
        -0.01077198050916195,
        0.03876985237002373,
        -0.0784287080168724,
        0.02271159179508686,
        0.00022908141545485705,
        -0.04464780539274216,
        -0.047882724553346634,
        0.020671583712100983,
        0.05551322549581528,
        -0.03880462050437927,
        -0.015286578796803951,
        0.06724206358194351,
        -0.028408950194716454,
        -0.01515950821340084,
        0.006729136686772108,
        -0.014637863263487816,
        0.008500684052705765,
        0.1041528508067131,
        -0.012062644585967064,
        0.01931104250252247,
        -0.03202894330024719,
        -0.007883461192250252,
        -0.04373949021100998,
        -0.0674174576997757,
        -0.04425985366106033,
        -0.03348720073699951,
        0.03312956914305687,
        0.04989108815789223,
        -0.06504837423563004,
        -0.08035352826118469,
        0.03962584212422371,
        -0.02828861027956009,
        0.007151547819375992,
        0.03275221958756447,
        0.02961772121489048,
        0.022207096219062805,
        0.07334131747484207,
        0.005481824744492769,
        -0.08805463463068008,
        0.028060948476195335,
        -0.032476138323545456,
        0.009406198747456074,
        0.10176460444927216,
        0.05490279570221901,
        -0.035351503640413284,
        -0.08133881539106369,
        -0.022523170337080956,
        -0.004738511051982641,
        -0.03316393122076988,
        0.016387710347771645,
        -0.011364060454070568,
        0.06934292614459991,
        -0.03897632658481598,
        -0.09645570069551468,
        0.0031100912019610405,
        -0.060826435685157776,
        0.002216547029092908,
        -0.006066709756851196,
        0.023530330508947372,
        0.07242292910814285,
        0.0755382627248764,
        -0.021006938070058823,
        -0.001537767006084323,
        0.0037352691870182753,
        0.04214123636484146,
        0.09201992303133011,
        0.03996524214744568,
        -0.026409102603793144,
        7.752975929584274e-33,
        -0.13142351806163788,
        0.045709650963544846,
        -0.04962046816945076,
        0.019593343138694763,
        0.017623499035835266,
        0.04374166950583458,
        -0.00655366713181138,
        0.09434633702039719,
        -0.0025803386233747005,
        -0.012108515948057175,
        -0.019400369375944138,
        0.03563807159662247,
        0.02629268355667591,
        0.02047014608979225,
        0.022784391418099403,
        -0.0660243034362793,
        -0.0718170553445816,
        -0.02929571643471718,
        -0.09565866738557816,
        -0.06012369319796562,
        0.03450845927000046,
        -0.017390497028827667,
        0.07565264403820038,
        0.03753738850355148,
        0.04859289899468422,
        -0.05219698324799538,
        0.0872834324836731,
        -0.056980352848768234,
        -0.01192071195691824,
        0.033723458647727966,
        -0.020255843177437782,
        0.07379670441150665,
        0.00023726682411506772,
        0.04845350980758667,
        -0.03243759647011757,
        0.04936521500349045,
        -0.001820674748159945,
        -0.04552604258060455,
        -0.03395012393593788,
        -0.005974099971354008,
        0.020769262686371803,
        0.003301138523966074,
        -0.12161175161600113,
        -0.053427085280418396,
        0.0067183999344706535,
        0.04932278022170067,
        0.06246989220380783,
        -0.030364256352186203,
        -0.026034535840153694,
        0.012903374619781971,
        -0.049332939088344574,
        0.010529369115829468,
        0.005201467778533697,
        -0.013347175903618336,
        0.056029513478279114,
        0.023814240470528603,
        -0.04720798507332802,
        -0.0547122098505497,
        0.004916128236800432,
        -0.051954906433820724,
        -0.08994563668966293,
        0.0644528940320015,
        -0.0193136278539896,
        -0.04721666872501373,
        -0.04863578826189041,
        0.1062830463051796,
        0.06444302201271057,
        0.00821380503475666,
        -0.04788387194275856,
        0.0934872254729271,
        0.05716898292303085,
        -0.10624723136425018,
        -0.022631606087088585,
        -0.030108975246548653,
        0.09972824156284332,
        0.05855070427060127,
        -0.038314953446388245,
        -0.0020159464329481125,
        0.04228110611438751,
        0.06255035102367401,
        -0.05803200230002403,
        0.03981417417526245,
        0.02236693724989891,
        -0.02635989524424076,
        0.15985107421875,
        -0.09036482870578766,
        -0.013852495700120926,
        0.04254457727074623,
        0.014606441371142864,
        -0.017471564933657646,
        0.05189776048064232,
        -0.0032872366718947887,
        0.017173724249005318,
        0.07028000056743622,
        -0.034576062113046646,
        -9.943133494149344e-33,
        -0.027744000777602196,
        0.03941550850868225,
        -0.024042434990406036,
        0.04960881173610687,
        0.03531460836529732,
        -0.04132888838648796,
        -0.027653586119413376,
        0.08063499629497528,
        0.0013099010102450848,
        -0.023769237101078033,
        -0.015697401016950607,
        0.04229079559445381,
        -0.004821528680622578,
        0.010253104381263256,
        0.023090554401278496,
        -0.0427953265607357,
        -0.0011841292725875974,
        -0.0871518924832344,
        0.012437495402991772,
        0.017115896567702293,
        0.026709364727139473,
        0.011236689053475857,
        -0.02270643785595894,
        0.0464789904654026,
        0.04626280441880226,
        0.019097084179520607,
        -0.04370148107409477,
        0.014095792546868324,
        0.01105048693716526,
        -0.039501775056123734,
        -0.10558879375457764,
        -0.02199728786945343,
        0.03324650600552559,
        0.04924725368618965,
        0.016028469428420067,
        -0.015571133233606815,
        0.02962876483798027,
        -0.014702870510518551,
        -0.03692731261253357,
        -0.02087864652276039,
        -0.0032212187070399523,
        -0.06198122352361679,
        -0.020719008520245552,
        0.009007515385746956,
        0.013140854425728321,
        -0.047927260398864746,
        -0.060374144464731216,
        0.06892286241054535,
        0.061795663088560104,
        0.06403052061796188,
        0.07305806130170822,
        0.018585991114377975,
        0.016723182052373886,
        0.02477124333381653,
        0.008243202231824398,
        -0.0711294412612915,
        0.04021550714969635,
        0.09088113158941269,
        -0.052493564784526825,
        0.046884968876838684,
        -0.002056532073765993,
        0.00586162693798542,
        0.04449564963579178,
        -0.0016323121963068843,
        -0.0596417598426342,
        -0.16301876306533813,
        0.03248003125190735,
        -0.017817344516515732,
        -0.02503867633640766,
        -0.08247634023427963,
        0.014363053254783154,
        -0.02955036051571369,
        -0.1014532819390297,
        -0.10187698900699615,
        -0.13765491545200348,
        0.01147510763257742,
        0.06148471310734749,
        -0.07866101711988449,
        0.051952190697193146,
        -0.09212782233953476,
        0.026942329481244087,
        0.09040183573961258,
        0.03783396631479263,
        0.02158898301422596,
        0.0304615069180727,
        0.06177046522498131,
        -0.04593716561794281,
        0.01164746843278408,
        0.017390383407473564,
        0.0913938656449318,
        -0.034689296036958694,
        0.034134745597839355,
        -0.04882495850324631,
        0.049433376640081406,
        -0.07044161111116409,
        -5.9182077905006736e-08,
        0.05055892467498779,
        0.05121662840247154,
        0.05411478877067566,
        -0.015882449224591255,
        0.1285901814699173,
        -0.027004795148968697,
        0.008816859684884548,
        0.03226626291871071,
        0.03954312577843666,
        0.08538471907377243,
        0.09532836079597473,
        -0.0040508899837732315,
        0.05478203669190407,
        0.015688134357333183,
        0.02766789309680462,
        0.0118820546194911,
        -0.05109011009335518,
        0.02749307081103325,
        -0.03197932243347168,
        0.004062805324792862,
        0.037869252264499664,
        -0.012445304542779922,
        -0.03500571846961975,
        0.04915335401892662,
        0.05696325749158859,
        -0.06291741132736206,
        -0.027682805433869362,
        -0.06206250190734863,
        0.0029463828541338444,
        -0.07444716989994049,
        -0.07734058052301407,
        -0.036871109157800674,
        0.08044324070215225,
        0.024706607684493065,
        -0.04937843233346939,
        -0.09124507755041122,
        0.010087944567203522,
        -0.013467845506966114,
        0.03633241355419159,
        -0.07313420623540878,
        0.05377355217933655,
        -0.11825168877840042,
        0.011554637923836708,
        -0.032174527645111084,
        -0.0965287983417511,
        -0.08234664052724838,
        -0.07231031358242035,
        -0.09868265688419342,
        -0.001282511162571609,
        0.05737143009901047,
        -0.05462885648012161,
        -0.06124597415328026,
        0.010731922462582588,
        0.012971357442438602,
        0.026610352098941803,
        0.06048206612467766,
        -0.0893559455871582,
        -0.007749727461487055,
        -0.0233233030885458,
        -0.03808119148015976,
        0.0979018434882164,
        -0.050329145044088364,
        -0.013760906644165516,
        0.10181349515914917
    ]
}