{
    "id": "X8fBNsRt9bw",
    "title": "The Best $400 Android Smartphone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-10-14T17:35:23Z",
    "video_url": "https://www.youtube.com/watch?v=X8fBNsRt9bw",
    "category": "People & Blogs",
    "tags": [
        "best 400 smartphone",
        "best 400 android",
        "best android smartphone",
        "best 400 dollar phone",
        "honor 8 review",
        "axon 7 review",
        "oneplus 3 review",
        "moto z review",
        "moto z play review",
        "idol 4s review",
        "idol 4 review",
        "mrmobile",
        "captain2phones",
        "michael fisher",
        "android central",
        "pocketnow",
        "android authority",
        "best cheap smartphone",
        "honor 8 vs axon 7",
        "oneplus 3 vs moto z play",
        "best phones 2016"
    ],
    "views": 545519,
    "likes": 11709,
    "comments_count": 1474,
    "description": "Why does the best $400 smartphone matter? Well, today's flagship phones are so bombastic and feature-packed, it's easy to forget that many cost upwards of $700. As I was recently reminded when a certain company announced pricing for a certain device I was planning to buy *cough-MotoZ-cough*, that's an awful lot of money. In 2016, you can get a lot of smartphone for less than half that  and the proof has been sitting in MrMobile's studio for several months.   Join me as I take today's best $400 Android smartphones for a test drive! From the strange innovation of Alcatel's IDOL 4S to the build quality of ZTE's Axon 7 to the sheer beauty of Huawei's Honor 8, we'll see what each phone brings to the table ... and where each falls short. You may come away with some new additions to your holiday shopping list, or at least a revived appreciation for your $700 flagship.    [SUBSCRIBE]     [ABOUT THIS VIDEO]  MrMobile's Best $400 Android Smartphone Showdown was produced after time spent with the showcased devices, all of which are press review units on loan from their respective manufacturers. As of press time, all units had the latest software/firmware installed, and had been running those versions for at least five days. Shortest time spent with a device was the Axon 7 at 34 days; longest time spent with a device was the OnePlus 3 at 4 months.   [PRODUCTS IN THIS VIDEO]  OnePlus 3:   Moto Z Play:   Huawei Honor 8:   ZTE Axon 7:   Alcatel Idol 4S:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  Overflowing\" by Score Squad, available at Premium Beat:   \"Dubday\" by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/10",
        "http://mrmobile.tech/2t",
        "http://mrmobile.tech/2u",
        "http://mrmobile.tech/2v",
        "http://mrmobile.tech/2w",
        "http://www.premiumbeat.com/royalty_free_music/songs/overflowing",
        "http://www.premiumbeat.com/royalty_free_music/songs/dubday",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- There are some truly great Android smartphones out there. But the thing about great smartphones is that they often command great prices. And the fact of the matter is that today, you don't need to spend that much to get a solid smartphone. I'm Michael Fisher, and this is a $400 Android Showdown. (upbeat music) To be clear, this isn't a proper comparison, spec sheets and camera shootouts, because that'd take 20 minutes. And, frankly, it'd be overkill. One of the great things about Android phones in this class is that they offer quality that until recently was only available on flagships. I've been using this combination of devices for weeks now, and I don't much notice the processor differences or the slight bumps in RAM or other specs. On the design side, all of these feel at least nice in the hand, and you've got a pretty wide aesthetic choice. If you like beefy metal, you go with the Axon 7. Glass on glass, Honor 8. Boardroom glitz, Idol 4S. Conservative metallic, OnePlus 3. And oddball modular gadget, Moto Z Play. Now I've already reviewed both the OnePlus and the Moto, so for this video, I'm focusing on the phones that are newer to me, the ones from Honor, ZTE and Alcatel. Again, all of these pretty much cover the basics. You're getting a full HD or quad HD display. There's expandable storage on everything but the OnePlus. They're all efficient enough with power to get you through the day on a charge, and they've all got fingerprint scanners. And headphone jacks. Where the differences shine through is in the details. Of these three, it's probably the Idol 4S that's managed to cram in the most gimmicks. And I don't necessarily mean that as a dig. First of all, the phone ships with a VR headset at no additional cost. Along with a beautiful quad HD display and a pair of JBL ear buds to make that headset worthwhile. Bravo. Also, I love being able to pull the Idol from a pocket and know that whether it's right side up or upside down, the software is gonna line itself up automatically. That symmetry isn't confined to the X axis. The pass-through speaker ports also make it reversible front to back. And they're good speakers too. Also, the boom key is an awful lot of fun once you remember it's there. Do it in a call and you'll get extra volume. Do it when a song is playing for extra oomph. Do it in the gallery for a series of instant collages. The boom key is what happens when a manufacturer ties in creative software with a dedicated hardware feature. And I love it. The sad thing is it's in the wrong place. If you're right-handed, the boom key is where the unlock button should be, and vice versa. Yes, the phone still wakes up when you press it, but it doesn't lock with the boom key. Whereas the fingerprint sensor sits damn near flush with the casing, which means you get no tactile guidance on where to put your finger. Just think of how many times a day you unlock your phone, and imagine hunting around for an invisible sensor every time you do it. This one little annoyance right in the wrong place makes using the Idol 4S very frustrating. And it's lightweight, kind of unremarkable in-hand feel doesn't really help either. Software, not hardware, is the low point for ZTE's Axon 7. There are tons of features here, like voice unlock and a half-hearted implmentation of Moto's chop to flashlight feature, but overall it's the least polished software of the bunch. Software updates since launch have tidied up some of the translation errors and typos and weird behavior, but so much of this just screams 2012-era Samsung. Throwing on half-baked features just for the sake of doing it. I also found the display a little disappointing. It's quad HD, which is great, but I found its saturation pretty low, especially for an AMOLED panel. But if you care about sound quality, the Axon 7 is your jam. Each of the twin grills flanking the display hides a solid driver, and the sound hitting your face when you're watching a movie or streaming Spotify is just great. (exercise music) (laughter) Dolby Atmos and digital surround lend a little bonus to the ear bud experience, too. And this hardware, man, what a tank. If heavy metal is your thing, you want a huge battery or you're just dying to relive the glory days of HTC, the Axon 7 is your phone. Just make sure you're prepared to paint over the interface with a custom launcher. That's also what many reviewers recommend you do with the Honor 8. The EMUI interface, let's say, pays a lot of homage to IOS. But it's actually grown on me over the years. I appreciate things like the battery monitor, which snitches on apps that are wasting power in the background. Despite how goofy it looks, knocking on the display to take a screenshot is actually less awkward than fiddling with the side keys. The option to program shortcuts into the power button is very convenient. Mine is set to launch the camera with the double click and light the torch with the long press. And unlike on the Idol, this button, which is also the fingerprint scanner, is easy to find by feel. And even if you don't like the look of the interface, you've gotta admit it's visually cohesive. The frosted glass layering effects play nicely with the phone's hardware, whose fit and finish suggest a much more expensive piece of kit. The Honor 8 isn't immune to shortfalls, naturally. There are occasional software slowdowns, the screen is a little dim, and it's quote unquote only full HD. And even some basic features, like auto brightness, don't always work as they should. But when you combine the positives with niceties like the rare IR transmitter and the dual camera setup, you get a really compelling little package. Speaking of cameras, all these are serviceable, but none is gonna win you the Snapchatter of the Year award. For me, it was the Honor 8, with its color and monochrome sensors working together with a feature-packed interface, that took the camera cake. Your priorities may be different. (upbeat music) I don't usually crown one phone a winner over others, but using these three devices over several weeks, I have to admit I gravitated most often to the Honor 8. It doesn't have the stunning screen of the Idol or the sound quality of the Axon, but to me it's the phone that seems the most well thought out, the most unified, and it doesn't hurt that it's beautiful. But hold on a second. We're omitting the phones I've already covered, remember. And if we fold those back in, it becomes really tough for me to choose between the specced-out OnePlus 3 and the endless customizability of the Moto Z Play. The former packs a lotta power on the hardware side and makes all the right changes to Android. The latter takes a step back on specs, but it's battery and processor combo make for insane endurance. And I love the ability to give it new features at will with Moto Mods. But that's cheating, isn't it. The Moto Mods cost more, and the Moto Z Play is already 50 bucks over the $400 threshold. So unless you really need expandable storage, I've gotta give my overall choice in this showdown to the OnePlus 3. Once again, all these will cover the basics for the average person, and there's plenty on each one to make even a smartphone nerd happy. But if I were to recommend an Android in the $400 segment to the mythical average consumer, then, yeah, the OnePlus 3 is still the phone to beat. See Mr. Mobile's OnePlus 3 review and the one for the Moto Z Play on Mr. Mobile's YouTube channel, which I welcome you to subscribe to, so you're the first to know when a new video goes live. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "great Android smartphones",
        "Moto",
        "Android",
        "phone",
        "Idol",
        "Honor",
        "Android smartphones",
        "Moto Z Play",
        "great",
        "Moto Mods",
        "Axon",
        "OnePlus",
        "great Android",
        "Android phones",
        "boom key",
        "Play",
        "software",
        "great smartphones",
        "make",
        "display"
    ],
    "transcript_entity_values": [
        "Idol",
        "First",
        "IR",
        "50 bucks",
        "weeks",
        "Michael Fisher",
        "half",
        "several weeks",
        "Samsung",
        "Spotify",
        "Glass",
        "400",
        "the Snapchatter of the Year award",
        "the years",
        "Moto Z Play",
        "Dolby Atmos",
        "YouTube",
        "JBL",
        "AMOLED",
        "Moto",
        "2012-era",
        "Mobile",
        "Axon",
        "today",
        "OnePlus",
        "RAM",
        "One",
        "one",
        "first",
        "the day",
        "Moto Mods",
        "IOS",
        "20 minutes",
        "Boardroom",
        "second",
        "ZTE",
        "Alcatel",
        "HTC",
        "Axon 7",
        "EMUI",
        "three",
        "OnePlus 3",
        "Android",
        "8",
        "4S"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "EVENT",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "NORP",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.09215877950191498,
        0.08200563490390778,
        0.07808525860309601,
        -0.03916778042912483,
        0.027812635526061058,
        -0.03380132466554642,
        0.019592415541410446,
        0.12134331464767456,
        0.0014306571101769805,
        0.02949545718729496,
        -0.01011589914560318,
        0.02797643654048443,
        0.09735886007547379,
        0.00873083807528019,
        0.024293791502714157,
        0.016461921855807304,
        0.08419931679964066,
        -0.05382866412401199,
        -0.04114571958780289,
        0.024945499375462532,
        -0.02143136039376259,
        -0.04060473293066025,
        0.0230860635638237,
        0.012272967956960201,
        0.046084463596343994,
        0.025962255895137787,
        -0.06573492288589478,
        -0.030387546867132187,
        -0.01903272233903408,
        -0.015226690098643303,
        -0.021146245300769806,
        0.14470835030078888,
        0.04279612749814987,
        0.03264646977186203,
        -0.010324801318347454,
        -0.105638787150383,
        0.04268782585859299,
        -0.029526658356189728,
        -0.02603430673480034,
        -0.033097926527261734,
        0.006021794863045216,
        0.009271334856748581,
        -0.01449153758585453,
        0.014152102172374725,
        0.010006841272115707,
        -0.03431868180632591,
        0.08137591928243637,
        -0.0027545932680368423,
        0.008069587871432304,
        -0.007424898911267519,
        0.025707727298140526,
        -0.02784288302063942,
        -0.02067231759428978,
        -0.03428846597671509,
        -0.11363636702299118,
        0.012704899534583092,
        -0.016927648335695267,
        0.008107122965157032,
        0.0665740966796875,
        0.014821479097008705,
        0.013679278083145618,
        -0.01646043360233307,
        -0.03292059898376465,
        0.06523969769477844,
        -0.024064648896455765,
        -0.04622694477438927,
        0.013999858871102333,
        -0.07698257267475128,
        -0.04352820664644241,
        0.0889912024140358,
        0.03441575542092323,
        0.0461728498339653,
        0.05151873826980591,
        0.030216339975595474,
        -0.032774727791547775,
        0.084250807762146,
        0.08175220340490341,
        -0.048053134232759476,
        -0.05657372996211052,
        0.03685756027698517,
        0.0596829392015934,
        -0.07650989294052124,
        -0.046158261597156525,
        -0.05351448059082031,
        0.10195500403642654,
        -0.03155849501490593,
        0.007751218508929014,
        0.037164244800806046,
        -0.045291829854249954,
        -0.05335922911763191,
        -0.03767632320523262,
        0.08836162835359573,
        -0.03417983651161194,
        0.012621482834219933,
        -0.069452203810215,
        0.04628366976976395,
        -0.0202470850199461,
        -0.061812564730644226,
        -0.044791437685489655,
        0.05693000555038452,
        0.06808383017778397,
        0.034848567098379135,
        0.028086239472031593,
        -0.016537697985768318,
        0.030821070075035095,
        -0.057680025696754456,
        -0.005013699643313885,
        -0.011306772008538246,
        -0.05277908965945244,
        0.010504357516765594,
        -0.06192122399806976,
        -0.02024986408650875,
        -0.012161936610937119,
        -0.02324674092233181,
        -0.07323532551527023,
        -0.0005618394934572279,
        -0.045159731060266495,
        0.0647144690155983,
        0.11086463183164597,
        0.0221838541328907,
        -0.02792278304696083,
        0.008312397636473179,
        -0.02883102558553219,
        -0.06188742443919182,
        0.0291369017213583,
        -0.02753784880042076,
        -0.05465694144368172,
        2.30745335000691e-33,
        -0.024343574419617653,
        0.11680576950311661,
        -0.055618200451135635,
        -0.05603911355137825,
        -0.07682562619447708,
        -0.00617939792573452,
        0.04058002308011055,
        0.04463404789566994,
        0.0139210419729352,
        0.009583639912307262,
        -0.0345768928527832,
        0.010260318405926228,
        -0.034984879195690155,
        0.05553242564201355,
        0.09131715446710587,
        -0.0761767327785492,
        -0.055204715579748154,
        -0.050473280251026154,
        -0.007620259653776884,
        -0.021049927920103073,
        -0.023293880745768547,
        -0.05133136361837387,
        -0.0010463186772540212,
        -0.0040163262747228146,
        0.009281555190682411,
        0.04825388267636299,
        0.13577616214752197,
        -0.048752401024103165,
        0.031010448932647705,
        0.0027624573558568954,
        -0.08761849999427795,
        0.005029177293181419,
        0.07626862823963165,
        -0.012987799011170864,
        -0.028409859165549278,
        0.050910141319036484,
        -0.030514121055603027,
        -0.1254798173904419,
        0.019539108499884605,
        -0.041266217827796936,
        -0.10374622792005539,
        0.001528816414065659,
        -0.1228364035487175,
        0.007385361008346081,
        0.01349545642733574,
        0.017192570492625237,
        -0.051467183977365494,
        0.015261290594935417,
        0.0030189172830432653,
        -0.02352834679186344,
        -0.040329694747924805,
        -0.002566031413152814,
        -0.03319649025797844,
        0.012474624440073967,
        -0.1054273322224617,
        -0.07424143701791763,
        0.0010478411568328738,
        -0.0567874014377594,
        0.0570482537150383,
        0.03892333433032036,
        0.02343131974339485,
        -0.05051984265446663,
        -0.05172792822122574,
        0.026298021897673607,
        -0.09368269890546799,
        0.060370106250047684,
        0.02371821366250515,
        -0.021669449284672737,
        -0.09898266941308975,
        0.08690398186445236,
        0.06307172775268555,
        -0.05776163190603256,
        0.07188486307859421,
        -0.062167685478925705,
        0.056040506809949875,
        0.05589251220226288,
        0.01898934878408909,
        0.006471500266343355,
        0.012466304935514927,
        -0.007872233167290688,
        -0.01669519767165184,
        0.01510544866323471,
        0.034576416015625,
        0.030952028930187225,
        0.021214989945292473,
        0.024540524929761887,
        0.019935831427574158,
        -0.06070755422115326,
        -0.010419920086860657,
        0.07325120270252228,
        -0.025685947388410568,
        -0.04864763095974922,
        0.012205102480947971,
        0.022538023069500923,
        0.03968632221221924,
        -3.287807006056059e-33,
        -0.0206498671323061,
        0.0163128562271595,
        0.07313074171543121,
        0.0008795926696620882,
        -0.0024858086835592985,
        -0.07515879720449448,
        0.008810409344732761,
        0.02343071810901165,
        -0.04594831168651581,
        0.0010846966179087758,
        -0.046390168368816376,
        0.025598151609301567,
        0.04705490916967392,
        -0.01053653471171856,
        -0.008029595017433167,
        -0.06609011441469193,
        0.0007091548177413642,
        -0.121116504073143,
        0.12070231139659882,
        -0.03713279590010643,
        0.029103586450219154,
        0.1108032613992691,
        0.008360193111002445,
        0.10463298112154007,
        -0.034385453909635544,
        -0.056597497314214706,
        -0.053561195731163025,
        -0.0018157284939661622,
        0.01627914048731327,
        -0.030792150646448135,
        -0.0023940973915159702,
        -0.10168544203042984,
        0.012315954081714153,
        0.050276294350624084,
        0.061041537672281265,
        0.06394291669130325,
        0.0033087378833442926,
        0.011319196783006191,
        0.02515624463558197,
        0.022531818598508835,
        0.03039998561143875,
        -0.011769959703087807,
        0.008757784962654114,
        -0.04359636828303337,
        0.10081453621387482,
        -0.08132778853178024,
        -0.03718365356326103,
        -0.042722515761852264,
        0.08209092170000076,
        0.0021303792018443346,
        0.04699389636516571,
        0.08152364194393158,
        -0.024029171094298363,
        0.024479545652866364,
        -0.062213607132434845,
        0.005213179159909487,
        -0.014100235886871815,
        -0.07944172620773315,
        0.01109468936920166,
        -0.05682624503970146,
        0.04971975088119507,
        0.03013092651963234,
        -0.05413307994604111,
        0.05378192290663719,
        -0.08710042387247086,
        0.011387624777853489,
        0.09758387506008148,
        -0.016056742519140244,
        -0.030987966805696487,
        -0.015426243655383587,
        -0.09508675336837769,
        -0.037040162831544876,
        -0.030568847432732582,
        -0.035492293536663055,
        -0.023714235052466393,
        0.07437118142843246,
        -0.08678845316171646,
        0.017283417284488678,
        0.011548923328518867,
        -0.060435086488723755,
        0.0018890645587816834,
        0.06237063184380531,
        0.0661553293466568,
        -0.029222652316093445,
        0.0160916056483984,
        -0.012703587301075459,
        0.0022456604056060314,
        -0.030155770480632782,
        -0.03704477474093437,
        0.0567040741443634,
        -0.028824497014284134,
        -0.009110203944146633,
        -0.06547108292579651,
        0.07570667564868927,
        0.022066695615649223,
        -4.875194647979697e-08,
        0.06580912321805954,
        0.005846238229423761,
        0.031118817627429962,
        0.011407731100916862,
        0.04137695953249931,
        -0.09544676542282104,
        -0.006702609360218048,
        0.015216218307614326,
        0.13407067954540253,
        0.04491334408521652,
        0.020884141325950623,
        -0.0983479842543602,
        -0.0692451000213623,
        0.061284612864255905,
        -0.018288660794496536,
        0.06014707311987877,
        -0.003409996861591935,
        0.008461098186671734,
        0.03217853978276253,
        0.028225155547261238,
        0.03643873333930969,
        0.05858746916055679,
        0.027627136558294296,
        -0.057075630873441696,
        0.03280429169535637,
        0.0691680908203125,
        -0.10509005188941956,
        0.04940038174390793,
        0.04967105761170387,
        0.0016088058473542333,
        -0.005395800806581974,
        -0.010437200777232647,
        -0.004414979834109545,
        -0.1000804752111435,
        0.011272947303950787,
        -0.03458419814705849,
        0.015240425243973732,
        -0.032776013016700745,
        0.07126609981060028,
        0.002931892639026046,
        0.0333600677549839,
        -0.10111512243747711,
        0.021527167409658432,
        0.021388830617070198,
        0.011372840031981468,
        -0.06987013667821884,
        -0.08298273384571075,
        -0.0819065049290657,
        0.0415593646466732,
        0.06630927324295044,
        0.024020308628678322,
        -0.010228847153484821,
        -0.0378926619887352,
        -0.03822340816259384,
        0.05772651359438896,
        -0.0710492953658104,
        0.005543381441384554,
        -0.01696743816137314,
        -0.062159959226846695,
        0.033982086926698685,
        0.06917678564786911,
        -0.11001580953598022,
        0.02349947579205036,
        0.06324517726898193
    ]
}