{
    "id": "XaJSYxit1qI",
    "title": "This phone case is ILLEGAL...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-01-26T15:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=XaJSYxit1qI",
    "category": "Howto & Style",
    "tags": [
        "Stun Gun cell phone case",
        "Yellow Jacket Cell Phone",
        "Smart phone",
        "iphone",
        "apple",
        "iphone 8",
        "new iphone",
        "Tech",
        "technology",
        "stun gun",
        "personl protection",
        "case",
        "illegal",
        "phone",
        "review",
        "illegal iphone case",
        "best iphone case",
        "smartphone",
        "iphone 7",
        "jerryrigeverything",
        "mobile phone"
    ],
    "views": 4076000,
    "likes": 84652,
    "comments_count": 5669,
    "description": "Get your FREE book download with 30 day trial HERE:  (I recommend 'Elon Musk') Even if you dont keep using Audible you still get to keep the book.  Its a win/win. You can also TEXT 'jerryrig' to 500-500 and get it that way.   This is the most dangerous cell phone case I have ever tested... and it hurts! I would suggest staying away from the metal prongs... Here is the current pricing for the Stun Gun iPhone case:  there are a few different colors too. If you need personal protection and this kind of thing is legal where you live, it might be the perfect solution. Even the sound alone might demotivate potential villains.   This case is illegal in 5 states currently, and you need a concealed weapons permit in several other states in order to have one of these stun gun cases. So make sure to check your own states regulations regarding stun guns, and Tazers.   The camera I used to film this video:  Wide angle lens:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.audible.com/jerryrig/",
        "http://amzn.to/2GkX9vV",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Before we get started, I want you to know the product I'm reviewing today is illegal in Hawaii, Massachusetts, New Jersey, New York, and Rhode Island. But it's still pretty interesting. Let's get started. [Intro] On my channel I've talked a lot about protection for phones. Today we're going to talk about personal protection using a stun gun case for your iPhone. This particular case can protect your phone, obviously, it's also a power bank, and it has 7 million volts of stun gun protection, which is pretty crazy. So this particular case is the teal case, and just out of the box it is super super thick. And check out this warning: This product can cause severe injury or potentially death. Read user manual before use. Never leave unattended around minors. That's probably pretty important. Only use if you are in serious danger. I like that they mentioned check your local laws before carrying a stun gun because these are illegal in several states, like I mentioned earlier. But like always on my channel, we test a lot of different things, and so we're going to test out the features of this stun gun and then take it apart and see how it works. It comes with a screen protector, and the case is detachable which is kind of cool. I'll go ahead and slide my pristine condition iPhone 8 inside of this case, and slip it into the housing and it should start charging. So I press this button on the back twice and these LEDs lit up, and now the phone itself is charging up here in the top corner. So that part of this case actually works. [Buzz sound] Oh man! There is the stun gun. That is pretty scary. Okay, so in order to activate the stun gun part of it, there are actually two safe guards. So first of all, I have to flip this switch right here up. And then I also have to slide these metal prongs out the top of the phone, which then releases the 7 million volts of electricity through those two points. One thing that I should mention is that when you do switch it into taser mode, it does stop charging your phone. So you can't defend yourself physically while charging your phone at the same time. No multitasking going on - either zapping people or charging your phone. You got to pick one or the other. So even though there is 7 million volts pulsing through these two needle-like connections at the tip, it's not the voltage that kills you. There's not a whole lot of amperage flowing through with those volts. So technically I should be fine zapping myself, but remember this is illegal in quite a few states. So...let's see what happens. [Buzzing sounds] Ready? I don't want to do this anymore! Oh boy. Okay. So I am in...okay, I'm going to do it this time. [Laughing] So right now we are locked into taser mode with the safeguard. The metal prongs are stuck up. [Buzzing sound] Ugh!!! I could feel it like all the way through my fingertips...like it made my fingertips curl at the very end, and I could feel it probably...oh, I'm getting goosebumps over my whole arm...I could feel it all throughout this range right here. That was so crazy. Okay, let's not do that again. Now I vote we open this thing up and see what the external batteries like inside, and see how these prongs of doom extrude from the case each time. Batteries in electric cars have been on my mind a lot lately after listening to a book on Elon Musk by Ashley Vance. Audible is kind of my way of productively filling my time while driving or traveling. One of Elon's quotes that stood out to me the most is, If other people are putting in 40 hour work weeks and you're putting in 100 hour weeks, then even if you are doing the same thing you will achieve in four months what it takes them a year to achieve. It's pretty motivating stuff. Audible is one of my ways of motivating myself to become a better person. Audible is giving out a free audiobook with 30 day trial membership. So if you don't know who Elon is, now would be a good time to check him out. Just go to Audible.com/jerryrig. Or even text the word jerryrig to 500-500 to get that free book. J E R R Y R I G. And thanks to Audible for supporting my content and sponsoring this video. So like I mentioned earlier, this does have an external battery charger as well, like it charges your phone while you're using it. And it's charged with a micro UBS port that charges this battery right here, which is a 3800 milliamp hour. And then from there, that goes into the proprietary lightning port that Apple uses with all their phones. So I'm going to disconnect that proprietary lightning port. So obviously a normal battery can't produce 7 million volts, so there has to be a couple other components inside of here that do that. So a transformer can step up the voltage to that 7 million we were talking about. And all of that circuitry is probably inside of this box right here. There also could be an oscillator that fluctuates the current and produces that buzzing noise you hear on the back. And a capacitor which actually stores the electricity and releases it in that pulse pattern. All of that happens inside of this box here while sending it out of the electrodes up at the top, and the electrodes can slide in and out just like that. It's a pretty sweet set up. At risk of getting shocked again, I vote we take apart this component, because this is the part that most cell phone cases don't have. But it looks like we can't get inside because it is a solid block of plastic. I imagine this is where we stick the transformers, the oscillator, and the capacitors that allow the electrodes to zap someone. So there is no taking this apart because it is a solid block of plastic. Overall, this is a pretty interesting device. I've never seen something quite like this that, you know, protects you physically as well as your electronics. Now as far as the damage it can afflict, it was more of a, I would say, like a distraction for me. Getting zapped was a surreal experience and like, you know, I definitely don't want it to happen again, but it wasn't like an immobilization thing. Like I was able to use my hand right afterward. To be honest, it was the sound that was mostly the deterrent. [Buzzing sound] That sound, coming from the voltage off of these electrodes made me not want to come anywhere near those two points. So that's what would be the biggest deterrent if I was a thief and I was going to go rob somebody. Just saying. I'll leave a link for all this stuff down in the video description, and make sure you check out Audible for your free book. It is a service that I use regularly. Audible.com/jerryrig. Let me know if you want to get zapped by 7 million volts down in the comments. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Rhode Island",
        "stun gun",
        "illegal in Hawaii",
        "case",
        "phone",
        "million volts",
        "pretty",
        "Massachusetts",
        "stun",
        "gun",
        "Hawaii",
        "Jersey",
        "York",
        "Island",
        "Rhode",
        "volts",
        "million",
        "inside",
        "stun gun case",
        "Audible"
    ],
    "transcript_entity_values": [
        "four months",
        "7 million",
        "iPhone",
        "30 day",
        "100 hour weeks",
        "Hawaii",
        "8",
        "Elon Musk",
        "Elon",
        "3800 milliamp hour",
        "two",
        "UBS",
        "40 hour",
        "Rhode Island",
        "Apple",
        "first",
        "Elon",
        "a year",
        "500-500",
        "7 million volts",
        "today",
        "weeks",
        "Massachusetts",
        "Today",
        "One",
        "New Jersey",
        "one",
        "New York",
        "Ashley Vance"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "GPE",
        "PERSON"
    ],
    "vector": [
        -0.03861800208687782,
        0.038556650280952454,
        0.0638505145907402,
        -0.09317214041948318,
        -0.05437043681740761,
        0.030124090611934662,
        0.05243385210633278,
        0.06453169137239456,
        -0.012686222791671753,
        0.009294736199080944,
        0.06832597404718399,
        0.007155429106205702,
        0.09341109544038773,
        0.011566364206373692,
        0.02482599951326847,
        -0.032709766179323196,
        0.12062615156173706,
        -0.010833028703927994,
        -0.06543967127799988,
        0.046627309173345566,
        0.03959403187036514,
        0.07092490047216415,
        0.05300701782107353,
        0.0005968380137346685,
        -0.09336334466934204,
        0.002137820702046156,
        0.05054415017366409,
        0.005734242964535952,
        -0.047528043389320374,
        -0.0482143796980381,
        0.06673575937747955,
        0.01540649775415659,
        -0.035831425338983536,
        0.030151138082146645,
        0.007863095961511135,
        -0.11065156012773514,
        -0.0015761640388518572,
        0.013339925557374954,
        0.04627024382352829,
        0.020119063556194305,
        0.01734209433197975,
        0.012769457884132862,
        0.028900351375341415,
        -0.02256854623556137,
        -0.037130288779735565,
        0.03168686479330063,
        0.05965910851955414,
        0.025074442848563194,
        0.04177024960517883,
        -0.053108349442481995,
        -0.007463331334292889,
        -0.03721574693918228,
        0.018960872665047646,
        0.057665299624204636,
        -0.05164463818073273,
        -0.0767044872045517,
        0.010706954635679722,
        0.005892984569072723,
        0.09983234107494354,
        0.025082893669605255,
        0.023007364943623543,
        0.016980048269033432,
        0.04913971200585365,
        -0.008808868005871773,
        -0.02035706117749214,
        0.0353366993367672,
        -0.013494117185473442,
        0.010500925593078136,
        0.06966814398765564,
        0.05104382708668709,
        0.05630116164684296,
        0.07337289303541183,
        0.041708145290613174,
        0.05864377319812775,
        -0.07920578867197037,
        0.05333733186125755,
        0.016019780188798904,
        -0.03980526328086853,
        -0.03876856341958046,
        0.04601321369409561,
        0.06528918445110321,
        -0.04889232665300369,
        -0.020012086257338524,
        -0.09522934257984161,
        0.012184150516986847,
        0.08970540761947632,
        0.006773439235985279,
        0.07002449780702591,
        0.0045300377532839775,
        -0.06197485327720642,
        0.00898781418800354,
        0.048267994076013565,
        0.020342767238616943,
        -0.013759927824139595,
        -0.016595685854554176,
        -0.07433777302503586,
        -0.036327917128801346,
        -0.08051847666501999,
        -0.028641564771533012,
        0.01828189566731453,
        0.04940873384475708,
        -0.11192037165164948,
        0.06360936164855957,
        -0.03479265421628952,
        0.08008823543787003,
        -0.036506619304418564,
        -0.08386197686195374,
        -0.08157915621995926,
        -0.02811410464346409,
        0.01280511450022459,
        0.023897793143987656,
        0.03548002988100052,
        -0.08441896736621857,
        0.002793228020891547,
        0.01847810484468937,
        0.04035777598619461,
        -0.047671571373939514,
        0.05153094604611397,
        0.08384551107883453,
        -0.04547860473394394,
        0.08644400537014008,
        0.013678624294698238,
        -0.057588689029216766,
        0.04940873384475708,
        0.06388741731643677,
        -0.02010905183851719,
        -0.07114491611719131,
        2.4640027489135452e-33,
        0.0038726963102817535,
        0.07780015468597412,
        -0.028708577156066895,
        -0.010067712515592575,
        0.05626630783081055,
        -0.06236140802502632,
        0.012832731939852238,
        0.030513059347867966,
        -0.010250645689666271,
        0.07566534727811813,
        0.021678980439901352,
        -0.044742401689291,
        0.004827406257390976,
        -0.00763609679415822,
        -0.024096356704831123,
        -0.04203874245285988,
        -0.05457565188407898,
        -0.09914934635162354,
        -0.023552756756544113,
        -0.005253269337117672,
        -0.034052468836307526,
        -0.10241466015577316,
        -0.02175987884402275,
        0.06722237914800644,
        -0.027009887620806694,
        0.04606761783361435,
        0.07989673316478729,
        -0.046627338975667953,
        0.07423923909664154,
        -0.015137923881411552,
        -0.06478014588356018,
        0.036738090217113495,
        0.041797488927841187,
        -0.0012087954673916101,
        0.019665388390421867,
        0.029235560446977615,
        -0.02568279765546322,
        -0.011100943200290203,
        -0.00474565289914608,
        0.03920421004295349,
        -0.10292448848485947,
        0.0504927858710289,
        -0.017602436244487762,
        -0.03264174610376358,
        0.13169367611408234,
        0.02648039720952511,
        -0.08608774095773697,
        -0.05411598086357117,
        -0.02289414592087269,
        -0.037435125559568405,
        0.007343991659581661,
        -0.06753770262002945,
        -0.014565878547728062,
        -0.016495851799845695,
        -0.12022104859352112,
        0.004327100235968828,
        -0.0023832865990698338,
        -0.027975214645266533,
        0.06251823157072067,
        -0.05714784935116768,
        -0.008165095932781696,
        -0.003171538235619664,
        0.0023378711193799973,
        0.031201213598251343,
        -0.06306427717208862,
        -0.04000486060976982,
        -0.06706264615058899,
        -0.02820311300456524,
        0.011659013107419014,
        0.03065357729792595,
        0.027409840375185013,
        0.020207034423947334,
        0.08656436204910278,
        -0.050913069397211075,
        -0.012590920552611351,
        0.005454247817397118,
        0.001117716426961124,
        -0.009622657671570778,
        0.013951221480965614,
        -0.036496926099061966,
        -0.07345982640981674,
        0.03661344200372696,
        0.0030363211408257484,
        0.04864950850605965,
        0.020763320848345757,
        -0.00886368565261364,
        -0.05050189420580864,
        -0.08839889615774155,
        -0.02948993444442749,
        0.0588611476123333,
        -0.008559181354939938,
        0.002287018345668912,
        -0.08816841244697571,
        0.024352891370654106,
        -0.01772422157227993,
        -3.186622656389184e-33,
        -0.010899517685174942,
        0.02629765123128891,
        0.019556069746613503,
        0.005915132816880941,
        0.05366828292608261,
        -0.05777067691087723,
        0.0372808463871479,
        0.14882081747055054,
        -0.0001728370989440009,
        -0.03325788304209709,
        -0.07236718386411667,
        0.022272827103734016,
        0.05954013392329216,
        0.03577108308672905,
        0.049818821251392365,
        -0.014893372543156147,
        -0.016595803201198578,
        -0.009109682403504848,
        0.0027649751864373684,
        0.046560682356357574,
        0.0007564736297354102,
        -0.01786375418305397,
        0.05544280260801315,
        0.04903995618224144,
        -0.023447537794709206,
        -0.010236212983727455,
        -0.06008343771100044,
        -0.06434653699398041,
        0.07936935871839523,
        0.0028350790962576866,
        -0.055935364216566086,
        -0.04953814297914505,
        0.03555886074900627,
        -0.012745983898639679,
        -0.06475890427827835,
        0.01583346724510193,
        0.10881153494119644,
        -0.03614264354109764,
        0.0452820360660553,
        -0.1059686467051506,
        -0.029653502628207207,
        0.08153650909662247,
        0.020416485145688057,
        -0.039543140679597855,
        -0.06489697843790054,
        -0.011418579146265984,
        0.08671481907367706,
        -0.013750429265201092,
        -0.02926822565495968,
        0.008328396826982498,
        0.04325977712869644,
        0.016158519312739372,
        0.019433055073022842,
        0.017926178872585297,
        -0.03622039780020714,
        -0.020780419930815697,
        0.03987690433859825,
        -0.09784655272960663,
        0.015411486849188805,
        0.04344571754336357,
        0.038366883993148804,
        0.08763293921947479,
        -0.06299321353435516,
        -0.08654013276100159,
        -0.046150609850883484,
        -0.007370749954134226,
        -0.05147518590092659,
        0.014872031286358833,
        0.02169998362660408,
        0.0009057450224645436,
        -0.013601128943264484,
        0.019538814201951027,
        0.012254404835402966,
        -0.0311276875436306,
        0.023624811321496964,
        -0.039186105132102966,
        -0.04967976361513138,
        -0.023009613156318665,
        -0.06094353273510933,
        0.02135385386645794,
        0.04464636743068695,
        -0.005021834746003151,
        -0.059740759432315826,
        0.04803730919957161,
        0.05930924043059349,
        0.11689706891775131,
        0.0686274990439415,
        -0.006529451347887516,
        -0.09575676172971725,
        0.06883667409420013,
        -0.02852325700223446,
        0.049842704087495804,
        0.0183328315615654,
        0.05487063154578209,
        0.06180286407470703,
        -5.977643269261534e-08,
        0.04176628217101097,
        -0.0032792454585433006,
        -0.0030151098035275936,
        -0.09169816225767136,
        -0.062457479536533356,
        0.007974016480147839,
        0.010421175509691238,
        -0.08694460242986679,
        0.08135875314474106,
        0.0015195677988231182,
        -0.059835147112607956,
        -0.08358965069055557,
        -0.03481452167034149,
        0.08212114125490189,
        -0.0929822027683258,
        0.0749049037694931,
        -0.05061342567205429,
        0.005559831392019987,
        -0.022885598242282867,
        0.03688792884349823,
        -0.06532750278711319,
        0.04246312752366066,
        -0.023915983736515045,
        -0.00193313742056489,
        -0.032554470002651215,
        0.07678327709436417,
        -0.025071952491998672,
        -0.04524346813559532,
        0.005423893220722675,
        0.1205524355173111,
        -0.07564376294612885,
        -0.0071801673620939255,
        -0.04791419953107834,
        -0.011810475029051304,
        -0.03269527107477188,
        -0.05186093971133232,
        -0.05814550071954727,
        -0.025918355211615562,
        0.03807864710688591,
        0.03988821804523468,
        -0.023849138990044594,
        -0.0685277059674263,
        0.021995820105075836,
        0.024656057357788086,
        -0.005631738342344761,
        -0.09267659485340118,
        0.062131352722644806,
        -0.1754329800605774,
        0.04637327045202255,
        0.1438809484243393,
        -0.03354734554886818,
        -0.06716454774141312,
        -0.06070602685213089,
        -0.0344914048910141,
        0.035438526421785355,
        0.04754427820444107,
        0.07164162397384644,
        0.014465834014117718,
        -0.026103906333446503,
        0.014306294731795788,
        0.029547492042183876,
        -0.05219931900501251,
        0.0003317732480354607,
        0.06739504635334015
    ]
}