{
    "id": "XeDCCNFAULk",
    "title": "Tilting, taking turns, and winning free games: the many tricks inside old pinball machines",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2024-05-27T17:00:22Z",
    "video_url": "https://www.youtube.com/watch?v=XeDCCNFAULk",
    "category": "Science & Technology",
    "tags": [],
    "views": 989687,
    "likes": 30274,
    "comments_count": 2125,
    "description": "Tilt! Links 'n' stuff: The Pinball Playlist (it'll getcha to parts 1 and 2)   This is the video on Bally Gay Time, a bingo machine from the 1950's   Technology Connections on Mastodon:   Technology Connections on Bluesky:   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLv0jwu7G_DFVAUoqtVxFVIu2oZc2GGyDf",
        "https://www.youtube.com/watch?v=rY4JvwWd7Ck",
        "https://mas.to/@TechConnectify",
        "https://bsky.app/profile/techconnectify.bsky.social",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "How do you suppose up to four players can compete with each other on this old pinball machine filled with nothing but wires and relays? Well, with wacky contraptions like this one here. This is the player unit, and with thehelp of two other mechanisms inside this machine it will alter the machines programming toallow competing players take turns as the game progresses. Welcome to part three of a deep dive into this electromechanical pinball machine. If you havent seen the earlier videos, be warned parts of this might be hard to follow. Linky-dinks are available to find partone and two, but Ill do my best here to lightly recap important concepts where necessary. First,though, lets talk about something simple. That. This machine has several anti-cheating measuresbuilt into it. Theyre designed to detect a player moving the machine and penalize them if theydo so. Skilled players are able to physically push the game cabinet around to keep the ballfrom draining, a technique called nudging. And for the record I suck at that! But if youregood at it you can become much more likely to get a high score and win a replay. Operatorsdont love those - they want your quarters, not your satisfaction! So if you get toorough, the machine will register a tilt. The tilt light comes on, the flippers shutoff, and youre forced to lose that ball. Now, if tilt seems like a weird word to describethis penalty, tilting is a very old pinball term dating back to the flipperless ball-shootingmachines of the 1930s. As those became popular, before long they started becoming used asgambling devices. Initially this was just the players making bets on each other but laterthe manufacturers started leaning into it. The written rules of the games they sold would soon award credits for certain high scores, and the proprietor of the establishment which hosted the games would pay those credits out to winners. As this practice spread, cheating becamea serious problem. Especially since these early games were small and light enough thatyou could easily pick them up and manipulate how the balls would roll around. So they neededa way to warn the proprietor of the establishment that the game cabinet had been tilted during thegame. In the early days there were many clever ways this was done which to save time I wont getinto but it usually involved a simple mechanism with a precariously perched object that resetwith the coin slide. At the start of the game something like a ball would find itself on top ofa stick, and if it fell off that perch, that meant the game was tilted during play and that wouldvoid the score and thus prevent any payouts. The early and problematic relationship betweengambling and pinball led to it being outlawedin some locales for many years. And, uh, by the way - Williams? They still exist. They make slot machines. And Bally? That names on somecasinos, isnt it? Though that lineage is much murkier. The Bally name and logo also endedup on fitness centers. And theme parks. And sports networks. Anyway, pinball machineswith flippers were usually earnestly meant for amusement only. Like this one! You cantell because it says \"for amusement only.\" But since you can score free games (usually- theres a fun legal loophole Ill cover later) and free games hurt the operators bottomline, anti-cheating measures are still in-place. And this machine has several anti-cheatingdevices! This one here is the most common - pretty much every pinball machine from the 1940sthrough today has a mechanism just like this, called the tilt bob. You might alsocall it a plumb bob because thats technically what it is. A conical weightis suspended on a rod much like a pendulum, and the weight rests in the center of a ring which surrounds it but doesnt touch it. 24 volts AC is applied across the weight andthat ring, meaning together they are really just a strange pair of switch contacts. Ifsomeone were to start shaking the machine, the weight will start to swing and get close tothe ring. Shake it too hard and theyll touch. And guess what that does? It sends voltage tothe tilt relay! If the tilt relay energizes, it locks on, illuminates the tiltindicator, and opens this switch. That disables practically everything in the game so you will instantly stop scoring points, and most importantly the flippers are disabled so you will lose the ball. The tilt penalty is only the ball-in-play so unless you tiltedon your last ball the game isnt over. But you also lose any bonus points you might have accumulated during that ball and even an extra ball if you managedto score one. To pour salt in the wound, the machine still executes the bonus sequence as normal once the ball lands in the outhole, but the tilt relay prevents it from awardingany points so it becomes a sadistic countdown where you watch it deny every point you hadpreviously built up. Once thats complete, though, the outhole relay energizes as normal whichun-trips the tilt relay and the game continues. As you may have guessed, the weightcan be moved up and down on the rod to increase or decrease the sensitivity ofthe tilt switch. Stingy operators would move the weight very far up so the wider diameterof the cone almost entirely filled the ring. But those with more forgiving temperaments might lower it so more violent shaking is needed for the machine to register a tilt. And right abovethe tilt bob it is a second tilt switch in this machine. A ball is placed in this track which,like the tilt bob, is energized at 24V. The track is a little knackered as the originalball is missing and this second pinball is just a little too big - but it does work. If theball rolls forward and touches this contact, since the ball is energized by the track, the tiltrelay will trip. This is designed to detect that someone is lifting the front of the machine tomake the playfield level and keep the ball from draining. These electromechanical gameshave fairly shallow playfields so the normal tilt switch wouldnt necessarily swing enough totrip in that case, at least if set more liberally. Now these arent the only two kinds of tiltswitches out there, in fact this machine has a third one hanging on the playfield. And therewere other varieties in use throughout the years. But before I move on, if you spied the anti-cheatswitch in the schematic earlier - thats actually something else entirely unrelated to tilting. That switch is normally closed and in series with the coin switches. It lives on the coindoor and youll notice that here its labeled \"anti-slam switch.\" This switch is there becausesomeone banging on the coin door could cause the leaf switches of the coin mechanisms to close andstart the game without actually paying for a game. If they try that the anti-slam switch will opento prevent a false purchase. Later machines in the solid state era would use this switch to trigger a slam tilt - which is a much more severe penalty. Slam tilts end the game entirelyas a punishment for someone bashing on the coin door or perhaps violently kicking the machine. This game, though, has no ability to do that. With the cheating out of the way, lets talkabout how this machine handles multiplayer games. As a quick refresher, this is just ahuge mess of wires were asking to do stuff for us. To perform specific tasks, themachine uses the score motor which is a contraption that rhythmically actuates awhole bunch of switches in stacks. When combined with the various relays throughout the machine which connect those switches to other devices, the machine can execute automated sequences. It might perform some action multiple times, which is how targets like this award 5,000points. Or the switches might activate several different mechanisms in a logicalsequence. You might call that a program. Relays arent the only thing which determines what all those switches in the score motor do, though. The game is also filled with severalstepper units. These contraptions rewire the machine based on their physical position, whichwill change as other actions take place. These can be used as a simple kind of memory, suchas in the ball count unit and the bonus unit, or they might alter specific steps in themachines program depending on their position. And this stepper, called the coin unit, is whatdetermines how many players can play the game. How does it do that? Well, when you deposita quarter, the coin switches trip the coin relay which causes the machine to reseteverything including the coin unit. Once reset, its main program loop begins and itserves the first ball to you. And now you have a choice. You can either plunge thatball and commit to a single player game, or you can give it another quarter to add asecond player. If you deposit another quarter, the machine doesnt reset this time. Since thegame was powered on by the first quarter, the now latched game over relay locks out the resetrelay. That prevents the coin relay and the score motor from resetting the game a second time and instead causesit to do only one thing: step the coin unit up. With the coin unit now in its second position, the backglass indicates that two can play. These lights are controlled with this wiper armhere, with each of those contacts wired to one of the four light sockets. But the other wipersin the coin unit are doing something more interesting. Through their new position, theyhave altered the end-of-ball sequence. That sequence occurs at the end of a ball via theouthole relay and it has four discrete steps: First, the score motor will pulse the ballcount unit step up coil to move the game fromball 1 to ball 2. Next it pulses the playerunit reset coil which resets the player unit. Then the bonus unit step up coil gets a pulse to put it back on 5,000 points for the next ball. And finally the ball release coil is pulsed to return the ball to the shooter lane. [rapid mechanical sounds as the sequence occurs repeatedly] That sequence works fine for single-player games but it doesnt work for the two-player game we have just paid for. After the first player has playedtheir first ball and lost it, step one in that sequence - advancing the ball count unit - canthappen. The game does need to return the ball so player two can play their turn, but the gameshould still be on ball one. To accomplish this, the coin unit serves as an interrupt. Althoughthe end-of-ball sequence does still occur, the coin unit will not allow the ball count unitto advance in step one. Remember this convoluted circuit path in the schematic? In order for theball count unit to receive the pulse of power coming from the outhole relay, that pulse hasto make it through the coin unit. And with the coin unit in the second position for a two-playergame, this link is moved down from here to here, thus the original circuit path is brokenand the ball count unit cannot advance. Great, that makes sense. But the machine alsohas to switch from player 1 to player 2. Hows that happen? Well, remember how the second step inthe end-of-ball sequence was to reset the player unit? You might have wondered what that does. Theplayer unit is what we looked at in the opening. Its another stepper unit that lives in the backbox and its arguably themost complicated of them all. Its got a TON of wires attached to it, and rather than wiper arms its got a fiberglass disc with 24 spring-loaded contacts sliding over a sea of brass rivetsalmost like snowshoes. Those contacts on the moving disc are simply linked together in pairs so what they actually do is bridge together a different set of wires connected to the rivetboard depending on the mechanisms position. Despite its apparent complexity, the bulk ofthis units job is actually pretty simple: there are four score displays in this machine, but only one of those displays should have points added to it as the ball hitstargets. This device is what controls that: the player unit connects the points relays in the backbox to only one set of score reels at a time, and it illuminates the player-up light to showwhich set of score reels is active (and thuswhich player is up). Of course, then, it hasfour positions - one position for each player. Its reset position is for player one and it will always return there when the reset coil is fired. That was step two in the end-of-ball sequence- reset the player unit. But at the end of the first players first ball, we need the opposite tooccur! We need it to step up to player two. And sure enough, thats what happens after the firstball is lost - with a nice and distinct clack. [bell ringing as points are added, then several distinct clacks] Why did that happen? If you guessed the coin unithad something to do with it, youd be guessing correctly but only indirectly. Lets find theplayer unit step up coil on the schematic. Here it is. Now, it gets its pulse from the outhole relay and switch 2-B in the score motor but looky here, its gotta go through a make/break switch in theplayer reset relay. Theres always another relay. If that relay is energized, then the player unitwill reset in the end-of-ball sequence. But if it's not energized, the player unit will stepup. So it must not have been energized during the first end-of-ball sequence. Why not?Because the ball count unit didnt step up. The coil for that player reset relay getsenergized by an end-of-stroke switch in the ball-count unit. That means the ball countunit has to physically move in order for the player reset relay to energize and causethe player unit to reset. So do you see what just happened? Since the coin unit just preventedthe ball count unit from stepping up to ball two, the ball count stayed on ball one. And because ofthat, the player reset relay could not energize and thus the next pulse coming from switch 2-B via theouthole relay stepped the player unit up instead of resetting it. And now that the player unithas moved to its second position? Player two is up. The next ball thats played will add points to the second players score reels. And thats literally the only difference as far as how the game operates when the ball is on the playfield. Once the second players first ball is lost, themachine will execute the end-of-ball sequence as it always does. But now we want the machine toadvance to ball 2 and go back to player 1. How will that happen? You might have spotted italready. Since the player unit moved to the player 2 position, the coin unit is no longerinterrupting the ball count unit. That link which moved down from here to here? Well, take a lookat the player unit right next to it. When player 1 was up its link was at the top so the circuit was broken. But with player 2 up, the link is now in the second position. And that matches thecoin unit. So when player 2 loses their ball, the pulse coming from the outhole relay and switch1-C to advance the ball count unit will now make it through. And of course, once it does, the ballcount unit will advance, so its end-of-stroke switch energizes the player reset relay, meaningthe next pulse in the sequence which comes from switch 2-B will in fact reset the player unitback to player 1. And so, ball 2 - player 1. So what would happen if we gave the machine three quarters at the start for a three-player game? Well, that would step the coin unit into its third position. And its link as shown on theschematic moves down to here. That means the coin unit will interrupt the ball count unit untilthe player unit is on player 3. So the first player loses their ball, and in the end-of-ball sequence the player unit stepsup to player 2. Then the second player loses their ball, and the same exact thing happens: the player unit steps up to player 3. But, with the player unit in the player 3 position, the next time a ball is lost, the coin units interrupt is bypassed. So the ball count unit can advance as normal which then allows the player reset relay to reset the playerunit back to player 1. Put simply, the coin unit is saying you must not advance the ball count until the player unit has reached player three. And once that condition is met, theball count unit can advance which of course moves the game along but also, through the playerreset relay, puts player one back up to bat. Now the last thing to address here is how extraballs work in multiplayer games. If you score one, the extra ball relay locks on. And you mayrecall from the previous videos that this prevents the ball count unit from advancing so you get afree ball. But if we look at the schematic again, youll see that in fact the first andsecond step in the end-of-ball sequence are interrupted by the extra ball relay. The ball count pulse andthe player unit pulse both go through this normally-closed switch. So, if its open thanks to you scoring an extra ball, neither will happen. So at the end ofyour ball the game awards the bonus points and then simply returns the ball, andthats why the light on the backglass says same player shoots again. In asingle player game its just a free ball, but in a multiplayer game it interrupts thegames progression from one player to the next. So, if youve got your head around all that, I have great news: thats the most complex thing in this video. From here on out, thingsget easier. And nows a good time to explain something about pinball machines from thistime period. If you havent noticed it before, the playfield completely resets afterthe ball is lost. Every ball begins with no letters lit and the bonus at 5,000points. This was a compromise which made multiplayer games possible. Single-playergames of this time period often had fairly deep and complex rulesets that unfolded over the game. But multiplayer games couldnt do that. Relay logic is what powers these things, andthere isnt a practical way to save the state of each players progress. Some games might enabledifferent features depending on the ball in play: Gottlieb, for instance, was very fond of doublingthe bonus on the last ball. But multiplayer capability required a fairly simple ruleset, and in most cases these multiplayer games are better understood as one-ball games which are merely repeated a fewtimes in the hopes of getting a very high score. And you might want to get a very high score in the hopes of winning a freegame. Which brings us to the credit unit. This is another stepper unit which lives in thebackbox. Its a step up / step down stepper like the bonus unit - one coil moves it up byone position, and the other moves it back down by only one position. This little window in the backglass graphics revealswhat position the stepper is in and thus whether there are any credits on the machine (and how many). If there are none,this is blank. But you might have earned yourself a replay by getting a high score or perhaps a special. In that case, the credit unit step up coil is fired and the window will show a 1. And now, the game canbe started again using the start button on the front. With a credit on the machine, the startbutton will energize the coin relay just as if you had inserted a coin and so the game willstart. It also steps the credit unit down to remove one credit. Now, much like the bonus unit, to the game logic,the credit unit can only be in one of two states: no credits, or yes credits. The number of credits shownsimply indicates how many steps away from the zero position the mechanism happens to be, and thushow many times a credit can be removed (and a game started or a player added) before its back tozero. All this thing is doing is pressing on this switch stack with this peg. If its got a credit,the peg has moved away from the stack and this switch is closed. That connects the start button tothe coin relay. And if it doesnt have a credit, the peg presses on the stack and this switch isopen which disables the start button. There's another peg on the same wheel which will press the switch stack from the other direction onceit hits it - and this defines the maximumnumber of credits the machine will store. Once this switch is open, the credit unit step up coil is disconnected and it cant add any more. You can move that peg to a few different positions which alter that maximum number of credits the machine will allow. Incidentally, the mere presence of this thing iswhat kept pinball illegal in some jurisdictionseven after flipper games became common. Somelawmakers apparently believed that if you could win a free game, you could then sell it? I guess?to another player and then somehow that made this a gambling machine. Now, this sounds absurdat first but its a little understandable when you know that the same companiesthat made these pinball machines also made bingo machines. Those looked an awful lotlike pinball machines (built into identical cabinets) but they didnt have flippersand they were explicitly gambling machines. Bingo machines were terribly addictive andinsidious devices. They tended to make your odds of winning slightly better by quasi-randomlyenabling more features and thus making a winslightly more likely if you gave them more money before theclock on the timed game (did I mention it's a timed game?) ran out. Ive linked to a very good explanation from a collector if youd like to learn more about them. Those machines also awarded credits if you won whichwere technically just free games. But you might win hundreds at a time. And theproprietor could knock them off the machine with a hidden button and pay you out their cashvalue. The distinction between pinball machines and bingo machines might seem obvious enough in hindsight, but anyone who knows how poorly Congress seems to understand the internet should be able topiece together why this confusion occurred. The pinball manufacturers were crafty, though. They just wanted to sell these machines to operators. Vertical integration and strict profit-sharingagreements weren't trendy yet, so they only made their profit when they sold the machines. They didn't care how they got used. So,to get around some of the stricter anti-pinball laws they began producing altered versions oftheir flipper games known as add-a-ball machines. In these games, there was no credit unit. Youcouldnt win a free game. Law satisfied! But you could win more balls. These machines, rather thandisplaying the ball-in-play, showed balls-to-play. The ball count unit became a step up/step downstepper, and the game was configured to begin with a certain number of balls, lets say 5. Then,when you lost that ball, it would step down to 4 remaining. The game would end when you reached zero balls remaining ofcourse but you could fairly easily add a ball through scoring enough points or hitting a certaintarget sequence. And you could often end up with more balls to playthan you started with! Ah, loopholes. Oh, thats also partly why the outlaneson this machine say special when lit, rather than replay when lit. The operator could configure this to award an extra ball rather than a credit, which would be enough to satisfy at least someof the weird legal prudes out there. I think that also might be why the credit unit doesnt showa zero: disable replays and make the special an extra ball and then theres plausible deniability thatthis machine can even store credits. Then again, it was also just an option given to operators andwould enable the same playfield design to be used in both add-a-ball and replay machines so Im not sure howmuch the legal issue influenced the term special but the use of it to imply replay was nearlyuniversal unless you lived where it was illegal. But of course Ive skipped the most importantthing - what adds credits in the first place? Well, first of course theres the outlanes whenlit for a special. When its lit and the ball hits the switch, the credit unit steps up. The laneis only lit if the bonus unit is at the maximum position AND youve lit every letter in AZTECso its pretty hard to score a special. Plus which outlane is lit flips back and forth as youhit 10 point targets so its pretty rare to earn one this way. But you can also win replays bygetting a high enough score. Hows that work? Well, until now Ive been deliberately ignoring all these wires going to some of the score reels. Three of the five reels in every player position have a circuit board attached to it. That board has 11 wires coming from it: a common connectionand 10 wires for each of the 10 digits on that reel. A wiper on that circuit board connects the common connection to one of the 10 wires. That wiper is attached to the drum, so as itrotates, the single wire connected to the common wire changes with the specific wire connectedcorresponding to the number shown on the drum. How does that give you free games? Well, herein the backbox youll find a rather strange adjustment jack. This connector has 10 positions, and next to it are 9 differently-colored wires with their own plugs. Those loose wiresare connected to the drums at the 100,000 position. And the connector you plug them intohas each hole wired to the drums of the 10,000 position. This guide here shows how to use them - if you want to award a replay at 350,000 points, then you need to plug the yellowwire, for scores between 310,000 and 400,000, into the bottom-left holeof the connector, the 50,000 position. Now, what that actually did waslink the 3 in the 100,000s score reel to the 4 in the 10,000s score reel. Betcha thought I was gonna say five. But see, the machine has to add that credit atthe moment the display first reads 3, 5, something something something points. And theaction which takes place before that happens is the rolling of this digit from 4 to 5. Whatactually moves that score reel forward in the game is the 10,000 point relay. So what these plugsdo is connect this switch in the 10,000 point relay to the credit unit step up coil, but thatconnection goes through the first two score reels. If and when they are in the correct position, in this case 3 and 4, then the next pulse of the 10,000 point relay will of course roll the4 up to a 5 but it will also award a credit. And heres that mess of wiring drawn in theschematic. On the left are the 10,000 point score reels and on the right are the 100,000 point reels. The adjustment jack is in the middle. Like the player unit, these arrows represent the link thescore reels are making based on their position, and since the schematic is drawn with the gamereset, the top position is zero, then 1 through 9 follow. The yellow wire is connected to the 3 inthe 100,000 point score reels and when its plugged into this position on the adjustment jack, then whenthe displays reads 3,4 something something points, theres a link through all this mess and up tothis switch here. The next time the 10,000 point relay energizes, as it will when rolling the 4to a 5, it sends a pulse through the credit or extra ball adjustment and finally through to thecredit unit step up coil. And so you won a replay! [knock] Which brings us to knockers. When this machine awards credits, it also energizes the knocker. This is a solenoidattached to the cabinet which simply whacks its bracket to make a knocking sound. [knock] Why? Theexact reason is likely lost to history, but the sound is unique and lets both players and operators know that a free game was won. On these electromechanical games the knocker isfairly subtle, but into the solid state era, the manufacturers started having fun makingthem startlingly loud. In machines from the early '90s, the sound level is similar to aballoon popping in your face. fanfare [KNOCK] That is until they got too cheap toput in an actual knocker coil and started playing a sound effect through theloudspeakers. Williams started it but they at least tried to emulate the old sound withtheir games. Meanwhile, over at Stern? Well, if you know you know. Put it back,guys. That noise is hideous. Also, fun knocker fact, while video games reallydid a number on the pinball manufacturers, some notable early arcade games were made by thelikes of Bally, Williams, and Gottlieb. Gottlieb produced Q*Bert, and for fun they installed oneof their knocker coils into the game cabinet so it made an actual thud shortly after Q*Bert felloff the board. Also, Haunted Mansion fans? That wrap on a table is probably coming from a pinball knocker, or at least something quite similar. Now did you notice something when we were lookingat this mess? The player unit was also involved. If youre wondering why, well what wouldhappen if, say, player 2 lost their ball and then, once they were awarded their bonus points, they ended up with 345,720 points? Player 2s score reels would then display 3 and 4, so the 10,000 point relay would be set up toaward a replay. But when any other player is up, that connection must be broken. Otherwise thenext player to score enough points to bump their 10,000 point relay will win Player 2's replayundeservedly. So the player unit only connects the score reels of the playerthats currently up to the credit unit. But theres one more way you might score a replay, and thats with the number match feature. At the end of the game (if that featureis enabled), a number appears on the backglass. That number will either bedouble-zeros, 10, 20, 30, 40, 50, 60, 70, 80, or - and this might shock you - 90. If thatnumber matches the last two digits in your score, you win a replay. [knock] Now you probably already have agood sense of how that might work. The 10s score reels also have the circuit board attached tothem, so their position is known to the game. It would seem that the number that appears on the backglass must be determined by some other mechanism, and if it and the last digitin your score match, then you win a replay. This is that mechanism. Its called the numbermatch unit and its a very simple device. This is just another stepper unit and like the scorereels it merely spins in circles. The match unit receives a pulse to advance with the 10 pointrelay, so every time a 10-point target is hit, this moves to its next position. The match featureis only one part of its job, though - this little switch is whats been causing some of the targets to change as the ball moves around. A cam in the center of the match unit alternately opens then closes this switch which energizes a relay called the change relay. That relay is whats flippingwhich of the bumpers are lit for 1,000 points, which of these two targets will award bonuspoints when hit, and it also flips the lane that's lit for special. Id go over how it does that butthe answer, as Im sure you know by now, is wires. The number match feature is done by the circuitboards on either side of the match unit, and both of them have a pair of wipers bridging a common wire with 10 other wires, just like the score reels. One circuit board illuminates thelights on the backglass which indicate the number this is on (though thats hidden until the end ofthe game), and the other board links to the 10s score reels of every player. If the score reelsposition matches this mechanism's position at the end of the game, the machine awards a replay. In fact, one for every player that matches. [knock knock] This works more or less identically tohow the high score credit award worked, at least as far as the linking between the scorereels and the match unit, but its the game over relay which actually awards those credits. Lookhere on the schematic. Switches 2-C, 3-C, 4-C, and 5-B are always sending pulses through the 10sscore reels, then through the number match unit, and to the credit unit throughout the game. Butthis switch in the game over relay prevents those pulses from going anywhere when the gameis switched on. When the game switches off, which happens when switch 1-B advances theball count unit and trips the game over relay, those pulses can make it through. So if the scorereels position matches the match units position, a pulse will make its way to the creditunit step up coil and you win a game. The number match is the very last thing the machine does before it shuts off. Since the score motor was pushed out of its home position bythe outhole relay, even though the game over relay is about to trip it will still complete the cycle. Andactually, take a look - if I move the last digit of player 1 to match the number that's lit, then everytime I push the score motor forward, it awards a replay. Wait, why didnt that work? Oh, the playerreset relay also has to be pulled in. So if I hold it in and then turn the score motor - there wehave it. The knock tells me it added a credit. [kachunkaKNOCKkachunkahunkaclack] Now, you might wonder - if its the 10point relay which moves the match unit, that means the match unit and the 10 reel arealways moving at the same time. Wouldnt that mean the machine could get stuck in a loop where its always awarding a match? Well, not really. Remember that the scores are resetto zero between games, and the number match unit doesnt move during that process. So it willdesynchronize unless the game ends with the score reel on zero. And to fix that potential issue,the numbers the match unit picks arent in order. Youll notice that as I advance it manually, the numbers move around quite frantically. Actually - probability people. I havea question about this. Intuitively, since the match unit has 10 positions and thescore reels have 10 positions then it should award a replay 10% of the time. But, and Ill admitI havent kept track over hundreds of games to confirm this, it sure feels as though it happensmuch less frequently. Is that possible? It feels like it shouldnt be, but since the twomechanisms are running in different sequences, there are scenarios where its not possible to get a match if they stay synchronized. Say the match unit starts on 6 and the gamestarts with the score reel on zero. If the two mechanisms always move together then its impossible during that game to win a replay. It will just be repeating these 10 pairs, none ofwhich match. So unless the mechanism is faulty, the only possible way for a match to occurif the match unit starts on 60 is if a second player is added so their ten-point scoring desynchronizes the match unit and player 1. Now, theres a confounding issue, here, which is that the match unit in this game isnt working quite right - many times the mechanism doesnt advance when itshould. Its kind of sticky. But even if it were working perfectly, I suspect givenhow the game works and the sloppiness of the real world there will be occasions where the10 point score reel moves but the match unit doesnt, or vice versa. But I am really curious tothe probabilities here if it were working perfectly. Wait a minute,I can just do a matrix cant I? OK, of the 100 possible ending combinations assuming the two mechanisms stay synchronized throughout a single-player game, 10 resultin a match. So it does seem as though the likelihood is 1 in 10 overall, but the odds ofgetting a match in the next game are heavily influenced by where the match unit ends in theprevious game. If it ends on 60, 40, 30, or 20, then you cannot win a match in the next game (assuming, again, the mechanisms stay synced). But your odds of getting a match are great if the previous game ended with the match unit on 70 or 50. But how multiplayer gamesmess with this, where each player up jumbles the sequencing up, is well over my head. I have triedto give it some thought but it hurts too much so Im throwing it out to you! I fully expect itto still be 1 in 10 overall but this bunching of possibilities combined with how the sequencesmight synchronize then desynchronize feels fishy. Now if you didnt spot it before, the coin unitmakes itself known one more time at the end of the game. Remember, it determines how many playerscan play. And what if the number match unit landed on zero in a single-player game? Three scoredisplays would match because theyre all zeroes, but you only paid for one game. Since its in the reset position, the coin unit prevents the number match feature from working on players 2 through 4. But, in a two player game, these three arrows all move down so now switch 3-C will pulse the 2nd player player and award a replay if it matches. Three players? Then 4-C gets hookedup, too. And in a four player game, every score display gets checked against the match unit, and any time one of them matches, you score a replay. And with that - weve reached the end. As in,I think Ive gone over pretty much everything this game does. But this wont be the lastvideo - at least two more videos on Aztec will be put out on Connextras. The firstwill be an unscripted one where I go over some frequently asked questions - so, uh, ask yourquestions in the comments below! And the second will be a sights-and-sounds video where I make audio recordings of it going through its various sequences and explain whatson the screen for those who cant see it. Oh, but I will address one thing whichkept coming up: many of you have presumed that these electromechanical games must behorribly unreliable and a pain to take care of. Well, as someone who has had this machine for over10 years and even - and here comes a surprise - had it on location in revenue service at a restaurant for a couple of years... I'm that weird. Ican tell you from first-hand experience this isnt the case! This machine has only had one thing breakin all this time - and that was a flipper. One of them just broke on the shaft. The only other issue I hadto take care of over several thousand games was the slingshots - on occasion the kicker wouldslip out from behind the rubber ring and then this would happen. [rapid, painful chattering] Luckily my friends who ran the restaurant would shut it off right away and put it out of order, and all I needed was toslide out the glass and put the kicker back. In contrast, this Theatre of Magic machine from 1995, which lives in my home and doesnt have the general public giving it quarters and beating itup, oh and also is run by a computer rather than all this crap, has had at least a dozen things gowrong with it which required repair in the last couple of years. Im talking potentiometer adjustments, mechanical realignments, wire-reattachment and repair, parts replacements, switch adjustments, and even driver board repair. And still! It has a problem with the trunk motor where it sometimes gets stuck for no apparent reason, theres a light socket I need to repair, and now the right flipper is sticking in the up position. Pinball machines from the '80sand '90s are an endless battle of weird little issues (especially as capacitors decay) but theseelectromechanical games are shockingly resilient! Aside from catastrophic mechanical failures likea flipper breaking off, the only truly troublesome thing in these electromechanical games are the stepperunits. They are rather delicate devices and their proper operation relies on smooth movement, properly-tensioned springs, and clean contacts. If they get gummed up or the springs start tofail, the game logic breaks down or sometimes it just doesnt do what it should - for instance I did have toreimburse my friends at the restaurant for several games when the coin unit didnt step up properlyfor a second player. Other than that, though, these machines usually just require cleaningdirty switches and adjusting them if need be. And, if theyre adjusted properly, they shouldmostly clean themselves. Their rounded shape and over-extension as theyre actuated producesa rubbing action which grinds off any deposits. What is truly difficult with these old games istroubleshooting problems. If a single switch is out of adjustment, it can wreck a whole lottastuff. And since all these switches look the same, with some normally open yet others normallyclosed, finding the problem switch can be a nightmare. But if you can learn to readtheir schematics and you understand what the game should do when, youll usually be ableto find it pretty quickly. And I hope through these videos that youll have some idea of how to do that for yourself. But Imust warn you: if you decide to get a pinball machine of your own, before long youre going to discover why they put a power outlet inside the cabinet. Thats for your soldering iron. And you will need it. Sometimesannoyingly frequently. Sure is worth it, though. salaciously smooth jazz ...between gambling and pinball led to it being outlawed in some locales - locales. In some locales. In some locales. In some locales. I am really struggling with saying those words! With the coin unit now in its second position - ah! I should start it, huh? [ka-chunk and all the lovely noises] [another ka-chunk as he finally remembers to add a second player] I think I said relay funny. The pulse coming from the outhole relay and switch 1-C to advaooohhh [tiny burp] god that line is too long! Meaning the next pulse in the sequench whits comes from swi - ah crap. ...until the player unit is on player 3. And I lost my place. So, ya think a video on Theatre of Magic and what these games started to look like in the solid state era might be worth it? There is some cool stuff in there: clever sensors, magnets, matrixed lamps and switches. Plus it's kind enough to keep track of things and tell you when there are problems! Well, usually. Self-diagnostics only go so far...",
    "transcript_keywords": [
        "player unit",
        "unit",
        "ball count unit",
        "player",
        "game",
        "match unit",
        "ball",
        "coin unit",
        "credit unit",
        "player reset relay",
        "count unit",
        "machine",
        "relay",
        "games",
        "score",
        "ball count",
        "credit unit step",
        "unit step",
        "player game",
        "position"
    ],
    "transcript_entity_values": [
        "Williams",
        "a couple of years",
        "1995",
        "the early days",
        "a minute",
        "two",
        "3",
        "Ican",
        "10,000",
        "20",
        "2",
        "10",
        "jack",
        "four",
        "one",
        "many years",
        "60",
        "4to",
        "5",
        "Gottlieb",
        "Somelawmakers",
        "30",
        "10s",
        "50",
        "Three",
        "50,000",
        "1,000",
        "400,000",
        "70",
        "Sometimesannoyingly",
        "the first quarter",
        "over10 years",
        "somecasinos",
        "11",
        "the early '90s",
        "AC",
        "Haunted Mansion",
        "first",
        "4",
        "tozero",
        "quarter",
        "100",
        "3,4",
        "Connextras",
        "Player 2's",
        "three",
        "Theplayer",
        "zero",
        "Youcouldnt",
        "1",
        "9",
        "20",
        "only one",
        "24",
        "100,000",
        "this Theatre of Magic",
        "80",
        "tofail",
        "40",
        "Lookhere",
        "'90s",
        "only two",
        "Aztec",
        "hundreds",
        "today",
        "Bally",
        "5",
        "switch1-C",
        "another quarter",
        "10",
        "the last couple of years",
        "100,000s",
        "350,000",
        "60",
        "Imust",
        "the 1930s",
        "5,000points",
        "10,000s",
        "Theatre of Magic",
        "the end of the",
        "third",
        "the years",
        "10%",
        "at least a dozen",
        "5,000",
        "at least two",
        "10 digits",
        "numbermatch",
        "ten",
        "50",
        "6",
        "10point",
        "4",
        "three quarters",
        "Congress",
        "70",
        "between 310,000",
        "One",
        "five",
        "First",
        "24 volts",
        "second",
        "awhole",
        "345,720",
        "2nd",
        "2s"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.027445537969470024,
        -0.025929071009159088,
        -0.0312060434371233,
        -0.12153355032205582,
        -0.04893428459763527,
        0.017677728086709976,
        0.006807428319007158,
        0.04148197919130325,
        -0.07292916625738144,
        0.074672631919384,
        -0.006917430087924004,
        0.05371817946434021,
        0.01576465740799904,
        -0.017406566068530083,
        0.018414253368973732,
        0.07583653926849365,
        0.0028292685747146606,
        -0.020001601427793503,
        -0.014078758656978607,
        -0.001523135113529861,
        0.04685857892036438,
        -0.17460991442203522,
        0.021570894867181778,
        -0.07304240763187408,
        -0.10905444622039795,
        0.05115482211112976,
        -0.004177768714725971,
        0.055267710238695145,
        -0.12184426933526993,
        -0.08914220333099365,
        -0.07991601526737213,
        0.0024770060554146767,
        -0.025302086025476456,
        0.0009441693546250463,
        -0.056916672736406326,
        -0.08679638057947159,
        -0.0035360988695174456,
        -0.010319286957383156,
        -0.06391803175210953,
        0.031745653599500656,
        -0.02416420914232731,
        -0.05565100535750389,
        0.04069676250219345,
        0.02161264605820179,
        -0.029509451240301132,
        0.10814827680587769,
        -0.041201286017894745,
        -0.020706795156002045,
        0.01675390638411045,
        -0.004865536466240883,
        -0.06003297492861748,
        -0.041650786995887756,
        0.14295443892478943,
        -0.009388112463057041,
        0.11211086809635162,
        0.0364995114505291,
        0.012303972616791725,
        0.04251549020409584,
        -0.01710359752178192,
        0.011241396889090538,
        0.06118357926607132,
        -0.01093723438680172,
        -0.06678501516580582,
        -0.04867510125041008,
        -0.005841931793838739,
        -0.07030291855335236,
        -0.03756571188569069,
        0.05858975648880005,
        0.0008592863450758159,
        -0.017120301723480225,
        0.03576425835490227,
        -0.03850485384464264,
        0.003044725162908435,
        -0.008359326049685478,
        0.03204771503806114,
        -0.0410006120800972,
        0.041486531496047974,
        -0.02335142344236374,
        0.028607316315174103,
        0.019076865166425705,
        0.015461886301636696,
        -0.029749786481261253,
        -0.05335747078061104,
        -0.04535840451717377,
        -0.03192765265703201,
        0.008496305905282497,
        -0.06066853553056717,
        0.028295250609517097,
        0.008118300698697567,
        -0.008215281181037426,
        -0.08786727488040924,
        0.030234066769480705,
        0.027266602963209152,
        -0.03145476430654526,
        0.07297873497009277,
        0.03176932409405708,
        -0.059668444097042084,
        -0.07181920856237411,
        0.008445730432868004,
        0.04851347580552101,
        0.024480540305376053,
        0.06572497636079788,
        0.05544670671224594,
        -0.05669531598687172,
        0.06284470856189728,
        0.01481956522911787,
        -0.027892690151929855,
        0.05288520082831383,
        0.05855407938361168,
        0.007711048237979412,
        0.02108200453221798,
        0.005458362400531769,
        0.0103037990629673,
        0.03496911749243736,
        -0.11557785421609879,
        0.013855106197297573,
        -0.11414805799722672,
        0.04420185461640358,
        -0.022936467081308365,
        0.07442392408847809,
        0.12276579439640045,
        -0.04629019647836685,
        -0.002051263116300106,
        -0.0029588656034320593,
        0.04245750606060028,
        0.05775696039199829,
        -0.052679289132356644,
        2.3625261786978958e-33,
        -0.01148178055882454,
        0.020544884726405144,
        0.011303567327558994,
        0.047459688037633896,
        -0.011407701298594475,
        -0.0009753912454470992,
        0.024996822699904442,
        0.02393459528684616,
        -0.06136801093816757,
        0.02613505907356739,
        -0.05782425031065941,
        0.06292227655649185,
        -0.08773994445800781,
        0.02502625621855259,
        0.06988617777824402,
        -0.13486036658287048,
        -0.04948846995830536,
        -0.021064072847366333,
        0.013472718186676502,
        0.011617720127105713,
        0.029798615723848343,
        0.011986383236944675,
        -0.01759175956249237,
        -0.029865557327866554,
        -0.001784961437806487,
        0.01867237500846386,
        -0.028495322912931442,
        -0.08867790549993515,
        0.07741910964250565,
        0.020489512011408806,
        -0.008837143890559673,
        -0.025522394105792046,
        -0.11580527573823929,
        -0.017765292897820473,
        0.016281653195619583,
        0.006694147828966379,
        -0.0038197305984795094,
        -0.09536004811525345,
        -0.0028276604134589434,
        0.040144097059965134,
        -0.04147082194685936,
        -0.06430400907993317,
        -0.06684179604053497,
        -0.015351084992289543,
        -0.07349658757448196,
        -0.03815366327762604,
        0.0294803474098444,
        -0.01946394145488739,
        -0.04195811226963997,
        0.011180221103131771,
        0.04195491597056389,
        3.758487991945003e-06,
        0.035464320331811905,
        -0.040056418627500534,
        0.04742322117090225,
        -0.05422740802168846,
        -0.007022949866950512,
        -0.002702576108276844,
        -0.0032498929649591446,
        0.017808822914958,
        0.016793295741081238,
        -0.00919437874108553,
        -0.020882174372673035,
        0.008905673399567604,
        -0.04856539145112038,
        0.06416991353034973,
        0.06529220193624496,
        -0.0226958729326725,
        0.006169578060507774,
        0.022141557186841965,
        -0.013133855536580086,
        -0.0978497639298439,
        -0.03952687978744507,
        -0.024042339995503426,
        -0.008141323924064636,
        0.09285847097635269,
        0.024956604465842247,
        0.0560818687081337,
        0.04315469041466713,
        -0.06774444878101349,
        0.05232035741209984,
        -0.0026000281795859337,
        -0.08123517036437988,
        -0.0332573726773262,
        -0.004448276478797197,
        0.0265848096460104,
        -0.004860903136432171,
        -0.074458546936512,
        -0.02921096421778202,
        0.046613432466983795,
        -0.02376345545053482,
        0.006450955756008625,
        -0.03274596855044365,
        0.05318480730056763,
        0.009838557802140713,
        -3.876962937978266e-33,
        -0.04939998686313629,
        -0.012953461147844791,
        -0.05647379159927368,
        0.05634494125843048,
        0.0823526680469513,
        0.01599564030766487,
        0.08483803272247314,
        -0.05412554740905762,
        0.016959330067038536,
        0.004653178621083498,
        -0.032879672944545746,
        0.004233005456626415,
        0.06854985654354095,
        0.023016633465886116,
        0.05399203300476074,
        -0.0012375721707940102,
        -0.01754234917461872,
        0.1073722392320633,
        0.03472325578331947,
        0.017272481694817543,
        0.09815558046102524,
        0.0875227302312851,
        -0.0065213413909077644,
        0.01942821964621544,
        0.00038446119287982583,
        0.023939108476042747,
        -0.021315231919288635,
        -0.06296442449092865,
        0.025891510769724846,
        0.05866994708776474,
        0.006409774534404278,
        -0.01837378367781639,
        0.06011483818292618,
        0.08178646862506866,
        -0.040915459394454956,
        0.02899782545864582,
        0.0643828958272934,
        0.035189755260944366,
        0.05192236602306366,
        -0.10082819312810898,
        0.04020155966281891,
        -0.012112626805901527,
        0.018879804760217667,
        0.07344113290309906,
        -0.027025649324059486,
        0.047817714512348175,
        -0.0855884775519371,
        -0.012840976938605309,
        -0.06263291090726852,
        0.056458741426467896,
        -0.10032684355974197,
        -0.030617184937000275,
        -0.014263713732361794,
        -0.11189599335193634,
        -0.07778721302747726,
        -0.04270881414413452,
        -0.002822334412485361,
        -0.0392833948135376,
        0.025488989427685738,
        0.05987553671002388,
        -0.01751023158431053,
        -0.06681065261363983,
        -0.016219496726989746,
        0.1005655899643898,
        0.06618833541870117,
        0.054959703236818314,
        0.060011520981788635,
        0.012829866260290146,
        -0.03440932556986809,
        -0.03724643960595131,
        -0.0363948792219162,
        0.08950413763523102,
        0.07785864174365997,
        -0.040445536375045776,
        0.006394372787326574,
        0.07396488636732101,
        -0.02497725747525692,
        0.03436348959803581,
        -0.00655549019575119,
        -0.005608040373772383,
        -0.07058673352003098,
        0.03143176808953285,
        0.058197833597660065,
        -0.016490045934915543,
        -0.01692637987434864,
        0.058335889130830765,
        0.039404965937137604,
        0.05472053214907646,
        -0.06437446177005768,
        0.011382069438695908,
        0.04452640935778618,
        0.03274863585829735,
        0.14025840163230896,
        -0.0027715517207980156,
        0.03722737729549408,
        -5.691194360224472e-08,
        0.027387047186493874,
        0.06756570190191269,
        0.03037548065185547,
        -0.006172338034957647,
        0.006268098019063473,
        0.04591510444879532,
        -0.010012284852564335,
        0.0013386247446760535,
        0.01912187971174717,
        -0.03336511179804802,
        -0.008538545109331608,
        0.02194165624678135,
        0.021071743220090866,
        0.023333633318543434,
        0.08349128812551498,
        0.08938808739185333,
        -0.0888916552066803,
        0.007768661715090275,
        -0.0504634827375412,
        0.08399099111557007,
        0.050786860287189484,
        -0.005113864317536354,
        0.032091859728097916,
        0.08333756029605865,
        -0.06394621729850769,
        0.02925805188715458,
        -0.05443454906344414,
        0.022805411368608475,
        -0.028949527069926262,
        0.02194136567413807,
        -0.0213826484978199,
        -0.005182600114494562,
        -0.01297752931714058,
        0.02794184535741806,
        -0.043645888566970825,
        -0.02535075880587101,
        -0.06693260371685028,
        0.05383433401584625,
        -0.03653902933001518,
        0.01662180759012699,
        -0.05561739206314087,
        -0.0734633356332779,
        -0.18533247709274292,
        0.01969345659017563,
        -0.001970664132386446,
        -0.05774379149079323,
        -0.10383264720439911,
        -0.06939427554607391,
        -0.05477461591362953,
        0.0323508121073246,
        -0.010139524936676025,
        0.053616441786289215,
        0.01285479310899973,
        0.011073810048401356,
        0.08886882662773132,
        0.11765840649604797,
        -0.010401485487818718,
        0.03923438489437103,
        0.06243940070271492,
        -0.013097369112074375,
        -0.04156943038105965,
        0.0190044604241848,
        -0.022636903449892998,
        0.02083209715783596
    ]
}