{
    "id": "xf_ReluPZf4",
    "title": "Unboxing the most EXPENSIVE Mystery Tech...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-11-06T18:04:51Z",
    "video_url": "https://www.youtube.com/watch?v=xf_ReluPZf4",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "how to waste",
        "amazon",
        "beats",
        "beats studio buds",
        "beats fit pro",
        "beats fit pros",
        "airpods",
        "airpods 3",
        "apple",
        "intel",
        "intel evo",
        "thunderbolt",
        "syng cell",
        "syng cell alpha",
        "tech",
        "unboxing",
        "microsoft",
        "surface",
        "surface duo 2",
        "austin",
        "austin evans"
    ],
    "views": 1205015,
    "likes": 38893,
    "comments_count": 1033,
    "description": "Check out Intel Thunderbolt + Intel Evo!  Syng Cell Alpha speaker:  Apple AirPods 3 on Amazon:  Beats Fit Pro on Amazon:  I'd actually recommend the Beats Studio Buds on Amazon FYI:  Pocket Tripod on Amazon:  Microsoft Surface Duo 2 on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  My new podcast @TheBackmarkers!  I have a TikTok!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://austin.tech/intelevo",
        "https://austin.tech/syngcell",
        "https://austin.tech/airpods3",
        "https://austin.tech/beatsfitpro",
        "https://austin.tech/studiobuds",
        "https://austin.tech/pockettripod",
        "https://austin.tech/surfaceduo2",
        "https://www.relay.fm/testdrivers",
        "https://www.tiktok.com/@austintechtips",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- [Ken] How much do you think we spent? - I don't know. - [Matt] Throw a number out. - 279.99. - No, higher. - Double it. - Higher, higher. - $560. - Higher. - A thousand, $1,120. - Higher. Is this a math question? - Higher, yes. - Double that. - $1240. - Nope. That's not double. - That's not double. - 2240, 2240. - Close enough. - [Ken] That's how much we spent on this. - What the? Is this Price is Right? (Ken groaning) - Dammit. - You spent $2,000 on a box? Apparently it has Spotify and Airplay. So is this a really expensive, stupid speaker? - [Matt] No, clearly a refrigerator. - [Ken] Yes, you. Oh my God. What, what, what else could it be? - [Ken 2] So full disclosure, I actually did find this on Instagram and usually these things are like Kickstarters that like don't really exist, but I was surprised that this one actually showed up. - Wait, wait, wait, wait. You spent $2,000 on a random product you found on Instagram and you're surprised it showed up? (Ken laughing) - Yeah. - Cell Alpha, welcome to a new sound. Any number, any layout. Place your cells how they best fit in your space. - [Ken] I could have bought more, but I spared you. - [Matt] I like how it's implied that you could buy like five of these. - Oh, wow. I mean, that is quite some packaging I will say. It looks like Marty Mcfly's leftovers. - [Ken] It's like a space star burst. (packaging tears) - It just keeps going. What the hell is this? Inside box number one is more. What, what the? Uh huh. Remove before assembly. (packaging crinkles) Oh, sweet baby Jesus. - [Ken] No, it says remove after assembly. Look it says after. - After. - [Ken] Where did you see before? Let it. No, no, no, no, no, no, no, no, no, no, no, no, no, no, no. How can you be so criminally bad at this? - [Jared] Before you, I need to do another take. - Doesn't it need to go through here? - Oh, you're right. - How can you be so criminally bad at this, Ken? - Fair enough. - The Triphon, a three horn system projects sound with pinpoint accuracy. Single point source, all sound emanates from the core delivering unmatched clarity and perfect timber. All right, is everyone ready? We're about to start a sound check. I don't know what's about to happen. I have big expectations. Start sound check now. It is updating software, nevermind. (Ken laughing) - [Jared] I am ready for the AURAL experience that we're about to - You're about to experience some oral bliss, friends. - Aural! - Oral bliss is on the way. - [Jared] AURAL, AURAL. - Apologies to everyone at home. I'm about to play copyrighted music. So, edit team, please put on some friendly, royalty free music so everyone can see how great this sounds. Wait. No, no, no. There's a royalty free track. We can actually listen to altogether, okay. (dance music) (all laughing) What's wrong with us? This is one of the most expensive mystery tech items ever. The fact that one of these speakers is $1,800, for mere mortals like us, is blowing our minds. - Yeah and it's not even that crazy like deep bass, - Yeah. - but it still packs a punch and it's again, as you said, it's even. - You know what we should do right now? We should take a moment and appreciate mystery because you know what we don't have enough in the world? Mystery. - [Ken] Wasn't (beep) good enough for you? - Oh my god. (Ken laughing) - [Ken] It sounded way better in my. I don't know why, it sounded way better. - Yeah, (indistinct). (Ken laughing) - Boy, what the? Is that a F1 wheel? - It's not just a 1. - Did you break it? Did you break the wheel? - [Ken] No, it came like that. - You dropped the wheel? Really, really, really, really, really hard? - [Ken] I dropped the wheel sideways and by me I meant Sergio Perez. - Can I ask, oh wait, is this for what I think it is? - Yes. - Oh. You might want to subscribe and ring a ling that ding a ling button. We got some cool stuff coming up. I can't say anything about it though. You realize, I can't say anything right now. I. - [Ken] I will, I will. I will be very subtle with my euphemism. - Wow, Ken, subtle. The Kensington SD5700T Thunderbolt 4 Dual 4K dock. Are you about to give me a great segue to the sponsor of today's mystery tech, Intel's wonderful Thunderbolt technology powered by Evo laptops. Oh, okay. All right. The Sabrent Rocket USB C external aluminum SSD, oh there's a bunch of stuff here. There's an enclosure. Oh wow. So we have three Thunderbolt SSDs and is that an Intel Evo powered Lenovo Yoga laptop? - Yes it is. - Oh boy. Okay, so there's a lot to break down here. So you're probably familiar with Thunderbolt. This is a technology developed by Intel. That's been through many iterations, but essentially it is sort of like the ultimate port because with a single Thunderbolt port, not only can you power your device, but you also have 40 gigabits per second throughput. So with my dock, I can do dual 4k displays or an 8K display, on top of all the other nonsense that I'm going to plugin. Oh, what the? Oh, is that a Thunderbolt display? - It is a Thunderbolt display. - That's a big chungus if I've ever seen a big chungus. Is that a 38 inch? - [Ken] This a 34 inch, 1440P high Thunderbolt display. - So I'm going build a whole set up right now. - Yes. - Okay. - So I don't know if you saw, - Yeah. - But - We have three individual, how big are this? - Did you see this one? - No. Eight terabytes over Thunderbolt SSD? - [Ken] So they're rating just under 3000 megabytes per second. - Wow. So it will go down to USB, but obviously you get the best speeds with Thunderbolt. 2,700 megabytes per second. That is extremely fast. Wow. So this is an eight terabyte, two terabyte, and two terabyte. - [Ken] That sounds like it'll be great for video editing. - So we're going to start out with the dock. So we have the Thunderbolt in. We have USB A, SD card, and headphone jack, as well as little power button. But on the back we have three more Thunderbolt ports, so we can load it up with SSDs. We have ethernet and a bunch more 10 gig USB 3.0 ports. Okay. So this is a great place to start. So one of the nice things about Thunderbolt is that it is essentially the do everything port. So with a single cable, I'm going to plug in this Yoga laptop, which of course is EVO certified. Then it is going to turn on our dock, which has our mouse, ethernets, as well as we have our three SSDs and the display all connected. Again, this is all coming from a single cable. - [Ken] And that was fairly quick too. - Fairly fast, right? Everything just lights up. It's good to go. And the cool thing about Thunderbolt is that it really kind of allows you to do everything because I could just as easily plug in a USB C cable. I could just be charging the laptop, which this is being charged right now, by the way. Or you could even do something as simple as use this to go out to like just a single external display or an external graphics card or wherever the case is. I use Thunderbolt on a daily basis. I use a Thunderbolt display on my desk. I have since like 2016 and it's nice because it really allows you to do pretty much everything. Now, all you need is the one cable. Unplug it, grab your laptop, and you're good to go. I mean, it's hard to argue with that. Wait, I'm not, well, I'm not done. I was about to walk off. I'm not done yet. So you'd like to know more about Intel's fine, Thunderbolt technology, their EVO laptops, and of course the wide variety of accessories that are available for them, definitely be sure to go check that out at the link in the description and huge shout out to Intel for sponsoring this episode of Mystery Tech. Just lay it on me. - What? - Just lay it on me. - What are doing? No. Lay what on you? I'm not laying on you. - Throw my way. Wing it. - [Ken] I have hid the product that you're going to take a look at somewhere in the room and you have to find it. - It's in your hand. I see it. - [Ken] No, this is a different product. - No there's not. You're tricking me. I see a product in your hand right now. You want me to look around the set? You just tricked me. That was a duplicitous move. These are the AirPods 3. I am skeptical because while the upgrades to the AirPods 3, you know, having the new design and whatnot, are cool, spatial audio. These retail for $180. At that kind of price, you can get a lot of headphones that have active noise cancellation, like the Beats Studio Buds that I've reviewed on Mystery Tech previously, which I actually really like, but one of the things I'm probably most excited for is wow, that's a small case, is the sound quality because supposedly these AirPods sound better. I've never been a huge fan of the way the AirPods sound. They always sound fine, but nothing more than that. My test is always does it fit in the coin pocket? So I'll take out my headphones. And that is, I mean, that's, those might be the smallest case I've ever actually used for a pair of Bluetooth earbuds. That's really, really good. A lot of people like regular AirPods because they have plastic tips instead of rubber. I was actually like that for a long time. It took me years before I was really comfortable with rubber ear tips. I've kind of gotten used to it, but there is certainly something, especially depending on like the size of your ear, to the idea of using the plastic tip. All right. Let's see how they sound. (faint music) You know what? Not bad. - Is your hearing okay? - You can definitely hear my music? - Yeah, 100%. - It's at like 85 decibels. It's definitely not good for your hearing. - Thanks, Dad. - So the thing is, what you're missing here really is the active noise cancellation. Definitely not here. 100%, I can hear everything around me. The AirPods are pretty solid, but I also have recently got a pair of the Beats Fit Pros. So these are similar I would say in a lot of ways to the Beats Studio Buds. The Beats are only $20 more than the AirPods and while they don't have MagSafe, they do have active noise cancellation and they had the cool little light design that fits in your ears. I've spent some time. I just got DM'd by Taco Bell. (laughing) That's a weird thing. Okay. - They sent a photo. - Oh, oh. - Y'all stay out of my DMs, okay. - I want, - I want to know. - I want. - Absolutely not. - You got DM'd by Taco Bell? (Ken laughing) - [Ken] Yo, is Taco Bell DTF? - I shouldn't be surprised, but I guess I am. They're actually really similar. Both of them actually have similar sounds. Like I'll still say the Beats sound a little better, but that almost seems more like a consequence because they're actually sealed, which I think always just kind of helps to improve sort of sound quality. - But here's the thing, AirPods Pros are usually - Are about the same price. - around $180 anyway. - Yeah. These are 200 and these are 180 MSRP. AirPods Pros technically cost 250, but you can find them 200 bucks, 170, 180 bucks, pretty easily. - [Ken] The Android argument's one thing, but if you're on the Apple side, just wait for the Pros to be on sale again. - That being said though, I actually still like the Beats Studio Buds. They're 150 bucks. They have most of the same features except they have the small case. They had the active noise cancellation and they work well with Android. On top of that, the Beats Studio Buds are $150 retail, but regularly go on sale for like 120, 130 bucks. Out of all these headphones, those actually are probably my pick. I don't think these make sense, 180 bucks. And I think these are okay at 200. I think the Beats Studio Buds are actually my favorite. - But, here's the thing. - Yeah. - [Ken] AirPods 3. Got the flex. - Is that even a flex anymore? I feel like half the $20 wish earbuds you buy look exactly like AirPods anyways. - [Ken] Yeah, they just. They're twice the size in your ear - No. - [Ken] and people don't think I notice. - So then I told them that what we really need is some tech that's actually not super expensive and he just laughed. Ow, did you just throw something at me? I'm having a chat with the director of, okay, that's fine. That's fine. This is the Pocket Tripod Pro. How much is a pocket tripod? - [Ken] I bought them for 35 each. I have one as well. - 35 Bucks. Okay, that's not outrageous. They look a little like a JOBY pods there. That's about the same price. Wow. Okay. If this isn't a complete pile of garbage, this is actually going to be cool. - [Ken] What? What are you? No, no. Go like this. - Rotate around. - They're together now. - Oh, oh, I see. Okay. You're you're you're you're smart, Mr. Bolido. You're smart. So now I'm going to hit record on the iPhone. - Yeah. - If we want a Roboraptor POV camera, we can just look at what it looks like to be Roboraptor all day. - [Ken] See, I want that for the plane so that I can watch videos on it and also have that in my wallet. (Austin humming Zelda music) - Whoa. Wow. That was really high. That will almost hit the top camera. Hello, welcome friends, to a very exciting time for me to unbox an item that I single-handedly saved from the clutches of Ken who almost wrecked. - I think you used two hands for that. - Double handedly saved from the wicked witch himself, Ken. - I think it's on brand. - What? - Inside, the many layers of the box is this Surface Duo. The Duo. - What is wrong with you? Jesus. - Now this is actually one of those rare items that I've actually been able to try beforehand. So we actually went to a sort of pre-brief hands-on of this a few weeks ago. I got what, 20 minutes to play with the phone. And in that 20 minutes, I was very impressed. So one of the first things you'll notice is this has a much, much larger camera bump, AKA, it has a real set of cameras. So the first Duo only had a front facing camera, which you could kind of flip around, but this now has a proper triple camera setup. It has an ultra wide, a wide, and a telephoto. The thing is, if you look at these two devices, right? So the original Duo, as well as the Duo two, they're incredibly thin. And when it comes to designing cameras, the whole reason why, again, I'm just going to pull out, the Pixel has this huge camera bump is because for a large camera and a large sensor, large lens, you just need some depth, right. Which is why they have to sort of chonktastic it up. - [Ken] So the camera bump is angled. - Yes. - [Ken] So that it's not going to scratch the back of the phone. So while there is a bump and it's not a perfect fold anymore, it's actually at least thought about. - So I have now installed the case, which calling this a case, I think, is kind of a overstating it because it is incredibly thin. But the nice thing is not only does it have a magnetic spot for your pen, but it also wirelessly charges it. Because of the dual screen nature of this, you kind of need a lot of additional software support. So let me run you through some of the speeds and feeds, Snapdragon 888 processor, 5G, NFC, giant battery, as well as you've got the two very large displays, which are now curved on the inside, which means that as you look and you scroll between them, not only does it feel nice with your finger, but also it is very, very much seamless. Today I'm going to react to a classic using the Surface Duo. Hello, welcome to my YouTube channel where I am a reactor reacting to this heavily requested video of a certain tech tip man and his important thoughts. Great intro. Very enthusiastic. He's now talking. - [Ken] Austin. Tell me about the Duo. What do you think? - What accent was that? - I'm going to go leave now - [Ken] A mix of Australian and British. - Thank you. Make sure you subscribe. Don't encourage Ken, but subscribe to me and you'll get content that's actually good. Unlike what you're watching right now.",
    "transcript_keywords": [
        "Beats Studio Buds",
        "Thunderbolt",
        "Beats Studio",
        "Thunderbolt display",
        "Studio Buds",
        "sound",
        "Beats",
        "Yeah",
        "AirPods",
        "Duo",
        "thing",
        "camera",
        "wow",
        "higher",
        "mystery tech",
        "Wait",
        "display",
        "Studio",
        "Intel",
        "USB"
    ],
    "transcript_entity_values": [
        "35 Bucks",
        "this Surface Duo",
        "only $20",
        "Spotify",
        "5",
        "iPhone",
        "first",
        "jack",
        "USB C",
        "1",
        "two",
        "Matt",
        "120",
        "the AirPods 3",
        "Eight terabytes",
        "one",
        "the Beats Studio Buds",
        "USB A",
        "560",
        "Australian",
        "Jesus",
        "180",
        "Beats Fit Pros",
        "Thunderbolt",
        "The Sabrent Rocket USB C",
        "Airplay",
        "888",
        "130 bucks",
        "2",
        "Marty Mcfly's",
        "Bolido",
        "this a few weeks ago",
        "MagSafe",
        "Ken",
        "USB",
        "250",
        "Austin",
        "Instagram",
        "34 inch",
        "EVO",
        "2016",
        "170",
        "180 bucks",
        "number one",
        "20 minutes",
        "YouTube",
        "Taco Bell DTF",
        "SSD",
        "4k",
        "38 inch",
        "1,120",
        "today",
        "3000 megabytes",
        "Android",
        "daily",
        "200 bucks",
        "Lenovo Yoga",
        "1240",
        "279.99",
        "1,800",
        "AirPods",
        "Sergio Perez",
        "British",
        "Apple",
        "the Surface Duo",
        "Thunderbolt",
        "100%",
        "2240",
        "Zelda",
        "Duo",
        "Kensington",
        "years",
        "around $180",
        "an eight terabyte",
        "Thunderbolt SSD",
        "JOBY",
        "Taco Bell",
        "all day",
        "SD",
        "2,700 megabytes",
        "NFC",
        "40 gigabits",
        "Yoga",
        "Ken] Austin",
        "a bunch more 10",
        "Mystery Tech",
        "Evo",
        "Pixel",
        "two terabyte",
        "180 MSRP",
        "Ken] Yo",
        "35",
        "three",
        "Ken] AirPods 3",
        "2,000",
        "Roboraptor",
        "150",
        "AirPods Pros",
        "4",
        "Today",
        "8",
        "Pros",
        "150 bucks",
        "five",
        "Intel",
        "200",
        "Dad",
        "20"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "NORP",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "FAC",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY"
    ],
    "vector": [
        -0.07075734436511993,
        -0.020021459087729454,
        0.03823324665427208,
        -0.00438486086204648,
        -0.02343703806400299,
        -0.030259976163506508,
        0.09416727721691132,
        0.06610815972089767,
        0.06623964011669159,
        0.07164496183395386,
        0.014011148363351822,
        0.005142645910382271,
        -0.003872718894854188,
        -0.050237979739904404,
        0.03132802993059158,
        -0.05383485555648804,
        0.1136568933725357,
        -0.03951062262058258,
        -0.09753412753343582,
        0.0030477631371468306,
        0.029966620728373528,
        -0.0430193655192852,
        0.030460311099886894,
        0.01160620991140604,
        0.11936940997838974,
        0.022192632779479027,
        -0.04112750664353371,
        -0.05161057412624359,
        -0.03466968238353729,
        0.014555398374795914,
        -0.08893828094005585,
        0.06631066650152206,
        0.027489695698022842,
        -0.01780952513217926,
        0.01480020023882389,
        -0.055589720606803894,
        0.05169259384274483,
        -0.016071345657110214,
        -0.0413983128964901,
        0.00709191570058465,
        -0.021959451958537102,
        -0.05260678380727768,
        -0.030703388154506683,
        0.031148241832852364,
        -0.04558892548084259,
        -0.007917824201285839,
        -0.023392315953969955,
        0.002736566122621298,
        0.008302738890051842,
        0.06707895547151566,
        -0.02025611698627472,
        -0.01378939300775528,
        0.03430036082863808,
        -0.041696738451719284,
        0.03447490930557251,
        0.03141476586461067,
        0.012901989743113518,
        -0.00990552268922329,
        0.031831882894039154,
        0.034302327781915665,
        -0.0154567901045084,
        -0.09896477311849594,
        -0.028051504865288734,
        0.026200834661722183,
        0.014991612173616886,
        -0.03033958002924919,
        -0.04400630667805672,
        0.030735738575458527,
        -0.05004559084773064,
        0.0479242205619812,
        0.01690426655113697,
        0.027843840420246124,
        0.0643535926938057,
        0.011646315455436707,
        0.0288765337318182,
        0.03261687979102135,
        0.11086568236351013,
        -0.005542994011193514,
        0.004938545171171427,
        0.05098855495452881,
        0.02601824514567852,
        -0.1152450293302536,
        -0.05037609115242958,
        -0.054893575608730316,
        0.07461079210042953,
        0.013045242987573147,
        0.029979949817061424,
        0.0038179524708539248,
        0.012151148170232773,
        -0.029152441769838333,
        -0.0008851024904288352,
        0.00010533750901231542,
        0.0018108653603121638,
        -0.005419882480055094,
        0.02804691530764103,
        0.0684928297996521,
        -0.07792861759662628,
        0.02808258682489395,
        -0.018511908128857613,
        0.033259615302085876,
        0.0906863585114479,
        0.07151705771684647,
        0.06047539785504341,
        -0.10874883830547333,
        0.01873229257762432,
        -0.07089421898126602,
        -0.038880959153175354,
        0.03320160135626793,
        0.09971781820058823,
        0.0592719204723835,
        -0.021311312913894653,
        -0.09765447676181793,
        -0.01213170401751995,
        0.030443433672189713,
        -0.0014412305317819118,
        0.048426710069179535,
        -0.029206421226263046,
        0.039489809423685074,
        0.07105445861816406,
        -0.035874687135219574,
        -0.021759260445833206,
        0.047018613666296005,
        0.021882392466068268,
        -0.014084937050938606,
        -0.07982541620731354,
        -0.04507271200418472,
        -0.12340869009494781,
        -1.2529888159002468e-33,
        -0.010298625566065311,
        0.06860139966011047,
        0.00423706928268075,
        -0.10221533477306366,
        -0.05405542999505997,
        -0.04527325555682182,
        -0.0680452436208725,
        0.08166352659463882,
        -0.028088530525565147,
        0.10149610787630081,
        -0.07772795110940933,
        0.06596945226192474,
        -0.028352398425340652,
        0.0578298345208168,
        0.028856949880719185,
        -0.04741350933909416,
        -0.07855323702096939,
        0.0011540240375325084,
        0.03794265165925026,
        -0.004280406981706619,
        0.012001912109553814,
        -0.06510818749666214,
        0.011007867753505707,
        -0.005266163963824511,
        0.010739481076598167,
        -0.04491843655705452,
        0.005183286964893341,
        -0.09594763070344925,
        0.10772689431905746,
        0.013578019104897976,
        -0.10287132114171982,
        -0.0074813468381762505,
        0.03560129180550575,
        -0.05556271970272064,
        -0.023057643324136734,
        -0.028602145612239838,
        -0.00343562220223248,
        -0.03021828643977642,
        0.010206252336502075,
        0.023423640057444572,
        -0.057328712195158005,
        0.04297284781932831,
        -0.025739725679159164,
        -0.057221055030822754,
        0.004182758275419474,
        0.02087986469268799,
        0.025435689836740494,
        -0.0164569653570652,
        0.06014636904001236,
        -0.051872096955776215,
        -0.08670572936534882,
        0.01357512641698122,
        0.004008816555142403,
        0.0011844682740047574,
        0.002413683570921421,
        -0.10696323961019516,
        0.028091304004192352,
        0.029058773070573807,
        0.06323646754026413,
        0.08022165298461914,
        -0.050441473722457886,
        0.030216781422495842,
        0.06419805437326431,
        -0.019663458690047264,
        -0.17484398186206818,
        0.08810524642467499,
        0.002340528881177306,
        0.025470614433288574,
        -0.04307114705443382,
        0.0728115439414978,
        -0.01067189872264862,
        0.04313715174794197,
        0.034599389880895615,
        -0.05676351860165596,
        0.04655343294143677,
        0.004106038715690374,
        -0.009616125375032425,
        0.0335906445980072,
        0.05578813701868057,
        0.0032365499064326286,
        -0.041490573436021805,
        -0.008077776990830898,
        0.03150816261768341,
        0.05695619434118271,
        -0.03485069051384926,
        -0.00536745972931385,
        -0.005823541432619095,
        -0.015399226918816566,
        -0.024254219606518745,
        0.03228999674320221,
        -0.018123392015695572,
        0.027125801891088486,
        -0.105563685297966,
        -0.08972425758838654,
        -0.006302011199295521,
        -6.896620305322072e-34,
        -0.024195503443479538,
        0.04678143188357353,
        -0.006479083094745874,
        0.07355907559394836,
        0.00329126650467515,
        0.0036527381744235754,
        -0.010562705807387829,
        -0.038448650389909744,
        0.04306720569729805,
        -0.00556072685867548,
        -0.0071614691987633705,
        0.06978383660316467,
        -0.000126802537124604,
        0.014257542788982391,
        0.029693925753235817,
        -0.07248184084892273,
        -0.024822181090712547,
        -0.07593374699354172,
        0.0513116754591465,
        -0.07030374556779861,
        0.02336641028523445,
        0.03349688649177551,
        0.03916017338633537,
        0.05957096070051193,
        -0.033161461353302,
        0.0195846576243639,
        -0.019115662202239037,
        -0.0040827104821801186,
        0.023517554625868797,
        0.02820749580860138,
        0.012377056293189526,
        -0.12169377505779266,
        -0.00205069943331182,
        0.02847890555858612,
        0.0008015198400244117,
        0.01544270385056734,
        0.05985843762755394,
        0.030145129188895226,
        -0.0066942377015948296,
        -0.04311683028936386,
        0.032637547701597214,
        -0.005573739763349295,
        -0.03860973194241524,
        0.0368942990899086,
        0.051006071269512177,
        -0.10682641714811325,
        -0.05972589552402496,
        -0.007961053401231766,
        0.019845223054289818,
        -0.03646114468574524,
        0.015729133039712906,
        -0.02092353068292141,
        -0.016384301707148552,
        0.028318345546722412,
        -0.1463821828365326,
        0.04024248570203781,
        -0.03242218866944313,
        0.037444427609443665,
        0.04736773297190666,
        -0.016704177483916283,
        0.03902874141931534,
        -0.00023174269881565124,
        -0.024848006665706635,
        0.024356679990887642,
        -0.059815019369125366,
        0.04942411184310913,
        0.10162649303674698,
        0.02752198837697506,
        -0.0744154155254364,
        -0.030655089765787125,
        -0.026778142899274826,
        0.002019805135205388,
        -0.006153135094791651,
        -0.09947160631418228,
        -0.046814706176519394,
        0.10080341249704361,
        0.02627772092819214,
        -0.02535138837993145,
        0.08984412997961044,
        0.0012847674079239368,
        0.009217796847224236,
        0.030822647735476494,
        0.0853060632944107,
        0.003972378093749285,
        0.030699823051691055,
        -0.0016425601206719875,
        0.011020097881555557,
        0.061099693179130554,
        -0.09279889613389969,
        0.027525516226887703,
        -0.09155478328466415,
        -0.009401685558259487,
        -0.07457327842712402,
        0.05185465142130852,
        -0.017627980560064316,
        -6.38282884324326e-08,
        0.03717946633696556,
        0.07012113928794861,
        0.04881449043750763,
        0.027614695951342583,
        0.025767868384718895,
        -0.024215761572122574,
        0.055777907371520996,
        0.09843454509973526,
        -0.005299563053995371,
        0.034559573978185654,
        0.014288393780589104,
        -0.07428272068500519,
        -0.09880657494068146,
        0.01987256295979023,
        0.008046526461839676,
        0.0016720922430977225,
        -0.06676581501960754,
        0.018767884001135826,
        -0.05593385174870491,
        -0.06724588572978973,
        0.026508215814828873,
        0.10468252003192902,
        0.0645369291305542,
        -0.00656868377700448,
        -0.05319364741444588,
        0.05946630239486694,
        0.01090078242123127,
        0.08950617164373398,
        0.023997625336050987,
        -0.013771460391581059,
        -0.026927608996629715,
        -0.07017244398593903,
        -0.04234796017408371,
        -0.0031288997270166874,
        0.0018952430691570044,
        -0.11193806678056717,
        -0.08713036775588989,
        0.029879337176680565,
        0.050642043352127075,
        0.05083181709051132,
        -0.07111787050962448,
        -0.10535535216331482,
        -0.012769291177392006,
        0.03260071203112602,
        0.07197580486536026,
        -0.054301973432302475,
        -0.08141475915908813,
        -0.06273452192544937,
        -0.021423382684588432,
        0.008388424292206764,
        0.002829907462000847,
        0.05821283906698227,
        0.004021306522190571,
        0.020137907937169075,
        0.033879056572914124,
        -0.02587539702653885,
        -0.04580473154783249,
        -0.0007903375080786645,
        -0.0972072035074234,
        0.08934888988733292,
        0.09546713531017303,
        -0.11960408836603165,
        -0.06121797487139702,
        0.05980678275227547
    ]
}