{
    "id": "xg6JMBrFZWw",
    "title": "A quarter the price! - NexiGo Aurora Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-10-16T18:10:10Z",
    "video_url": "https://www.youtube.com/watch?v=xg6JMBrFZWw",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "NexiGo",
        "Projector",
        "Home theatre",
        "Audio",
        "NexiGo Projector",
        "4K Projector",
        "120hz",
        "Television",
        "TV"
    ],
    "views": 736038,
    "likes": 17371,
    "comments_count": 873,
    "description": "Thanks to NexiGo for sponsoring this video! Purchase a NexiGo Aurora Pro Projector at:  and get $300 off with the coupon AURORAxSC. Note that this coupon is limited to 200 uses and is valid for one month.  4K projectors are a great avenue to explore if you are looking for a large display but don't have the budget for those expensive 100-inch TVs. Luckily for you, the new Aurora Pro Projector from NexiGo will satisfy your needs with its 4K image and HDMI 2.1 inputs.  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:30 Unboxing 1:54 Taking a look at the Aurora Pro 3:39 IT'S ALIIIIIVE 6:25 Playing some Dolby demos 8:14 Testing out the speakers 8:49 Gamer time 12:09 Closing thoughts 12:30 Outro",
    "description_links": [
        "https://viraln.link/SCxAuroraPro",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Did you know that you can get a TV that is a hundred inches or even larger? All you need is a 10, $15,000 or a bit of creativity. Today, sponsored by Nexigo, we are gonna be unboxing the Aurora Pro, which is a 4K laser ultra short throw projector that can be equipped with a screen like this one also from Nexigo for a TV like experience at a fraction of the cost. Let's go ahead and start cracking this bad boy open. All the key specs are here. 4K resolution, up to 120 Hertz refresh rate for gaming on the latest generation consoles, support for Dolby Vision and it's laser, meaning that compared to a conventional projector, the contrast is extremely high. So you don't get that same washed out appearance. I'm a big advocate for laser projectors. A quick look at the remote. Actually, that is a surprisingly not cluttered remote. Power, navigation, home volume, track skipping, view. Yeah, completely absent is the billboard for all the various streaming services that I can cumulatively pay more than my cable subscription for. And this is the projector itself. This is a really cool thing about these. I noticed immediately that the front is equipped with a giant speaker grill. That's because the way ultra short throw projectors work, unlike a conventional projector, it doesn't go, you know, way back here on your ceiling or whatever else, all inconvenient. Ooh, that was close. Instead, it goes right here under the screen where having a speaker on the front of it actually makes any sense. You ever noticed that? Projectors, they have speakers on them. They're behind you. What's up with that? And just to make sure I'm not misleading you about the speaker grills, yes, there's two 15-watt woofers and two 15-watt tweeters. On the side, we've got a couple of cooling fans, something that hopefully wasn't pre-adjusted. Oh, that's just leveling for the little footsies. USB port for playing back media on the built-in Android 9 operating system. And then here at the back, we find some really good stuff. We've got three HDMI 2.1 ports, one with eARC if you wanna hook up a soundbar or a home audio receiver. Something to note about the video inputs, though, is that the HDMI 2.1 spec has some optional components, including the ability to run 4K 120 hertz. So only input three supports high refresh rate at 4K. We've got two more USB ports, S/PDIF out, regular audio out, and gigabit LAN, as well as our power in. Of course, ah, the star of the show is the short throw projection lens right here. And this is the key for any short throw projector, I mean, realistically, any projector, but especially for short throws. Because with a regular projector, right, you got your screen here, you got your projector over here, and it's kind of like mostly the same distance to every corner and to the center of the screen. Here, that's not the case at all. You're gonna have screen that's this far away from the lens, and then you're gonna have screen that's like, almost my entire arm span away from the lens. So achieving that with minimal distortion and with even brightness, very, very tricky. Now, I see a couple of sensors here. Does this have some kind of like auto-focus or something like that? Oh, might be to turn off in case your eyes look at it, okay. Why don't we try this bad boy out? Look, we've got studio lights on right now. Honestly, all things considered, look, there's a light right here. Not bad, it's an ambient light rejecting Fresno screen from Nexigo, it costs about a thousand dollars, so you guys can check that out. It's a gray screen, and the idea there is to improve contrast. If you're in a completely dark room, I would recommend a lighter screen, but if you're trying to use it with a little bit of ambient light around you, this is a pretty good strategy. I'm just trying to get it aligned while I can still see what I'm doing, then yeah, we're gonna turn it off. I'm pretty excited to try this out because not only does it do 4K 120 hertz, they advertise less than 15 milliseconds of input lag, I think what, 12 in gaming mode or something like that? Not bad, on a projector, that is like pretty good if it's true. Not gonna lie, it took us a little longer than I would have liked to get this set up and aligned. I think that sponsored or not, that's something that Nexigo could improve about the setup process, just providing more guidance in terms of exactly where you should position your screen relative to the height of your console, but we got there, folks, and all it needed was a little bit of keystones. Oh, ah, now we can give this a shot. We're starting with the built-in Android interface. It's got a MediaTek processor, three gigs of RAM and 128 gigs of eMMC memory. Actually, no, we're gonna start by turning off some of these lights and talking about some of the trade-offs for an ambient light rejecting screen. For one thing, your viewing angles tend to be a little bit weaker because they're going out of their way to reflect back the light from the projector straight and then ignore anything that's coming in. So that means that you're from the projector, not really gonna bounce as much out to the sides. For another thing, especially if you go with a gray screen, well, what you gain in deeper blacks, you're gonna lose in your peak brightness. Now I'm expecting when I hit this one, we're going to go from, yeah, that's a washed out projector too. Oh, that actually looks pretty decent. Hey, that's not bad. Especially from right in front of it. See, you'll see what I mean. Here, Glenn, can you go this way a little bit? See, right over here, you're gonna start to lose some of that brightness and it's gonna look less even. But dead center in front of it, which is actually a surprisingly big zone when you're at the distance that you would be from a projector. Not bad at all. And we still have one of the studio lights on here. Hello. this is about what I'd expect. Not midday sun or even early afternoon sun, but kind of dinnertime sun to be coming in through the window. Let's go ahead and fire up some Dolby demos. Oh, I didn't mention it's Wi-Fi 6, so you never know with Wi-Fi, but theoretically we should be able to stream, you know, high bit rate 4K content without too much trouble. Like any projector, it's obviously going to perform its best in a dark environment, but this is very usable. Something I'd actually like to see Nexigo improve though is on their screen. This is a hundred inch screen. This bad boy will do, they rate it for anywhere from 80 to 150 inches. But while it looks really nice that they have like this brushed finish and the super slim bezel, it can actually be helpful to have a more matte material on the bezel and to have a bit of a thicker bezel because no matter what your projector is, getting it pixel perfect lined up is basically impossible. So having a little bit of area for it to bleed over into can be a benefit. A really nice thing about ultra short throw though, is that you don't need any down in front. I mean, it would be annoying if someone was standing right here and you're trying to watch a movie or whatever, but you're not actually blocking the image. It is wild how bright projectors are getting and how good HDR can look on them. We're not even in a dark room yet. This will do 2,400 MC lumens. Bell, do you want to go ahead and hit the light and we can see what it's like in an actual dark environment? Whoa, you can argue all day, TV versus projector pros and cons, but if you want a big frigging screen, it's very hard to argue with the value. It's kind of a funny thing about a projector is that you go out of your way to make your room as dark as possible and then you shine this bright projector in it and it inherently impacts its own black levels, just from light bouncing around in the room. It's not too bad in here because most things are kind of dark-ish, but that looks sick. Let's hear the speakers. Those are surprisingly usable, actually. They're not the best speakers I've ever heard in my life for anything like that, but if all I wanted was a soundbar and I wasn't going to put in a full surround setup or anything, this is very usable. This is 50%. It's got support for Miracast, AirPlay, and DLNA, but the big one for me is actually not the onboard Android TV thing, but rather support for 4K 120 hertz gaming. Let's go ahead and get the Xbox fired up. Hmm, no dedicated button for inputs. Oh, wait, there's a button. Okay, I thought this button was like, turn the Wi-Fi on and off or something. HDMI 3, game. Only tips, let's go. And there we go. Everything immediately picks up. We've got HDR enabled, Dolby Vision enabled, including for gaming, auto low latency mode. I am expecting my latency to be very low, 120 hertz. And that's it. Whee, it's just kind of floaty, you know? It's not the smoothest motion handling I've ever seen on a high refresh rate display, but it's definitely markedly better than gaming on 60 hertz. Oh, you know what though? Hold on, I'm on an Xbox. Did they want us on an Xbox? Like, is that why we're here? Next time ask me, I'll help you out. It's probably motion blur in a stupid game. I just don't know how to change it. I think there's, I think that, well, none of the other buttons do anything, smart guy. Pretty quiet. You get a little bit of fan noise, obviously, cause you know, lasers. By the time you have a game running or whatever though, I don't think you're gonna notice that. Motion blur long. There's your flipping problem, you doofs. Wait, this game doesn't even run at 120 hertz. Man, Nexigo, really though. Next time, next time, let us just game on a PC. It's better. No offense, Xbox lovers. Xbox is great. I love Xbox. Well, what? I mean, at least on a PC, what? You don't have the most powerful PC, no problem. Turn the details down, get that FPS up. That's way better. There, you can really see the difference without that gross motion blur at 30 frames per second. That's why it felt floaty too. Yeah, no, this game is fine for evaluating the input latency. We could barely even read people's names though before. See, that's way better. Okay, let's try another game. Whew, that is bright though. Laser projection, I cannot not like it. HDR makes such a big difference too for something like a projector. We still don't have the alignment of the screen absolutely perfect, but it's the kind of thing that neither is my one at home. And you don't notice it when you're just consuming content. How long did it take you guys to get it aligned after all? Probably half an hour, okay. As long as it's not something you're doing all the time, I don't mind that too much. Man, how fricking awesome does this look? And the concerns I had about motion handling are clearly primarily just Forza being Forza. It's hard for me to say for sure whether their claims of 12 milliseconds of input lag are accurate. But what I will say is I'm not noticing anything, which is a pretty strong endorsement from me. You're gonna get more than 12 milliseconds of delay just from the dead zones on an Xbox controller. Like it's not, it's not a problem. In conclusion then, the Aurora Pro's MSRP is $2999, but they're currently having a sale that drops the price down to $2699. And Nexigo has provided our viewers with a coupon code for an additional $300 off, bringing the total price down to $2399. This coupon code is limited to 200 uses and will be valid for one month. So make sure you act fast. You guys can check it out at the link in the video description. Thanks Nexigo for sponsoring this video and thanks to you for watching it. Don't forget to subscribe to ShortCircuit.",
    "transcript_keywords": [
        "projector",
        "screen",
        "Nexigo",
        "bit",
        "short throw projector",
        "bad",
        "short throw",
        "Xbox",
        "light",
        "thing",
        "Hertz",
        "kind",
        "game",
        "projectors",
        "short",
        "throw projector",
        "pretty",
        "ultra short throw",
        "throw",
        "laser"
    ],
    "transcript_entity_values": [
        "2699",
        "3",
        "an additional $300",
        "early afternoon",
        "more than 12 milliseconds",
        "Glenn",
        "Fresno",
        "60 hertz",
        "2999",
        "the Wi-Fi",
        "one month",
        "Hertz",
        "three",
        "all day",
        "RAM",
        "eMMC",
        "4",
        "one",
        "MC",
        "USB",
        "AirPlay",
        "Nexigo",
        "80 to 150 inches",
        "DLNA",
        "Bell",
        "the Aurora Pro",
        "12 milliseconds",
        "Today",
        "second",
        "200",
        "Dolby",
        "a hundred inch",
        "half an hour",
        "2,400",
        "Dolby Vision",
        "120 hertz",
        "a hundred inches",
        "LAN",
        "128",
        "Xbox",
        "the Aurora Pro's",
        "Android 9",
        "10",
        "Android TV",
        "MediaTek",
        "two",
        "120",
        "Android",
        "15,000",
        "S/PDIF",
        "30",
        "midday",
        "50%",
        "15-watt",
        "12",
        "hertz",
        "2399",
        "ShortCircuit",
        "Xbox",
        "2.1",
        "Xbox",
        "about a thousand dollars",
        "Forza",
        "Miracast",
        "Wi-Fi 6",
        "less than 15 milliseconds",
        "Wi-Fi"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "MONEY",
        "TIME",
        "QUANTITY",
        "PERSON",
        "GPE",
        "QUANTITY",
        "MONEY",
        "FAC",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "LOC",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.049524761736392975,
        0.027728406712412834,
        -0.012335562147200108,
        -0.07269363850355148,
        0.05197732895612717,
        -0.012823980301618576,
        -0.04462375491857529,
        0.0036759725771844387,
        -5.531722854357213e-05,
        0.035027507692575455,
        -0.025054646655917168,
        -0.061713915318250656,
        0.032480183988809586,
        -0.026539677754044533,
        -0.03292367607355118,
        -0.008527033030986786,
        0.08483735471963882,
        -0.08266814798116684,
        -0.023034729063510895,
        -0.009868581779301167,
        -0.03713120147585869,
        -0.11850116401910782,
        -0.039439018815755844,
        -0.07067777961492538,
        0.04455149546265602,
        -0.05425598472356796,
        0.07366714626550674,
        -0.06561882793903351,
        -0.005967322271317244,
        -0.06357291340827942,
        0.001197934034280479,
        0.012198587879538536,
        0.028238415718078613,
        0.002136897761374712,
        0.04434395581483841,
        -0.03551163151860237,
        0.023651396855711937,
        -0.0896625965833664,
        -0.12865009903907776,
        -0.015100151300430298,
        0.048905592411756516,
        -0.05049900710582733,
        -0.0323028638958931,
        -0.07013776153326035,
        -0.02617708221077919,
        -0.018492955714464188,
        0.016661427915096283,
        -0.04829923063516617,
        0.0877746045589447,
        0.018111946061253548,
        -0.007662496995180845,
        -0.022038500756025314,
        -0.009603438898921013,
        0.044022005051374435,
        -0.0024215301964432,
        0.04057600349187851,
        -0.036932408809661865,
        -0.05640013888478279,
        0.006701069884002209,
        0.033586397767066956,
        0.07306879013776779,
        -0.04776834696531296,
        0.009831316769123077,
        0.05306641384959221,
        0.02635950967669487,
        0.018375765532255173,
        0.018965741619467735,
        -0.0007034103036858141,
        -0.06018544360995293,
        -0.034272968769073486,
        0.0009504561894573271,
        0.01266178023070097,
        0.06900684535503387,
        -0.024120189249515533,
        0.018621476367115974,
        0.021327396854758263,
        0.12003514915704727,
        -0.10640407353639603,
        0.036783162504434586,
        -0.025508547201752663,
        0.032783202826976776,
        0.030942479148507118,
        -0.0619562491774559,
        0.005374687258154154,
        0.001015768968500197,
        -0.02967599406838417,
        -0.008601799607276917,
        0.040310658514499664,
        0.034631941467523575,
        -0.016534211114048958,
        -0.035479530692100525,
        -0.026030926033854485,
        0.003636622102931142,
        0.025487979874014854,
        -0.07676111161708832,
        -0.02035137452185154,
        0.00244264118373394,
        -0.08083818107843399,
        -0.013142308220267296,
        0.0625409185886383,
        0.0036383098922669888,
        -0.007669589947909117,
        0.05542973056435585,
        -0.06525491923093796,
        -0.0711570456624031,
        -0.07561207562685013,
        0.052812159061431885,
        0.07626187056303024,
        0.0012403724249452353,
        0.0930904820561409,
        -0.017875084653496742,
        0.012452658265829086,
        -0.052085310220718384,
        0.015642214566469193,
        0.01861010491847992,
        0.02341577783226967,
        -0.005197528749704361,
        0.039351753890514374,
        0.05069775879383087,
        -0.05040264502167702,
        0.044927503913640976,
        -0.022357897832989693,
        -0.009176517836749554,
        0.04840970039367676,
        -0.0013248927425593138,
        0.028316481038928032,
        -0.05304323136806488,
        6.32888803345009e-33,
        -0.03818037733435631,
        0.1063058152794838,
        -0.05884686857461929,
        -0.02955174632370472,
        0.01175145898014307,
        0.06337249279022217,
        0.07003382593393326,
        0.11910867691040039,
        -0.06275155395269394,
        -0.05839754268527031,
        -0.006397224962711334,
        0.015932394191622734,
        -0.05630215257406235,
        0.10431434214115143,
        -0.012195520102977753,
        -0.10170596092939377,
        0.019345909357070923,
        0.03987335413694382,
        -0.03327103331685066,
        0.06062931567430496,
        -0.0650961622595787,
        -0.05585765466094017,
        -0.009021726436913013,
        -0.02403072454035282,
        0.006118910852819681,
        -0.04057040065526962,
        -0.011794686317443848,
        0.01944802887737751,
        -0.004837710410356522,
        0.003921039402484894,
        -0.011457392014563084,
        -0.023290270939469337,
        0.07545213401317596,
        0.008915741927921772,
        -0.042495183646678925,
        -0.01794593036174774,
        -0.08170365542173386,
        -0.043417904525995255,
        -0.027560874819755554,
        0.010685398243367672,
        -0.0603363998234272,
        0.1418178528547287,
        -0.08975610882043839,
        -0.04869770631194115,
        -0.04269321635365486,
        0.009878327138721943,
        0.08999231457710266,
        0.012051498517394066,
        -0.0034724234137684107,
        -0.019423048943281174,
        -0.006449950393289328,
        0.022493526339530945,
        -0.09991316497325897,
        -0.09575749188661575,
        0.04949584975838661,
        -0.08088652044534683,
        -0.02018234133720398,
        0.0009569787071086466,
        0.14340613782405853,
        0.03190428018569946,
        -0.022632455453276634,
        0.035166531801223755,
        -0.024852409958839417,
        0.013293451629579067,
        -0.05022807419300079,
        0.06278510391712189,
        0.05786895751953125,
        0.008936590515077114,
        -0.0960269346833229,
        -0.036900222301483154,
        -0.008514918386936188,
        0.04588177055120468,
        0.07172051072120667,
        -0.08266451209783554,
        0.010943342931568623,
        0.02002488449215889,
        -0.04945750534534454,
        -0.017787044867873192,
        0.010404190048575401,
        0.031348977237939835,
        -0.03407995402812958,
        0.004498948343098164,
        0.0975748598575592,
        0.05126844719052315,
        0.010951003059744835,
        -0.01256394013762474,
        -0.019139209762215614,
        0.08596999943256378,
        -0.09945666044950485,
        -0.036808717995882034,
        0.005136685911566019,
        -0.00816782470792532,
        -0.049194905906915665,
        -0.030354967340826988,
        -0.013473829254508018,
        -5.591926176539457e-33,
        0.042827945202589035,
        0.02662273310124874,
        -0.09322372078895569,
        -0.01300421729683876,
        0.10031630843877792,
        0.003317895345389843,
        0.05305490270256996,
        0.03132152557373047,
        -0.014909397810697556,
        -0.019167335703969002,
        0.024290846660733223,
        -0.009858614765107632,
        -0.02580264024436474,
        -0.03767270967364311,
        -0.036028508096933365,
        -0.08453357219696045,
        0.041800886392593384,
        -0.052450601011514664,
        0.017661303281784058,
        -0.07910961657762527,
        0.06576810777187347,
        0.08833012729883194,
        -0.06988836079835892,
        0.01297212764620781,
        -0.012254632078111172,
        0.00887643825262785,
        0.040144987404346466,
        0.03813033550977707,
        -0.08737736940383911,
        0.03321576863527298,
        -0.07013212889432907,
        -0.059758804738521576,
        -0.015041422098875046,
        -0.005704862996935844,
        0.041660141199827194,
        -0.002613855991512537,
        0.057147637009620667,
        0.06449741125106812,
        -0.06248259171843529,
        -0.07132083177566528,
        -0.004624915309250355,
        0.06699137389659882,
        0.01472325436770916,
        0.048757489770650864,
        0.024516182020306587,
        -0.007081151474267244,
        -0.03714925795793533,
        -0.020642070099711418,
        0.05935715138912201,
        0.05343886464834213,
        -0.06893180310726166,
        -0.013581115752458572,
        0.024462435394525528,
        0.027280252426862717,
        -0.011698730289936066,
        -0.05657226964831352,
        -0.05698717013001442,
        0.07992742210626602,
        0.048111043870449066,
        -0.01714070327579975,
        -0.01803305372595787,
        -0.045957501977682114,
        -0.017898907884955406,
        0.043740950524806976,
        0.018399488180875778,
        0.024072231724858284,
        0.03858614340424538,
        0.06432677805423737,
        -0.007083980366587639,
        0.05606713145971298,
        0.04077553376555443,
        0.012998491525650024,
        0.024016065523028374,
        -0.07209078967571259,
        -0.08175211399793625,
        0.015689948573708534,
        0.043099597096443176,
        -0.005111410282552242,
        0.13153856992721558,
        -0.03448719531297684,
        -0.049799270927906036,
        -0.007101935800164938,
        0.07407237589359283,
        -0.0033111872617155313,
        0.10892719030380249,
        0.046186454594135284,
        0.051008936017751694,
        -0.03569842875003815,
        -0.04529745131731033,
        0.062175314873456955,
        -0.03243327885866165,
        0.0436682403087616,
        0.0115125123411417,
        0.004931000526994467,
        0.07337980717420578,
        -5.96463607394071e-08,
        0.017599763348698616,
        0.0317901074886322,
        -0.001076560583896935,
        -0.0025085124652832747,
        0.016917647793889046,
        -0.10023575276136398,
        0.024473952129483223,
        -0.004054426681250334,
        0.08138848096132278,
        -0.04641375690698624,
        0.05146104097366333,
        -0.09095720946788788,
        0.00469505088403821,
        -0.013381422497332096,
        -0.01207712385803461,
        -0.007428416516631842,
        0.01709640771150589,
        0.036337532103061676,
        -0.0033091933000832796,
        0.026505861431360245,
        0.024046294391155243,
        0.03828868642449379,
        0.007718158885836601,
        -0.04404522106051445,
        0.00400849012658,
        0.047299399971961975,
        0.023506274446845055,
        0.02462371438741684,
        0.10743311792612076,
        -0.14307336509227753,
        -0.12139787524938583,
        -0.001509151072241366,
        -0.014408798888325691,
        -0.06554844230413437,
        0.07104336470365524,
        -0.06782874464988708,
        -0.10180902481079102,
        0.04132596030831337,
        0.056195467710494995,
        0.0496242456138134,
        0.030066734179854393,
        -0.03855634480714798,
        0.024710524827241898,
        -0.06067755073308945,
        0.05248289927840233,
        0.00956284161657095,
        -0.02110753022134304,
        -0.12348979711532593,
        0.002110940171405673,
        0.06346304714679718,
        -0.01089511252939701,
        -0.01711508259177208,
        -0.0285173449665308,
        0.002589680952951312,
        0.0874364897608757,
        -0.006648067384958267,
        0.06259249150753021,
        0.03598630800843239,
        -0.0007398067973554134,
        0.10002501308917999,
        0.07794607430696487,
        -0.06239377334713936,
        -0.10255623608827591,
        0.13447649776935577
    ]
}