{
    "id": "xhuZfX8FCac",
    "title": "5 Reasons Why The Wii U Failed",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-05-15T15:14:08Z",
    "video_url": "https://www.youtube.com/watch?v=xhuZfX8FCac",
    "category": "Science & Technology",
    "tags": [
        "wii u",
        "nintendo",
        "nintendo wii u",
        "nintendo switch",
        "switch",
        "wii",
        "gameplay",
        "gaming",
        "games",
        "wiiu",
        "console",
        "wii u vs nintendo switch",
        "review",
        "video game",
        "gamepad",
        "mario kart",
        "top 5",
        "game console",
        "2018",
        "austin evans"
    ],
    "views": 1863220,
    "likes": 38645,
    "comments_count": 5462,
    "description": "The Nintendo Wii U failure turned the Switch into one of the best handheld consoles ever. Thanks to Mevo for sponsoring this video. Use my codeaustin50for $50 off Mevo Plus or $150 off the Mevo Plus Pro Bundle.  Between the Gamepad, poor performance vs PS4 and Xbox One and the high price tag the Wii U never really got off the ground but in many ways it was ahead of its time with video games like Mario Kart and Splatoon that paved the way for the Nintendo Switch we all know and love.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://shop.getmevo.com/discount/austin50",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- This video is sponsored by Mevo. Hey guys, this is Austin. The Wii U was the biggest flop in Nintendo history. Now sure, they had weird experiments like the Virtual Boy, but coming off of the massively successful Wii, there was a real sense that Nintendo could do no wrong. And yet, we have this. Reason number one, is a simple one. The name was just not a good idea. Now, don't get me wrong, the Wii U was not a bad console, but a lot of people first of all didn't even realize that it was even a separate console by itself. Lots and lots of people just thought that it was a tablet add-on for the original Wii. And I mean, with ads like this, can you blame them? - [Boy] And did we mention, togetherness? - Just check out the simulation. - Whoa! - Don't get me wrong, a ton of people made fun of the name of the original Wii, at least until it was in basically every living room on the face of the planet. The problem is that six years after the launch of the original Wii, Nintendo brought this out and a lot of people just asked, what exactly was it? It is a big problem, when tons of people don't realize that your shiny brand new console, is an actual shiny new console, not some add-on for the original Wii. Especially when you consider, that after 100 million sales of the original Wii and merely 13 million with the Wii U, Nintendo had a major branding problem, that honestly could have been solved by just calling this the Wii 2, or you know, the Wii Want You To Buy Our Console Edition. Reason number two why the Wii U was sales challenged had to do with the tablet that served as it's controller, the GamePad. Now it's easy to forget that back in 2012, tablets were touted as the next big thing. Unfortunately, what was not the next big thing, was a giant unwieldy tablet that was completely useless if it was not connected to its base station. That's the beauty of a console like the Switch. It has pretty much none of the same down sides as the Wii U, so you're going to be getting a more powerful system, that's going to be a lot smaller, a lot more portable, and to top it all off, you can take it with you anywhere. As opposed to the Wii U where, you can take this anywhere, as long as this is no more than 20-25 feet away. With the Wii U, the GamePad relied on a local wireless connection. Now while that was fine for the most part, get too far away and it completely falls apart. However, once you're actually close to the Wii U console it does work pretty well. In theory, you could never plug this into a TV, and just use the GamePad for all of your game play. At launch, the GamePad also had another problem. Not very good battery life. So the first models would last somewhere in the neighborhood of three to three and a half hours on a charge which really isn't great for a controller. Thankfully later models did bump that up to something closer to six to seven, but if you're one of those early adopters of the Wii U, you had better not stay too far from a charger with this guy. Now this might sound like a little bit of a nitpick, but one of the issues, especially with games like Super Smash Bros., is that while this is always gonna be one of your controllers, you can only ever have one GamePad paired with the Wii U at the same time. Meaning that if everyone comes over for a game of Smash Bros., someone's always gonna get stuck with the giant controller. However, don't get me wrong, this is not all bad by any means. So first of all, the idea that this has a lot of interesting tech that was legitimately new for the time is cool. Stuff like NFC support for Amiibos, which would come a little bit later, really was the first time that this was ever shown in a Nintendo console. And the idea that you do have a camera, you do have decent controls, even though it's a little bit big, a touch screen, there's a lot to like here. But, this was a major hurdle for the Wii U to overcome and a lot of people just straight up thought that it was an accessory for the original Wii. Kinda hard to get over that one. - Hot buttered popcorn, that's a deal! - Before we move on, I wanna give a huge shout out to Mevo for sponsoring this video. So what you're looking at right now is being shot on a Mevo camera. It's basically the next best thing to having your own Ken. What's so cool about the Mevo, is that it is a small pocketable 4K camera that has full capabilities of turning itself into a livestreaming control room. So basically, once you pair it with the app, you can use that to be able to pan around the shot, do zooms, do punch ins, and all of this stuff is going to be completely digital thanks to that 4K sensor. What makes the Mevo unique, is that this single camera can livestream to a variety of sources including YouTube, Facebook, as well as Periscope. What's cool is, because it's so small and it does have a tripod mount in the box, you can easily set this up on the go. So in addition to being able to work over wifi, you can also connect it to your phone and use it over LTE to livestream something like a concert, or in my case, I can livestream a super cool match of Mario Kart. One of my favorite parts really is how the app works. So really simply I can say, zoom out on the shot. I can tap on my face, I can tap on the screen, I can sort of punch in, punch out, there's really so many different options to be able to kind of get a more studio quality experience out of a camera that is really going to fit in your pocket. So if you wanna up your livestream game, definitely be sure to go check out the Mevo at the link in the description, and while you're there you can check out my coupon code which'll get you like $50 off. Anyway, huge shout out to Mevo for sponsoring this video. - Here's why we need Wii U. Reason number three has to do with power. It's easy to forget, but the Wii U actually came out only a year before the Xbox One and the PS4. Where the Wii was essentially just a faster GameCube, the Wii U did some legitimately interesting stuff. Of course, one of biggest leaps, was the leap to HD, something that the Xbox 360 beat it to by like seven years. However there was more to it than just that. As opposed to the anemic single core CPU that was found in both the GameCube and the Wii, instead the Wii U stepped all the way up to a triple core PowerPC processor. Although, this was hardly cutting edge, even back in 2012. Nintendo also included a dual AMD GPU set up. Well, technically at least. So in addition to the standard GPU, which is what the Wii U uses to run its normal games, you're also going to be getting a copy of the Wii GPU. Now this is for backwards compatibility, and it does work really well here. Although interestingly, you actually can unlock GameCube backwards compatibility as well, although that is definitely not going to be fully supported. At least, if you ask Nintendo. With two gigs of RAM, the Wii U does have a healthy advantage over Xbox 360 as well as the PS3, and in a lot of ways, the Wii U is going to be more powerful. Unfortunately, the Wii U came out in 2012, and again, being only a year away from both the Xbox One and PS4 meant that this really had a difficult time competing with the current generation of consoles. Just like the Wii, it had a lot of interesting capabilities, but high performance definitely wasn't one of them. Reason number four has to do with price. So when the Wii U first came out there were two models. First of all, a basic white version which looks very, very similar to the original Wii, and then there's the black deluxe edition, which was a little bit more expensive, and at least didn't look quite so much like the console that it was replacing. (clears throat) Considering that you were getting a console with roughly the same power as the outgoing Xbox 360 and PS3, prices weren't exactly cheap. So the basic model came with only eight gigabytes of storage for $300, and even stepping up to the deluxe model would still only get you 32 gigs of storage at a $350 price tag. Now to be fair, it wasn't all bad from the start. The first couple months of the Wii U being on sale, Nintendo sold over three million units. Unfortunately after that, well sales kinda fell off of a cliff, and they really never recovered. Due to the high cost of the GamePad which had to be included with every single Wii U, Nintendo really didn't have a lot of options to be able to boost the lagging sales. So after about a year, they were able to drop the price on the deluxe model from $350 to $300, which did make an effect, but at the end of the day, there really was not a lot of room for them to do anything besides hope that people would finally buy this misunderstood, wonderful console. Now if that was the only problem with the Wii U, they probably would have been just fine. However, with problems quickly mounting, the Wii U having only been on sale for less than a year, the real challengers were coming up very quickly. PS4 and Xbox One, as you might imagine, very quickly outsold the Wii U, and never looked back. That brings us to reason number five, why the Wii U was a failure. Third party support, or more specifically the almost complete lack thereof. Now let's be real, the original Wii did have a lot of third party games, the problem was, most of them were complete garbage. (marching music) However, with a hundred million consoles in the wild, a lot of developers, in fact, pretty much all developers really didn't have a lot of choice, you had to make a Wii game. Now when it comes to the Wii U, they didn't really have that constraint, which meant that they really didn't have to actually make Wii U games, and so, they didn't. To be fair, there were some third party games on the Wii U, most specifically Ubisoft actually did support it for the first few years. However, the issue was, is that with so few consoles in the wild, and such a huge disparity between the performance of the Wii U and the brand new Xbox One and PS4, it was very difficult for developers to justify spending the time and money to bring an actually decent Wii U game to the platform. Making things more complicated was the promise of the GamePad. Of course, most first parties didn't take great advantage of this, so when it comes to third party support, yeah, that really wasn't a thing. Now to really put things in context, the finally tally here in the US for third party games released on the Wii U, was a mere 118 titles. That is far less than any other main Nintendo console. By a lot. Now don't get me wrong, there were some amazing Nintendo titles for the Wii U, but at this point, almost all of them have been ported to the Switch, and are oftentimes even better than their original versions. The ones that haven't been ported are pretty much already on the way. It was a cool console, there was a lot they did right. But the games either weren't there, or are just better on Switch today anyway. It's kind of ironic to think that the Switch really is just a Wii U 2.0 with the tech that actually supports the original vision. Sometimes it just goes to show, success and failure can be two different sides of the same coin. - And that's how it's done.",
    "transcript_keywords": [
        "Wii",
        "original Wii",
        "lot",
        "Nintendo",
        "console",
        "Wii GPU",
        "Mevo",
        "original",
        "Wii game",
        "Xbox",
        "Nintendo console",
        "games",
        "make Wii",
        "people",
        "single Wii",
        "successful Wii",
        "GamePad",
        "decent Wii",
        "problem",
        "game"
    ],
    "transcript_entity_values": [
        "GamePad",
        "over three million",
        "Wii",
        "number two",
        "Mario Kart",
        "AMD",
        "Ubisoft",
        "third",
        "three",
        "Wii",
        "Third",
        "The first couple months",
        "Super Smash Bros.",
        "first",
        "Nintendo",
        "RAM",
        "118",
        "only a year",
        "Ken",
        "number four",
        "Nintendo",
        "Austin",
        "six years",
        "Smash Bros.",
        "GameCube",
        "about a year",
        "two",
        "Xbox 360",
        "300",
        "the Wii GPU",
        "Xbox One",
        "Switch",
        "PS4",
        "the end of the day",
        "50",
        "a hundred million",
        "the first few years",
        "4",
        "six to seven",
        "the Wii U",
        "one",
        "YouTube",
        "32",
        "the Wii Want You To Buy Our Console Edition",
        "2012",
        "Facebook",
        "Wii U",
        "PS3",
        "less than a year",
        "13 million",
        "a ton",
        "Xbox One",
        "CPU",
        "NFC",
        "$350 to $300",
        "100 million",
        "Amiibos",
        "350",
        "Wii U",
        "seven years",
        "three to three and a half hours",
        "Wii U. Reason",
        "only eight gigabytes",
        "One",
        "US",
        "number five",
        "GPU",
        "LTE",
        "First"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "GPE",
        "MONEY",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL"
    ],
    "vector": [
        -0.03717096894979477,
        -0.042920809239149094,
        0.07627274841070175,
        -0.07988846302032471,
        0.07508363574743271,
        0.012437241151928902,
        0.01268473919481039,
        0.10562657564878464,
        0.0012202225625514984,
        0.106146901845932,
        -0.03177564963698387,
        0.0664650946855545,
        0.02547483518719673,
        -0.023653369396924973,
        0.013941031880676746,
        -0.03351058065891266,
        0.033122364431619644,
        -0.09149838238954544,
        -0.039443228393793106,
        0.029610153287649155,
        0.027890421450138092,
        -0.036424726247787476,
        -0.0769357681274414,
        -0.006157349795103073,
        -0.01676303520798683,
        0.07875490188598633,
        -0.011665049009025097,
        0.015973662957549095,
        0.010526864789426327,
        -0.04330391809344292,
        -0.05232807993888855,
        0.022678177803754807,
        0.06581614911556244,
        -0.06474458426237106,
        -0.03732018545269966,
        -0.09439819306135178,
        0.005446715746074915,
        -0.058145616203546524,
        -0.06204826384782791,
        -0.0934816226363182,
        -0.06730325520038605,
        0.010641233064234257,
        0.02324843406677246,
        0.09284105896949768,
        -0.017399972304701805,
        -0.045172058045864105,
        -0.029468825086951256,
        -0.018315734341740608,
        0.020670181140303612,
        0.013194034807384014,
        -0.0261624064296484,
        -0.00687183765694499,
        0.09030431509017944,
        -0.07634387910366058,
        0.0817071795463562,
        -0.021074626594781876,
        0.05681390315294266,
        0.013428153470158577,
        0.12303262948989868,
        0.05370379611849785,
        -0.04055875167250633,
        -0.0655616968870163,
        0.04106459021568298,
        -0.05028069391846657,
        0.06718630343675613,
        -0.07604353129863739,
        -0.00950170960277319,
        -0.008403907530009747,
        -0.011481733061373234,
        0.058757152408361435,
        0.04598497971892357,
        -0.010460132732987404,
        0.04308249056339264,
        0.01765461266040802,
        0.004014777950942516,
        0.0019965178798884153,
        -0.008934217505156994,
        0.030609916895627975,
        -0.0019510023994371295,
        0.10914246737957001,
        0.05123256891965866,
        -0.06942161917686462,
        -0.0823507234454155,
        -0.030135437846183777,
        0.014292736537754536,
        0.07075783610343933,
        0.05670670419931412,
        -0.10553418844938278,
        -0.008386410772800446,
        -0.004562566056847572,
        -0.03531307354569435,
        -0.032112184911966324,
        0.08388331532478333,
        0.01224488765001297,
        0.06720218807458878,
        -0.03986090421676636,
        -0.008760408498346806,
        -0.004035081714391708,
        -0.03825528547167778,
        -0.0016097916522994637,
        0.012562498450279236,
        0.05824465677142143,
        0.032478414475917816,
        0.0031970904674381018,
        0.0390511192381382,
        -0.047504618763923645,
        0.06318128854036331,
        0.01107762847095728,
        0.05975962057709694,
        0.02643490768969059,
        -0.0289305429905653,
        -0.03603986278176308,
        -0.042301811277866364,
        0.032049212604761124,
        -0.014483626000583172,
        -0.05331368371844292,
        0.031068388372659683,
        0.05366130173206329,
        -3.4988941479241475e-05,
        -0.029090508818626404,
        0.012807336635887623,
        0.02480023354291916,
        -0.012920099310576916,
        0.015703216195106506,
        -0.0007002516067586839,
        -0.03460939601063728,
        -0.002315677236765623,
        3.1347840902018906e-33,
        0.007469790987670422,
        0.0611749142408371,
        -0.018343530595302582,
        0.004011862445622683,
        -0.0033785044215619564,
        -0.022959880530834198,
        -0.034364305436611176,
        0.05589934438467026,
        -0.015523925423622131,
        -0.017805753275752068,
        0.027693364769220352,
        0.02295462228357792,
        -0.06806709617376328,
        0.061374057084321976,
        0.07771267741918564,
        -0.0340326689183712,
        -0.051791660487651825,
        -0.08951329439878464,
        0.03480057418346405,
        0.030708735808730125,
        0.024832000955939293,
        0.007074626162648201,
        0.07660293579101562,
        -0.0543721541762352,
        -0.09400507807731628,
        0.01731017418205738,
        -0.08658479899168015,
        0.0041639544069767,
        0.0403045117855072,
        0.01813174970448017,
        -0.06004273518919945,
        -0.03077901154756546,
        -0.030927181243896484,
        0.001073142047971487,
        0.08823587000370026,
        -0.10903973877429962,
        0.06658799946308136,
        -0.08093473315238953,
        -0.08268935978412628,
        0.06103086099028587,
        -0.06192098557949066,
        0.02040693536400795,
        -0.1441134214401245,
        0.02799181640148163,
        0.12977032363414764,
        0.00595739483833313,
        0.06318821758031845,
        -0.05224156752228737,
        -0.0725688636302948,
        0.015458467416465282,
        -0.02464466169476509,
        0.10837765038013458,
        0.0010593861807137728,
        -0.10756682604551315,
        0.007896262221038342,
        -0.04495178908109665,
        0.05172838643193245,
        0.02455240674316883,
        0.03162996843457222,
        0.02568455971777439,
        -0.04455637186765671,
        0.0091358982026577,
        0.04039375111460686,
        0.04778479039669037,
        -0.1117166131734848,
        0.05033876746892929,
        0.11091147363185883,
        -0.021758610382676125,
        -0.023283857852220535,
        0.005434324499219656,
        -0.0223414096981287,
        -0.031477879732847214,
        -0.050786323845386505,
        -0.10434621572494507,
        0.07781928777694702,
        0.015105674974620342,
        -0.067962646484375,
        0.0176590196788311,
        0.025839606299996376,
        -0.12148097902536392,
        0.03081025555729866,
        -0.0021272716112434864,
        -0.05879683047533035,
        0.0015766252763569355,
        0.006900764536112547,
        0.006377013865858316,
        0.018995370715856552,
        0.009015400893986225,
        -0.02483791671693325,
        -0.043520569801330566,
        -0.02017146907746792,
        -0.04003235325217247,
        0.032883018255233765,
        0.030168041586875916,
        0.06799693405628204,
        -4.6208660890305044e-33,
        -0.05921319127082825,
        -0.045350246131420135,
        -0.005299077834933996,
        0.04130912572145462,
        -0.025360021740198135,
        -0.07838491350412369,
        0.0005981915746815503,
        -0.061792515218257904,
        0.04298524186015129,
        -0.013107065111398697,
        -0.028517233207821846,
        -0.03315672278404236,
        -0.07443714141845703,
        0.03641192242503166,
        -0.007598921190947294,
        0.027108199894428253,
        -0.013301879167556763,
        -0.029831774532794952,
        0.00918756052851677,
        -0.07502442598342896,
        0.12194014340639114,
        0.064851775765419,
        -0.036940798163414,
        -0.02806825377047062,
        -0.05922140181064606,
        0.1018444374203682,
        -0.00806778110563755,
        -0.0026138375978916883,
        0.08863125741481781,
        -0.02837357483804226,
        0.04377847909927368,
        0.075034961104393,
        0.03536544740200043,
        0.047307055443525314,
        0.006252775434404612,
        0.07474984228610992,
        0.02338886260986328,
        0.05814816430211067,
        -0.021929237991571426,
        -0.05097557231783867,
        0.029016533866524696,
        0.027043437585234642,
        0.007514014840126038,
        -0.06294700503349304,
        -0.006183921359479427,
        0.025629788637161255,
        0.01277507096529007,
        0.03433689847588539,
        0.05488397181034088,
        0.010250815190374851,
        0.001121677691116929,
        -0.03225051239132881,
        -0.019397525116801262,
        -0.035443633794784546,
        -0.08883722871541977,
        -0.09290619194507599,
        -0.007358697708696127,
        0.04225587844848633,
        0.078304223716259,
        0.08675087988376617,
        0.006722429301589727,
        -0.016640570014715195,
        0.027278538793325424,
        0.03559897467494011,
        -0.016553116962313652,
        0.008013197220861912,
        0.11464666575193405,
        0.009069361723959446,
        0.035812173038721085,
        -0.03976399824023247,
        -0.03625950217247009,
        -0.011766495183110237,
        0.030433326959609985,
        0.010998650453984737,
        0.02671532705426216,
        0.10881858319044113,
        -0.08059714734554291,
        -0.04656726121902466,
        -0.013522417284548283,
        -0.02146092802286148,
        -0.06004125252366066,
        0.027951769530773163,
        -0.0030856109224259853,
        0.002454753266647458,
        0.0015609868569299579,
        0.035696305334568024,
        0.042609505355358124,
        0.02285592630505562,
        0.028390269726514816,
        -0.02789519727230072,
        -0.0006719054072163999,
        0.055836331099271774,
        -0.016215570271015167,
        0.028286386281251907,
        -0.002978511620312929,
        -5.654203860672169e-08,
        0.0862896665930748,
        -0.015424305573105812,
        0.006854294799268246,
        0.05851861461997032,
        0.10182033479213715,
        -0.026389766484498978,
        -0.04588434845209122,
        0.07538545876741409,
        0.061255551874637604,
        0.10710494220256805,
        -0.07185859233140945,
        0.03769076243042946,
        -0.10552825033664703,
        0.058983996510505676,
        0.07010018825531006,
        0.06716802716255188,
        -0.053907398134469986,
        -0.002473335713148117,
        0.0051469746977090836,
        0.04691746085882187,
        -0.012084083631634712,
        -0.0007157434010878205,
        -0.04900747537612915,
        -0.0940796509385109,
        -0.08730791509151459,
        -0.05450376495718956,
        -0.017102273181080818,
        0.03460846096277237,
        -0.01654803939163685,
        -0.018978575244545937,
        -0.004005428869277239,
        -0.04300500079989433,
        -0.09040536731481552,
        -0.03153938800096512,
        -0.06760881096124649,
        -0.08582288026809692,
        -0.0009235023171640933,
        -0.013582252897322178,
        0.026189353317022324,
        -0.045588262379169464,
        0.024950262159109116,
        0.007481732405722141,
        -0.04354869946837425,
        0.01714589074254036,
        -0.03556238114833832,
        0.06826981157064438,
        -0.12452816218137741,
        -0.004652930423617363,
        -0.1023029312491417,
        0.07263681292533875,
        -0.04232991486787796,
        -0.06588280200958252,
        -0.057685621082782745,
        0.018325693905353546,
        0.04112448915839195,
        -0.03513401746749878,
        0.0034850852098315954,
        -0.036434538662433624,
        -0.016029464080929756,
        -0.04634476453065872,
        0.04535011202096939,
        -0.042508434504270554,
        -0.01190878450870514,
        0.07131627202033997
    ]
}