{
    "id": "XI3MCihPpj8",
    "title": "This should have been GREAT! - LOUPEDECK CT",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-04-24T20:15:33Z",
    "video_url": "https://www.youtube.com/watch?v=XI3MCihPpj8",
    "category": "People & Blogs",
    "tags": [
        "Video",
        "Editing",
        "Photo",
        "Music",
        "Knob",
        "Control",
        "Custom",
        "Review",
        "Unboxing",
        "Impressions",
        "Loupedeck",
        "Loupedeck CT",
        "Computer",
        "USB-C",
        "Sreen",
        "Buttons",
        "Dial",
        "Configurable",
        "Film Making",
        "Post Production",
        "Tools",
        "Haptic",
        "RGB",
        "Process"
    ],
    "views": 949434,
    "likes": 36234,
    "comments_count": 2073,
    "description": "The Linus Media Group's King Of Macros takes a look at something that should have been the ideal productivity tool. Is it any good?  Check out the LOUPEDECK CT at   Buy Loupedeck Creative Tool On Amazon (Paid Link):      On BHPhoto (Paid Link):       Buy Streamdeck XL On Amazon (Paid Link):     On NewEgg (Paid Link):       Buy Ripple Tangent On Amazon (Paid Link):      On BHPhoto (Paid Link):       Check out Monogram Creative Console at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/QPOH0",
        "https://geni.us/d6xNbKl",
        "https://geni.us/tEBY2a",
        "https://geni.us/EcAYI",
        "https://geni.us/bU88Vo",
        "https://geni.us/AcihcM",
        "https://geni.us/AeGf",
        "https://monogramcc.com/",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So today we're checking out the Loupedeck CT. I'm quite excited for this one. Basically what this is, is a control surface which is supposedly better than using a keyboard and mouse. Here we go, oh, it's nice. Is integrated with, well, let's find out, I don't actually know. Lightroom, Photoshop, Premiere, Final Cut, Illustrator, Streamlabs, Ableton Live, After Effects, Audition, and I guess Windows. Those are nice knobs. Let's peel this. And this really reminds me of just a straight up small stream deck, but they have like little sliders on the side that you can probably, yeah, that's almost certainly touch sensitive over there. So, very cool. Apparently, these you can use to change profiles, these ones here. Not bad. This this knob is also a touchscreen, which I think is super cool, so looking forward to that. In the box, we've got also a little manual, quick guide, which is really boring looking, frankly. What is here? Cable. USBC. Thank you, thank you for that. And I think we've hit rock bottom. It's like a holographic Pokemon card up in here. Enhance how you create and edit, oh. Everything's going to be amazing. We'll see. Hi, welcome to my desk. I've been using the Loupedeck for a few weeks now, and I missed a couple of things about the hardware. First of all, these are not sliders. I think they're literally just labels for whatever the dials are, and also these dials have buttons. Also, this one is pretty difficult to keep your finger on because you don't wanna slip off onto the touchscreen and you don't wanna slip off to this side. It can be hard to use, it's okay. The little stops on here, I think that's called like a ratcheted dial, listen to that. And then this one is not ratcheted, that's just a smooth dial. Keep in mind, I've only been using this thing for Premiere and Photoshop, it does support other applications. I don't know how good or bad it is in those, I can only give you my experience. And my experience is, I don't like this thing, I don't like it. The software feels very unfinished. I actually had to check to see if this was a Kickstarter project, and I was on the beta software. I'm not. When I'm in Photoshop, for example, and I hit Ctrl + Shift + I, it just automatically brings me to the Loupedeck, and opens up this (laughs), this inspect element thing, because this is like chromium based or whatever. It's like a debugging thing. And it's also just like very slow to use, and sometimes the actions will like, appear and disappear seemingly at random, because it's so slow to update. If you search for a command, let's do Audio Keyframes. See it's, come on, searching really slow, and then, once you drag the command on, it clears your search. I feel like every command that's in here, at least for Premiere, needs to have a written explanation of what it does. Because like you're just looking through here, and I'm trying to figure out like, what is cmd.window.events. There's all sorts of stuff in here where I know that these are just the names from the default API. And they didn't change them. They don't seem to know what they're for what they do, you drag them on and try to use them and they don't seem to do anything. Open.item, click. I don't know, nothing happens. Click. Like yeah, it's a lot of work to have a written explanation of what each thing does, but that would ensure that it's something that even needs to be in there, and also, otherwise, you're offloading all of that work, figuring stuff out, onto the user. Come on guys, you're better than this. Maybe not. You can only have one profile per application. You can't make any more, and it must be tied to an application, which is bad because now I can't make backups, I can't swap in and out, two different things. A lot of the software, it's hard to figure out, even with the manual. And by the way, they don't tell you that there is actually a manual, not just for the Loupedeck software, but also for like Premiere, there's one for Photoshop, like this is great, but it's not in the Quickstart Guide, despite how confusing the software is to use. It's also not nearly customizable enough. You can't change the sensitivity of dials. You can't change the direction of dials. You know, which way is gonna increase the number versus decrease. You cannot change an acceleration curve. The small or the big dials can't do it. You can't change what icon or text appears next to the dials. You can change what happens when you click the dials, if you know that you have to click over here, on the press, which took me a while to figure out. Also you cannot change the icon or color or image or text on any of the touchscreen buttons, or the touchscreen itself. And the worst part is that for a lot of the functions that they have, they don't have an icon. Or sometimes the names are all the same. This is one of the biggest strikes against the Loupedeck CT. Like, I assumed that you'd be able to do it like you can for the stream deck. With the stream deck, you can put whatever text and whatever icon you want. And here's another big strike against them. You cannot open or activate any given application that you want, you are stuck with the ones that they've preselected for you. From the stream deck, you can totally do it. Just open an app file and you can choose whatever you want, anywhere on your system, including AutoHotkey scripts, That's like the main thing that I use the stream deck for. More stuff you can't do. There are these one, two, three, four, five buttons that you cannot customize, you cannot change them. Also, you can't change the RGB of any of the buttons at all. The physical buttons, no they're stuck with the default colors. Honestly, for most of the stuff that this thing can do, it's usually better to just use the keyboard. Honestly, because your hand is already on the keyboard, you already have all the muscle memory. And like the physical feedback of pressing a key, releasing a key, and you know that an action has been sent. That's better than the haptic feedback on the Loupedeck CT, because get this, when you touch it at all, You just touch it? Listen. It makes a vibration. But that doesn't mean that it's done anything, it's done nothing. (laughs) It always vibrates when you touch it, even though the action only happens when you release. So the vibration is doubly useless. It's telling me something has happened when nothing has happened, and then it tells me that something's happened when it has happened, but I can't feel it. It's even worse on this thing here. I don't know what it's trying to tell me, listen. Look, what is it doing? At least when I double tap it, I get back to normal. But like when I move my finger here and then back, I'm not back where I started. So the shuttle command is garbage. It's kind of okay when you're going slow. If you go fast, whoa, it teleports around seemingly at random. I think what they did is they tried to get it to like, skip over gaps. The best one I've ever used is on the Logitech craft keyboard, to the point where I just wanna cut it off of that keyboard and just put it down here and use only the dial. I feel like what they really should have done is just talk to the users, people who actually use Premiere, go on UserVoice and find stuff that you can fix with the Loupedeck CT. And here's a perfect example. Keyboard shortcuts for effects and presets. They don't have it. I have it because I did it without a hotkey. Nobody else has it and this would be perfect, perfect for the Loupedeck. You just press one key and all of a sudden you have access to whichever one of your presets you want. Look at all these. There is one command I found that works better on the Loupedeck CT than it does on the keyboard, select a clip. (blips) If you click on a different row, then it'll select on that row. Oh, that's so cool. Look at that. And then the other really good things to have on dials and sliders are color correction controls, for which it's okay on the Loupedeck, but honestly if you really want color correction in Premiere on a control surface, use the Ripple Tangent, it is magnificent. I love this thing, I use it every day. Increase and decrease the exposure, I can change the saturation, make it really high, make it really low, change the color temperature. This is the kind of thing they should have tried to emulate with the Loupedeck, and it just doesn't work nearly as well as a real physical ball. The Photoshop integration is a little better, they put more thought into it, I think. Except that I can't always get it to work. I'm in Photoshop, I'm gonna click on the brush tool. Nothing's happened, oh gosh, type tool? Nope, nothing's happened. I think I have to close out of Photoshop and reopen it. There we go, we got the brush tool, okay. I can change my foreground and my background color, except that you literally only have these ones to choose from. What if you want brown or gray? Too bad, there are not swatches for that. And even if there were, there would be no icons for them. And then you can't make your own icons. So, (spits) whatever. You don't even have icons for white and black. Okay, brush size, opacity and hardness, okay, great. Brush, can make the size smaller, brush, okay, okay. And I can also change the hardness this way. Come on, here's the problem. You can do that way faster with keyboard shortcuts. If you don't know about this one, it's great. So brush tool, just hit alt, right click, and then you have access to both hardness and diameter. And then of course, because I'm the macro king, I bound this all to a single button, so. And then they also have, for example, zoom. Guys, the zoom. Guess what, look at how slow and laggy it is. Compare that to the built in Photoshop feature where you press Ctrl + Space + left click, which is instantaneous, works so much better. I put it on a single button, because you know I can. This thing is not worth the 500 something dollars that they're asking for. They tried to do too many things. They tried to support too many different pieces of software. Whereas a focused approach like the stream deck, where it's like, we're gonna make this just for streaming, to start with. Get it really good for that and then expand out from there. Or with the Ripple Tangent where they're like, this is just for color correction. That's so much of a better approach. You know, it's all beauty and very little brains, like this thing looks great, it looks very impressive. And the hardware is fine, like if they had the integration working really well, I could see myself using this. But at the moment, the only thing, the only thing that I might use it for is Photoshop actions. Guys, this is great. Lemme show you. These are all my own custom actions that I have built. And the problem with Photoshop is that you can only ever assign 44 actions to different shortcuts, whereas because the Loupedeck CT has API access to Photoshop, they are directly integrated, there's no need to go through a shortcut, I can have unlimited actions on here, check it out. 50% smaller, nearest neighbor. Oh, is it not working? Oh, there we go, there's just a delay because of course there's a delay. There's a whole group of fish called delay fish. Like I can do it with that 12 or whatever, but I only have so many keys. And if they've only done that for Premiere presets, then that's another great reason to use this thing. All right, oh, some things that I do like about it. It does have access to F24 through F13. Lemme see here. So I was experimenting with that here. You can create macros of sorts. They're called custom actions. Anything that's in here, yeah, you can add to a custom action. That's great, that's perfect, thank you. And I like the consistent use of colors for workspaces versus pages versus whatever, and it does look cool. And those are the only things that I like about it. (laughs) Just from what I've seen so far, like I'm just, I'm so not impressed. I want to encourage products like this. I wanted this to be great, I wanted to like this, but I don't because we need more stuff like this, we need more stuff like the Ripple Tangent. (sings) Get one of these if you wanna do color correction in Premiere. Get a stream deck. This doesn't have integration with Premiere, but watch my review. They added all the features that I requested in my review, but don't get a Loupedeck CT. Maybe, maybe when they fix the software, but oh, I've been waiting, I've been waiting for the Palette Gear guys to fix their software and make it a lot better. I've been waiting for years. I don't use these things because it has a lot of similar problems to the Loupedeck CT, they tried to bite off more than they can chew. However, they do have a brand new system coming out soon which maybe I will get to review on a short circuit, we will see. So make sure you subscribe, bye.",
    "transcript_keywords": [
        "Loupedeck",
        "thing",
        "Photoshop",
        "change",
        "Premiere",
        "things",
        "stream deck",
        "make",
        "dials",
        "software",
        "keyboard",
        "click",
        "great",
        "color",
        "stream",
        "deck",
        "stuff",
        "Ripple Tangent",
        "actions",
        "happened"
    ],
    "transcript_entity_values": [
        "USBC",
        "Photoshop",
        "Open.item",
        "three",
        "44",
        "AutoHotkey",
        "one",
        "Pokemon",
        "the Ripple Tangent",
        "the Quickstart Guide",
        "a few weeks",
        "Lightroom",
        "Brush",
        "Logitech",
        "Ctrl + Space +",
        "500 something dollars",
        "API",
        "UserVoice",
        "F24",
        "Streamlabs",
        "Premiere",
        "Ableton Live",
        "F13",
        "the Loupedeck CT",
        "two",
        "Audio Keyframes",
        "Loupedeck",
        "four",
        "Kickstarter",
        "Loupedeck",
        "the Ripple Tangent",
        "50%",
        "RGB",
        "12",
        "First",
        "five",
        "years",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "GPE",
        "PERSON",
        "FAC",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.10385700315237045,
        -0.03948622941970825,
        -0.03664674609899521,
        -0.04785129800438881,
        0.12774322926998138,
        0.07118342071771622,
        0.012462780810892582,
        0.0746273323893547,
        -0.07828972488641739,
        0.03317352756857872,
        -0.02282784879207611,
        0.019877605140209198,
        0.008485288359224796,
        -0.041164152324199677,
        0.07675247639417648,
        0.0027171734254807234,
        0.05216651409864426,
        -0.018210580572485924,
        0.008017162792384624,
        -0.010979400016367435,
        0.015814192593097687,
        -0.08926435559988022,
        -0.022956402972340584,
        -0.04134266823530197,
        0.006829802878201008,
        -0.02964264154434204,
        0.01358109712600708,
        -0.0764816626906395,
        0.0574781708419323,
        -0.09321605414152145,
        0.00040694334893487394,
        0.02019505761563778,
        0.021793650463223457,
        -0.028641073033213615,
        0.06428401917219162,
        0.004702132660895586,
        0.015055406838655472,
        -0.041523631662130356,
        -0.07126772403717041,
        -0.05166648328304291,
        0.008005107752978802,
        -0.015750305727124214,
        -0.052342597395181656,
        -0.013034078292548656,
        -0.012769426219165325,
        -0.05171307176351547,
        0.03424472361803055,
        -0.015460043214261532,
        0.02571898140013218,
        0.09969022870063782,
        -0.04355943575501442,
        -0.11255394667387009,
        0.027900489047169685,
        -0.00048227005754597485,
        0.006873209960758686,
        0.016674399375915527,
        -0.011705937795341015,
        -0.0754748284816742,
        0.05762410908937454,
        -0.07123810052871704,
        0.030856138095259666,
        -0.08804259449243546,
        -0.08128593862056732,
        0.06615796685218811,
        0.011014613322913647,
        0.02783099003136158,
        0.013369898311793804,
        0.14066608250141144,
        -0.04881942272186279,
        -0.07468177378177643,
        -0.07142287492752075,
        0.006677949335426092,
        0.021401552483439445,
        0.11613520979881287,
        -0.04034232348203659,
        0.006389295682311058,
        0.048033010214567184,
        -0.03625449910759926,
        0.026204099878668785,
        -0.018562866374850273,
        0.0189321581274271,
        0.06435200572013855,
        -0.04635275527834892,
        0.008666758425533772,
        -0.007201098836958408,
        0.013892189599573612,
        0.08162478357553482,
        0.059456128627061844,
        0.03635001555085182,
        -0.00382572365924716,
        0.021794846281409264,
        0.11562369763851166,
        0.08351881802082062,
        -0.009132035076618195,
        -0.005568147171288729,
        -0.028305934742093086,
        0.06702332198619843,
        -0.08412802219390869,
        0.009832008741796017,
        0.07544051855802536,
        0.01595951057970524,
        0.04081965982913971,
        0.08447761088609695,
        -0.10713007301092148,
        -0.04670918732881546,
        -0.07128752768039703,
        -0.004628422670066357,
        0.0998983383178711,
        0.040734391659498215,
        0.01370592974126339,
        -0.06162156164646149,
        0.015392672270536423,
        -0.08740592002868652,
        -0.08462882041931152,
        0.034726906567811966,
        0.0026600020937621593,
        -0.035859476774930954,
        -0.05610336363315582,
        0.07132479548454285,
        -0.05255162715911865,
        0.07383722066879272,
        0.0027211979031562805,
        -0.022360092028975487,
        0.054100047796964645,
        0.02399025857448578,
        0.07205101102590561,
        -0.025010118260979652,
        3.27289916629374e-33,
        -0.024331670254468918,
        0.0679067075252533,
        -0.07181160897016525,
        0.002210230566561222,
        0.09639377892017365,
        0.009046471677720547,
        0.03479994460940361,
        0.004317958373576403,
        -0.11182841658592224,
        0.00895541999489069,
        -0.05844046175479889,
        0.10755324363708496,
        -0.07342293858528137,
        0.09663158655166626,
        -0.033544644713401794,
        -0.04046544432640076,
        -0.0005873889313079417,
        0.07383457571268082,
        0.022849516943097115,
        0.0028196843340992928,
        -0.04171587899327278,
        -0.022498274222016335,
        0.06042647734284401,
        0.018101966008543968,
        0.039203301072120667,
        0.0138144725933671,
        -0.006088458001613617,
        -0.02451750636100769,
        0.08600763231515884,
        0.02567773126065731,
        -0.0507911741733551,
        -0.0015493921237066388,
        0.03810979798436165,
        0.01948409713804722,
        0.011547577567398548,
        -0.021384775638580322,
        -0.10338717699050903,
        -0.11749526858329773,
        0.05369175598025322,
        0.07083263993263245,
        -0.08267015963792801,
        0.025858284905552864,
        -0.09524622559547424,
        -0.11226671934127808,
        0.0024684136733412743,
        -0.018496477976441383,
        -0.02868850901722908,
        -0.00904070120304823,
        0.06828287988901138,
        -0.00956563651561737,
        0.02607763186097145,
        0.0019637702498584986,
        -0.05601073428988457,
        -0.007909375242888927,
        0.04082576930522919,
        -0.040832940489053726,
        -0.03869675472378731,
        -0.018422838300466537,
        0.04417680948972702,
        -0.0013174343621358275,
        0.039411138743162155,
        0.05301833152770996,
        0.04163305461406708,
        -0.02508520893752575,
        -0.07552133500576019,
        0.012746748514473438,
        0.020369326695799828,
        -0.0042942785657942295,
        -0.015972718596458435,
        -0.071265809237957,
        -0.04013573005795479,
        -0.011631518602371216,
        0.04169338941574097,
        -0.03708881139755249,
        0.01206835638731718,
        0.01651160791516304,
        -0.057484518736600876,
        -0.019098585471510887,
        -0.02354661002755165,
        0.046173181384801865,
        -0.06456846743822098,
        0.020536376163363457,
        0.006902191322296858,
        0.0370061993598938,
        0.01780104637145996,
        0.00999675877392292,
        0.01170148141682148,
        0.021973514929413795,
        -0.08015744388103485,
        -0.01292814314365387,
        -0.05350939556956291,
        0.029335927218198776,
        0.013306330889463425,
        0.02116810902953148,
        -0.0376049168407917,
        -3.629297298519549e-33,
        -0.08034587651491165,
        0.008828670717775822,
        -0.023714840412139893,
        0.054335396736860275,
        0.05495091900229454,
        0.01550178974866867,
        0.0754203200340271,
        -0.03883893042802811,
        0.05489519611001015,
        -0.05399325117468834,
        -0.029032662510871887,
        -0.002281083259731531,
        -0.11929504573345184,
        -0.01201076339930296,
        -0.015028639696538448,
        -0.0462505966424942,
        0.03446735069155693,
        -0.13359296321868896,
        -0.03693066164851189,
        -0.041231971234083176,
        0.06774137169122696,
        -0.0024630415719002485,
        0.0014718358870595694,
        0.05706492438912392,
        0.08301099389791489,
        0.023908158764243126,
        -0.021670280024409294,
        0.020277680829167366,
        -0.013704251497983932,
        0.07031580805778503,
        -0.018631696701049805,
        0.056894924491643906,
        -0.0062955524772405624,
        -0.03500446677207947,
        0.026512036100029945,
        0.012300819158554077,
        0.08132512122392654,
        0.13873083889484406,
        0.01310464646667242,
        -0.013013496063649654,
        0.02504357509315014,
        -0.0534968338906765,
        0.003598224138841033,
        -0.029910292476415634,
        -0.018695352599024773,
        -0.018763747066259384,
        -0.05973724648356438,
        -0.09608094394207001,
        0.01851723901927471,
        0.09459537267684937,
        -0.03793198615312576,
        -0.03443007543683052,
        0.03933735564351082,
        -0.0125836580991745,
        -0.11695259064435959,
        -0.030969344079494476,
        -0.005746741313487291,
        -0.0066630165092647076,
        -0.04220675677061081,
        0.003266542684286833,
        -0.030812159180641174,
        -0.0037822998128831387,
        -0.005369189660996199,
        -0.005946795456111431,
        0.037733860313892365,
        -0.005625102203339338,
        0.04115630313754082,
        -0.014792132191359997,
        -0.12130195647478104,
        0.003796768607571721,
        0.03412222862243652,
        0.012283413670957088,
        0.005456225015223026,
        -0.06323397904634476,
        -0.03292805701494217,
        0.08618473261594772,
        0.03324417397379875,
        0.005564225371927023,
        -0.010095329955220222,
        -0.007077106740325689,
        0.02477734163403511,
        0.09876222908496857,
        0.07547015696763992,
        -0.04226149246096611,
        -0.016055362299084663,
        0.07920002937316895,
        0.019741881638765335,
        -0.0872725173830986,
        -0.01999548450112343,
        -0.021993959322571754,
        -0.09981045871973038,
        -0.02606416866183281,
        -0.017965687438845634,
        0.09188662469387054,
        0.0325588695704937,
        -6.36348289617672e-08,
        -0.05925225466489792,
        0.0024797350633889437,
        -0.004197261296212673,
        -0.03760872036218643,
        0.008420555852353573,
        -0.022163676097989082,
        -0.004334631841629744,
        0.02186349220573902,
        0.04510900005698204,
        -0.029584310948848724,
        0.05619871988892555,
        -0.0799243375658989,
        -0.006006299052387476,
        0.04099566861987114,
        0.04917757585644722,
        -0.06032637879252434,
        0.009450165554881096,
        0.006715280003845692,
        -0.06350060552358627,
        -0.09342528879642487,
        0.0036416049115359783,
        0.05773497372865677,
        0.09356895834207535,
        -0.013963853009045124,
        -0.03029724583029747,
        -0.023256337270140648,
        0.05018634349107742,
        0.007449274882674217,
        0.09777205437421799,
        -0.05805191025137901,
        -0.04473221302032471,
        0.05218461528420448,
        0.011119969189167023,
        0.0363067202270031,
        0.07640630751848221,
        -0.01646866276860237,
        -0.0668957307934761,
        0.06612875312566757,
        -0.032657548785209656,
        0.06588676571846008,
        0.010680289939045906,
        0.07242047786712646,
        0.0024014150258153677,
        -0.03697332367300987,
        0.06890660524368286,
        -0.046683840453624725,
        -0.0014169774949550629,
        -0.025750434026122093,
        0.0319480299949646,
        0.002283283742144704,
        0.001905986457131803,
        0.0008116786484606564,
        -0.06616117805242538,
        0.06989390403032303,
        0.03867508843541145,
        -0.01851513423025608,
        -0.04240775480866432,
        0.02393784373998642,
        0.015876123681664467,
        0.06884365528821945,
        -0.07037632167339325,
        -0.09494704008102417,
        -0.016402017325162888,
        0.07840834558010101
    ]
}