{
    "id": "xiJvAVPqWAQ",
    "title": "ProPods Max Scam Follow-up (They Vanished?) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-12-16T16:58:53Z",
    "video_url": "https://www.youtube.com/watch?v=xiJvAVPqWAQ",
    "category": "Science & Technology",
    "tags": [
        "ProPods Max Scam Follow-up (They Vanished?) - Krazy Ken's Tech Talk",
        "AirPods Max",
        "AirPods Scam",
        "ProPods Scam",
        "ProPods Max",
        "PODSPRO",
        "Apple",
        "Mac",
        "iPhone",
        "Wireless Headphones",
        "Headphones",
        "Scam",
        "Krazy Ken's Tech Talk",
        "Computer Clan"
    ],
    "views": 196978,
    "likes": 7767,
    "comments_count": 499,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below It's been almost a year since Krazy Ken ordered these ProPods Max scam headphones, and there's been some juicy developments.  Watch part 1 first!   Download our epic wallpapers   Watch more tech scam-busting episodes    Support our channel and get cool stuff   Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord     Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   UPDATE: I've received some suggestions regarding different \"clones\" I should test. I hear your feedback, and I think a follow-up episode is in order. Thanks for your comments, and stay tuned   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/ZsjGFXF4sIg",
        "https://thecomputerclan.com/wallpapers",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Apple AirPods Max, one is real and one is fake. Can you tell which is which? Sponsored by Linode. (techno music) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And back in January 2021, I started exploring this PODSPRO company. And I ordered one of their ProPods Max headphones. To no surprise, they still haven't arrived, but I did do an episode back in April. However, it's been about eight months and there's been some interesting developments since then. So today, we'll recap part one, then we'll go over the new developments that have been happening, and then finally, we'll compare the fake ones with the real ones. And we'll even see if an Apple retail employee can tell the difference between the two. So let's dive in. The company behind ProPods is IPODSPRO, but they later changed their name to PODSPRO. Their website is littered with stolen product photos and videos, which are directly copied from Apple. ProPods claim they can offer the full experience of AirPods Max at half the cost, $119, which mathematically is less than half, but whatever. During my exploration, PODSPRO took an interest in me, sending me tweets and DMs, and even including one of my tweets on their website. I highly encourage you to watch part one, if you haven't seen that already, just to get all the juicy details. But long story short, the product never arrived and they kept making up stories and excuses as to why the product wasn't here. And they just kept lying to me and to the public. So it's been eight months, what has been happening? During this time, PODSPRO changed their website and it mimicked even more of Apple's design and style. And again, they used more stolen imagery. The price was now listed at $149 instead of the 119 I saw earlier. Their new website still claimed PODSPRO has a digital crown and other AirPods Max features, except for the battery life. It mentions five to six hours, as opposed to Apple's claim of 20. They also erased the reviews from their website, which was probably a good idea. So I continued the DMs on Twitter just to get some more information out of these guys, but then they blocked me. Then their Twitter profile displayed a something went wrong error. But then the next day, oddly enough, they were back up and running, but they had zero follows and zero followers. So the DMs continued and I just kinda played dumb, you know, just to let the conversation keep going. But even though they said, \"Hey, we'll get them to you in August.\" I never received a tracking number. And this is where the communications just died. And their Twitter account just vanished. I can't even find them in my DMs anymore. Their propodsmax.co website now leads to a 404 and it displays a default Webflow favicon, but their Instagram is still up. However, there are no posts on it. But wait, they still have a product listed on their Facebook store. Maybe that will work. (buzzer buzzes) Oh. So for grins and giggles, I went back to the emails they sent me months ago and they were just marketing communications, and I clicked on the propodsmax.co link. And yeah, it just redirects to a clothing store now called nap. I also sent an email to their support address just to see if I'd get anything back. And I did, from an automated message, host or domain not found. They knew they were beat, so they deleted themselves from the Interwebs. But hey, we're not done yet. In the last episode, I reached out to Unbox Therapy because the ProPods, PODSPRO people, whatever, claimed they were working with Unbox Therapy on a video. And I wanted to verify that information and an Unbox Therapy representative actually got back to me. So that was awesome. And they had similar suspicions. To put it broadly, they told me they were also suspicious of the shady practices with these ProPods, PODSPRO people. So that additional validation made me feel good. But hold on, wait, this would be kind of a disappointing end to a story, if we couldn't even get the physical product, right? Well, with the website completely gone, I don't really know what else to do, except for one more thing. And I had to do this in my Lit Mobile episode. I never received the product. So I merely went to Alibaba and bought the OEM product. And I did something similar, in this case, with AliExpress. I browsed for a product that looks similar to what PODSPRO was selling. But because PODSPRO used stolen Apple images, it was hard to tell for sure. But I figured, this listing would be a reasonable fit. With shipping, the final price came to be $17.30. It's good to note that this AliExpress listing was also using stolen Apple product images, but there was at least one legitimate photo included. Note, the non-Apple logo in the corner of this box. And sure enough, they arrived. So now I think we're in a good place where we can compare these $17 headphones against Apple's $549 headphones. And by the way, if you guys find any other knock-off tech or scam tech products you want me to take a look at, feel free to send me a DM on Twitter. All right, let's take a look. Visually, the two products look very similar, especially at a distance or in a case. In fact, I ran a Twitter poll, which asked, \"Which AirPods Max are the real ones?\" At one time, 30% of the votes chose the knock-off pair. I even received a reply saying option A, the knock-offs, were the real ones because of the mesh design on the canopy. They said it was very off-brand for Apple. When in fact, the opposite was true. The mesh was Apple's design. The final results showed 18.9% of people voting for the knock-off pair, but I'm willing to bet, people were peeking in the replies to figure out the answer. So even though the answer may be obvious to some people, we have to remember, it can still trick some people, almost a fifth of those people picked the wrong pair, the knock-off pair, thinking they were the legit ones, but it's okay. It's our job to be patient and help educate those people who are not as tech savvy. And that's how we make the tech world a better place. Upon further examination, the biggest visual differences are the non-mesh band or canopy, the lack of a digital crown, and additional physical buttons. All of these are traits that don't match Apple's AirPods Max. Also, the cushions appear to be fake leather with stitching and not this mesh-like cushiony material on the official pair. Now, when you actually get both of these in your hands, you'll definitely notice more differences in how they feel and how they weigh. In fact, I've handed these to a few people and they always laugh because I hand them the real ones and then I hand them this pair. And they're so light, it's kind of funny. And that's because, well, the official ones are made of aluminum and steel, and the fake ones are (bangs headphones) cheap plastic. The AirPods Max weigh in at 13.4 ounces and the knock-offs weigh in at 4.8. Now, what about sound quality? Gosh, I think you already know where this is going. But we're already so far down this fricking rabbit hole, let's just keep digging. Now, if you want the best comparison you can possibly get, I encourage you to try out the AirPods Max for yourselves, because frankly, I'm not much of a headphone user anyway. So take my opinion with a couple grains of salt. But I will say, after testing these out, I really do like the quality and the noise cancellation is really impressive, and that Transparency Mode is also a super handy feature. But then there's these guys, and the quality, well, not even close. The knock-offs paired to my phone easily, so there's that, but it had a really funny computer voice. (notification bell ringing) - [Woman] The Bluetooth device is ready to pair. - Then I tried listening to some music with these things and, oh my gosh, the quality is atrocious. Not only is there zero noise cancellation in these things, but I only hear mids. I don't hear any bass or treble, just midrange frequencies, and they sound terrible. So it doesn't really make for a good product, but for $17, what do you expect? However, if this is the true experience that the PODSPRO people were trying to sell for $149, oh boy, that's a problem. Also, these things are very uncomfortable. Like I know I have a big head. Okay, that's been well-established, but these are still just really tight. I feel like my head is in a vice grip when I wear these. Yes, they're adjustable kinda, but they're still uncomfortable, and they're just kinda creaky. The cheap plastic makes creaking noises. And when they're on your head, you really hear those creaks as you're playing music because the noises are happening so close to your ear, it just makes for a terrible sound experience. Ultimately, they're pretty crap, but visually, they still do look kinda like AirPods Max, especially if you don't look really hard, and my poll helps demonstrate that. But now, let's see if an Apple retail employee can determine that these are fake. I traveled to an Apple store and pretended I needed help pairing my AirPods Max to my iPhone 7. And here is the conversation. Forgive me, I'm kinda new to the iPhone thing. - [Employee] No worries. (Ken laughs) Let's see. You've got Bluetooth on, that's a big thing. - [Ken] Oh, Bluetooth? Okay. Yeah, a friend of mine sold these to me, but I don't know much about them though. - [Employee] Who did you buy this from? - [Ken] Just a buddy of mine, locally. - [Employee] Yeah, these are not real. Yeah, these are like a demo. - [Ken] Oh. - [Employee] There's nothing in here. It's like a display. - [Ken] Okay. - [Employee] That is why you couldn't pair them. - [Ken] Oh my gosh. - [Employee] These are not real. - [Ken] I feel so embarrassed about that - [Employee] No, you're good, you're good. - [Ken] Okay! Okay, so thankfully, they're not stealthy enough to get past Apple's eye, but there is actually one thing I haven't talked about yet. There is one feature that these things have that the official AirPods don't. 360-degree surround stereo attack and high fideity sound. That's right, deity. These headphones have Jesus built in. ProPods Max, a scam from the beginning. Despite them trying to convince the public and myself that they were legit, they ultimately never shipped their product, closed up shop, and purged themselves from the internet out of defeat. But I'll tell you what's definitely not a scam, my awesome friends at Linode. Thanks guys for making this episode possible. They helped me and they can help you too. You can simplify your infrastructure and cut your cloud bills in half with Linode's Linux virtual machines. Whether you're developing a personal project, building a website or managing larger workloads, you deserve simple, affordable and accessible cloud computing solutions. And that's exactly what Linode is for. Heck, you can even deploy Minecraft and CS:GO servers. And as a thank you for watching my show, I'll give you a 60-day $100 credit, when you sign up today. You also receive 24/7/365 human support, regardless of your plan size. You can choose shared and dedicated compute instances, or you can use your $100 in credit on S3-compatible object storage, Managed Kubernetes, and more. To put it simply, if it runs on Linux, it runs on Linode. So visit linode.com/computerclan today and click the Create Free Account button, and I'll give you that $100 in credit for free. And when you do that, you'll also be supporting the Computer Clan, so thank you very much. And feel free to subscribe for more tech episodes coming out all the time. I love making episodes about rare and retro tech, new tech, and of course, scam tech. And hey, if you liked this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy and pass it on. (upbeat techno music) (mouse clicks) (bell chiming)",
    "transcript_keywords": [
        "AirPods Max",
        "Apple AirPods Max",
        "Apple",
        "Max",
        "PODSPRO",
        "product",
        "PODSPRO people",
        "AirPods",
        "people",
        "Apple AirPods",
        "website",
        "pair",
        "stolen Apple product",
        "tech",
        "Unbox Therapy",
        "ProPods Max",
        "Twitter",
        "stolen Apple",
        "real",
        "good"
    ],
    "transcript_entity_values": [
        "PODSPRO",
        "Webflow",
        "Ken",
        "zero",
        "30%",
        "months ago",
        "ProPods",
        "Unbox",
        "half",
        "Facebook",
        "Which AirPods Max",
        "OEM",
        "Alibaba",
        "January 2021",
        "non-Apple",
        "Managed Kubernetes",
        "two",
        "Apple",
        "Instagram",
        "April",
        "18.9%",
        "ProPods Max",
        "149",
        "100",
        "17",
        "20",
        "AirPods",
        "ProPods Max",
        "60-day",
        "today",
        "less than half",
        "Krazy Ken",
        "five to six hours",
        "at least one",
        "AliExpress",
        "the next day",
        "549",
        "eight months",
        "13.4 ounces",
        "one",
        "S3",
        "119",
        "fifth",
        "Jesus",
        "4.8",
        "404",
        "iPhone",
        "August",
        "the AirPods Max",
        "IPODSPRO",
        "Minecraft",
        "AirPods Max",
        "Linux",
        "24/7/365",
        "17.30",
        "Twitter",
        "Linode",
        "Linode",
        "the Computer Clan",
        "CS",
        "about eight months",
        "Unbox Therapy"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "PERSON",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.1972288340330124,
        -0.10019414126873016,
        0.0173115823417902,
        -0.15860652923583984,
        0.0403706394135952,
        0.007639656774699688,
        0.06640678644180298,
        -0.018456123769283295,
        -0.029652666300535202,
        -0.008124234154820442,
        0.06109907105565071,
        0.05802306532859802,
        -0.0009754555067047477,
        -0.09943004697561264,
        0.002471612300723791,
        -0.006791893392801285,
        0.07554226368665695,
        -0.1034112423658371,
        -0.07169029861688614,
        -0.007376972120255232,
        -0.06555715203285217,
        -0.0894080325961113,
        0.006087293848395348,
        0.04048377647995949,
        0.060543403029441833,
        0.03319159895181656,
        -0.05046835541725159,
        -0.0028322695288807154,
        -0.021027252078056335,
        -0.06183403730392456,
        0.025640420615673065,
        0.050643082708120346,
        0.06134267523884773,
        0.018078546971082687,
        0.05388473719358444,
        -0.015133527107536793,
        -0.00509664649143815,
        -0.03303905948996544,
        -0.036269184201955795,
        -0.01145458035171032,
        0.025763778015971184,
        -0.06947394460439682,
        -0.11672739684581757,
        0.053492702543735504,
        -0.03762531280517578,
        0.022676635533571243,
        0.021311981603503227,
        -0.03384996950626373,
        0.043244246393442154,
        -0.009930703788995743,
        0.00136533472687006,
        -0.10964569449424744,
        0.08809918910264969,
        -0.007208527997136116,
        -0.035151880234479904,
        -0.029581984505057335,
        0.03287563472986221,
        -0.02369275875389576,
        0.12377668917179108,
        0.008981137536466122,
        0.04747668281197548,
        -0.003927195444703102,
        -0.028555942699313164,
        0.028951751068234444,
        0.012809398584067822,
        -0.0112438490614295,
        0.01711074262857437,
        0.07561354339122772,
        0.018245819956064224,
        -0.03109198808670044,
        -0.00041650907951407135,
        0.022392578423023224,
        0.019835511222481728,
        0.0785411149263382,
        0.02425527200102806,
        0.04725835844874382,
        -0.015202808193862438,
        -0.06115640327334404,
        0.03420700877904892,
        -0.09046788513660431,
        -0.018600910902023315,
        -0.06149395555257797,
        -0.031665343791246414,
        -0.0676017552614212,
        -0.025181956589221954,
        0.039637405425310135,
        -0.029274577274918556,
        0.013417174108326435,
        0.02567370794713497,
        -0.025754835456609726,
        -0.031876131892204285,
        0.07240165770053864,
        0.14621911942958832,
        -0.008189408108592033,
        0.019210373982787132,
        0.05552774295210838,
        -0.021615631878376007,
        -0.03643554076552391,
        -0.007092555984854698,
        0.07754641026258469,
        -0.0228763185441494,
        0.062091417610645294,
        0.010403025895357132,
        -0.11313940584659576,
        0.01823786087334156,
        -0.05602177605032921,
        -0.030591318383812904,
        0.05152098834514618,
        0.09409916400909424,
        0.029043154790997505,
        -0.025840166956186295,
        0.014775504358112812,
        0.009527740068733692,
        -0.013942696154117584,
        0.05854101479053497,
        0.04847456514835358,
        -0.04771694540977478,
        0.08151587098836899,
        0.05831505358219147,
        -0.08448990434408188,
        0.09586341679096222,
        0.02698110044002533,
        -0.009638216346502304,
        -0.009954143315553665,
        0.05097687616944313,
        0.024078860878944397,
        -0.042181529104709625,
        3.222325358559534e-33,
        0.045789934694767,
        0.12146811932325363,
        -0.061772093176841736,
        0.009367411956191063,
        0.027289927005767822,
        -0.03778275474905968,
        0.0011164145544171333,
        0.08418019115924835,
        -0.13830037415027618,
        0.02153235860168934,
        -0.06003117933869362,
        -0.010771730914711952,
        -0.048801571130752563,
        -0.0014004730619490147,
        -0.08408673852682114,
        -0.053267817944288254,
        -0.032414019107818604,
        -0.0034828733187168837,
        -0.023130621761083603,
        0.005045678000897169,
        0.05988563224673271,
        0.023929061368107796,
        0.003744227811694145,
        0.036093275994062424,
        0.01568589173257351,
        -0.06927637755870819,
        -0.0745435431599617,
        0.002486943267285824,
        0.13512226939201355,
        0.03873328119516373,
        -0.10664308816194534,
        0.006269212346524,
        0.04843701049685478,
        0.0484631322324276,
        -0.002380004385486245,
        -0.0023025120608508587,
        -0.03448088839650154,
        -0.13445870578289032,
        -0.023976150900125504,
        -0.027668774127960205,
        -0.027472734451293945,
        0.027139635756611824,
        -0.1013367548584938,
        -0.057921092957258224,
        -0.0439644493162632,
        0.00866630207747221,
        -0.0022707576863467693,
        0.029010143131017685,
        0.08857633918523788,
        -0.026874670758843422,
        -0.05520942807197571,
        0.017707275226712227,
        -0.0299174003303051,
        -0.00012962146138306707,
        -0.040920842438936234,
        -0.03062174841761589,
        -0.010571177117526531,
        -0.026172250509262085,
        0.07367413491010666,
        0.0014913204358890653,
        0.10076452791690826,
        0.07176823168992996,
        0.03806868568062782,
        0.027121732011437416,
        -0.06336559355258942,
        -0.006166903302073479,
        0.010058294050395489,
        0.046375077217817307,
        -0.014083905145525932,
        0.06643112003803253,
        4.980361336492933e-05,
        0.0015359341632574797,
        -0.02341381274163723,
        -0.04368437081575394,
        0.03181028366088867,
        -0.05413354933261871,
        -0.09198897331953049,
        0.01841915026307106,
        -0.08029446750879288,
        0.05839831009507179,
        -0.015507818199694157,
        0.01717451959848404,
        -0.009950275532901287,
        0.025068877264857292,
        0.03618944063782692,
        0.005974108353257179,
        0.05839160829782486,
        -0.02377384528517723,
        -0.06388579308986664,
        -0.012364553287625313,
        0.0036582057364284992,
        -0.04692305624485016,
        0.01209335122257471,
        0.04048733413219452,
        0.0008791876025497913,
        -4.12556493215581e-33,
        -0.008552677929401398,
        -0.030978882685303688,
        0.0132997902110219,
        -0.028731582686305046,
        0.038796067237854004,
        0.0014314595609903336,
        -0.001430037315003574,
        0.030937448143959045,
        -0.02749956212937832,
        0.024177737534046173,
        0.05842007324099541,
        0.03785990923643112,
        -0.04333142191171646,
        -0.07444670796394348,
        -0.002375409472733736,
        -0.0781976506114006,
        0.029240021482110023,
        -0.011314855888485909,
        0.04228627309203148,
        -0.027880551293492317,
        0.08350390940904617,
        0.015014706179499626,
        -0.049310892820358276,
        0.05917810648679733,
        -0.014332855120301247,
        0.003724961308762431,
        0.03819109871983528,
        0.0954212173819542,
        0.04243007302284241,
        0.015716249123215675,
        0.029908522963523865,
        0.06468906998634338,
        -0.0894208773970604,
        0.013878325000405312,
        0.03947211429476738,
        0.044268231838941574,
        0.029240010306239128,
        0.035771604627370834,
        -0.026828136295080185,
        -0.09588611871004105,
        0.04111069440841675,
        -0.015404374338686466,
        -0.05821825563907623,
        -0.030780423432588577,
        -0.05691954866051674,
        -0.08395286649465561,
        0.005217340309172869,
        0.02140207029879093,
        0.0005682440241798759,
        -0.02387765608727932,
        0.02238377556204796,
        -0.021799571812152863,
        0.07953611761331558,
        0.0022971886210143566,
        -0.09450563788414001,
        0.0449884757399559,
        0.023789100348949432,
        0.08996874839067459,
        0.09250711649656296,
        -0.04069627821445465,
        -0.01575898379087448,
        -0.040746111422777176,
        -0.02435927279293537,
        -0.019920624792575836,
        0.00847222562879324,
        -0.008142220787703991,
        0.10320163518190384,
        0.06581404060125351,
        0.010409311391413212,
        -0.016788823530077934,
        0.0035480489023029804,
        0.029463190585374832,
        -0.009364764206111431,
        -0.0643044039607048,
        -0.0038940750528126955,
        0.030047569423913956,
        -0.020108774304389954,
        -0.022508487105369568,
        -0.005927083548158407,
        -0.004387595225125551,
        0.00695615541189909,
        0.027476314455270767,
        0.02584169991314411,
        0.08309286832809448,
        0.09817222505807877,
        0.03131579980254173,
        0.04831697791814804,
        0.03900236263871193,
        -0.03207028657197952,
        0.0006743900012224913,
        -0.019064826890826225,
        -0.036328718066215515,
        0.033782266080379486,
        0.0864981859922409,
        0.039335791021585464,
        -5.726398555339074e-08,
        0.03375165909528732,
        0.04918345436453819,
        -0.009566587395966053,
        -0.025694653391838074,
        0.09745161980390549,
        -0.08170665800571442,
        -0.061136141419410706,
        0.012468007393181324,
        -0.04060615971684456,
        -0.0025990395806729794,
        0.04144717752933502,
        -0.029549287632107735,
        -0.012924379669129848,
        -0.004954577889293432,
        0.03212732821702957,
        -0.028976965695619583,
        -0.0720711275935173,
        0.02884882315993309,
        -0.05782759189605713,
        -0.10506552457809448,
        -0.02110772393643856,
        -0.015592958778142929,
        0.10479432344436646,
        -0.04407825320959091,
        -0.025648869574069977,
        0.03629719838500023,
        0.03936189413070679,
        0.06807007640600204,
        0.036382198333740234,
        -0.006164385937154293,
        -0.051685795187950134,
        -0.03581817075610161,
        -0.0743122398853302,
        -0.053764458745718,
        0.04475892335176468,
        -0.011005810461938381,
        -0.0761784017086029,
        0.026008492335677147,
        0.008439556695520878,
        0.03286221623420715,
        0.01593022793531418,
        -0.12521840631961823,
        0.02028554491698742,
        0.016754435375332832,
        -0.01033168938010931,
        0.008396955206990242,
        -0.08045890182256699,
        -0.05745144560933113,
        0.05454917624592781,
        -0.08689530193805695,
        0.03138076886534691,
        -0.04749835655093193,
        0.010966228321194649,
        0.08304577320814133,
        0.03498365730047226,
        -0.029465682804584503,
        -0.02170144021511078,
        0.05698198080062866,
        0.04718399420380592,
        0.06949396431446075,
        0.06451314687728882,
        -0.047589659690856934,
        -0.03800554573535919,
        0.019883453845977783
    ]
}