{
    "id": "XnxbL1-kBpU",
    "title": "The State of Foldables 2022: Samsung vs The World!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-09-12T21:59:09Z",
    "video_url": "https://www.youtube.com/watch?v=XnxbL1-kBpU",
    "category": "Science & Technology",
    "tags": [
        "foldable phones",
        "foldable",
        "MKBHD",
        "Z Fold 4",
        "Z Flip 4",
        "Galaxy Fold",
        "samsung fold",
        "Xiaomi fold",
        "Xiaomi Mix"
    ],
    "views": 2775532,
    "likes": 97889,
    "comments_count": 5221,
    "description": "Flip vs Fold vs... the world  MKBHD Merch:   Get a skin for your smartphone at  Get the Galaxy Z Fold4 at  Get the Galaxy Z Flip4 at  Check out the Xiaomi Mix Fold 2 at  Check out the Huawei P50 Pocket at   Foldable sales reference:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://dbrand.com/mkbhd",
        "https://geni.us/czjHNm",
        "https://geni.us/XQjYR",
        "https://geni.us/F2py7",
        "https://geni.us/SlsL1",
        "https://www.counterpointresearch.com/foldable-smartphone-shipments-2022/?utm_source=pocket_mylist",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "about folding phones right now. So number one, sales of these things are up every single year despite them being overall a pretty tiny fraction of overall smartphone sales. And number two, it is still very much early adopters and enthusiasts that are buying these things, maybe with one exception, but that's just because they're so expensive and they also clearly still need some material-science breakthroughs in order to feel like a regular phone. But the most interesting thing of them all that I really wanna talk about here is how it so clearly feels like Samsung steers the ship in this particular category. So we got the very first real foldable, what, around 2019, not that long ago? Stuff like the Royole FlexPai. It was a hilarious phone, but hey, it was technically a folding phone and we could clearly tell that the idea was pretty sick. So the question became, what if these things started to get really good so that they no longer feel like a science fair project, but that they get to the point where it's like just a normal phone that happens to fold in half? That would be sick. So let the R&D begin. So now it's 3 1/2 years later and we have a bunch of different folding phone options out here now and what I've noticed is they've basically coalesced into three form factors, three different, distinct models or versions of this. 1, 2, 3. So it's the fold, the flip, and the others. So the fold. This is something normal that opens up into something big. That's the basic idea. And so the standard among these is Samsung's Z Flip 4. The competition is getting closer and there's one notable one that I'll talk about in a second, but basically all of them are starting to look like this one. I've been using the newest Fold 4 on and off for a few weeks now. It looks basically exactly the same as last year with slightly more trim bezels. It has an updated chip set, new cameras and a more well-hidden, internal, selfie camera. So the new chip set has done wonders for this phone. Performance is consistently very smooth, and the battery, while it is the same physical size as last year, is getting 15 to 25% more battery life because this Snapdragon 8+ Gen 1 has just been so rock solid and efficient while also being more powerful. And then the new cameras, while they look almost exactly the same as last year from the outside, they do offer an improvement as well. Nothing game changing. I mean, they're flagship-quality cameras as far as detail and color and freezing motion, which is huge, but that's what it is. The rest of the hardware evolution though has basically come to a stop. Like, we had a much smaller cover screen to start. Now it is a full, corner-to-corner cover screen. This one, this final version here is three millimeters wider than last year. And the main screen on the inside, it stays at 7.6 inches diagonally, but it changes slightly in aspect ratio from 22 1/2 by 18, to 21.6 by 18 It's still a good looking OLED, it has a slightly visible and feelable crease through the middle. And the main improvement is that it's gotten stronger and more durable over the years from being one of the most fragile components on any phone ever, to being able to actually support a special stylus and not breaking immediately. And at selfie camera that they hid under this display in this fourth version, it feels kind of like a gimmick but it is also now much more impressive visually. Like, it's much harder to see during everyday use that there's a camera back there at all. You're just looking at the content. It's almost invisible. But it still takes some of the worst-quality selfies I've ever seen from a modern-day phone. Not even exaggeration at all. You know, it's functional for video calls. I can get behind its existence, but you should really just be using the back camera to take selfies on this phone. The absolute best thing about this new Fold 4 and I'm not even joking, is the new dock at the bottom. It's great. It has massively improved how easy it is to multitask to the point where I actually want to do it more while using the phone. It can be a little awkward sometimes that it sits right above the gesture bar but you get used to it pretty quickly. And it is endlessly convenient to just set up a bunch of custom apps, ready to go whenever you want plus some recent apps on the right. Maybe the iPad should experiment with a permanent dock like this. Either way, this is also coming to older folds as well. But guess what. This still comes in at 1,799 so it's more expensive than most other phones and it's still thicker than most other phones. But there is competition. There are alternatives. So the Oppo Find N which I did a video on is basically a Z Fold but slightly smaller with a more passport-like ratio. So that makes the cover screen feel more like a normal phone, a little bit more reachable, but it also makes the inside screen a bit smaller. There's also the HUAWEI Mate X2 which is the fold but a wedge shape. So you can see they do it a little differently with the weight distribution which definitely feels different in the hand. It has its advantages. It's also a little bit bigger which means the outside screen is extraordinarily tall but the inside screen is now up to eight inches diagonally. And the vivo X Fold, which I don't have in front of me but I've seen videos, feels like a fold but with slightly less of a crease. But then there's the new Xiaomi Mix Fold 2 and this one has been extremely impressive to me and it actually has possibly real arguments for it over Samsung's standard Z Fold 4. This is the thinnest and prettiest fold in the world right now yet it somehow packs a larger 4500 milliampere battery inside which is incredible and it also takes a bit of a different approach to the hinge where it's a little more fluid and once you get past 90 degrees, it really wants to snap open, and once you get close, it wants to snap shut. There's less stopping halfway and using it halfway folded like Samsung, which hey, some people don't really do anyway. So then there's the flip, the flip being a normal size phone that folds down into something smaller. This is actually currently the most popular version of a foldable phone. And once again, pretty much all the flips are converging on the Samsung Z Flip form factor. This being the latest version which is a very iterative update from the last one. There are new cameras again for the wide and the ultra wide, both 12 megapixels with slightly bigger pixels on the main camera which helps images get just a little bit more light. It's moved to a matte finish on the outside instead of glossy, and there are more quick controls and functionality on the outside display. So you can send quick pre-written responses to texts and use more quick-settings toggles or call three of your favorite contacts. Again, just slightly better, it's iterative, and I would guess something that you probably can or will be able to get ported back to a Flip 3. But the biggest improvement has absolutely turned out to be the battery. So not only did it move up to the Snapdragon 8+ Gen 1, but the improvements to the hinge also left room for a physically larger 3,700 milliamp-hour battery this year. You can finally use this form factor all day without sacrificing battery life. And speaking of the hinge, it's also better than last year. I think this is the best one they've ever made. It's just really firm and confident, and of course, doesn't take up as much space. The thing about a small fold like this is that you have to open the phone to really use it and depending on what type of person you are, that's either an upside or a downside. Like for someone like me, I use my phone all the time. You could call me a power user, right? I unlock it all the time. This tiny outside screen is convenient but it's not enough to do a lot of the stuff I wanna do all the time, so I have to take it outta my pocket and then open it up, which doesn't sound like much, but if you own the phone and use it, it slowly starts to wear on you. But there are some people who are intentionally trying to use their phone less, which in this case is actually a huge win. It creates this small barrier between you grabbing your phone, how many times do you just check your notifications and then 10 seconds later, you're just scrolling through something mindlessly? You don't even know what happened. This phone can kind of prevent that, but guess what? There's other flips too and they all kind of look like this one. So you've heard of the Huawei P50 Pocket? It's a flip, but with a small, circular, outer screen instead of a big rectangle. You can still buy the older Z Flip. It's still a pretty popular phone from a lot of carriers in the US. Even TCL made this foldable that they never shipped but that also looks exactly like Samsung Z Flip. For a little while, the only other flipper that had any real character that was unique was the Motorola Razor. And I reviewed the early versions. The first one-two generations really leaned into the nostalgia bit and I liked them, they were cool, but now this third version is out and not only does it make this hilarious noise every time you open it, but it looks and it's starting to feel more and more like a Z Flip than ever before. I mean, it still has some character, but it's a lot less than the original Razors. Is this because they're not creative? Is this because they're copying just the most popular one? Or is it because they're all converging on maybe the most technically advanced design? Or maybe it's a combination of all this stuff or more. I mean, clearly each manufacturer is putting their own spin on this. They have to, but yeah, they're all chasing the Samsung version when it comes to foldables and Samsung knows it for the folds and the flips. So then there's other. Just the other foldable phone stuff. This is where it gets the most interesting because there is no Samsung here. So I'm considering anything not in the fold or the flip bucket here. And the most interesting thing about these is their future is way more questionable. So you have stuff like this which is the Huawei Mate XS, really interesting foldable but it folds from the outside. So I did a whole video on this concept. I'll link it below the like button. Basically, I think it looks sick but there's just no way this version can be as durable as a normal phone until material science advances significantly. And there's also been some other concepts. TCL has famously shown a working prototype of like, everything they can think of. Like they've made trifolds and rollables and all kinds of weird stuff. Never actually sold any of it but just more proof-of-concept stuff that you can do wild, creative things with a pocketable, flexible OLED display. At the end of the day, though, it's risky to put lots of research and development money into something that's not proven yet on the off chance that it might catch on. But that's why I think we find Samsung kind of at the forefront of it, steering the ship, because that's what they do. Remember when they just were kind of the first ones to make a huge phone? They called it a phablet and they had, like, the edge of the screen rolling off to the side? And then suddenly a few years later, every phone was huge. Like they've tried so many weird things that some of 'em are bound to stick. And so the Samsung thing is to just try more stuff and they make so much money with the rest of their business that they can sort of afford to subsidize the R&D of some wild ideas. So in the future someday, you know, maybe we'll see a foldable Pixel, maybe we'll even see a foldable iPhone, but for right now in 2022, Samsung steers the ship for the foldables market until probably the next big material-science update where these things really start to shrink and improve again. And I would bet money that Samsung is the one currently spending the most money on finding out what that advancement is. But let me know what you think about foldables in general.",
    "transcript_keywords": [
        "phone",
        "Samsung",
        "fold",
        "flip",
        "screen",
        "year",
        "normal phone",
        "folds",
        "Stuff",
        "version",
        "foldable",
        "foldable phone",
        "things",
        "slightly",
        "basically",
        "thing",
        "folding phone",
        "camera",
        "Samsung Z Flip",
        "bit"
    ],
    "transcript_entity_values": [
        "Pixel",
        "three",
        "one",
        "iPad",
        "10 seconds later",
        "Flip 3",
        "3,700 milliamp-hour",
        "22 1/2",
        "HUAWEI Mate X2",
        "up to eight inches",
        "around 2019",
        "third",
        "Z Fold 4",
        "3",
        "2022",
        "three millimeters",
        "2",
        "this year",
        "a few years later",
        "fourth",
        "the years",
        "18",
        "half",
        "first",
        "a few weeks",
        "90 degrees",
        "Samsung Z",
        "the same as last year",
        "4500",
        "iPhone",
        "the Royole FlexPai",
        "all day",
        "one-two",
        "2",
        "15 to 25%",
        "1,799",
        "Fold 4",
        "second",
        "21.6",
        "Xiaomi",
        "12 megapixels",
        "US",
        "number two",
        "1",
        "TCL",
        "3 1/2 years later",
        "modern-day",
        "Samsung Z Flip",
        "the Motorola Razor",
        "the end of the day",
        "last year",
        "7.6 inches",
        "Samsung",
        "every single year"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.15406855940818787,
        0.020749950781464577,
        0.06839116662740707,
        -0.007997973822057247,
        0.03961700201034546,
        -0.029604462906718254,
        -0.017021607607603073,
        0.13508106768131256,
        -0.04603692144155502,
        0.015321778133511543,
        0.0551326610147953,
        0.05099203810095787,
        0.014012794941663742,
        -0.0016824729973450303,
        0.05141149461269379,
        0.024709314107894897,
        -0.030770225450396538,
        -0.05688408762216568,
        -0.06303981691598892,
        0.03966781497001648,
        0.05483062565326691,
        -0.007303730584681034,
        0.023903824388980865,
        0.00155571848154068,
        -0.026302529498934746,
        0.05049698427319527,
        -0.044321637600660324,
        -0.07518251240253448,
        0.025308798998594284,
        -0.014745887368917465,
        0.05606206879019737,
        0.188193678855896,
        0.03146282956004143,
        -0.04307303950190544,
        0.02381155453622341,
        -0.07162782549858093,
        0.04190493002533913,
        -8.931894990382716e-05,
        -0.010800345800817013,
        -0.028306912630796432,
        -0.005788542330265045,
        -0.03853894770145416,
        0.027674496173858643,
        0.015278588980436325,
        -0.012764462269842625,
        -0.07091887295246124,
        0.02696409821510315,
        -0.029871689155697823,
        -0.056863464415073395,
        0.025031566619873047,
        0.016771767288446426,
        -0.020751003175973892,
        0.0014519826509058475,
        -0.03230111300945282,
        -0.04305800795555115,
        0.040646735578775406,
        -0.04405622556805611,
        0.04333119094371796,
        0.06147289276123047,
        0.04172845557332039,
        0.05942578241229057,
        -0.07109896838665009,
        -0.010510096326470375,
        -0.008834428153932095,
        0.0010858216555789113,
        0.00278207054361701,
        0.009828237816691399,
        -0.04167097806930542,
        0.009011326357722282,
        -0.00299167912453413,
        -0.01502775028347969,
        0.009962126612663269,
        0.050620194524526596,
        0.03327074274420738,
        0.05150296166539192,
        0.0287749245762825,
        0.09882471710443497,
        -0.020119624212384224,
        -0.08662974089384079,
        -0.00419090548530221,
        0.023639924824237823,
        -0.07849912345409393,
        -0.05951101705431938,
        -0.039969127625226974,
        -0.031110171228647232,
        -0.027235297486186028,
        -0.023298947140574455,
        0.017169056460261345,
        -0.08506178110837936,
        -0.024210430681705475,
        -0.010468145832419395,
        0.04930382966995239,
        -0.032627932727336884,
        -0.004073574207723141,
        -0.057122185826301575,
        0.028948698192834854,
        -0.06247387081384659,
        -0.004021349363029003,
        0.05604555830359459,
        0.024392517283558846,
        0.0009662687662057579,
        0.101288340985775,
        0.07456093281507492,
        -0.0007836386794224381,
        0.008327820338308811,
        -0.1288597136735916,
        -0.00797654502093792,
        -0.026170413941144943,
        -0.01802969165146351,
        0.0532088540494442,
        -0.025090763345360756,
        -0.023818129673600197,
        -0.008307660929858685,
        -0.011346709914505482,
        -0.06464368104934692,
        0.0019286544993519783,
        -0.02541714906692505,
        0.0672115683555603,
        0.08038691431283951,
        0.04343938082456589,
        -0.03357447683811188,
        0.04396890476346016,
        0.012676907703280449,
        -0.10921158641576767,
        -0.015640920028090477,
        0.036671675741672516,
        -0.0654405951499939,
        7.449531613811101e-33,
        -0.0038444376550614834,
        0.09667523950338364,
        -0.029524002224206924,
        0.07220951467752457,
        0.009467448107898235,
        -0.05644606798887253,
        -0.036567769944667816,
        -0.00957784429192543,
        -0.06108711659908295,
        0.038520410656929016,
        -0.002429554471746087,
        0.07958071678876877,
        -0.04370935261249542,
        -0.001735529862344265,
        0.061633024364709854,
        -0.07606633007526398,
        -0.07294286042451859,
        -0.06585163623094559,
        -0.04684252664446831,
        -0.04655361920595169,
        -0.024312680587172508,
        0.010068352334201336,
        0.10895508527755737,
        -0.00259426049888134,
        0.06121709942817688,
        -0.00844292901456356,
        0.056474220007658005,
        -0.037617992609739304,
        0.08298320323228836,
        0.022208426147699356,
        -0.09772149473428726,
        0.003837029216811061,
        -0.016684643924236298,
        -0.06837829947471619,
        -0.025841878727078438,
        0.058161113411188126,
        -0.05129069834947586,
        -0.1370607614517212,
        0.023653104901313782,
        0.007673137821257114,
        -0.04592498764395714,
        0.029116321355104446,
        -0.06569825857877731,
        0.004041467327624559,
        0.022165657952427864,
        0.015818174928426743,
        0.05102284997701645,
        0.04680342599749565,
        -0.0036752831656485796,
        -0.03325009346008301,
        -0.04076184332370758,
        0.005668032914400101,
        -0.038031138479709625,
        -0.027110980823636055,
        -0.02836022526025772,
        -0.06864470988512039,
        0.026333846151828766,
        -0.07411456108093262,
        0.020847782492637634,
        0.02846773900091648,
        0.036678511649370193,
        0.07854339480400085,
        -0.03235343471169472,
        0.008065968751907349,
        -0.022859785705804825,
        0.11576754599809647,
        0.06351141631603241,
        -0.039745163172483444,
        -0.0766119658946991,
        0.0411960706114769,
        -0.01745656691491604,
        -0.008034994825720787,
        -0.04539310932159424,
        -0.04113934561610222,
        0.06523171812295914,
        0.005238539073616266,
        0.05038341134786606,
        -0.03849557042121887,
        0.03606471046805382,
        -0.04178908094763756,
        -0.019287435337901115,
        0.04894963279366493,
        0.038195062428712845,
        0.05511350557208061,
        -0.028507668524980545,
        -0.03810558840632439,
        0.02484111301600933,
        -0.044649604707956314,
        0.0009126825025305152,
        -0.009088156744837761,
        -0.11036701500415802,
        -0.06627727299928665,
        0.05834762006998062,
        -0.028899485245347023,
        -0.019394556060433388,
        -7.19696930569724e-33,
        -0.012142343446612358,
        -0.01803831197321415,
        0.01538644079118967,
        0.0013608270091935992,
        0.06827030330896378,
        -0.03849096596240997,
        0.004843922797590494,
        0.02045762725174427,
        -0.07434888184070587,
        -0.05688982829451561,
        0.019802821800112724,
        0.017637643963098526,
        0.05467157065868378,
        -0.012563125230371952,
        -0.017144978046417236,
        -0.014728875830769539,
        0.07022717595100403,
        -0.08666108548641205,
        0.023942584171891212,
        0.031750164926052094,
        0.06146366894245148,
        0.036160413175821304,
        -0.04929860681295395,
        0.0670873373746872,
        -0.07469014823436737,
        0.019730564206838608,
        0.024925488978624344,
        -0.02157105691730976,
        0.06605416536331177,
        -0.01183212548494339,
        -0.03264699876308441,
        -0.07629091292619705,
        0.009364561177790165,
        0.007971513085067272,
        0.0030871026683598757,
        0.013058982789516449,
        -0.045407913625240326,
        -0.060099080204963684,
        0.04399780184030533,
        -0.0467555895447731,
        -0.012705122120678425,
        0.013915150426328182,
        -0.04371003434062004,
        -0.01885226182639599,
        0.03991846367716789,
        -0.1018802672624588,
        -0.08163315802812576,
        0.06379935145378113,
        -0.007162794470787048,
        -0.0648421198129654,
        0.036539796739816666,
        0.0480738990008831,
        -0.0193842351436615,
        -0.0846438929438591,
        -0.0735837072134018,
        0.028827287256717682,
        -0.022530535236001015,
        -0.04261799156665802,
        0.011540246196091175,
        0.03655185177922249,
        0.046177566051483154,
        0.03031063638627529,
        -0.02314736135303974,
        -0.06844108551740646,
        -0.06583160907030106,
        0.019573304802179337,
        0.10891737788915634,
        -0.06135205924510956,
        -0.0671403706073761,
        -0.019601473584771156,
        0.03517879918217659,
        -0.016214266419410706,
        -0.03279432654380798,
        -0.04714261367917061,
        -0.0003864268946927041,
        0.10459323972463608,
        -0.06432999670505524,
        -0.015214473009109497,
        0.006014800164848566,
        -0.06043560430407524,
        0.03296308219432831,
        0.058601394295692444,
        0.0345214381814003,
        0.014243322424590588,
        0.06532490253448486,
        0.034503716975450516,
        -0.03893972560763359,
        0.02109062857925892,
        0.025722695514559746,
        0.03764171898365021,
        -0.005552126094698906,
        -0.03219237178564072,
        -0.054357606917619705,
        0.18359950184822083,
        0.03156652674078941,
        -5.5331813797465657e-08,
        0.07487457990646362,
        0.06924298405647278,
        0.05484243109822273,
        0.03947581350803375,
        -0.018941011279821396,
        -0.006605111062526703,
        0.031491346657276154,
        -0.07296419888734818,
        0.07439368963241577,
        0.030190367251634598,
        -0.035223234444856644,
        -0.05719529092311859,
        -0.08122304826974869,
        0.09604871273040771,
        0.048470210283994675,
        0.11349939554929733,
        -0.045442819595336914,
        0.066628597676754,
        -0.039267897605895996,
        0.017345061525702477,
        0.02402491308748722,
        0.017879771068692207,
        0.07848591357469559,
        -0.04215846583247185,
        0.023820826783776283,
        -0.013970788568258286,
        -0.08696086704730988,
        -0.012731565162539482,
        0.03394998982548714,
        -0.00838463380932808,
        -0.040045496076345444,
        -0.03244961425662041,
        0.006614992395043373,
        0.011151510290801525,
        -0.006463657133281231,
        -0.060292404145002365,
        -0.011882992461323738,
        -0.03859151527285576,
        0.028080977499485016,
        0.0756351575255394,
        0.09139414131641388,
        -0.008468185551464558,
        -0.039209216833114624,
        0.0824226662516594,
        -0.028699491173028946,
        -0.10931085795164108,
        -0.008742250502109528,
        -0.04390139877796173,
        -0.013630516827106476,
        0.11342757940292358,
        -0.051333796232938766,
        -0.06618084013462067,
        -0.04502150043845177,
        0.01283414289355278,
        0.04903704300522804,
        0.10174331068992615,
        -0.01094081997871399,
        0.03718298673629761,
        -0.07423380762338638,
        0.0291383508592844,
        0.010442876257002354,
        -0.11334622651338577,
        -0.01562534272670746,
        0.11965169757604599
    ]
}