{
    "id": "xPEa0Wc9iUc",
    "title": "How to Make a Clean Air Enclosure (for HDD repair etc)",
    "channel": "DIY Perks",
    "channel_id": "UCUQo7nzH1sXVpzL92VesANw",
    "subscriber_count": 4640000,
    "upload_date": "2014-07-07T17:24:33Z",
    "video_url": "https://www.youtube.com/watch?v=xPEa0Wc9iUc",
    "category": "Science & Technology",
    "tags": [
        "hard drive",
        "hdd",
        "repair",
        "data recovery",
        "clean",
        "clean room",
        "air",
        "enclosure",
        "hepa",
        "filter",
        "air filtration",
        "how to",
        "recover",
        "data",
        "failed",
        "clicking",
        "spinning",
        "buzzing",
        "disk",
        "disc",
        "drive",
        "laptop",
        "format",
        "ntsc",
        "volume",
        "Hard Disk Drive (Invention)",
        "clean air enclosure"
    ],
    "views": 640893,
    "likes": 15641,
    "comments_count": 686,
    "description": "In this video, I will show you how to build a clean air enclosure for hard drive data recovery or other sensitive work. Also, I now have a Twitter account!   OFFICIAL LINKS:  Support me on Patreon:   Official Website:   Discord:   Forums:   Twitter:",
    "description_links": [
        "http://www.twitter.com/DIYPerks",
        "https://www.patreon.com/DIYPerks/",
        "https://www.diyperks.com/",
        "https://diyperks.com/discord-server/",
        "https://diyperks.com/community/",
        "https://twitter.com/DIYPerks"
    ],
    "transcript": "Normal air usually has a lot of particles floating around in it and this can sometimes pose a problem for delicate work like hard drive data recovery. As I've shown in previous videos, hard drives can be repaired in normal environments with successful results. However, having a clean environment in which to do the work means that the chances of damaging the drive further are greatly reduced, and it gives you great peace of mind. So in this video I'm going to show you how to build a clean air enclosure, which will give you an ideal environment in which to repair hard drives or do other sensitive work. It costs around 10 to make, as it is made out of cheap materials such as craft cardboard, and it only takes three hours or so to build. A bonus of using cardboard is that it can be folded up when not in use, which is great if you don't envision using it regularly. Feel free to use more robust materials if you think you'll be using it often, however. So, here's how it works. At the side of the enclosure there is a hole for a vacuum cleaner nozzle. Once the vacuum cleaner is turned on, all air is sucked out of the enclosure, which is completely sealed once your arms are in the holes. The air has only one entrance point, which is through a hepa filter. All dust and particles trying to enter with the air are caught by this filter, so the air inside the enclosure becomes super clean. You can then turn off the vacuum cleaner, put the cap over the hole, and begin working! The first thing you'll need for this build is a HEPA filter of some kind. HEPA filters prevent small particles in the air from passing through them, making the air clean. They come in many shapes and sizes, and are usually pretty cheap. For this build, I recommend using a decent quality vacuum cleaner bag, and I'll explain why later. You'll also need some sheets of craft cardboard, an empty yogurt container, or yoghurt if you're in America, and a sheet of clear plastic. To keep costs low try using some from product packaging like I did. Lastly you'll need four rubber gloves, a roll of duck tape, and some glue. So the first thing to do is start cutting the cardboard to make the enclosure. The measurements I mention are for reference only. Feel free to change them depending on the materials you have available. Start with the base first. Mine measured 27cm by 48cm, which should be big enough for most uses. Cut another piece of cardboard for the front, matching the width of the base. Make sure it's at least 15cm high as this is just enough room for the hand holes. Now get your yogurt carton and cut a hole out of its lid. Whilst you're at it, cut off the top of the carton as well, as these will form the frames for the hand holes. Place these new rims on the base and try and position them to where they'll give you the most arm freedom when you're working. When you're happy with the positioning, mark them with a pencil and cut out the holes for them. Make sure you make the hole a bit smaller then the rims as they will need a surface to glue to later. Now get a strip of duck tape and stick the front to the base. Do this on both sides for strength. Once that's done it's time to cut some cardboard for the back. So again, cut its width to match that of the base, and its height to be about 21cm. Just like before, stick this cardboard to the back of the base using duck tape on both sides. Now it's time to work on the view port. So get your clear plastic, which in my case measured 18cm by 49cm, and stick it to a piece of cardboard which forms the top of the enclosure and should be roughly 13cm deep. Use plenty of glue to make sure that the seal is good. After it's dried you can then stick the other edge to the inside of the front panel. So far it should be looking something like this. Now fold over about 2cm of the top piece of cardboard so that it hooks over the top edge of the back panel. This is going to be edge which isn't permanently sealed, so add some duck tape to these two edges to create a surface to which you can repeatedly stick duck tape to without damaging the cardboard when you want to take it apart. For now, stick these edges together. Now place it on one of its sides and use a pencil to trace around its edges onto another piece of cardboard. Cut flaps about 2cm wide towards your traced edges, and use a knife to cut halfway through the cardboard on the reverse side and then fold them to 90 degrees. Cover all the edges with duck tape to keep it all together, and see how it fits. If it's all good, do the same for the other side. Now it's time to make the hole for the vacuum cleaner nozzle. To do this just mark around the nozzle with a pencil on the side where you want it to be, and cut it out with a knife. Because it's not necessary to have the vacuum on all the time when you're working, it's helpful to be able to seal this hole so that you can turn it off. To do this, cut the bottom off a cardboard cylinder and cut this edge into many little tabs, and bend them inwards. Now glue these tabs to the side panel over the vacuum hole. To make sure it's properly sealed use some glue or calk on the outside edge. Now that's done it's time to work on the filter side. So get the other side panel and cut a hole in it for the filter. Now that's done it's time to work on the hepa filter. Now originally I foolishly thought that a single pane of filter would allow enough air through to satisfy the vacuum, but unfortunately it caused the enclosure to implode due to too little internal pressure. The simple solution was, as you know, to use the entire bag as it has a much larger surface area for the air to pass through. This is also why I recommended the vacuum cleaner bag earlier - standard hepa filters will also cause this issue, unless of course you use more rigid materials to build the enclosure out of. So the first thing to do is to take off the cardboard tab and cut the hole to be a bit bigger. Now cut a matching hole in the side panel and stick the bag to it. Make sure the seal is good so that the only entrance for the air is through the bag itself. Use some glue between the bag and the cardboard if you like to be extra sure. The bag needs some support to prevent it from also imploding under negative pressure, so make some kind of frame to insert to support it. It doesn't need to be anything special. For the next section of the video you'll notice that the original attempt at the filter remains unchanged. You'll have to excuse me on that one and imagine the bag in place until it magically reappears later. So now its time to stick some duck tape along the sides of the enclosure. Again, this is to prevent the cardboard from being damaged when you want to disassemble it. So now the enclosure is really taking shape, and the next thing to do is add the arm holes. So the first thing to do is wash off any powder from the rubber gloves. This makes them hard to take off, but it does mean that there won't be any chance of powder getting inside the enclosure. Once the gloves are dry, take two of them and cut off the fingers. Now stretch these cut edges over those yoghurt carton rims you made earlier. You might want to smooth off any hard edges on the rims first, so that the risk of the rubber being punctured is minimised. Now you can glue them onto the front of the enclosure. Again, use plenty of glue to make a nice seal, and finish it off with caulk on the outside. Now it's time to add the finishing touches. I found out that the back panel was pulling inwards when the vacuum was on, making a gap. So to fix this I just added a little lip of cardboard for the top to slot into. Because you'll want plenty of light to see what you're doing, you might want to add some leds to the inside. I just used some sections from a 12v LED strip, and had the power wire go through a small hole, which I later sealed. The final thing do to is make a small access hole so that you don't have to remove one of the sides to put something into the enclosure. To do this, simply cut out a rectangle, leaving the bottom edge intact. Add duct tape around its edges to, again, have a reliable surface to which you can add and remove tape from without damaging the cardboard. So now your enclosure is complete! As you can see, when folded up it's pretty compact, which is handy if you don't have a lot of space. To set it up, first tape the top back edge together, making sure you get a good air tight seal. Do the same for the side panels, and also the access hole once you've slotted in the items you want to work with. So now it's time to test it out. Put your vacuum cleaner's nossel into the hole, and turn it on. Now put your arms through the holes, and check for any drafts along the sealed edges. The only place air wants to be coming from is the filter, so if you find any unexpected drafts, seal them up with duck tape. Before you use it, give the inside a wipe down with a damp cloth to get rid of any dust. It's also very important to thoroughly wipe down everything that you want to put into the enclosure, otherwise you may introduce unwanted particles. So, just how well does this clean air enclosure work? Well, it mostly depends on the quality of your hepa filter, which is why it's important to use something decent. Note that decent doesn't necessarily mean expensive. To stress test mine, I opened up a hard drive inside the enclosure, and had someone beat on an unusually dusty cushion next to the filter. After a few minutes, I took a photo of the platters to check for any dust. During the whole test the vacuum cleaner was on to test the system to its limits, however it is generally a good idea to have the vacuum cleaner on for a minute, and then turn it off and put the cap over its hole, after which you can begin working on the drive. This method just means that it's less likely for anything to be sucked into the enclosure whilst you're working.",
    "transcript_keywords": [
        "cardboard",
        "enclosure",
        "Cut",
        "hole",
        "vacuum cleaner",
        "air",
        "vacuum",
        "make",
        "duck tape",
        "filter",
        "tape",
        "edges",
        "side",
        "drive data recovery",
        "cleaner",
        "time",
        "holes",
        "edge",
        "hepa filter",
        "clean air enclosure"
    ],
    "transcript_entity_values": [
        "first",
        "a minute",
        "America",
        "18cm",
        "12v",
        "HEPA",
        "about 21cm",
        "four",
        "two",
        "49cm",
        "only one",
        "a few minutes",
        "about 2cm",
        "one",
        "at least 15cm",
        "roughly 13cm",
        "around 10",
        "three hours",
        "hepa",
        "48cm",
        "90 degrees",
        "27cm"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "TIME",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY"
    ],
    "vector": [
        -0.05969822779297829,
        0.0029965077992528677,
        0.08883891999721527,
        0.03542419895529747,
        0.035941705107688904,
        -0.13802377879619598,
        -0.012668604031205177,
        -0.007765633519738913,
        -0.07696150988340378,
        0.02340068854391575,
        -0.05079381912946701,
        0.10261475294828415,
        0.04291630908846855,
        0.011649657040834427,
        -0.06658764183521271,
        0.004139848053455353,
        0.029415298253297806,
        -0.03913366422057152,
        -0.05653772130608559,
        0.039332758635282516,
        -0.030600519850850105,
        0.03969283774495125,
        0.02578684687614441,
        -0.04186477139592171,
        -0.02186213992536068,
        -0.032973773777484894,
        0.03327801823616028,
        -0.04606512561440468,
        0.005202020052820444,
        -0.02812069281935692,
        0.03768647089600563,
        -0.04005380719900131,
        -0.014813614077866077,
        0.04780705273151398,
        0.09175358712673187,
        0.02726886235177517,
        -0.007286166772246361,
        0.01869836449623108,
        -0.02536827139556408,
        -0.09944745898246765,
        -0.01804000698029995,
        -0.01576627418398857,
        -0.05884291231632233,
        0.023628665134310722,
        -0.007946963422000408,
        0.008010958321392536,
        0.06173137575387955,
        -0.05391961708664894,
        0.07365702837705612,
        -0.007225553505122662,
        -0.0375453382730484,
        0.022379187867045403,
        0.0071444702334702015,
        -0.024318845942616463,
        -0.044765617698431015,
        0.011076665483415127,
        0.03071233071386814,
        -0.054523661732673645,
        -0.0422392413020134,
        -0.04726827144622803,
        0.07506892830133438,
        -0.03659992665052414,
        0.060238342732191086,
        -0.0699591189622879,
        0.05563448742032051,
        0.0026508746668696404,
        0.04296135902404785,
        0.03367043286561966,
        0.00042111767106689513,
        0.08744171261787415,
        -0.024594388902187347,
        -0.013677584938704967,
        -0.059520721435546875,
        0.025552164763212204,
        0.07886108756065369,
        0.01747412048280239,
        -0.023917850106954575,
        -0.12285149097442627,
        0.02535952441394329,
        0.07880977541208267,
        0.06620126962661743,
        0.009742810390889645,
        -0.09288069605827332,
        -0.007126426789909601,
        -0.0629969984292984,
        0.024066897109150887,
        -0.0281711183488369,
        0.020015718415379524,
        -0.0423942431807518,
        -0.055572327226400375,
        0.05550970882177353,
        0.021393707022070885,
        0.06650370359420776,
        0.010914185084402561,
        0.01487824972718954,
        -0.04649600014090538,
        0.04021868482232094,
        0.032934024930000305,
        0.022679002955555916,
        -0.029954174533486366,
        -0.03799150884151459,
        0.029975073412060738,
        0.02449476160109043,
        -0.11299937963485718,
        -0.0950106531381607,
        -0.09229587018489838,
        0.021217944100499153,
        -0.006036592647433281,
        -0.05343485623598099,
        -0.022901006042957306,
        -0.06738301366567612,
        -0.011802884750068188,
        -0.09578371047973633,
        0.023376410827040672,
        0.008742290548980236,
        0.013597182929515839,
        0.03126952052116394,
        -0.043152838945388794,
        -0.07781221717596054,
        -0.005224229767918587,
        0.05244617909193039,
        -0.019712425768375397,
        0.07060525566339493,
        -0.015487328171730042,
        0.08717401325702667,
        -0.056591495871543884,
        0.036841392517089844,
        3.990183615113592e-33,
        0.028991958126425743,
        0.027570858597755432,
        -0.0011794774327427149,
        0.017656046897172928,
        -0.015921462327241898,
        -0.039120785892009735,
        0.0670287236571312,
        0.016187217086553574,
        0.09216363728046417,
        0.14265799522399902,
        0.02668076567351818,
        0.006222624331712723,
        -0.02225850149989128,
        -0.038294121623039246,
        0.01840483583509922,
        -0.06904705613851547,
        -0.03986692056059837,
        -0.07568228989839554,
        -0.14574368298053741,
        -0.043790966272354126,
        -0.038129910826683044,
        -0.018274955451488495,
        0.0242921132594347,
        0.04955786466598511,
        0.08912216126918793,
        -0.061293039470911026,
        0.07322148233652115,
        -0.07775000482797623,
        0.049095090478658676,
        0.01623506098985672,
        -0.01723981834948063,
        -0.010506946593523026,
        -0.051401976495981216,
        0.08574287593364716,
        -0.05836692452430725,
        0.05228284373879433,
        -0.09967343509197235,
        -0.018499594181776047,
        -0.03159022703766823,
        0.03873596340417862,
        -0.06610362976789474,
        0.03844756260514259,
        0.055128734558820724,
        0.008049546740949154,
        0.05760841444134712,
        0.0009785100119188428,
        -0.013563411310315132,
        0.035782139748334885,
        -0.027668442577123642,
        0.002751789754256606,
        -0.007856878452003002,
        0.051122669130563736,
        0.04335136339068413,
        -0.058999065309762955,
        -0.026648540049791336,
        0.038041435182094574,
        0.11123644560575485,
        -0.10771416127681732,
        0.02923227846622467,
        -0.0022058936301618814,
        0.00995793379843235,
        -0.01756690815091133,
        0.07242688536643982,
        0.02312305010855198,
        -0.10567083954811096,
        0.10739300400018692,
        0.06197512149810791,
        0.04380611702799797,
        0.023221880197525024,
        -0.07165928184986115,
        0.01811138354241848,
        -0.020477039739489555,
        -0.07608021795749664,
        -0.07688165456056595,
        -0.04274683818221092,
        0.003640519455075264,
        0.030042001977562904,
        -0.046484582126140594,
        -0.06389347463846207,
        -0.10520655661821365,
        -0.01709769293665886,
        -0.049300357699394226,
        -0.011574416421353817,
        -0.0002040435210801661,
        -0.02853790670633316,
        -0.04476355388760567,
        -0.005913949105888605,
        0.019178731366991997,
        0.003796194912865758,
        -0.049866143614053726,
        -0.041212670505046844,
        -0.02626904286444187,
        0.037573326379060745,
        -0.02216820791363716,
        -0.0015616309829056263,
        -4.895380754145972e-33,
        0.04765470698475838,
        -0.06813400238752365,
        0.05183904245495796,
        0.026456691324710846,
        -0.03230096027255058,
        0.01617634855210781,
        0.011207394301891327,
        0.07946509122848511,
        0.05256963521242142,
        0.021835407242178917,
        -0.16594992578029633,
        0.04337339848279953,
        0.06752893328666687,
        -0.03737255185842514,
        0.026287391781806946,
        0.031049029901623726,
        -0.05243063345551491,
        -0.06290129572153091,
        -0.04084134101867676,
        0.06230028718709946,
        0.022038571536540985,
        0.03677254915237427,
        0.05682720988988876,
        0.01792558655142784,
        -0.009870198555290699,
        0.02676832303404808,
        -0.051232051104307175,
        -0.03191523626446724,
        0.09473926573991776,
        0.08618653565645218,
        -0.059041477739810944,
        -0.021696049720048904,
        0.07587813585996628,
        0.02865164913237095,
        0.016295474022626877,
        -0.029941577464342117,
        0.10464837402105331,
        -0.026808656752109528,
        -0.04024401679635048,
        -0.12102612853050232,
        0.020998338237404823,
        0.07292598485946655,
        -0.026422331109642982,
        -0.019418170675635338,
        -0.03675378859043121,
        0.03278500214219093,
        -0.060080237686634064,
        -0.07064437866210938,
        0.0032957284711301327,
        -0.013296887278556824,
        0.08429184556007385,
        -0.021216392517089844,
        0.012314865365624428,
        0.024902330711483955,
        0.07050777971744537,
        0.01849992200732231,
        0.047889791429042816,
        0.004807201214134693,
        -0.03761410340666771,
        0.0060946340672671795,
        -0.0261043943464756,
        -0.023695683106780052,
        0.03515977784991264,
        0.05683040991425514,
        -0.08127331733703613,
        -0.033509593456983566,
        0.14730733633041382,
        0.007266870699822903,
        -0.08686622232198715,
        -0.00025089067639783025,
        -0.03881271183490753,
        0.0553484670817852,
        0.027642911300063133,
        0.00577205466106534,
        0.018826160579919815,
        0.01952982507646084,
        0.030183492228388786,
        -0.013743394054472446,
        0.03376395255327225,
        0.05860142409801483,
        -0.04927081614732742,
        -0.025684157386422157,
        -0.06881266832351685,
        0.05226777493953705,
        0.05608581006526947,
        -0.04168755188584328,
        -0.015617741271853447,
        -0.022978760302066803,
        -0.012113381177186966,
        -0.0009847035398706794,
        -0.02044920064508915,
        0.006896015722304583,
        0.016935408115386963,
        0.014567728154361248,
        -0.0004660022386815399,
        -5.07353909995345e-08,
        -0.03312480077147484,
        -0.012620381079614162,
        0.044297438114881516,
        0.012323388829827309,
        -0.07913517951965332,
        -0.06647243350744247,
        -0.0028471057303249836,
        0.12804795801639557,
        0.03898860886693001,
        -0.04954727739095688,
        0.04884329065680504,
        -0.05145879089832306,
        -0.03851253539323807,
        0.0020558862015604973,
        -0.049103084951639175,
        -0.014521091245114803,
        -0.09213193506002426,
        0.10437296330928802,
        -0.024909740313887596,
        -0.018751204013824463,
        0.03716438263654709,
        -0.008848858065903187,
        0.09655770659446716,
        0.04408527910709381,
        0.028775561600923538,
        0.08819154649972916,
        -0.031262900680303574,
        -0.07823380082845688,
        0.020605554804205894,
        -0.051987409591674805,
        -0.07169591635465622,
        -0.014860475435853004,
        0.0501788929104805,
        0.00806498248130083,
        -0.05505959689617157,
        -0.036891669034957886,
        0.05235077813267708,
        -0.0040355343371629715,
        -0.035399556159973145,
        0.07963557541370392,
        0.004081679042428732,
        -0.005699123255908489,
        -0.05796414986252785,
        -0.02095686085522175,
        0.007220919243991375,
        -0.0390346497297287,
        -0.07775212824344635,
        0.008043985813856125,
        -0.029130596667528152,
        0.08980004489421844,
        0.005175108555704355,
        -0.006405951455235481,
        0.002050829352810979,
        -0.001116983825340867,
        0.004637882579118013,
        0.05733867734670639,
        -0.0200041476637125,
        0.05764806270599365,
        0.07003899663686752,
        0.0695614218711853,
        0.03340918943285942,
        0.05135340243577957,
        -0.09331556409597397,
        0.0507974736392498
    ]
}