{
    "id": "xpMPFD6S-I0",
    "title": "😍 My first WWDC!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-06-05T17:04:55Z",
    "video_url": "https://www.youtube.com/watch?v=xpMPFD6S-I0",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "wwdc",
        "vlog",
        "memoji"
    ],
    "views": 380012,
    "likes": 13562,
    "comments_count": 985,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- How good that looks. Looks just like the invite. We are at WWDC. I'm about to head in. I just got my credentials, which means it's official. This is my first WWDC. I've been to WWDC's before, but only outside of like the Moscone Center. I've never actually been inside of an event. My first one. Today's the day. I'm freakin' out. I'm freakin' out. I'm so excited. C'mon Jen, let's go. Come on. Oh man I'm so hyped. So hyped. It kinda looks like I'm talking to myself 'cause Jen is kinda far away, but like I'm not. This is gonna happen quite a lot. Hi, thank you. This is one of my favorite colors. Hi, good how are you? - [Man] How's everything going? Great, I'll see you inside. - Okay. It looks pretty cool. Everybody has really big cameras. Okay, well it's 8:30. Everybody has Apple bags. Are people shopping already? I'm not sure where to go. I'm gonna have to ask somebody. Okay so we are now in line, but we've got like almost two hours until the event. I'm gonna go get us some orange juice, so I'll be right back. I'll report back. So somebody actually got these for us in line, so we have to thank them. He said hey nice YouTube channel. Do you want me to get that orange juice for you? Cheers. We're waiting very patiently for the doors to open, and by patiently, I mean I'm shakin' in my boots, and I'm not even wearing boots. These are actually kids shoes. I saw the door. The door just opened, it's closed now. Door's open, look, look, look, look! Door's open! Doors are opening. It's opening, we can see inside. This is oh wow, okay it's closed again. - I saw secrets. - Should I hop in with, okay, let's go hop in with Marques. Can I hop in with you 'cause we got in the wrong line. And I almost was going in to risers. We were in the wrong line for like all the broadcast cameras for like the news. I guess that's why they were questioning why our camera was so little. So, we made a mistake, but I just cut in line with Marques so, hi. - Hi. - I'm so sorry, I'm so sorry, I'm so sorry. We're getting in! Hi! Hello! (gasp) It's beautiful! Yes! That's a lot of apps. We made it here. We're inside. I'm so excited, and there's a huge, massive screen up at the front and it's all covered in apps. I wish that that's what my house looked like, and it could. My house kinda does look like that. Oh my gosh, it's starting, it's starting! Oh I'm shaking, I'm shaking in my shoes. (applause) - [Narrator] Northern California's Bay area. From all corners of the world. This is the developus tritorapsus, or as it is more commonly known the developer. (applause) - Good morning. Good morning. Good morning, and welcome to WWDC 2018. It is great to be back in San Jose with everyone. We have developers here from all over the world this morning. (applause) Our next big release of iOS is, you guessed it, iOS 12. Tapping and dragging our line like that, and check that out, it's a measurement. (crowd applause) Now, what's really cool is I can extend these measurements so I could just tap, you can take-- - You guys, I'm so excited about this because I can never find a measuring tape. This is so cool. They have a AR Lego app, so you can play with up to four friends. So using ARKit Two-- - [Narrator] Which now with ARKit Two, you get to see inside our physical creations. - [Justine] Just like he said. - [Narrator] Check out all the details that were hidden before. Little ballerina, little... - [Narrator] iOS support for grouped notification. - [Justine] Yes, finally. (applause) - [Narrator] First you choose who you'd like to enable walkie-talkie with. And this is just some people that you often communicate with so you can easily add them. Now the first time that you do this, your friend will receive a one-time request to allow the walkie-talkie connection with you. If they accept, then you can speak to each other with walkie-talkie whenever you like. - Briefly address this question. No! (audience laughter) Of course not. (applause) - Days like this only come from years of effort, hard work, and great sacrifice. And so I thank them and their families. Let's have an incredible week together. Thank you! - So we're just heading out of the actual keynote, it was so awesome. There's so many things I have to talk to you guys about, but I don't think that's gonna happen in this particular video 'cause this is just a blog. There'll be tons of videos coming on more of the things, but um oh I'm so sorry! But now it's time for some lunch I think. What do you think? Lunch? We're trying to get Jordan to get an Apple watch so that I can walkie-talkie him. I'll be like Jordan hello. Jordan hello. - It'd be really cool if it actually worked off short wave radio, 'cause in a group like in a car convoy or something, you could talk to other people in other cars, super sweet, but if you go to like Angeles Crest, there's no cell data there. - Okay. - It sounds cool. - Jordan, you're so particular. We're just leaving the keynote. I had so much fun. I'd have to say one of my highlights is probably, which is so crazy and random, they have walkie-talkie now on the watch OS five. I'm super excited about it. Also, dark mode, which is something that I've been looking forward to for a really long time. So that'll be coming in the new Mac OS, which is named Mojave, and guess what that means? We've been going to all of the places of the Mac OS names, like we went to-- - [Jen] Yosemite? - We did, we went to Yosemite, we went to El Capitan like two years ago, and now Jenna, we're going to Mojave baby. I guess I didn't have to do that. Okay, we're gonna go get some lunch. I'll talk to you guys more about what we saw. I had such a great time, I can't wait for all of the new updates. It was very software heavy, I did think that there was going to be one more thing, I had something in my mind that I thought was gonna be, but there wasn't, but it's okay. There'll be more events. There will be more things. So how many videos have you seen of all of us saying our one favorite thing that we're most excited about? I'm sure you've seen all of us saying it, but hey why not let's just do it again. So, hey Jonathan. - Hi, what's up? - [Justine] What was your favorite thing? - Favorite thing, walkie-talkies on Apple watch. - [Justine] Do you have an Apple watch? - Not right now, but I'm gonna get one just for that. - [Justine] You don't have one yet? - [Jonathan] Not right now. - What?! - So I was waiting for the update, and it hasn't happened yet. I was hoping it was gonna come out today. - Here's what I'm gonna say, 'cause nobody else is gonna say this. This is super underrated. It's just like faster performance. - Why didn't you say that in my video? - [Justine] Oh no! - I gotta switch it up. - [Jonathan] He held out for your video. - But yeah, no one's talking about it, but it's true like things are opening faster, the camera and stuff. It's not exciting, but it's definitely useful. - I'd have to go with desktop stacks. That is clutch. I keep a super dirty desktop, I usually throw everything in one folder, but desktop stacks is gonna definitely change that up. - Wait a minute, I forgot there's 32 person FaceTime. We need to get 32 of us, it's gonna be the best collab ever all on a FaceTime call. We're gonna start a Google Doc, and we're gonna make this happen. I'm not gonna promise, 'cause I don't know if I'll be able to deliver, but we'll see. So right now we're playing Swift Shot. I'm playing against Jordan, and this game is all built in AR, using ARKit 2. What's cool about ARKit 2 is you can play with mulitple people. You can play across timespans, so you can come back to a game if you decide to leave it, and also there is spectators. So, right now as you can see, over here we have someone who is spectating our game, so he can see what we see because if you really look, there's nothing there. Alright, you ready? - Here we go. Oh, you're already, now I gotta step down. - Uh oh. (futuristic music) - No! - Yes! I win! Come see this victory, there it is. Victory! - That's really disappointing. I only got one of yours. - So sorry. Yeah, I know. - [Jen] So who won? - Me! - Well, it was technically one to one overall. - So, now it'd be two to one, - No no - Cause I won the last one. - The last game didn't really finish actually. - It did. - It didn't finish. - I won, I won. - So, you didn't quite. - No, I did. - It's a tie now. - No, no! I won. We just got done playing this super fun game, and look who I ran into, Rich! - What's up? - Hello! What did you think? - I thought it was awesome. Just to see that world that you can't really see in real life is very strange to be playing a game that's not existing in front of you. But I really like it. It took me a little bit to get the hang of it, though. - Look, just got a camera person. - Look, you can go hands free. - I know, it's magical. Well it's good to see you. I feel like I run into you randomly at all these random events. - Usually Apple events. - Usually, yes. - Usually once a year, twice a year, even though we live half an hour from each other. - It's true, yeah, in L.A., but we see each other elsewhere. - That's how it is. We take two hours to get to anywhere in L.A., even if you're a mile away. - What was your favorite thing from the keynote? - To me, my personal favorite was actually that we can now have Google Maps and Waze on CarPlay. - Me too. - Nobody's really caring about it, except me because I love Apple Maps. I think it looks so beautiful and flowy, but sometimes I just want my Google Maps. - It's true, yeah, I love CarPlay. I love it so much, so I was excited about that. - It's the greatest thing ever. - I was most excited about being able to track yoga workouts on the Apple watch. - And now it's all automatic, and you don't have to start anything. The phone is just doing everything. You don't have to think anymore, right? - Yes, it's so great. - I'm looking forward to that, too. - There's so many fun things. Well it's good to see you. - Not the yoga, just the automatic tracking. - Well maybe you should think about it. - I don't think I could stretch like that. - I guess that brings my WWDC vlog to a close, I'll be doing a bigger recap and talking about some of the other things that I've seen here and of course the announcements, but for now that's the end of the vlog, and I will see you guys soon. Hope you guys enjoy it. I had the absolute best time. I'll see you later. Bye! (futuristic music)",
    "transcript_keywords": [
        "WWDC",
        "Apple",
        "Apple watch",
        "favorite thing",
        "things",
        "thing",
        "good",
        "excited",
        "line",
        "Jordan",
        "cool",
        "favorite",
        "game",
        "walkietalkie",
        "inside",
        "Good morning",
        "guys",
        "Great",
        "watch",
        "time"
    ],
    "transcript_entity_values": [
        "Northern California's",
        "a minute",
        "WWDC",
        "iOS 12",
        "WWDC",
        "Jonathan",
        "one",
        "a Google Doc",
        "two years ago",
        "2",
        "Bay area",
        "Apple",
        "Justine",
        "Lunch",
        "Two",
        "Jordan",
        "WWDC",
        "32",
        "WWDC 2018",
        "Today",
        "CarPlay",
        "the day",
        "FaceTime",
        "Lego",
        "half an hour",
        "Mojave",
        "a mile",
        "Marques",
        "Yosemite",
        "iOS",
        "Jen",
        "Angeles Crest",
        "five",
        "almost two hours",
        "ARKit",
        "Google Maps and Waze",
        "Swift Shot",
        "El Capitan",
        "two hours",
        "L.A.",
        "Apple Maps",
        "today",
        "Jordan",
        "Jenna",
        "two",
        "YouTube",
        "the Moscone Center",
        "an incredible week",
        "FaceTime",
        "8:30",
        "first",
        "San Jose",
        "Mac",
        "up to four",
        "Door"
    ],
    "transcript_entity_types": [
        "LOC",
        "TIME",
        "EVENT",
        "PRODUCT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "LOC",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "LOC",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "TIME",
        "GPE",
        "FAC",
        "DATE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "FAC",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.04264870285987854,
        -0.10090257227420807,
        -0.07856830954551697,
        -0.11084875464439392,
        0.04572634398937225,
        0.024059072136878967,
        0.04624682664871216,
        0.06069917231798172,
        -0.0016582286916673183,
        0.07648028433322906,
        0.04032157361507416,
        0.0007664143922738731,
        -0.010259853675961494,
        0.014420488849282265,
        -0.022589044645428658,
        0.07338249683380127,
        0.006060121580958366,
        -0.014082629233598709,
        -0.01191685814410448,
        0.037938348948955536,
        -0.043494001030921936,
        -0.03895704448223114,
        0.05467601493000984,
        -0.01487022452056408,
        -0.04597822576761246,
        0.07778382301330566,
        0.018099183216691017,
        0.07222244143486023,
        -0.08160757273435593,
        -0.08448638767004013,
        -0.02827160619199276,
        0.01724862866103649,
        0.113749198615551,
        -0.002600923413410783,
        0.011062138713896275,
        -0.033680323511362076,
        0.06642252206802368,
        -0.021564703434705734,
        -0.01564323529601097,
        -0.022144727408885956,
        -0.006081830710172653,
        -0.03525460511445999,
        0.0283769853413105,
        -0.009301258251070976,
        -0.09931065142154694,
        -0.0797015056014061,
        -0.005556093063205481,
        -0.04192906618118286,
        0.049073725938797,
        0.0662747472524643,
        -0.06531547009944916,
        -0.026516851037740707,
        0.0030291005969047546,
        0.03150226175785065,
        -0.08214522898197174,
        0.0021822808776050806,
        -0.09480709582567215,
        0.03059862181544304,
        0.05453655496239662,
        -0.08260802179574966,
        0.015089198015630245,
        -0.04372376576066017,
        0.002599036321043968,
        0.05304795131087303,
        -0.047732044011354446,
        -0.07337892055511475,
        0.0250648632645607,
        0.01866433024406433,
        -0.0037559380289167166,
        -0.0028792761731892824,
        -0.13396212458610535,
        0.06362459808588028,
        -0.03349870815873146,
        0.029028739780187607,
        -0.03346961364150047,
        0.03955593332648277,
        0.05098783224821091,
        -0.05576957389712334,
        -0.007504008244723082,
        0.03900343179702759,
        0.019674215465784073,
        -0.013442105613648891,
        -0.07166201621294022,
        -0.02024742215871811,
        0.013124740682542324,
        0.04345136880874634,
        -0.005849240347743034,
        0.020665546879172325,
        -0.01923546753823757,
        -0.08346278965473175,
        -0.08420690894126892,
        -0.04502412676811218,
        -0.01928037591278553,
        -0.02250741608440876,
        -0.018492737784981728,
        -0.04988855868577957,
        0.0007139001972973347,
        -0.051042355597019196,
        -0.05525098368525505,
        0.07941699773073196,
        0.030130602419376373,
        -0.07362707704305649,
        0.022452328354120255,
        -0.04630158096551895,
        -0.0324210561811924,
        -0.11365804821252823,
        -0.04954696446657181,
        0.07177121937274933,
        -0.003618293209001422,
        -0.008994342759251595,
        -0.055528249591588974,
        0.05156238004565239,
        -0.0798988789319992,
        -0.05610949546098709,
        0.038243368268013,
        0.09508737176656723,
        -0.027012605220079422,
        0.08333580940961838,
        -0.006032379809767008,
        0.017681654542684555,
        -0.003764106659218669,
        -0.09573850780725479,
        -0.002110015135258436,
        0.033078163862228394,
        -0.005978392902761698,
        -0.026901347562670708,
        -0.028190860524773598,
        1.285918379960213e-32,
        0.011141492985188961,
        0.04725126177072525,
        0.012913143262267113,
        0.09573131799697876,
        -0.012979520484805107,
        -0.011906438507139683,
        -0.0018431067001074553,
        0.08375472575426102,
        -0.03781464323401451,
        0.023481212556362152,
        0.027475198730826378,
        0.042751092463731766,
        -0.04968546703457832,
        0.0456678569316864,
        0.02604963444173336,
        -0.046555403620004654,
        -0.035768769681453705,
        -0.05375945568084717,
        -0.07903263717889786,
        0.008861449547111988,
        0.02516140230000019,
        -0.022304678335785866,
        0.032077353447675705,
        0.07163403183221817,
        0.08920684456825256,
        0.07482486218214035,
        0.06507569551467896,
        0.02635376714169979,
        0.0987074002623558,
        0.012002313509583473,
        -0.03688659518957138,
        -0.06403927505016327,
        -0.018578603863716125,
        -0.10510821640491486,
        0.00796692818403244,
        0.03359208256006241,
        -0.08007632195949554,
        -0.006533732637763023,
        -0.012923400849103928,
        -0.054780278354883194,
        -0.015283656306564808,
        -0.013776109553873539,
        -0.07186496257781982,
        -0.06215912103652954,
        0.07555987685918808,
        0.04186002165079117,
        0.06302855908870697,
        0.08233003318309784,
        -0.03757278993725777,
        0.025826597586274147,
        -0.03726371005177498,
        -0.0016502358485013247,
        -0.046416025608778,
        0.025592200458049774,
        -0.009514184668660164,
        -0.09713887423276901,
        -0.017996491864323616,
        0.05103233456611633,
        0.03755433112382889,
        0.06772790104150772,
        -0.004082557745277882,
        0.000995685695670545,
        -0.025125857442617416,
        -0.01739290915429592,
        -0.06456383317708969,
        0.061143308877944946,
        0.06882990896701813,
        -0.02882831171154976,
        0.03715677559375763,
        0.05833817645907402,
        -0.001507829292677343,
        -0.030620111152529716,
        0.03405700623989105,
        0.052278656512498856,
        0.042150747030973434,
        0.059208888560533524,
        -0.07252649962902069,
        -0.056306563317775726,
        0.013014714233577251,
        -0.02267826348543167,
        -0.12263661623001099,
        0.07809972763061523,
        -0.03376941382884979,
        0.10094720870256424,
        -0.010889869183301926,
        -0.05010348930954933,
        0.019864816218614578,
        -0.06298559904098511,
        -0.05662619322538376,
        -0.004234509542584419,
        -0.009062341414391994,
        0.09312113374471664,
        -0.06117989122867584,
        -0.038062598556280136,
        -0.03445927053689957,
        -1.293129009244951e-32,
        0.02144409716129303,
        0.03754904493689537,
        0.018513979390263557,
        -0.03859055042266846,
        0.03707326203584671,
        -0.01974288746714592,
        0.03848681598901749,
        0.07052913308143616,
        0.06309910863637924,
        -0.07848832756280899,
        0.07611483335494995,
        -0.06390925496816635,
        -0.13617278635501862,
        0.014981293119490147,
        -0.014422180131077766,
        -0.04787681996822357,
        -0.0435880608856678,
        -0.05159482732415199,
        0.06162228807806969,
        -0.014576766639947891,
        0.0847918689250946,
        0.13691110908985138,
        0.07544945180416107,
        -0.008887175470590591,
        0.017259446904063225,
        0.02091897837817669,
        0.04199845343828201,
        0.07994227111339569,
        0.05614025145769119,
        0.050506532192230225,
        -0.009312373585999012,
        -0.06632199138402939,
        -0.04116407409310341,
        0.014768517576158047,
        0.055956315249204636,
        0.02612459287047386,
        0.013795905746519566,
        0.03930823504924774,
        -0.015490473248064518,
        -0.060022078454494476,
        0.04503757134079933,
        -0.015618898905813694,
        -0.012546589598059654,
        -0.004973710048943758,
        -0.028608672320842743,
        -0.13472072780132294,
        -0.05267869308590889,
        0.0039376686327159405,
        0.007376725785434246,
        0.006697291508316994,
        -0.05612080916762352,
        -0.038126397877931595,
        -0.006488680839538574,
        -0.029065221548080444,
        0.009815013036131859,
        -0.00012160546611994505,
        -0.05695826932787895,
        -0.01660027913749218,
        0.06001892685890198,
        0.0003448395000305027,
        0.03615379333496094,
        -0.008972322568297386,
        -0.0792260691523552,
        -0.0559251569211483,
        -0.0022878190502524376,
        -0.08746098726987839,
        0.10307639092206955,
        0.042758625000715256,
        -0.01921045407652855,
        0.007440065499395132,
        -0.012732656672596931,
        0.03698287904262543,
        0.047568876296281815,
        -0.01832473650574684,
        0.06372328847646713,
        -0.03439415618777275,
        -0.06190675124526024,
        0.00036220764741301537,
        0.07336702942848206,
        -0.039903584867715836,
        -0.04869765788316727,
        -0.01674698479473591,
        0.025163739919662476,
        0.057868167757987976,
        0.09009619802236557,
        0.092681385576725,
        0.09585460275411606,
        -0.008787620812654495,
        0.004682323429733515,
        0.04539892449975014,
        0.026911504566669464,
        0.08380915224552155,
        0.0918392688035965,
        0.1260416954755783,
        -0.09436435997486115,
        -6.380092543167848e-08,
        -0.006537709850817919,
        0.022660570219159126,
        -0.027921490371227264,
        0.0041392589919269085,
        0.006270586978644133,
        -0.06905099004507065,
        -0.03905056044459343,
        0.0042646536603569984,
        0.008881982415914536,
        -0.058807965368032455,
        0.11149387061595917,
        0.011485465802252293,
        -0.009678080677986145,
        0.10057739168405533,
        0.029271913692355156,
        -0.0011209077201783657,
        -0.10044486820697784,
        0.07365576177835464,
        -0.03469664603471756,
        -0.08252459019422531,
        -0.051886629313230515,
        0.05438482016324997,
        0.05583418905735016,
        -0.00899665616452694,
        0.04493984580039978,
        0.004529241938143969,
        0.009317060001194477,
        -0.019274957478046417,
        0.007396910339593887,
        0.015411549247801304,
        -0.03762434795498848,
        0.013065848499536514,
        -0.001275944639928639,
        -0.007112897001206875,
        -0.06325726211071014,
        -0.040302831679582596,
        -0.07172004878520966,
        0.00618984317407012,
        0.001894183922559023,
        0.03414754569530487,
        0.0027339209336787462,
        -0.08346427977085114,
        -0.04713873937726021,
        0.025106262415647507,
        0.007653762120753527,
        -0.04854270815849304,
        0.0189867801964283,
        -0.05157078430056572,
        -0.039051417261362076,
        -0.04507619887590408,
        -0.05691536143422127,
        0.037735722959041595,
        0.04573335871100426,
        -0.04982070252299309,
        0.03224513679742813,
        0.006698550656437874,
        0.036555927246809006,
        0.07160105556249619,
        -0.044141385704278946,
        -0.014005467295646667,
        0.01282309740781784,
        0.017395908012986183,
        -0.04872894287109375,
        0.02689702808856964
    ]
}