{
    "id": "XpowfENlJAw",
    "title": "The $0 Apple Update That Changes Music Forever",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2021-06-14T01:21:17Z",
    "video_url": "https://www.youtube.com/watch?v=XpowfENlJAw",
    "category": "Science & Technology",
    "tags": [
        "Apple Music",
        "Apple Music 14.6",
        "Apple Music lossless",
        "Apple Music vs Spotify",
        "Apple Music Dolby atmos",
        "Apple Music spatial audio",
        "iOS 15 features",
        "How to listen to lossless",
        "Best dac Apple Music",
        "Apple Music review",
        "Apple Music iOS 15"
    ],
    "views": 633767,
    "likes": 24632,
    "comments_count": 1247,
    "description": "Apple Music Spatial Audio + Atmos & Losless Review! Apples iOS 14.6 Apple Music update that gets better with iOS 15 changes music forever. It brings Lossless, hi-res lossless & Dolby atmos music with spatial audio for $0 extra. This is my full breakdown/walkthrough and how to listen in lossless.   Recorded and mixed on M1 iPad Pro:   My Dolby Atmos + Spatial Audio playlist!   Listen to MagSafe in Apple Lossless:  Listen to MagSafe on Spotify:   Young Morales by Jonathan & Friends ft Wolf Apple Music:  Spotify:   Apple Music Lossless Guide:  Mixing in Dolby Atmos by Dave Way & Produce Like a Pro:   Morgan Freeman by Josh Robert Thompson:   Joshua Valour:  Darko Audio:   Dragonfly black (youll need a lightning to USB or USB C to USB adapter)    Dragonfly Red:    Dragonfly Cobalt:     Beyerdynamic DT 1990 Pro:   RME Babyface Pro:",
    "description_links": [
        "https://youtu.be/v-g6KAIqOoA",
        "https://music.apple.com/us/playlist/jonathan-x-friends-best-of-dolby-atmos-spatial-audio/pl.69e109bfed3148fc9b3b1f70bdb96d33",
        "https://music.apple.com/us/album/magsafe/1539379230?i=1539379233",
        "https://open.spotify.com/track/1uq2UMoJalmaPbwpuWOcvx?si=OLjv1xKtQVun88GSulg7Ww",
        "https://music.apple.com/us/album/young-morales-feat-wolf/1562198615?i=1562198946",
        "https://open.spotify.com/track/41b70MEpM8vuqs3sT8r2DR?si=6M9S5hVvTJ2qN_tn9q0kxg",
        "https://support.apple.com/en-us/HT212183",
        "https://youtu.be/Kky2u5XzZBU",
        "https://thejrtshow.com/",
        "https://youtu.be/eC-W29VWjwk",
        "https://youtu.be/oVl6Nyf7YLI",
        "https://www.amazon.com/AudioQuest-DragonFly-Black-Preamp-Headphone/dp/B01DP5JHHI",
        "https://www.amazon.com/AudioQuest-DragonFly-Red-Headphone-Amplifier/dp/B01DFMV4NQ",
        "https://www.amazon.com/AudioQuest-Dragonfly-USB-Headphone-Amplifier/dp/B07T3HSD9Z",
        "https://www.sweetwater.com/store/detail/DT1990Pro--beyerdynamic-dt-1990-pro-open-back-studio-reference-headphones",
        "https://www.sweetwater.com/store/detail/BabyfaceProFS--rme-babyface-pro-fs-24-channel-usb-audio-interface"
    ],
    "transcript": "(electronic beep) - [Morgan] Welcome. - God? - [Morgan] No, it's Morgan, fool. - Is that the only voice you got? - [Morgan] Alexa got Samuel, Waze got Kevin and Shaq. But for five installments of $58.15, I can do a mean Larry David. Which might I say is pretty, pretty, pretty good. Or, for no extra charge, I can do Liam Neeson. (intense music) Press the digital crown to continue, or I will you, and I will kill you. - Nah, I'm good. - [Morgan] Son, what exactly is it that you think you're doing? - Wiring up, I gotta get the lossless. - [Morgan] I swear, every tech reviewer out here buying $550 wireless headphones with a gyroscope accelerometer two H1 chips, nine microphones, and the first thing you fools wanna do is pass the auxiliary. At least try them out like Tim Apple intended. Wireless. It's some crazy stuff, right? I mean, you can't walk on water, but spatial audio, baby. I'm laid back but I don't front Dopamine up and the MagSafe plugged Hit my line like you didn't just dub Pressing decline is a sugar rush - Yo, Jonathan here. Today I'm breaking down the brand new Apple Music update. Lossless, Hi-Res Lossless, Dolby Atmos, spatial audio. What all that means, why you'd wanna use it, and more importantly, how to Properly use it. Now, because this is the internet, the one thing I want you to keep in mind throughout this video before you drop a comment, is that all of these updates come with a price increase of $0. So it costs exactly the same as it did two weeks ago, but it's so much better. Before we jump into any of that exciting stuff, though, just in case you wanna try it out for yourself, let's first talk about how to enable that update. I will specifically be referencing iOS devices, so iPad and iPhone. And with that, contrary to a couple of the comments I've seen, you don't need the iOS 15 beta to experience this. You simply need iOS 14.6. This update also comes to macOS, tvOS, so if you want a complete breakdown of which devices are supported, of which headphones are supported, which regions are supported, because it may not work in every part of the world, I will drop that detailed breakdown down below. Once you're up to date with iOS 14.6, you're gonna wanna head over to settings, and then to music. It should automatically show up. If it doesn't, I've seen a couple of suggestions saying to toggle on and off your sync library. For me, that particular method did not work. I ended up just waiting overnight, and it showed up the next day. And as always, when in doubt, restart. Once everything's updated and good to go, it should look like this. And from there, there are two important tabs to pay attention to, Dolby Atmos and audio quality. So what is Dolby Atmos? There's a good chance you've seen Dolby Vision on a TV show or a movie. That is a flavor of HDR, kind of the video side of things. Whereas Atmos, that covers audio. It's kind of a more beefed up, complex version of surround sound, but instead of a traditional 5.1 or 7.1 setup, you have sound coming from the sides of you, and also from above, firing down. So you're almost in this 360 degree box of sound. Typically the way we consume music is in a stereo field, left to right or right to left. That's why you see that L and that R on your headphones, or you have a pair of speakers. Don't get me wrong, there are incredible stereo mixes with huge space, separation, and great use of panning. Take the Beatles, for example. Especially now that lossless is here. If you get a chance to listen to the Beatles with a good pair of headphones, what they did with a stereo mix and panning is ridiculous. So hopping into Logic Pro. Typically you'll have the lead vocal, which sits right smack in the middle Got my circle and we ride like PS5 - Then you might have guitars that are panned left, or right, or both, creating kind of the stereo wall. You're switching sides Out of chances go head put that car in drive In drive So you can see how you could create space, left to right, right to left. Once you see how something is mixed in Dolby Atmos it's a completely different level. - Let's try this track here. Yeah, okay, so. (electric guitar strumming) So I'm kinda moving that a bit in a circle. And then I can also go up. (electric guitar strumming) When you're in the speakers, it's really pretty dramatic because you're actually pinpointing all these things. For anybody who hasn't actually heard an Atmos mix, it really is something. It is a big, big step up from just 5.1. And it mainly has to do with the side speakers and the height speakers. You know, with 5.1, we basically had in our, you know, in front of us, and then in back of us, with shades in between. But having stuff up there and stuff directly in your side speakers, the detail in between front to back is really something. And then being able to hear things from anywhere above you. It can be subtle, it can be very dramatic. It's whatever you want it to be. It's just basically a big panner that you can do anything that you want. It's the Wild West. - I'll drop a link to that video, as well as the song I showcased before that down below. But once you really get a grasp of what the potential is, it is so exciting. With that said, though, I think Dolby Atmos and spacial audio really exposes the tracks that were properly mixed for it because I guarantee you, there was a ton of songs, and albums, and artists who wanted to jump on that playlist, that stream wave. And click that spatial audio, Dolby Atmos button, and you can tell. There are some that sound like hot garbage. Honestly, I hadn't used AirPods Max a ton up until this update. I always kind of reverted back to AirPods Pro because of the convenience. But getting Dolby Atmos with music takes the AirPods Max to a completely different level. The entire Come Away With Me album by Noah Jones is probably the best AirPods Max plus Dolby Atmos experience I've come across. It is jaw dropping. Specifically Shoot the Moon, oh my goodness. The acoustic guitars on the left and the right, and the piano comes in, and it's just perfectly carved out in its own space. And then the vocals come in. It is beautiful. As far as a more modern take on music, the entire Olivia Rodrigo album sounds incredible. Like you could tell it was mixed for Dolby Atmos. Here Comes The Sun by the Beatles is also another great example. And I think because that was recorded to such a high quality source with tape and analog, and they did so many things with panning in a stereo field once that was brought into a Dolby Atmos world, it just worked so damn well. What I Got by Sublime also translates really well. Surprisingly a good chunk of the rock playlist, the classical, the jazz, those all work really well. I particularly enjoyed the RME, the Tonic on the rock playlist. So what I'll do is try to put together my playlist of what I think works best in Dolby Atmos, in spatial audio, because you definitely have to sift through the junk. That aside though, I think this is the future of music. Like could you imagine a John Mayer trio album mixed in Dolby Atmos, and being able to hear it on AirPods Pro or AirPods Max? That would be incredible. I know a lot of people out there are going to kind of be turned off or not have an open mind, which I think is ultimately a bummer. I think the beauty of this update is yes, you do have the option to enable Atmos, and that's right there in the settings where you can leave it set to automatic or straight turn it off or on. But I think if you don't truly give it a chance, you're going to miss out. The way that I try to look at tech is more through the lens of me, but like years and years ago. In story time, I lost my dad when I was 18. But I think a lot of my passion and love for tech comes directly from him. He was always on the latest and greatest. We would always go to Hollywood Video. And specifically, there was one time that will forever stick in my mind where he walked up to the desk, and asked the guy working there, \"Hey, do you guys have Blu-rays yet?\" And the guy was like, \"What's a Blu-ray?\" He was always on top of it. So I try to think, you know, \"What would my dad think? How cool would it be to show him this?\" Like, he loved the Beatles. And imagine if I could show him that in Atmos or spatial audio. So I try to keep that excitement and not lose sight of it because so many of us in the tech world tend to do that. Ultimately though, if you're a purist, I get it. If you wanna enjoy that lossless or high-res lossless with a pair of headphones and DAC, there's some beautiful, beautiful stuff there. To make sure that is enabled Properly, we're gonna go back to settings and then audio quality. We're gonna make sure that lossless audio is enabled, and below that, there are three very important tabs to pay attention to. So what we have here is your audio quality over cellular, wifi, and then downloads. It's probably a good idea, especially if you don't have a giant data plan, not to enable lossless over cellular, because those gigabytes full fill up and fly fast. For most of us, what we're probably gonna wanna do is select lossless or high-res lossless over wifi, because it's not gonna count against your data plan or space on your phone. Conversely, if you do have a ton of storage on your phone, offline is probably the best idea. If you're at home and you wanna download those tracks over wifi. And then that way, once you're out traveling whether you're on the road or potentially flying, you're not tagging or hitting your data plan because they're already on your phone. Now I don't by any means consider myself an audiophile. I like things that sound good, but I generally don't like the mindset behind the audioPHile movement. Because usually it's like, if you're not using a DAC, wearing wired headphones, listening to a FLAC file, and they judge you, and I'm like, \"Hey, if I wanna use wireless just for convenience most of the time, and then wire up when I want to, that's not gonna affect you.\" If however, this lossless experience opens up Pandora's box and starts a new habit for you. Two channels I could wholeheartedly recommend are Joshua Valour and Darko Audio. They know their stuff, they're Pros, they get it. And more importantly, they're down to earth cool dudes. With that said, I'm not gonna go on a Vsauce3 type explanation of what lossless audio is. Shoutout to Jake. But as far as what lossless audio does for you, it's essentially allowing you to listen to that piece of music as close to the original source as possible with nothing in the way. Really, there are two numbers you gotta pay attention to, bit depth and then sample rates. So take a CD for example, remember those things? That has a bit depth of 16 and a sample rate of 44.1. Spoiler alert, and this may be a little bit of a surprise for a lot of you out there, even though Apple Music technically supports all the way up to 24, 192, the majority of music out there taps out at 24, 48. A lot of it will sit in that window of 16, 44, 16, 48, 24, 44, or 24, 48. He do have some instances where music will go higher. A lot of the Travis Scott stuff is 24, 88. The Search for Everything by John Mayer is 24, 96. And surprisingly, a lot of the older music that must've been recorded to analog and then brought into this modern world that got remastered to 24, 96 or 24, 192. Of course, Hotel California, in all of its 12 string glory, are in 24, 192. To my surprise, the entire Disturbed studio collection is in 24, 192. There's even some Metallica, some Pantera, and Linkin Park in high-res lossless. So all that's cool, but how exactly do you make sure you're listening to music in lossless? And surprise, surprise number two, the cheapest way to get into that door is Apple's $10 Lightning to 3.5mm adapter because that will get you up to 24, 48. And again, like we talked about, that's most of the music out there. Are there better DACs and options out there? Absolutely. But for the money, it is surprisingly good. Personally, my go-to way to listen to lossless with Apple Music is using a DragonFly from AudioQuest. They come in three different flavors and price points. You have black, red, and then cobalt. Essentially, the higher up the ladder you step, the better the converters are. But all three of these will get you up to 24, 96. My go-to headphones to pair with the DragonFly are the Beyerdynamic DT 1990 Pros. I do have a pair of IEMs that I love, but I end up reverting back to the Beyerdynamics like 85% of the time, whether I'm working on music, mixing, editing a video, or in this case, listening. Now those headphones aren't to the moon expensive, but they're also not the most entry affordable options either. So what I'll do is post a couple different options of over ear, on ear, in ear that are under the $300 price point to pair either with the DragonFly or that Apple lightning adapter. So what if you love Hotel California and you wanna hear it in 24, 192 glory? What do you need? The answer is a better DAC. In my case, the audio interfaces that I use from RME, the Fireface and the Babyface, those work exceptionally. All of a sudden the M1 iPad Pro has turned into this incredible high-rise music machine that you can dish out 24, 192. So I've set it up with higher end studio speakers, which has been incredible. But I think what the setup is for most people is the iPad Pro paired with the Babyface, which has been phenomenal. Probably the best part about this combination is the Babyface Pro is bus-powered. So one cable directly into the iPad, and you are set with a great interface to record music, to mix, to listen back, and now, to play back high-res lossless music. I've actually used this combination. a ton. The Babyface paired with the iPad Pro and it's been incredible. I challenged myself to record and mix an entire song using nothing but the iPad Pro, and to level that up, shoot a video in HDR, edit on the iPad with the XDR display, and then upload that to YouTube in HDR. So if you wanna see how that turned out I got that link up here and down below. So if you truly wanna experience 24, 192 true high-res, lossless, that's a great way to go. I'll also drop some other options down below. But I think the most important thing to remember here is again, most music caps out at 24, 48. So either that lightning adapter, or the DragonFly is going to be more than enough for most of you out there. I will also post a playlist of some of my favorite music in lossless. so you guys can check that as well. Shoutout to MagSafe. Thank you guys so much for watching, hopefully this helped. If you enjoyed it, and you found it useful, drop a.",
    "transcript_keywords": [
        "Dolby Atmos",
        "Atmos",
        "Music",
        "Dolby",
        "lossless",
        "audio",
        "Dolby Atmos world",
        "Dolby Atmos experience",
        "Pro",
        "Apple Music",
        "iPad Pro",
        "lossless audio",
        "Dolby Atmos button",
        "spatial audio",
        "good",
        "Apple",
        "highres lossless",
        "back",
        "headphones",
        "AirPods Max"
    ],
    "transcript_entity_values": [
        "AudioQuest",
        "550",
        "DragonFly",
        "Babyface",
        "RME",
        "Beyerdynamic",
        "Moon",
        "48",
        "Tim Apple",
        "the iPad Pro",
        "14.6",
        "Travis Scott",
        "Two",
        "XDR",
        "Shaq",
        "Hollywood Video",
        "three",
        "44",
        "one",
        "Apple Music",
        "AirPods Pro",
        "Jonathan",
        "two",
        "Logic Pro",
        "iPhone",
        "MagSafe",
        "Beatles",
        "FLAC",
        "the iPad Pro",
        "16",
        "AirPods Max",
        "the Wild West",
        "Joshua Valour",
        "five",
        "5.1",
        "overnight",
        "Apple",
        "YouTube",
        "3.5mm",
        "John Mayer",
        "16",
        "Blu-ray",
        "Linkin Park",
        "Atmos",
        "first",
        "Kevin",
        "12",
        "192",
        "Alexa",
        "88",
        "10",
        "0",
        "Fireface",
        "300",
        "18",
        "Dolby Atmos",
        "Liam Neeson",
        "Pros",
        "96",
        "Hotel California",
        "Metallica",
        "Larry David",
        "Tonic",
        "a ton",
        "Samuel",
        "192",
        "96",
        "Waze",
        "24",
        "nine",
        "Pandora",
        "Dolby Vision",
        "the next day",
        "Dolby Atmos",
        "24",
        "AirPods Pro or AirPods Max",
        "years ago",
        "Morgan",
        "44.1",
        "Jake",
        "Pantera",
        "two weeks ago",
        "15",
        "H1",
        "Come Away With Me",
        "DAC",
        "iPad",
        "iPad Pro",
        "Noah Jones",
        "7.1",
        "the AirPods Max",
        "Olivia Rodrigo",
        "Shoutout",
        "Darko Audio",
        "58.15"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "LOC",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "LOC",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "MONEY"
    ],
    "vector": [
        0.013453391380608082,
        -0.08162795752286911,
        0.045157190412282944,
        -0.042759280651807785,
        0.022006485611200333,
        0.020884014666080475,
        0.030172357335686684,
        -0.07999283820390701,
        0.018713001161813736,
        -0.04492497071623802,
        0.007235313765704632,
        -0.05436129495501518,
        -0.07114611566066742,
        -0.06461265683174133,
        0.0049414555542171,
        0.023544223979115486,
        0.08094076812267303,
        0.04057598486542702,
        -0.024766800925135612,
        -0.0005601215525530279,
        -0.06800420582294464,
        -0.017390314489603043,
        0.012600223533809185,
        0.06493785232305527,
        0.061972662806510925,
        -0.04434601590037346,
        -0.019106529653072357,
        -0.01772204041481018,
        -0.03803412616252899,
        -0.074172243475914,
        0.007998966611921787,
        0.061216238886117935,
        0.09677049517631531,
        -0.060316409915685654,
        -0.044103845953941345,
        -0.10831411927938461,
        0.06646169722080231,
        -0.055992163717746735,
        -0.07701081037521362,
        -0.06611766666173935,
        -0.018177995458245277,
        0.052108895033597946,
        -0.03821166977286339,
        0.008454512804746628,
        -0.10577761381864548,
        -0.04393627122044563,
        -0.011387044563889503,
        -0.051024481654167175,
        0.003729748073965311,
        0.01949438825249672,
        -0.003321881638839841,
        -0.08641521632671356,
        0.02668435126543045,
        0.06750845164060593,
        -0.01843062974512577,
        0.04387588053941727,
        0.021730732172727585,
        0.10337106883525848,
        0.04791529104113579,
        0.035482779145240784,
        -0.009780271910130978,
        -0.03474639728665352,
        0.008733917027711868,
        -0.0020330208353698254,
        0.012497272342443466,
        0.005008907523006201,
        -0.05207804590463638,
        0.02921590395271778,
        0.022860996425151825,
        -0.004216987639665604,
        -0.04816078394651413,
        0.0014013705076649785,
        0.07949956506490707,
        -0.014334107749164104,
        0.06430843472480774,
        0.077972911298275,
        0.03059983067214489,
        -0.032310619950294495,
        -0.013683735392987728,
        -0.0014096085214987397,
        0.008870240300893784,
        -0.03582650423049927,
        -0.06743275374174118,
        -0.09726987779140472,
        0.03322027251124382,
        -0.014374138787388802,
        -0.005022473633289337,
        -0.04513305798172951,
        -0.06373729556798935,
        -0.014280539005994797,
        -0.06498463451862335,
        0.10237148404121399,
        0.03183184564113617,
        0.004316350910812616,
        0.07921423017978668,
        0.041401106864213943,
        0.004422789439558983,
        -0.0539110004901886,
        -0.011416791006922722,
        0.052182432264089584,
        -0.01081403810530901,
        0.018919846042990685,
        -0.006710528861731291,
        -0.005684993229806423,
        -0.00812435057014227,
        -0.15769799053668976,
        -0.004147060681134462,
        0.023932667449116707,
        0.007890451699495316,
        0.07157591730356216,
        0.06949324160814285,
        0.008961348794400692,
        0.02104545384645462,
        -0.04825035110116005,
        0.0017822925001382828,
        0.1141730472445488,
        -0.020462095737457275,
        0.05812566727399826,
        0.019523542374372482,
        0.03669939935207367,
        -0.06727041304111481,
        0.005380988121032715,
        -0.07906859368085861,
        -0.002666524611413479,
        -0.05685720592737198,
        0.02560916170477867,
        -0.038258157670497894,
        7.786126339645401e-33,
        -0.021042438223958015,
        0.007825078442692757,
        0.01514509879052639,
        -0.045442625880241394,
        0.0716625526547432,
        -0.14440222084522247,
        -0.007403850555419922,
        0.03163251653313637,
        0.003530804766342044,
        0.015937596559524536,
        -0.02136414870619774,
        0.017983468249440193,
        -0.07599953562021255,
        0.012714727781713009,
        -0.0008282500202767551,
        -0.10411863029003143,
        -0.026970429345965385,
        0.05209306627511978,
        -0.0010102674132212996,
        -0.025529004633426666,
        -0.024137770757079124,
        0.041823938488960266,
        -0.06895507127046585,
        -0.053073909133672714,
        0.08310084789991379,
        0.0714104101061821,
        0.023344580084085464,
        -0.02919628471136093,
        0.08743580430746078,
        0.015304443426430225,
        -0.0670468881726265,
        0.020541859790682793,
        0.036479026079177856,
        -0.09640194475650787,
        -0.014437561854720116,
        -0.034098897129297256,
        -0.055499788373708725,
        0.029959755018353462,
        0.0022847899235785007,
        -0.08052267134189606,
        -0.07086944580078125,
        -0.0064130015671253204,
        -0.09932062774896622,
        -0.04250939190387726,
        0.017225060611963272,
        -0.031963035464286804,
        -0.0046371459029614925,
        0.06115506961941719,
        0.04689325764775276,
        0.04698028787970543,
        -0.0010264830198138952,
        0.015068230219185352,
        -0.11067748069763184,
        0.07972963154315948,
        -0.018807535991072655,
        -0.03353707492351532,
        -0.01410689391195774,
        0.024838533252477646,
        0.04356146603822708,
        -0.0012138253077864647,
        0.1276976466178894,
        0.04499465599656105,
        0.06429241597652435,
        -0.07994206994771957,
        -0.028624368831515312,
        0.086075060069561,
        0.00048599933506920934,
        -0.11131589114665985,
        -0.012543484568595886,
        0.012234600260853767,
        -0.03951572999358177,
        0.029135290533304214,
        0.038740381598472595,
        0.011487424373626709,
        -0.008478430099785328,
        -0.025958899408578873,
        -0.07408767938613892,
        -0.06828154623508453,
        0.019875485450029373,
        -0.0020053416956216097,
        -0.05344444885849953,
        0.0772436261177063,
        -0.036206841468811035,
        0.07224556058645248,
        0.021820135414600372,
        0.05253682658076286,
        0.0059491368010640144,
        -0.03568606823682785,
        -0.060063235461711884,
        0.005430432502180338,
        -0.014929537661373615,
        -0.001206832705065608,
        -0.0015318981604650617,
        -0.030248481780290604,
        0.002944714156910777,
        -7.064136240002414e-33,
        0.020857151597738266,
        -0.01317253615707159,
        -0.004615503363311291,
        -0.003880932228639722,
        -0.03922344371676445,
        -0.0036003002896904945,
        0.008157587610185146,
        0.07545711100101471,
        0.08819372206926346,
        -0.005200426559895277,
        0.0199703611433506,
        -0.0003385505988262594,
        -0.02991592139005661,
        -0.0064424267038702965,
        -0.08899538964033127,
        -0.060723137110471725,
        -0.092454694211483,
        -0.009245362132787704,
        0.056840214878320694,
        0.0746508538722992,
        0.010048185475170612,
        0.06297281384468079,
        -5.1997853006469086e-05,
        0.027301017194986343,
        -0.046985745429992676,
        -0.023220809176564217,
        0.02065591886639595,
        0.16160987317562103,
        0.05728571116924286,
        -0.035184942185878754,
        0.044999271631240845,
        0.03914869204163551,
        -0.07448184490203857,
        -0.1072852835059166,
        0.03846412152051926,
        -0.025231948122382164,
        0.04581300914287567,
        0.026313384994864464,
        -0.06139419227838516,
        -0.054437920451164246,
        0.004964903928339481,
        0.02675653249025345,
        -0.015015065670013428,
        -0.024105453863739967,
        0.05022572726011276,
        0.034255579113960266,
        -0.05767278000712395,
        0.06830766797065735,
        0.02519851177930832,
        -0.08520126342773438,
        0.0926852598786354,
        -0.06311344355344772,
        0.033002015203237534,
        0.005150938872247934,
        -0.038527585566043854,
        0.063542440533638,
        0.019967133179306984,
        0.04319386184215546,
        -0.005478259641677141,
        0.0647413432598114,
        -0.01992933638393879,
        -0.015613807365298271,
        0.020613908767700195,
        -0.1021498367190361,
        -0.03105475939810276,
        0.12415359169244766,
        0.02924465946853161,
        0.004870003554970026,
        0.05003516376018524,
        0.02465125359594822,
        0.018834471702575684,
        0.02471422404050827,
        -0.03595929592847824,
        -0.003868311643600464,
        -0.0301847904920578,
        0.07595117390155792,
        -0.07047326117753983,
        -0.04131680727005005,
        -0.04611728712916374,
        -0.04209599643945694,
        0.011556744575500488,
        0.09834592044353485,
        0.04805652052164078,
        0.04303337261080742,
        0.10570330172777176,
        0.03567080944776535,
        0.04160825535655022,
        -0.04461880400776863,
        -0.00519338995218277,
        0.08988998085260391,
        -0.04213406518101692,
        0.016575898975133896,
        -0.04088932275772095,
        0.04585066810250282,
        -0.06402891129255295,
        -5.6790607771972645e-08,
        -0.021206550300121307,
        0.06386353820562363,
        -0.0010453608119860291,
        0.0006689319852739573,
        0.010927824303507805,
        -0.034136295318603516,
        0.033022865653038025,
        -0.036679401993751526,
        0.0429174043238163,
        0.01956402137875557,
        -0.02626272849738598,
        -0.06029776111245155,
        -0.033608272671699524,
        0.020796403288841248,
        0.011561702005565166,
        0.03610135242342949,
        -0.03139859065413475,
        0.04412876442074776,
        -0.04887876287102699,
        -0.057218585163354874,
        -0.020731154829263687,
        0.11848895996809006,
        0.004785506520420313,
        -0.08985698968172073,
        0.07932807505130768,
        -0.03366519510746002,
        0.14378109574317932,
        0.056159086525440216,
        0.020058108493685722,
        -0.04751864820718765,
        -0.009630127809941769,
        0.04770722985267639,
        0.015296167694032192,
        0.004494945518672466,
        -0.02541341632604599,
        -0.035055920481681824,
        -0.0407366007566452,
        0.029573703184723854,
        -0.030371323227882385,
        -0.00028876468422822654,
        -0.04079790413379669,
        -0.05498833581805229,
        -0.0335296094417572,
        -0.07518365234136581,
        -0.04908442124724388,
        -0.07892981916666031,
        0.0135430209338665,
        -0.03174581006169319,
        0.007508182432502508,
        0.10837637633085251,
        0.046956684440374374,
        0.02030996046960354,
        -0.009548991918563843,
        -0.020074328407645226,
        0.12609097361564636,
        -0.023155206814408302,
        -0.030300429090857506,
        0.046936050057411194,
        -0.06475967913866043,
        0.0869663804769516,
        0.06145061179995537,
        -0.05684525892138481,
        0.04056380316615105,
        0.05042090266942978
    ]
}