{
    "id": "xpV9o6OZrKg",
    "title": "WE HAVE A SECRET.....",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-06-23T12:06:00Z",
    "video_url": "https://www.youtube.com/watch?v=xpV9o6OZrKg",
    "category": "Howto & Style",
    "tags": [
        "Robot mop",
        "robot vacuum",
        "best robot mop",
        "Narwal",
        "Narwal Frio",
        "Dirtsense",
        "NarwalRobot",
        "Robotvaccumeandmop",
        "Robot mop test",
        "smartest robot mop",
        "cleaning",
        "cleaner",
        "robot cleaner",
        "tesla robot",
        "robot vacuum and mop combo"
    ],
    "views": 733369,
    "likes": 29249,
    "comments_count": 1703,
    "description": "The JerryRigEverything Family is expanding with a cute little BABY GIRL!!! You can expand your own family with a Narwal Freo HERE:  or on Amazon HERE:   Narwal is having an Anniversary deal that you don't want to miss! A teardown to break down the secrets of Narwal Freo that help it sense dirt and mop the floor until its thoroughly clean.  Keeping our floors clean is a difficult task - since I dont take off my shoes - and Cambry cant leave her wheels at the door our hard floors are constatnly dirty. With a new baby on the way - its time we find a way to keep things a bit cleaner. And what better way than with an automatic robot mop and vacuum combo that can do it all for us, automatically! #NarwalFreo #DirtSense #NarwalRobot #robotvacuumandmop  *Follow us for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://bit.ly/ytJerryJune",
        "https://bit.ly/JerryJuneAMZ",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/ACnP4TvUoTN-kdVzL6dT8g?pm=link",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "-[Zack] So this might come as a surprise, but we are 2 weeks away from baby number two. -[Cambry] And it's a girl, and we're really excited. -How are you feeling? -Tired. The last month of pregnancy is hard. Moving, like, out of my chair onto another surface is challenging...just to take a nap to get through the day. -We were talking and we decided that month 9 of pregnancy in a wheelchair is harder than month 1 with a baby. -Yeah, usually it's the other way around for people. But this time it's actually been easier. I don't know if it's because I've been lifting a toddler and my muscles are stronger than they were last time. Or girls are just easier than boys...I don't know. -It is a girl. We said that already? -Yeah. -Okay, yeah. Well what would make your life easier? -I don't know...maybe a robot mop that also happens to vacuum? -Well it just so happens our channel sponsor, Narwal, has sent us that very thing. -[Cambry] A lot of people take their shoes off when entering the house. But here at our house, not really our thing. I wish it could be. -[Zack] I, for one, am too lazy. And Cambry can't really leave her wheels at the door. -My wheels are my shoes, so finding a way to keep our floors clean while having a toddler and a newborn baby is pretty important. -And I think we found an all-in-one solution. -Let's get started. [Intro] -[Zack] This is the world's first fully automated self cleaning robot/vacuum/mop combo. I have tested other robots before and I knew that when this one fully mapped 800 square feet of my house in just 7 minutes with its top mounted lidar system, we had something special. No more bouncing off of walls to figure out where things are at. The Narwal Freo has 2 triangular mop heads on the bottom that rotate 180x a minute. The triangular shape help ensures that there's no gap between the brushes. -[Cambry] We can clean the whole floor all at once or each room individually. Or even just draw a square with the app and send the mop to clean and vacuum like a little house elf. -[Zack] As you can see from my fishy cracker and applesauce masterpiece, the Freo handles about 90% of the mess on the first pass. Then goes back to the base station to clean off the mop and comes back to hit it again with a second pass that brings us up to 100%, even getting a few extra intelligent scrubs in there for good measure. Of course we'll see how it all works from the inside later, but on the outside, after it's vacuumed and mopped in a set amount of time, it can head back to the base station. Let me explain what happens when the Freo goes into the base station since that's the coolest part. Up here we have the LCD screen, currently with a child lock on it. And we have a clean tank and a dirty tank. Let me pull out the vacuum. -[Robot voice] Your robot is hanging in the air. Move it to an empty area to start. -[Zack] It's using the clean water tank to rinse off these brushes...these mop pads, while the brushes are spinning around on this cleanable plastic plate, agitating the dirt. Which then gets rinsed off and stuck into the dirty water. Our previous robot mop had just a little spritz of spray that would shoot out in front, and then it would try to mop our whole house with a singular pad, just smearing dirt everywhere. Being able to clean off the mop during the process is perfect. The Freo has the ability to be spliced into the waterline for your facets so it can run like a washing machine, never needing water replenishment. However, our basestation is right front and center in our living area and Cambry says I'm not allowed to drill anymore holes in the wall. -[Cambry] Nope. -[Zack] Swapping out the water tanks after every few cleanings isn't that big of a deal. And after the pads are clean, the base station has the ability to dry them off so they're not there sitting in the dark starting to smell funny. I know it's a little gross, but the dirtiness of the water shows that the mop is actually doing it's job, and removing dirt from the floor just like an actual mop and mop bucket would. When the mop is running, it has a special little feature called Edge Swing. Again, another world first. Edge Swing is a dance that the Freo does near the edge of a room where it swings its little rear end near the baseboard so that the microfiber strands of the mop head can get way deep into the hard to reach corners. The mop brushes can also raise up and out of the way when it finds carpets or doormats, and gets set down again when the sensors detect hard floors. With the lidar up top and the built in infrared cameras, the Narwal Freo can be scheduled to work at night when there's less foot traffic. It can vacuum, then mop, or do both simultaneously. And with all of its sensors and algorithms, if it detects a spot that isn't clean enough it can go back and redo that spot all on its own. Narwal is aptly calling this feature Dirt Sense. It does have an app for more options and control. But I also like the built-in touch screen that can get the cleaning party started without even having a phone nearby. It also works with Siri, if you're into that kind of thing. If we mosey our way inside of the Freo, we find that the dust collection bin and air filter are located under the lid on the top side, along with a nice little brush and razor to slice hair and strings off the vacuum bristles. The triangular mop brushes kind of look like those fuzzy mitts you wash cars with. The vacuum bristles can come out like normal. And the coolest thing is that all of these parts can be easily replaced by hand, with no additional tools, including the mop brushes. Just for kicks and giggles, let's go beyond what normal people get to see and into the depths of the Freo. Thanks for subscribing by the way. With 9 Philips head screws removed, we get access to the 75 watt hour battery made up of cylindrical cells. We also get the brush holster and its motor. To get to the rest of the hardware it's a bit more complicated. With the aesthetic white exterior finally removed we get a detailed look at the brains of the whole operation. We have small motors up front for the rotating bristles and the spinning purple lidar unit up on top just like we see on some self-driving cars. It's interesting, there's a large singular motor on the back that's spinning both of the triangular mop pads. These also have the ability to be retracted up into the unit when it comes in contact with carpet like we saw earlier. It's a very densely packed piece of tech. Lots of moving parts and gadgets all working together. This also isn't Narwal's first rodeo. As a top three high-end robot mop brand in North America, and serving a million and a half families globally, they've had time and experience to make something really cool here. And I'm hoping that it all goes back together in one piece. [Turning on sounds] Turning on is a good start. -[Robot voice] Starting vacuuming task. -If you're looking for a personal self-cleaning robot vacuum of your own, I'll leave a link down in the video description with, I think, a pretty hefty discount. -And we'll keep you posted on our newest edition, even though I'm pretty sure she's not arriving with a self-cleaning mode. -But that's okay. -Thanks a ton for watching. -We'll see you around.",
    "transcript_keywords": [
        "mop",
        "Freo",
        "clean",
        "robot mop",
        "Narwal Freo",
        "mop brushes",
        "vacuum",
        "triangular mop",
        "Narwal",
        "robot",
        "brushes",
        "back",
        "mop pads",
        "base station",
        "house",
        "water",
        "top",
        "triangular mop brushes",
        "dirt",
        "thing"
    ],
    "transcript_entity_values": [
        "just 7 minutes",
        "the clean water tank",
        "about 90%",
        "Freo",
        "9",
        "2 weeks",
        "Cambry",
        "two",
        "Siri",
        "three",
        "up to 100%",
        "Narwal",
        "Philips",
        "North America",
        "one",
        "75 watt hour",
        "a million and a half",
        "night",
        "first",
        "second",
        "the Narwal Freo",
        "The last month",
        "800 square feet",
        "LCD",
        "month 9",
        "Dirt Sense",
        "Narwal",
        "The Narwal Freo",
        "Edge Swing",
        "Freo",
        "the day",
        "2"
    ],
    "transcript_entity_types": [
        "TIME",
        "LAW",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "LOC",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.14670808613300323,
        -0.029325777664780617,
        0.041110407561063766,
        0.012507452629506588,
        0.008141158148646355,
        -0.04622459039092064,
        0.03520433232188225,
        -0.023638779297471046,
        -0.04661010950803757,
        0.03784562274813652,
        0.037456341087818146,
        -0.020284565165638924,
        -0.024688800796866417,
        0.034873124212026596,
        0.02142280712723732,
        0.03952966257929802,
        0.060745395720005035,
        0.06734807044267654,
        -0.07273793965578079,
        0.009433203376829624,
        0.03121364302933216,
        -0.05067313835024834,
        0.118414968252182,
        -0.052783045917749405,
        -0.06536772847175598,
        0.0826968103647232,
        -0.03795560821890831,
        -0.008399519138038158,
        0.01813981495797634,
        -0.05158889666199684,
        0.05739295855164528,
        0.03202082961797714,
        0.03507378697395325,
        -0.030247731134295464,
        0.09285473823547363,
        0.026456594467163086,
        -0.03831234201788902,
        0.04429712891578674,
        0.00780881941318512,
        -0.010518481023609638,
        -0.026109157130122185,
        -0.04153083264827728,
        0.026555392891168594,
        -0.05377981811761856,
        -0.05555912107229233,
        0.012360434047877789,
        -0.01261064037680626,
        -0.08792642503976822,
        0.04337014630436897,
        -0.0029843677766621113,
        -0.050857335329055786,
        -0.0056922538205981255,
        0.0852062851190567,
        0.020993925631046295,
        -0.029041001573204994,
        0.004852650221437216,
        0.04913564398884773,
        -0.08468441665172577,
        -0.005435753148049116,
        -0.033450111746788025,
        0.0006589321419596672,
        0.03725825250148773,
        -0.024166760966181755,
        -0.003411961253732443,
        0.017658650875091553,
        -0.012382100336253643,
        0.024290703237056732,
        -0.0799049511551857,
        0.009085890837013721,
        0.016832983121275902,
        -0.06870769709348679,
        0.033449772745370865,
        0.02648232690989971,
        0.08244986832141876,
        -0.035811156034469604,
        0.029558490961790085,
        -0.010645344853401184,
        -0.018299732357263565,
        0.03951394185423851,
        -0.04106191545724869,
        -0.018113359808921814,
        -0.040318332612514496,
        0.00946201290935278,
        0.025986047461628914,
        -0.05471918359398842,
        0.05776171386241913,
        0.0011040844256058335,
        0.0019878046587109566,
        0.026815811172127724,
        -0.06458218395709991,
        -0.03250392526388168,
        -0.009457812644541264,
        -0.008591515943408012,
        -0.038151707500219345,
        -0.053773559629917145,
        -0.06656289100646973,
        -0.05287890508770943,
        -0.05583991855382919,
        -0.06863861531019211,
        0.031367819756269455,
        -0.07968174666166306,
        0.047029122710227966,
        0.03755231946706772,
        -0.05203628167510033,
        0.031985752284526825,
        -0.008196531794965267,
        -0.0008904438000172377,
        -0.018915625289082527,
        -0.01077287457883358,
        0.0718068927526474,
        -0.04102695360779762,
        -0.04231732711195946,
        0.014312664046883583,
        0.06291160732507706,
        0.027676688507199287,
        -0.07870479673147202,
        0.044655922800302505,
        0.03146568313241005,
        0.029755277559161186,
        -0.016638733446598053,
        0.07344106584787369,
        -0.10170344263315201,
        -0.11652585119009018,
        -0.003124980255961418,
        0.0627787634730339,
        -0.047793228179216385,
        0.012470424175262451,
        5.833137984670175e-33,
        0.02468027174472809,
        0.10080321133136749,
        0.022795049473643303,
        0.05745331197977066,
        0.004200316965579987,
        0.06205027550458908,
        0.034994158893823624,
        0.012815386988222599,
        -0.008020518347620964,
        0.08943091332912445,
        0.003927635494619608,
        -0.04167027026414871,
        -0.08581776171922684,
        -0.06549963355064392,
        0.03214815631508827,
        0.0036887044552713633,
        -0.059615910053253174,
        -0.09887639433145523,
        0.014873961918056011,
        0.03262213617563248,
        0.07637801766395569,
        0.10358972102403641,
        -0.005052981898188591,
        0.038639578968286514,
        0.07560562342405319,
        -0.026224423199892044,
        0.020711448043584824,
        -0.03466590866446495,
        0.001990086166188121,
        0.006491668056696653,
        -0.022369327023625374,
        0.08138909190893173,
        -0.015111459419131279,
        0.05825217440724373,
        -0.12197604775428772,
        0.02075367420911789,
        -0.054906751960515976,
        -0.048265114426612854,
        -0.0315539613366127,
        -0.005213936325162649,
        -0.12597662210464478,
        -0.03021322377026081,
        0.0027306461706757545,
        -0.08213783800601959,
        -0.00034210484591312706,
        -0.014333640225231647,
        0.02623175084590912,
        0.010962173342704773,
        0.03009158745408058,
        0.014248046092689037,
        0.07008195668458939,
        0.03707108646631241,
        -0.011245258152484894,
        -0.037856556475162506,
        -0.1000877320766449,
        -0.016366509720683098,
        0.025478480383753777,
        -0.08666683733463287,
        0.009507509879767895,
        0.016484439373016357,
        0.03451566398143768,
        -0.010361071676015854,
        0.030076706781983376,
        0.007583911065012217,
        -0.007805994246155024,
        -0.10051292926073074,
        0.12017960101366043,
        0.09302283823490143,
        0.047097060829401016,
        0.015599527396261692,
        -0.06703341752290726,
        0.0527125783264637,
        -0.03541611135005951,
        -0.08149071037769318,
        -0.02342768758535385,
        -0.004983128048479557,
        0.0275204349309206,
        -0.10609450191259384,
        0.0064057051204144955,
        -0.04642058536410332,
        0.023215122520923615,
        0.05485222861170769,
        0.05085105448961258,
        -0.003126982133835554,
        0.031525325030088425,
        -0.07386057078838348,
        -0.05445754528045654,
        0.0775238648056984,
        -0.048509448766708374,
        -0.01501575019210577,
        -0.04087211936712265,
        -0.02519318461418152,
        0.016929389908909798,
        0.030341360718011856,
        0.005850241519510746,
        -7.331840384722805e-33,
        0.11194431036710739,
        -0.0038550342433154583,
        -0.0009217378683388233,
        0.043878838419914246,
        0.006428899243474007,
        -0.023788293823599815,
        0.02640252374112606,
        -0.0007046490791253746,
        -0.015294247306883335,
        -0.006202302407473326,
        -0.06961304694414139,
        0.07239869236946106,
        0.07245449721813202,
        -0.062410127371549606,
        0.0543043352663517,
        0.020717715844511986,
        -0.006093502510339022,
        -0.010271172039210796,
        -0.029451677575707436,
        8.697747398400679e-05,
        0.034830693155527115,
        0.09014060348272324,
        -0.0915294736623764,
        0.034454669803380966,
        0.024722032248973846,
        -0.010979188606142998,
        -0.03765324503183365,
        0.10057850182056427,
        0.0025485719088464975,
        -0.008249468170106411,
        -0.08711234480142593,
        -0.005805229302495718,
        0.06673966348171234,
        -0.03861565142869949,
        0.039836250245571136,
        -0.07056492567062378,
        -0.0455525666475296,
        0.010465112514793873,
        -0.049050480127334595,
        -0.033287063241004944,
        0.02074185572564602,
        -0.0581127367913723,
        -0.030565999448299408,
        0.055663950741291046,
        -0.036632947623729706,
        -0.015621948055922985,
        -0.021160170435905457,
        0.0239421296864748,
        -0.06725207716226578,
        -0.0045198420993983746,
        0.03422597423195839,
        0.013940416276454926,
        -0.12164997309446335,
        -0.06290389597415924,
        0.04368472844362259,
        0.1619168221950531,
        0.04871036112308502,
        -0.06288747489452362,
        -0.030231451615691185,
        0.08652961254119873,
        -0.02767607383430004,
        0.10256416350603104,
        -0.05379871279001236,
        0.10066761076450348,
        -0.084502674639225,
        -0.012116079218685627,
        0.051755838096141815,
        -0.01097794622182846,
        -0.039146166294813156,
        0.011665409430861473,
        -0.04192296043038368,
        0.08231421560049057,
        0.08306248486042023,
        -0.05690700188279152,
        0.027351463213562965,
        -0.04468682408332825,
        -0.01025815773755312,
        -0.07456237822771072,
        0.027093827724456787,
        -0.00998628232628107,
        -0.007382194511592388,
        -0.0520920604467392,
        0.06845264136791229,
        0.03406715765595436,
        0.015114383772015572,
        -0.023316260427236557,
        -0.07821571081876755,
        -0.001389403361827135,
        0.01497127115726471,
        -0.027609808370471,
        -0.005460720043629408,
        0.007052422966808081,
        0.061852965503931046,
        -0.011865736916661263,
        -0.0015609440160915256,
        -5.859394391904971e-08,
        0.045106951147317886,
        0.03060506284236908,
        0.011474561877548695,
        -0.037871599197387695,
        0.08358132094144821,
        -0.057190682739019394,
        -0.0011959007242694497,
        0.10645121335983276,
        -0.03105197101831436,
        -0.020306866616010666,
        0.04349550977349281,
        0.052878815680742264,
        -0.01936602219939232,
        0.11324536800384521,
        0.026569902896881104,
        0.059888675808906555,
        0.04706711322069168,
        -0.0009477187413722277,
        -0.01462556328624487,
        -0.029101962223649025,
        0.000996375223621726,
        -0.0755339115858078,
        0.07182206213474274,
        0.0696377083659172,
        -0.043349526822566986,
        -0.049432963132858276,
        -0.12890170514583588,
        -0.005535709671676159,
        0.005748063791543245,
        0.038085754960775375,
        0.0019306071335449815,
        -0.049587786197662354,
        0.024161623790860176,
        0.0560101754963398,
        -0.025547601282596588,
        0.010765702463686466,
        -0.035572681576013565,
        -0.01776592805981636,
        -0.01379170548170805,
        0.015623591840267181,
        0.05865142121911049,
        0.035495419055223465,
        -0.05456053093075752,
        -0.007051549851894379,
        -0.0670228973031044,
        -0.03897161781787872,
        -0.05716392770409584,
        -0.12418495863676071,
        -0.017188239842653275,
        0.019046904519200325,
        -0.07506444305181503,
        -0.028798513114452362,
        -0.05605405196547508,
        0.044072311371564865,
        0.13081571459770203,
        0.058578383177518845,
        -0.01334502175450325,
        -0.06825698167085648,
        -0.0030143491458147764,
        0.141611710190773,
        -0.006706148851662874,
        -0.016879495233297348,
        0.025546271353960037,
        -0.017970522865653038
    ]
}