{
    "id": "xrlnMpYGwb8",
    "title": "Keyboard Monitor MYSTERY TECH!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-06-01T18:05:14Z",
    "video_url": "https://www.youtube.com/watch?v=xrlnMpYGwb8",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "how to waste",
        "amazon",
        "tech",
        "unboxing",
        "austin",
        "austin evans",
        "play date",
        "playdate",
        "genki shadowcast",
        "genki",
        "shadowcast",
        "shadow cast",
        "ficihp",
        "hoverpen",
        "heineken",
        "this is",
        "denki"
    ],
    "views": 1226733,
    "likes": 36655,
    "comments_count": 781,
    "description": "Check out the Heineken Closer!  Today on Mystery Tech things get a little steamy   Hovering UFO Speaker on Amazon:   Ficihp Keyboard Display on Amazon:  Novium Hoverpen 2.0 on Amazon:   Genki ShadowCast on Amazon:  Playdate:  SereneLife Portable Sauna on Amazon:    By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe to Ken's channel @Denki!  More shenanigans on @thisis:   My new F1 show @TheBackmarkers!  Subscribe for more!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://austin.tech/closer",
        "https://austin.tech/ufospeaker",
        "https://austin.tech/ficihpkeyboard",
        "https://austin.tech/hoverpen",
        "https://austin.tech/genki",
        "https://austin.tech/playdate",
        "https://austin.tech/portablesauna",
        "https://www.youtube.com/denkitime",
        "https://www.youtube.com/thisis",
        "https://www.youtube.com/channel/UC6xg3-DQKl7-NL5TReUhs7g",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- I'm sensing something, it's coming quickly. There's an item on the way from \"Mystery Tech\". I can feel it, it's gonna come out of the table. I caught it. Levitating Bluetooth speaker. You got me a UFO speaker? - [Matt] Yes. - All right, I'm down. - [Matt] Woo. - So we've got the actual speaker itself, which looks very unidentifiable. - [Ken] (laughs) It does actually look like a UFO. - Whoa, oh. - [Matt] Oh. - That's kind of cool. - Okay. I don't think I did that right. - [Matt] That's not how you do... - All right, maybe I should read the instructions. So I need to hold it slightly above, move it vertically and then release it, okay. So I'm gonna carefully position this. Well, it's leveling, it's almost like zero gravity. Oh no, no, no, stay in the middle, stay in the middle. Stay, stay. Stay. Stay! - I guarantee you I will get it first try. - Go ahead. - Just gotta find the point. (speaker clunks) (Austin and Ken laughing) Never mind, I lied. - All right, watch, Matt's actually gonna do it first try. I believe in Matt. - [Ken] How many Overclock employees does it take to put? - We don't have enough. (speaker clunks) - Okay. - We're already overheated. - Hold, hold, hold, hold on, okay, okay. Plan B, plan B, plan B, plan B. - [Matt] Okay, it's floating. - Yeah, we did it. - Edit team, you can composite this in After Effects? (speaker whirring) That was not a fun. - Did you make that noise? - No, that was not a fun sound. - It's overheating. Okay. - Woo, woo. Oh, oh, oh, wait, wait. Oh, that was it. Here, here, here, here, ready, you ready? - Yeah. Oh. - Let's go. Oh, it's vibrating. (spooky music) - Is this video sponsored by the aliens? - [Ken] How that's what you went to, the only thing that goes through Austin's mind is, \"What's the sponsor for this video?\" And after meeting Austin they immediately said, \"There's no intelligent life on this planet.\" (Austin laughing) - [Ken] Dibs. I didn't even get it out the box yet, you can't call dibs. The Ficihp K2, multifunctional touch keyboard. What the Ficihp is this? - [Matt] Oh, that's a chunky. - Okay. This feels nice. You know what this reminds me of? Are the Asus laptops that have the screen. - [Ken] Oh, you're right. - With a ergo lift and whatnot. - [Ken] Yeah, but this has a real keyboard on it. - It does, yeah, obviously that's a full mechanical keyboard. Although that feels like a $30.00 mechanical keyboard. Theoretically, if I plug this single USB-C cable into a device that has full USB-C with power delivery, and DisplayPort, and everything it will power my display and my keyboard all over one cable. - [Matt] Oh. - [Austin] Immediately the Ficihp shows up. - [Ken] I just kind of wish that the screen would tilt up more. - It doesn't, yeah, yeah, yeah. And it's also not a touchscreen. Oh, it is a touchscreen. - [Ken] It is a touchscreen. - Oh. - [Ken] Yeah, that I remember seeing. (keyboard clicking) - [Ken] Yep, those are blues. - For $400.00 I would expect a nicer keyboard. The keyboard itself very much feels like a $50, generic blue special that you can get on Amazon. - [Ken] One last thing that I want to check. - Yeah? To make sure they're actually blues? - Well, no, not so much that. - [Matt] If they're hot swappable. - If they're hot swappable. - Oh, interesting. - [Matt] You can hot swap. - Oh, it's still expensive. The fact that it's hot swappable though actually kind of interesting. I'm not gonna pitch another Denki video but Ken, you should make a Denki video on this. - I will, I'm gonna make a video. - Make the ultimate version of this. - The weirdest keyboards I could find. - All right. Don't subscribe to Denki, subscribe to This Is. Is C cam focused? - [Ken And Matt] Yes. - Are you sure? - [Ken] Yes. - Can people see me in 4K? - [Jared] I wish they couldn't. - Okay. I just double check. What the? Hover pen, Hover Pen 2.0: Interstellar Edition, meteorite embedded version, 18 karat gold plated ball point pen, starlight silver. Those were some expensive words. Ooh. Oh my goodness, wow. Ken knows me, Ken knows that this is the kind of that appeals to me. I'm assuming this little thing in the end is a chunk of meteorite. (Austin sniffing) - [Ken] What does it smell like? - It doesn't smell like space. - [Ken] How do you know what space smells like? - And then I've got a little stand for it. So do I? Okay, this is... This is a complicated three-dimensional shape. All right. So... Oh my gosh, okay. - [Ken] No, no. - [Matt] You people have too much money. (mellow music) There you go. Oh, yo, okay that's cool. That's pretty cool. If I were a hovering meteorite pen how much would I cost? $169.95. - [Ken] You know what the funny thing is? Is that it's actually cheaper than that. - Okay. - It's a $100.00 for the base model. (glass shattering) - Is this the point where you tell me that this is not the base model? - [Ken] Yes, the meteorite version costs $400.00. - You know I'm all for mystery tech, this is not the way I usually start an episode of \"Mystery Tech\". But you know what? I'm out here for it. - [Jared] It's only 11 o'clock a.m. - It's five o'clock somewhere Jared Jared. - [Jared] Whoa. - You almost hit the Heineken. My friends, this is a momentous occasion on \"Mystery Tech\", because we have a very special sponsor. Heineken have created a brand new product, they have given me early exclusive access to. This my friends is the Closer. Now, it might look to an ordinary civilian like a bottle opener. But oh no, it is so much more. I'm gonna start working on my monthly report, (sighs) look at all this nonsense. Ken you've spent so much money on \"Mystery Tech\", do you see these numbers? They're going up not down, that's bad. It's five o'clock it's time to unwind, and experience what the Closer has to offer. (laughs) It actually worked. My computer's asleep. The way the Closer works is actually really interesting. There's no actual physical thing that's happening here, instead when you actually have it connect with the bottle cap, it completes the circuit which therefore sends the signal. Yeah, see, it's asking if you wanna shut your computer off, obviously I don't wanna do that 'cause I'm not gonna touch it again. Well, cheers to not working past five o'clock, 'cause that's unhealthy and you should work on your work-life balance. Enjoy the beer every once in a while. Yo, did you see that? Did you see that? Did everyone see that? Can we get a slow motion replay of that one? This is the ShadowCast Console Laptop Link. Is this like reverse HDMI? A capture card to get your game console to show up on your laptop display. - [Matt] Yes. - Wow, that is very small. It's literally HDMI on one side, USB-C on the other. - [Ken] Who needs xCloud when you have xWired. (Austin laughing) - Okay, you got me on that one. I'll say when you have it in favor performance the quality looks like 480p, favoring resolution looks a lot nicer. (computer chiming) Got it. All right, let's see. Oh wow, that immediately feels bad. (car whirring) There's definitely several frames of latency. Obviously we're watching this at 24 frames on the preview, but no, I'm getting like 20 FPS right now. - [Ken] Ooh. - Yeah, I'll switched to favor performance, all right? And I'll see how that goes. Oh, there's still latency. You're using OBS, really? - [Ken] Mm-hmm. - [Austin] Is OBS gonna be better. - [Ken] So what I'm gonna do is I'm gonna add the Genki as a video capture source. Just try that out. Latency seems a little bit better, performance seems to be about the same where I do feel like I'm dropping frames. This is actually not even as performant as a lot of Cloud gaming. All of those feel better than this. It's a cool idea, but I think the premise is a little bit flawed. For some games if you don't care about that really quick response time, this is probably fine. But the fundamental limits of the technology mean that even in the best case scenario you're only gonna have so much performance. It's certainly not gonna be as good as plugging an HDMI cable into a display. - [Ken] So that's a... - That's an L you could say. - [Ken] That's an L. - What do we got from \"Mystery Tech\" today? A Playdate. Ooh, okay. So if you're not familiar the Playdate is a tiny, little, I would almost say Game Boy-like console, but it doesn't play emulated games or anything like that. It actually plays its own specific titles. Now this is made by Panic who have traditionally been more of a game developer, but this is the first time I believe they've actually gotten into hardware. - [Ken] My favorite band. - Panic At The Disco? - [Ken] Yes. I chime in with a haven't you people ever heard of Closing the goddam door, oh - [Jared] Well, at least we don't worry about copyright. (Austin laughing) Ooh. Okay, All right. What lovely packaging. Have fun, I think I will. First thoughts, this hardware feels incredible. So it's plastic, right? But it's like that sort of higher quality, almost grippy kind of plastic. And you've got the little spinney dial thing, which is not the way to charge it. But it's actually the way that you can actually interact in some games. - [Ken] If that was the only way to charge it I'd be... - Hang on, I gotta play mom. I gotta charge it for one more minute. Compared to an original DMG, it is obviously a lot smaller, but it's a much sort of wider aspect ratio. - [Ken] 16:9. - (sniffs) It smells very slightly like plastic if I really get you get in there and just (sniffs). - [Ken] Okay, well... - [Matt] Okay, it's not a pile of (beep). Oh, here we go. Oh, that's sweet. That's so cool. (console playing music) - I love the haptic sounds. (console playing music) The thing that jumps out to me most about the screen is the fact that it's not backlit. We're in a studio environment right now, so we have a lot of lights, which makes it really easy. I think this could get annoying if you are not in a well lit environment. I have two games built in right now, although it will download more every seven days. All right, crank to turn, okay. Gnarly bro. Woo. Oh, unawesome. All right, I'm start to get the idea though. It was really just the crank, and I just move left and right. - [Ken] Yeah buddy. - Yeah boy, let's go. Let's go, rad bro, let's go. Let's go. The Playdate is super weird, right? It's one of these things that is incredibly quirky, you might play it for a few hours never touch it again, it's totally possible. But this is fun, these games are totally unique, and while you're probably not gonna waste 10 hours and play through a campaign on something, it's not that kind of game. But the fact that you're getting games constantly updated to this. It also is apparently easy for you to actually develop, I'm assuming that third parties are gonna be making Playdate stuff. While I love something like the Analogue Pocket, that's just a better way to play games that I've played for decades. This is something which is all new, not only with the actual input method, but the kinds of games and the actual hardware. It's like nothing like you've ever played before. - [Ken] It's a shame that Austin's never gonna touch it again 'cause there's no Pokemon on it. - No, you know what I'm gonna do? - [Ken] What? - I'm gonna take it all the way over to This Is, and make an entire video. Check it out, subscribe to This Is. - [Ken] What's better than a good life? - A great life. - [Ken] A Serene Life. - Ken looks really excited right now, that's never a good sign. - [Matt] 'Cause you know he's gonna take this immediately. - No, I have no room for this. - Look at Ken's face. Look how excited he is right now about this. - [Matt] I have no room for the thing I'm about to steal. - What is this? So I've got a nice foam mat. - [Matt] I'm Matt. - [Ken] Yeah, Matt's over there. - Am I building a tent, is a warming tent, an incubation pod? Do I grow (censored) in this? This is a deluxe personal therapy detox heated home sauna. How much was this? There better not be four digits in what you're about to say. - There's five digits. - Including the cents? - [Ken] Yes. - $342.53. - Okay. - [Matt] So just go ahead and sit down, sit right in. - I feel like I have a lot of clothes on for a sauna, I'm gonna get really sweaty. - [Matt] We don't want you to take your clothes off. We're gonna go ahead and zip you in here. - Okay. - You feeling good? - I feel like I'm in a quarantine unit. - [Matt] All right, turn on the oven. - Oh my God, why is it red? Why is it red? I don't know like the fact that it's wiggling. - [Ken] It's wiggling? What? - Matt is over here wiggling it right now. - [Ken] Matt's literally right over here dude. - It is now up to 82 degrees. I don't believe that, I think it's a lot warmer than 82 degrees in here. - [Ken] Celsius. - Then I'm dead. (group laughing) - [Ken] You can just flat out see the sauna compared to everything else. The ambient room temperature is 27 degrees Celsius, how hot is this thing right now? - [Matt] 86 degrees Celsius, by the way, on the panels. - These panels are not something I want to touch, even having my hands in front of it, it feels like my hands are in front of the oven right now. This is proper toasty. I gotta say, this is one of the few \"Mystery Tech\" items that has legitimately surprised me in a really, really positive way. It looks dumb, it's such a weird idea, but for a pretty reasonable price this is a real sauna. I am proper, I don't know if you can tell, but I'm proper sweating, which makes sense. I am super happy with this right now. This is great. - [Ken] So if you're super happy with it we can keep you in there, right? - No. - So you guys wanna go? - Let's go, let's go. - [Jared] Have a good one Austin. - Don't leave me. - Oh, camera are you gonna come too? Joanna, come on. Yeah, yeah. - [Ken] Bye Austin, bye, goodbye. - I'm all alone, they've left me.",
    "transcript_keywords": [
        "Mystery Tech",
        "Yeah",
        "Tech",
        "Mystery",
        "thing",
        "games",
        "coming quickly",
        "keyboard",
        "Matt",
        "Ken",
        "video",
        "stay",
        "Austin",
        "make",
        "feel",
        "feels",
        "lot",
        "game",
        "Playdate",
        "hold"
    ],
    "transcript_entity_values": [
        "OBS",
        "Ficihp",
        "Asus",
        "monthly",
        "Cloud",
        "decades",
        "one more minute",
        "only 11 o'clock a.m. -",
        "third",
        "three",
        "Ken] Celsius",
        "86 degrees Celsius",
        "xCloud",
        "20 FPS",
        "USB-C",
        "first",
        "Amazon",
        "five o'clock",
        "Ken",
        "Jared Jared",
        "Austin",
        "Ken] Dibs",
        "a few hours",
        "Ficihp K2",
        "two",
        "Matt",
        "30.00",
        "10 hours",
        "50",
        "HDMI",
        "four",
        "4",
        "Pokemon",
        "Austin",
        "one",
        "Hover Pen 2.0: Interstellar Edition",
        "Ken] Mm-hmm",
        "Genki",
        "18",
        "169.95",
        "five",
        "Joanna",
        "DisplayPort",
        "342.53",
        "400.00",
        "more every seven days",
        "Ken] Ooh",
        "Heineken",
        "Ken] Matt's",
        "almost like zero",
        "the Analogue Pocket",
        "Yo",
        "100.00",
        "the ShadowCast Console Laptop Link",
        "27 degrees Celsius",
        "Denki",
        "Mystery Tech",
        "24",
        "today",
        "First",
        "82 degrees",
        "Game Boy"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "TIME",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "TIME",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "NORP",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.11854220926761627,
        -0.05223647877573967,
        0.04372880235314369,
        -0.04221367835998535,
        0.031715985387563705,
        -0.04579731076955795,
        0.08834591507911682,
        -0.0323345810174942,
        0.050032444298267365,
        -0.01511523500084877,
        0.07799085974693298,
        -0.01074378751218319,
        0.007647982332855463,
        -0.007808267138898373,
        -0.09484098106622696,
        -0.024607539176940918,
        0.08723394572734833,
        -0.07748199254274368,
        -0.011239301413297653,
        0.010936204344034195,
        -0.043116044253110886,
        0.028077490627765656,
        -0.022551055997610092,
        0.022294336929917336,
        0.011886730790138245,
        0.04152720421552658,
        0.01852567307651043,
        -0.03973611444234848,
        -0.05005994066596031,
        -0.041744206100702286,
        -0.05141349509358406,
        0.09158025681972504,
        -0.03750434145331383,
        -0.02059018798172474,
        0.03024698793888092,
        -0.023286348208785057,
        0.06216546520590782,
        -0.04110204428434372,
        -0.022972771897912025,
        -0.07166572660207748,
        -0.0612962581217289,
        -0.08017529547214508,
        0.04435744881629944,
        0.017398031428456306,
        -0.03173144534230232,
        -0.0002478286623954773,
        -0.045127224177122116,
        -0.07744383066892624,
        0.017323628067970276,
        0.007414474152028561,
        -0.06027916446328163,
        -0.05919249355792999,
        0.12392649054527283,
        0.03271159529685974,
        -0.00938358623534441,
        0.047497138381004333,
        0.039528485387563705,
        0.0004952044109813869,
        0.07376858592033386,
        -0.006868291180580854,
        0.03528763726353645,
        -0.03392218053340912,
        0.02535332925617695,
        -0.016183743253350258,
        0.024089006707072258,
        0.05069047957658768,
        -0.08263839781284332,
        -0.03390609845519066,
        0.03989585489034653,
        -0.005943154916167259,
        0.06268037110567093,
        -0.028830979019403458,
        0.03444000706076622,
        0.013372296467423439,
        0.1255980283021927,
        0.014525707811117172,
        0.0375947430729866,
        -0.07861984521150589,
        0.05395999923348427,
        0.0113247474655509,
        0.04110744222998619,
        -0.007246091030538082,
        -0.01745733991265297,
        -0.03686826303601265,
        0.02794610895216465,
        0.000694749120157212,
        0.014098119921982288,
        0.008559702895581722,
        -0.07158785313367844,
        -0.02529839798808098,
        -0.10155876725912094,
        -0.05885778367519379,
        -0.06542718410491943,
        -0.03033575788140297,
        -0.012264067307114601,
        -0.020947758108377457,
        0.019508954137563705,
        -0.01244521513581276,
        0.005015211179852486,
        0.08011605590581894,
        0.04882672801613808,
        0.021731412038207054,
        0.03324489668011665,
        -0.04089781269431114,
        -0.04059182479977608,
        -0.06255455315113068,
        -0.048046138137578964,
        0.042934197932481766,
        0.08282347768545151,
        -0.034656208008527756,
        0.022501815110445023,
        -0.00165562704205513,
        -0.05196714401245117,
        0.017503229901194572,
        -0.05738683044910431,
        0.0693768635392189,
        0.0031969884876161814,
        0.05773384869098663,
        0.007690430618822575,
        -0.025498874485492706,
        0.04344942420721054,
        0.009738816879689693,
        -0.044664859771728516,
        0.037332408130168915,
        0.034152645617723465,
        0.05121782794594765,
        -0.08842745423316956,
        3.500023409313822e-33,
        0.04769299179315567,
        0.081090047955513,
        -0.040396299213171005,
        -0.04458243027329445,
        0.035628195852041245,
        -0.04439350962638855,
        -0.04385250806808472,
        0.10600004345178604,
        -0.014868371188640594,
        0.062365517020225525,
        -0.03673551604151726,
        0.05026143416762352,
        -0.020474953576922417,
        -0.055170655250549316,
        0.0009160747285932302,
        -0.10022615641355515,
        -0.04027249664068222,
        0.010539185255765915,
        -0.06514842808246613,
        -0.04643673077225685,
        0.05466689169406891,
        -0.007342019584029913,
        0.004496656823903322,
        -0.004629997070878744,
        0.07290947437286377,
        0.0410289391875267,
        -0.016955969855189323,
        -0.003330731764435768,
        0.05213243514299393,
        0.053776517510414124,
        -0.07045648247003555,
        0.07267803698778152,
        0.03411237522959709,
        -0.06778091937303543,
        -0.03684689849615097,
        -0.05936044827103615,
        0.003363401861861348,
        -0.05221617966890335,
        0.0007918648771010339,
        -0.059976786375045776,
        0.010792807675898075,
        0.03281345218420029,
        -0.045692138373851776,
        0.012685111723840237,
        -0.007930856198072433,
        -0.028553584590554237,
        0.044508762657642365,
        0.02115020342171192,
        0.06325135380029678,
        -0.005667626392096281,
        -0.1138358786702156,
        -0.02376282401382923,
        0.03424812853336334,
        -0.0015194234438240528,
        0.048969633877277374,
        -0.07976315170526505,
        0.025469420477747917,
        0.012269601225852966,
        0.09820964932441711,
        -0.002116829389706254,
        0.0648927316069603,
        0.06124481186270714,
        0.04073554277420044,
        -0.03294020891189575,
        -0.005867925938218832,
        9.406221215613186e-05,
        -0.00676009152084589,
        0.03461967781186104,
        -0.0448453314602375,
        0.010220339521765709,
        -0.04637705162167549,
        -0.01072514895349741,
        -0.009238592348992825,
        -0.014342591166496277,
        -0.026217209175229073,
        -0.011077783070504665,
        -0.039016690105199814,
        -0.020383037626743317,
        -0.011689122766256332,
        -0.060388799756765366,
        -0.0157085619866848,
        -0.046513304114341736,
        0.038499560207128525,
        0.026486363261938095,
        -0.07142940163612366,
        -0.018654055893421173,
        -0.03805262967944145,
        -0.07390905916690826,
        -0.05010640621185303,
        0.010166334919631481,
        -0.0003312282497063279,
        0.005933036096394062,
        -0.0775475725531578,
        -0.0017958651296794415,
        -0.07855358719825745,
        -5.00078365916436e-33,
        -0.006654197815805674,
        0.005345913115888834,
        -0.06936641037464142,
        0.0002899996470659971,
        0.01258019357919693,
        -0.055649228394031525,
        0.0005743764922954142,
        0.06480573862791061,
        -0.009260873310267925,
        -0.05049673840403557,
        0.03785128518939018,
        0.04450599104166031,
        -0.03927736356854439,
        -0.07739657908678055,
        -0.012150433845818043,
        0.034956492483615875,
        0.02440376579761505,
        0.002313371980562806,
        0.05490581691265106,
        0.05570580065250397,
        0.053232599049806595,
        -0.018062325194478035,
        -0.05370691418647766,
        0.01066485233604908,
        -0.014358431100845337,
        0.058358512818813324,
        0.1120462417602539,
        0.041176315397024155,
        -0.03731502965092659,
        0.033670276403427124,
        -0.03418999910354614,
        0.03338127210736275,
        0.02282858081161976,
        0.0357092022895813,
        0.03394780680537224,
        0.014067353680729866,
        0.05798789858818054,
        -0.06391587853431702,
        -0.026595275849103928,
        -0.08847209811210632,
        0.057942941784858704,
        0.11626406013965607,
        -0.021887551993131638,
        0.046788133680820465,
        -0.02221061661839485,
        -0.01963372901082039,
        -0.07174401730298996,
        0.056225501000881195,
        0.017926659435033798,
        -0.029749875888228416,
        0.0802076980471611,
        -0.046538736671209335,
        0.02595575712621212,
        -0.05337599292397499,
        -0.1625576764345169,
        0.006603391375392675,
        -0.05106765776872635,
        0.041097067296504974,
        0.020539917051792145,
        0.06464553624391556,
        0.07363366335630417,
        0.0045949965715408325,
        -0.00044432314462028444,
        -0.060910437256097794,
        0.0005852450267411768,
        0.023066792637109756,
        0.0798480436205864,
        0.08413617312908173,
        0.04170965775847435,
        0.010549920611083508,
        0.071135014295578,
        -0.010272937826812267,
        -0.016916019842028618,
        -0.02469315566122532,
        0.056243833154439926,
        0.04592574015259743,
        0.013263015076518059,
        -0.0834079384803772,
        -0.023534264415502548,
        -0.04124237969517708,
        0.04653899744153023,
        -0.011502303183078766,
        0.09192294627428055,
        -0.024269502609968185,
        0.11966795474290848,
        0.06146072596311569,
        -0.05370353162288666,
        0.05134619399905205,
        -0.08772699534893036,
        0.02002609148621559,
        -0.0058877174742519855,
        0.03862921521067619,
        -0.05221128091216087,
        0.05270515754818916,
        0.07921068370342255,
        -6.528593132770766e-08,
        0.03680335730314255,
        0.03399662673473358,
        -0.04621141031384468,
        -0.06204542890191078,
        0.015878476202487946,
        -0.09593483805656433,
        0.03417154401540756,
        -0.07430074363946915,
        -0.013684897683560848,
        -0.093577079474926,
        -0.05422090366482735,
        -0.11321882158517838,
        -0.03726866841316223,
        0.045952435582876205,
        0.0915234312415123,
        0.07467404007911682,
        -0.1332586258649826,
        0.0676458403468132,
        -0.0951126366853714,
        -0.022623971104621887,
        -0.010759701952338219,
        0.02083536423742771,
        0.09614099562168121,
        -0.08266856521368027,
        -0.02641298435628414,
        0.028058061376214027,
        -0.024274446070194244,
        0.045957475900650024,
        0.1055145338177681,
        -0.08730679005384445,
        -0.05172450840473175,
        0.0249448474496603,
        -0.049345314502716064,
        0.00039349778671748936,
        -0.007585877552628517,
        0.006452282425016165,
        -0.14430493116378784,
        0.001075120409950614,
        0.007159831002354622,
        0.008312598802149296,
        0.0024263691157102585,
        -0.10138194262981415,
        -0.13309521973133087,
        0.038434628397226334,
        -0.03539971262216568,
        -0.026570018380880356,
        0.07331793755292892,
        -0.0613255575299263,
        0.031050357967615128,
        0.0834573358297348,
        0.011122705414891243,
        -0.058678265661001205,
        0.01215776801109314,
        0.016452644020318985,
        0.014944960363209248,
        0.018787434324622154,
        0.05271238088607788,
        0.01991467922925949,
        -0.032456155866384506,
        -0.03284214064478874,
        0.07043034583330154,
        -0.053890522569417953,
        -0.027470996603369713,
        0.08075778931379318
    ]
}