{
    "id": "XsGzwzLUttQ",
    "title": "MASSIVE OREO UNBOXING! National Oreo Day!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-03-06T16:13:28Z",
    "video_url": "https://www.youtube.com/watch?v=XsGzwzLUttQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "national oreo day",
        "oreo",
        "oreo day"
    ],
    "views": 583696,
    "likes": 14668,
    "comments_count": 1438,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and I'm here with my two sisters. This is Jenna and this is Bree. - Hello. - Hi. - Did you know that I have another sister? - I did, I did though. - Here I am, here I am. - This is Bree, she is Bree. That's the only way that we can explain it. But one thing about Bree that you need to know is that she loves Oreos. - I do - Okay if you think that Jenna likes Oreos, Bree, we used to go on vacation there would be like a pool area and I'd be up on the upper level deck and I would try to throw Oreos into your mouth, into the pool, while you would lay there. - I don't remember that. - Wow, lazy. - That's because you weren't there. - Where was I? - I was. Probably taking a nap. - Yeah, I was gonna say I was probably taking a nap. - You seemed super interested. - I'm interested. - Oh, by the way, it's National Oreo Day. That's why we're making this video. - Whoa-ee! - Yes! - No way? - Wait, let me double check if its national or international. - Hey, Siri. - I don't have a Siri. - National, definitely not international. - You, are you saying that Oreos aren't international? National Oreo day is, March 6th so be ready to observe by having your glass of milk handy as it is National Oreo Cookie Day. This day is recognized across the nation each year on March 6th. - I'll celebrate privately. - Interesting. - No you are celebrating now publicly. - I'll celebrate privately. - Let's celebrate. - First thing we are gonna open. What do you wanna open first? - This! - We're gonna save that for last. - Oh my god! - Well, why'd you ask me? - Then don't even ask us, what do you want us to open first? - Fine! Let's open this one. No! - Taking up the most space. - Let's do what you want because Why did you even ask us? - Let's open the more, the music box. Because I am really excited about what's in there. I think it's gonna be cool. - So you know? - I don't know. - She's lying. - She knows. - She peeked. - She looked. - So the first thing we're gonna open is the Oreo Music Box. I have no idea what this is, I basically went on Amazon and I found as many Oreo things as I could. - Oh! Look at this! - Correction - I'll take this for my personal celebrating. - You spin the Oreo! You place a whole Oreo on a turntable. - I love that. - Oh, I thought it was gonna be music - Turn the music box arm to the center of the Oreo, music will begin playing. Whoa! You can play music with an Oreo. (gasps) I love white fudge Oreos. - Me too, they're the best! - It say limited edition and look at this cute little tin. - No, they used to make those all the time. - They did, that's a lie. - Maybe they just brought them back, check the expiration date. Those might be the same ones. - [Justine] Limited edition, here they are. So, everything that came in here was the white fudge Oreos, plus this little container. - [Jenna] Oh I also had a container. - Thins, thins, what's in here? - Oh my gosh! - Thin. - So, you're unboxing it off camera. What (laughs) - She's unboxing it privately. - No there's, batteries are included. - She unboxed it privately. - So Bree unboxed it privately. Here's the music box. - Hmmm, like they cared watching me open it. It's here, it's here, the final product is here. Why'd you need to see the trash? - Oh my Gosh! - Because People, its called unboxing. Oh my gosh, wait, I can record? - But this is the final product. It's all you care about. - It's the final product. - Who cares about the - It's actually a really great point. - I know. - Ah - So, I need to put the Oreo on it to record. - Yeah. - Which kind, Thin? - The Thin! It said the Thin. - Really? - [Bree] Yes the directions. - Oh! - To play, place a whole Oreo cookie on the turntable. - Oh my gosh! These are, these have been damaged. - Those are, we need a big one. - These have been compromised. - Turn (clears throat). Turn the music box arm to the center of the Oreo cookie music will begin playing. Every time you take a bite from the Oreo the song changes. - Oh my God. - Shut up. - There's trash everywhere. - Hmmm - This is real life. - I'm gonna get ants. - [Jenna] You already have cockroaches. - Yeah, but now I'm gonna have ants. - They need friends. - Everyone needs a friend, okay. - Oh, you can record. - Do you have a water? For my pallet. - [Justine] Oh my gosh. (funky music) - Okay, that's pretty cool. - [Justine] I don't even know - That's pretty cool. Now hold on - Wait, wait! I gotta get a close up here. (funky music) - Is that enough time? - I don't, I'm so - Watch. - Wait, oh wait, wait! - No, you take a bite, and it changes the tune. (girls laughing) - Yeah, it doesn't play it. - I might've taken too big of a bite. - Oh no, what have you done, you hog? - No, it says you take a bite. - Who invited you? (laughs) - I, that's what the directions said. - Listen, we really had a good time while it worked. (pop music) - That's a new tune. (singing) - No, cause it says to play the recording turn the arm to the edge of the turn table. (smooth music) - [Justine] It changed, that's something. Basically what's happening is there's little sensors here, so whichever ones are available. - No, this is magic. - Yeah. - Yes, its magic. Don't, you can't give away the tricks. - I know, what is wrong with you. - (singing to music) - Seriously, the more you eat the better the song gets. - [Jenna] Okay, lets go on to the next thing. - You're right. - We should, I'm losing interest quickly. - If we are losing interest, they're losing interest. We're on to the next one. - [Justine] Breanne likes candy canes also. - I don't really but - You don't? - No. - [Justine] Breanne likes candy canes. - Nope, nope, don't really, but - Okay. - [Jenna] They look like zebras. - Here you go, one for you. One for you. How do you eat your candy canes? - I usually don't eat it like this but I really wanna get this. - I actually don't eat candy canes. - I think, you know, its just like a sugar stick. - Just stick it in your mouth. - Oh, I don't like it. - Oh, it kinda smells like wood. - This is like if I licked the carpet. Do not lick it, it is (gagging). Christmas is canceled. - I'm gonna take your word for it and say it sucks. - [Jenna] We did not enjoy that. - Ew, I smell it. (girls humming) It smells like licorice-y. - (gagging) - Alright, on to the dessert pie. - Get this out of here. - I did not like that. - [Justine] Oh, it opens from the side. - [Bree] Oh, imagine. - I didn't wanna tell you that, but I did see that. - Why're there so many knives up here? - Crap, you've knocked me over. - I almost got knocked over by that question. (girls scream) - Oh gosh. - The music box has fallen. - [Bree] It's still good. - These have not been delivered in transit. - Honestly - In premium. - How long have these been sitting in storage? - I don't know. Okay, best by January 27th of 2019. Okay, we're good. So - That's not - That's in the past. - No, we're not good. - Oh, its spoiled. (girls laughing) - All these things spoiled? - I mean I just bought them. - Yes! February 8th 2019. - This is I am so upset, I just bought all of these things on Amazon. I want you to know that someone's getting a bad review. - What? - Okay. - Milkshake gift set? - Yeah. - Okay, what do we do with this little pot? - Wait, we're safe here, June. - But, let's talk about the pot. Look at the little pie. The pie, the pie pot isn't expired. This is cute. - Oh, nice quality. - Yeah, its like Yeah, it's uh, is it ceramic? - Mmhm - You can use that for eggys. - Dishwasher safe and oven safe. Microwave may become hot. Okay, well, dur - You know what's not safe? The expired ingredients. - No! - You can. You can use this as a weapon, like in the cartoons. Do not do that though. - Okay - That's bad. - Well, that's unfortunate. So, basically you're supposed to rinse the pie dish combine the chocolate pudding mix in a small bowl and then you put it in here and you put these little It's spoiled! - All this crap is. - Happy Oreo day, I've been spoiled. - It also, these are, it's all Christmas stuff. Look, it has Christmas decor on the front. - It does have Christmas decor. No that's just a pine tree. - Well, you're just late. Nope, that's Christmas. Look it has, look, look. - No, that's, its a pine tree. - It has Christmas balls. Nope Christmas. It's a gift set. - [Jenna] As, for someone, a gift? - Yeah, for Christmas. - That's a great point. Okay, well - No wonder this is all spoiled. - Everything is spoiled. - Give me something to hold. I'm helping. - So, let me show you me unboxing this. - Oh my God, the sass. - Wow. - Oh my God, the straw! Hasn't Oreo realized that - It's reusable. Nah, don't do that. Let me get this out first. - I get it. I like this, I'm really into this. I love Oreo. - Like, maybe I just have a weak nature. - Here. Push it out. - Huh, like - Oh, see, it's, it's got a little bit of sticky on it. So, this is definitely not - So all you do is add the two Oreo cookies, vanilla ice cream, a half cup milk, blend. - This is not a very high quality Ew, ick. - It's heavy. - Ick. - She said ick. - [Justine] Okay. - [Bree] What was fun about this? - Stop it, you're icky. - I was promised fun. - Are you not having fun? - What was - Stop it! - What was fun about this? - It, this is icky. - Get on with the big one. - Here, eat this. - No, that's expired. Quit trying to poison me! - Oh, is that expired? - Yes! - Why are my This is not expired. - Because it's all Christmas stuff. Yes it is, that's expired. - Ah, its expired! - You know what I used to like to do? Get paper and shoot paper wads. - You're a paper wad. Look at this expiration. Oh, I've been tapped. - Well its better than the January one. - Why is this so upsetting? - Because this is Christmas decor. - Yeah, but like it's supposed to be for Christmas, it's like not that long ago. Okay, lets open the last one. - What's in the box? - This is something that I'm very excited about. Hey Hey? - What? - Get into this. - I'm into it, I'm into it. You lost my interest when I went to open it first. - [Jenna] Whoa, Oreos. - Yes, look. - Oh, those do look good. The most. - Oh, scan the stud, oh stuff. - You scan an Oreo though? - I thought it said the stuff, the stud. You could win, oh, oh! You could win prizes. Oh, but guess, it ends on 3/6. (gasp) We can still win! Okay, wait a minute, you scan an Oreo cookie and you could win over a million dollars in prizes. How do I do it? - Expired prizes. - No! Well, it expires today, 3/6. - Nine - Six. This is so - We missed - [Justine] Okay, put that back in. That's, that's a mess. - I wanted to show them, me unboxing. - So inside are Oh, look at that. - Oh my God. - [Bree] Check the date. - Best before September 2019. - Perfect. - Thank God. Alright, this is something that I think Bree will really be into. - What's in here? - I actually don't think so, but I'm into that. - [Justine] This is the most stuff. Its the most creme ever. - Have they never seen the video that I did where I did a hundred layer Oreo? - Front, front, on the front. - I may have done that. - Top left. So is it June 18th of 19 or 19th of 18? - It's fine. - Don't worry about it. - It's fine. - Is the year 18 or 19? - This wasn't a thing in 2018. - It wasn't. This is new. This is, this is new. Prepare yourself for the most stuff ever. - What if you put a stuffed with a stuffed? - Someone ate one. There's missing stuff. - There are look like there's some missing. - [Jenna] They're missing. - No there's, oh my God. Not even joking - Someone has eaten the Oreos. - Holy, like, you didn't do - I swear, why would I? - No, this was just opened. Guys - I'm not eating that. - They're missing! - [Bree] Those have been tampered with. - [Justine] How many are supposed to be in here? - They've been compromised. - This doesn't even have an end. - This is insane. Look. - This is an Oreo conspiracy. - No, it definitely is because look, this one has one, two, three, four, five. And look, there's missing ones. - They're definitely missing. - I know! - You're gonna have to call Shane Dawson for this! This is a conspiracy! - Shane, Shane! - We need you. - This is a actual conspiracy. This is the most real conspiracy that I've ever seen in my life. No, but like, this is. - [Jenna] I know. - How many are there? - We needa, we need to do some - How many are supposed to be in that? - [Justine] There should be 18 cookies. 12, 13, 14, 15, 16, barely 17. - [Bree] That doesn't even count, that doesn't even have an end. - [Justine] No, it doesn't. - We have been missing a cookie. - Someone definitely ate a cookie. Somebody ate like 3 cookies. - Somebody ate a couple cookies. - I'm not eating those now. - I'm not eating this either. - [Bree] My day's ruined. - My day is also ruined - I was promised Oreos. - [Justine] Wow. - What happens if you put the super thick one on the beat box? (pop music) - [Justine] It's barely in there. - So then this has been real fun. - This is crazy. This is - This This is a conspiracy in itself. Because - [Jenna] Where's the Oreo? I'm writing to Oreo. - One, two, three, four, five, six, seven, eight, nine, 10, 11, 12 Gross, look at that. Look, the other half of this isn't even there. - I'm upset. - I'm so sorry. Although I'm very excited for It's National Oreo Day, I'm gonna celebrate anyway. - Oh gosh. - I'll take these. - What's March 7th? Let's celebrate something else. What's, well celebrate something tomorrow. - March 7th, um, its Alexander Graham Bell Day. - Oh my gosh! - Name Tag Day, National Cereal Day, National Crown Roast of Pork Day? - Hm, this is getting better. - I think you have something for National Cereal Day. - I may. - Um, Lent, wait, yeah, Lent. - We can only eat fish sandwiches tomorrow. - I don't want to. - We have, its National Cheerleading Week, National Dental Assistance Recognition Week, National Pet Sitter' Week, oh, National Procrastination Week, that's cool. National School Breakfast Week. - I'm in. - Women in Construction, Teen Ten week - Let's end this, they don't care. Okay, well thanks guys for joining - The astrological sign is Pisces. Okay, this is over. - Thank you guys so much for watching. Make sure you subscribe to youtube.com/itsmejennae - And check your Oreo dates. - Yeah check your dates. This is, I've been scammed. This is a conspiracy. - There's a conspiracy. - Tweet Shane, let him know, cause this is - This is unacceptable. - This is unacceptable. - Chucky's off the hook. - Oreo is a lifestyle, but this is a lie. - Alright, see ya! - Bye! - Ermahgawd, ermahgawd, ermahgawd. - Guys all my things were expired. - [Bree] Yeah, good luck! See ya! Good luck cleaning up. (funky music)",
    "transcript_keywords": [
        "National Oreo Day",
        "Oreo",
        "National Oreo",
        "Oreo Day",
        "Oreos",
        "Oreo Cookie",
        "National",
        "National Oreo Cookie",
        "Day",
        "Christmas",
        "Oreo Cookie Day",
        "Bree",
        "National Cereal Day",
        "Yeah",
        "Oreo Music Box",
        "Oreo cookie music",
        "music box",
        "music",
        "Wait",
        "god"
    ],
    "transcript_entity_values": [
        "March 7th",
        "Tweet Shane",
        "Bree",
        "a minute",
        "nine",
        "Oreos",
        "National Cheerleading Week",
        "12",
        "one",
        "Amazon",
        "National Oreo Day",
        "14",
        "a hundred",
        "January 27th of 2019",
        "National Oreo",
        "17",
        "Justine",
        "Oreos",
        "National Procrastination Week",
        "Siri",
        "Oreo",
        "February 8th 2019",
        "16",
        "three",
        "over a million dollars",
        "This day",
        "National School Breakfast Week",
        "National Cereal Day",
        "13",
        "Justine] Breanne",
        "Bree unboxed",
        "Teen",
        "Shane Dawson",
        "National Oreo Cookie Day",
        "Justine]",
        "3/6",
        "four",
        "Justine] Limited",
        "18",
        "March 6th",
        "June",
        "Siri",
        "day",
        "Thin",
        "five",
        "five",
        "Oreos",
        "ermahgawd",
        "3",
        "eight",
        "Tag Day",
        "six",
        "National Dental Assistance Recognition Week",
        "today",
        "the year 18 or 19",
        "two",
        "September 2019",
        "seven",
        "each year",
        "National Pet Sitter' Week",
        "2018",
        "10",
        "11",
        "June 18th of 19 or 19th of 18",
        "Chucky",
        "first",
        "Christmas",
        "tomorrow",
        "Lent",
        "January one",
        "Shane",
        "Pisces",
        "Alexander Graham Bell Day",
        "15",
        "Jenna",
        "One"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.015596451237797737,
        -0.029239172115921974,
        0.01054034661501646,
        -0.0743064358830452,
        0.04101008549332619,
        0.007209993898868561,
        0.042098212987184525,
        0.016771400347352028,
        -0.09990707784891129,
        0.044902458786964417,
        0.006401237566024065,
        0.00964966882020235,
        -0.028918853029608727,
        -0.02904392220079899,
        -0.029381394386291504,
        0.056452907621860504,
        0.05004463344812393,
        -0.022423716261982918,
        -0.02911475859582424,
        0.06476833671331406,
        -0.015096113085746765,
        -0.08287135511636734,
        -0.03446929529309273,
        0.02632385678589344,
        -0.03684340789914131,
        0.12136753648519516,
        -0.001864420366473496,
        0.013263203203678131,
        -0.11097583919763565,
        -0.11184853315353394,
        -0.07389818876981735,
        0.04303022474050522,
        0.11513277888298035,
        -0.012932571582496166,
        0.01965298317372799,
        -0.014728722162544727,
        0.007152929436415434,
        -0.0064087919890880585,
        -0.031146088615059853,
        -0.011655936017632484,
        0.02997146174311638,
        -0.012081694789230824,
        0.0105283223092556,
        -0.053183604031801224,
        -0.05742922052741051,
        -0.09091248363256454,
        0.039164118468761444,
        -0.06407887488603592,
        0.08709081262350082,
        0.048899758607149124,
        -0.047147236764431,
        -0.042205944657325745,
        0.03562704473733902,
        0.024323036894202232,
        -0.10769618302583694,
        -0.03911876678466797,
        -0.09294130653142929,
        0.0018656019819900393,
        0.025043968111276627,
        -0.07826370000839233,
        0.0002093662042170763,
        -0.04063703864812851,
        -0.002561494940891862,
        0.06206406652927399,
        0.0074201226234436035,
        -0.007462291978299618,
        0.012000133283436298,
        0.010254258289933205,
        -0.022714048624038696,
        0.006903963629156351,
        -0.04672197625041008,
        0.05591931939125061,
        -0.02030085399746895,
        0.06326241791248322,
        -0.0006137964664958417,
        0.0802328884601593,
        0.03077670745551586,
        -0.06719665974378586,
        0.03565097972750664,
        0.07128982245922089,
        0.010727139189839363,
        -0.03524835780262947,
        -0.03684608265757561,
        -0.06462423503398895,
        0.0032261896412819624,
        0.05216696858406067,
        0.019312990829348564,
        0.031028343364596367,
        -0.03942234814167023,
        -0.08856572210788727,
        -0.1075160875916481,
        0.011692418716847897,
        0.007284009363502264,
        0.017021985724568367,
        0.019571559503674507,
        -0.08533934503793716,
        -0.05101984739303589,
        -0.0200212299823761,
        -0.049327999353408813,
        0.07459220290184021,
        0.11230140179395676,
        0.00012792149209417403,
        0.0032614117953926325,
        -0.087151437997818,
        0.007249519694596529,
        -0.08509088307619095,
        -0.05621064454317093,
        0.031669262796640396,
        0.00880725309252739,
        0.07604390382766724,
        -0.07567260414361954,
        0.03685539960861206,
        -0.03383917734026909,
        -0.05684119835495949,
        0.006464880425482988,
        0.09485258907079697,
        -0.04565717279911041,
        0.07699154317378998,
        0.021389398723840714,
        0.03155673295259476,
        0.02242644689977169,
        -0.1247762069106102,
        -0.029447274282574654,
        0.009154933504760265,
        0.009292650036513805,
        0.029287442564964294,
        -0.015641039237380028,
        1.2748459578594364e-32,
        -0.06804510205984116,
        0.0380709134042263,
        0.0027806709986180067,
        0.056674256920814514,
        0.03347938507795334,
        -0.006423358805477619,
        -0.039982814341783524,
        0.08208371698856354,
        -0.028567645698785782,
        0.028854193165898323,
        -0.04478383809328079,
        0.08784063160419464,
        -0.04214228689670563,
        0.049124814569950104,
        0.04749128967523575,
        -0.08883706480264664,
        0.00487131904810667,
        -0.006930080242455006,
        -0.04500565305352211,
        -0.0186386127024889,
        -0.019968999549746513,
        0.00019022086053155363,
        -0.019444625824689865,
        0.07434331625699997,
        0.030199266970157623,
        0.13686975836753845,
        0.028899265453219414,
        -0.0686192661523819,
        0.03726614639163017,
        0.0017789594130590558,
        -0.017257967963814735,
        -0.06664365530014038,
        -0.015916969627141953,
        -0.03293408080935478,
        -0.025760946795344353,
        -0.008163108490407467,
        -0.09333430975675583,
        0.013737184926867485,
        -0.008326740004122257,
        -0.03578893467783928,
        0.005500239320099354,
        -0.008174839429557323,
        -0.1015966460108757,
        -0.03192393481731415,
        0.06683351844549179,
        0.01968318410217762,
        0.03006247617304325,
        0.060011036694049835,
        -0.0358194075524807,
        -0.02295755408704281,
        -0.013252930715680122,
        0.007238384336233139,
        -0.040981922298669815,
        0.021298613399267197,
        -0.0019953111186623573,
        -0.11218470335006714,
        -0.008986285887658596,
        0.022115306928753853,
        0.06307736784219742,
        0.051645565778017044,
        0.025178873911499977,
        0.006950410548597574,
        0.0026718159206211567,
        -0.005377287045121193,
        -0.06597160547971725,
        0.08404828608036041,
        0.01686524599790573,
        -0.011931464076042175,
        0.021892579272389412,
        0.056519001722335815,
        0.03848207741975784,
        -0.0019483966752886772,
        0.07272790372371674,
        0.020229218527674675,
        0.03398168459534645,
        0.043195802718400955,
        -0.029165832325816154,
        -0.07368285208940506,
        0.008853343315422535,
        -0.016940459609031677,
        -0.07308389246463776,
        0.06897728145122528,
        0.0323411300778389,
        0.07340336591005325,
        -0.02852756343781948,
        -0.017603985965251923,
        0.04310835525393486,
        0.01115291379392147,
        -0.05245133489370346,
        0.04226050525903702,
        -0.02084987796843052,
        0.06716981530189514,
        -0.11486034095287323,
        -0.050882358103990555,
        -0.01687813736498356,
        -1.24411045400528e-32,
        0.04166635870933533,
        0.011488442309200764,
        0.006310720462352037,
        -0.04122322052717209,
        0.05738021433353424,
        -0.009868462570011616,
        0.010716419667005539,
        0.10350486636161804,
        0.045984793454408646,
        -0.08216825127601624,
        0.045763205736875534,
        -0.08187663555145264,
        -0.05472346767783165,
        0.0343087837100029,
        -0.03529805317521095,
        -0.024091018363833427,
        -0.023683805018663406,
        -0.019576817750930786,
        0.05421091616153717,
        -0.02455613948404789,
        0.03861316293478012,
        0.12117130309343338,
        0.0220396276563406,
        0.041062865406274796,
        -0.00464320695027709,
        0.010638461448252201,
        -0.02576604299247265,
        0.05414804443717003,
        0.06666913628578186,
        0.09282172471284866,
        -0.015026573091745377,
        -0.04343431442975998,
        -0.011622551828622818,
        0.020081426948308945,
        0.05236673355102539,
        0.07430840283632278,
        0.030583880841732025,
        0.08364933729171753,
        8.608006464783102e-05,
        -0.047352127730846405,
        -0.0031164020765572786,
        0.006062611937522888,
        -0.03828239068388939,
        0.028057632967829704,
        0.007504004053771496,
        -0.08630692213773727,
        -0.0858759880065918,
        0.0321371927857399,
        -0.0021824203431606293,
        0.03533867374062538,
        -0.06849116832017899,
        -0.06541644036769867,
        -0.025975169613957405,
        -0.028302425518631935,
        -0.022319428622722626,
        0.02998642809689045,
        -0.0776606872677803,
        -0.04727071523666382,
        -0.012526657432317734,
        -0.006504921242594719,
        0.009710210375487804,
        -0.060566678643226624,
        -0.06561731547117233,
        -0.08066827058792114,
        -0.020466893911361694,
        -0.027666378766298294,
        0.10592016577720642,
        0.008149550296366215,
        -0.04500278830528259,
        0.0080168591812253,
        0.0020267809741199017,
        0.052884191274642944,
        0.02841065265238285,
        0.00021129942615516484,
        0.03659427911043167,
        0.01381871197372675,
        -0.04981961101293564,
        0.04324537515640259,
        0.06904608756303787,
        -0.04798654466867447,
        -0.08010318130254745,
        -0.023944351822137833,
        0.05217405781149864,
        0.07271555066108704,
        0.10670942068099976,
        0.07920092344284058,
        0.08161846548318863,
        -0.03018156997859478,
        -0.05273934453725815,
        0.05514219403266907,
        0.045212309807538986,
        0.023114021867513657,
        0.02740747295320034,
        0.1047886461019516,
        -0.09252365678548813,
        -6.432359356267625e-08,
        0.0710795670747757,
        -0.009464701637625694,
        -0.015916097909212112,
        0.002660690573975444,
        0.05042877048254013,
        -0.05475997179746628,
        -0.05352981016039848,
        0.03312167525291443,
        0.048426780849695206,
        -0.039723120629787445,
        0.11813820153474808,
        -0.031858403235673904,
        -0.04554029554128647,
        0.09053651243448257,
        0.049319975078105927,
        0.01960977353155613,
        -0.10474009066820145,
        0.12749461829662323,
        -0.04064144566655159,
        -0.049088846892118454,
        -0.061114151030778885,
        0.05114557966589928,
        0.06412769854068756,
        -0.029283007606863976,
        0.07721427083015442,
        0.015438654460012913,
        0.016339045017957687,
        -0.012789745815098286,
        0.03144964203238487,
        0.007271867245435715,
        -0.07409338653087616,
        -0.011019766330718994,
        -0.024429725483059883,
        -0.05197420343756676,
        -0.05105367675423622,
        -0.018094435334205627,
        -0.0617147833108902,
        0.00012749608140438795,
        0.014020705595612526,
        -0.05289096385240555,
        0.011752218939363956,
        -0.11514735966920853,
        -0.04977986216545105,
        0.00014916565851308405,
        0.025731509551405907,
        -0.08797608315944672,
        0.011446105316281319,
        -0.0671464204788208,
        -0.014423893764615059,
        -0.0408124104142189,
        -0.07098399102687836,
        0.05433058738708496,
        0.06404455751180649,
        -0.02656128630042076,
        0.09751897305250168,
        -0.010966377332806587,
        0.009086058475077152,
        0.037268467247486115,
        -0.011713852174580097,
        0.02187456376850605,
        0.026077300310134888,
        -0.0025912232231348753,
        -0.0746779516339302,
        0.01764414831995964
    ]
}