{
    "id": "xshYJVm6qFY",
    "title": ":( something I've never talked about...",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2016-12-16T07:31:06Z",
    "video_url": "https://www.youtube.com/watch?v=xshYJVm6qFY",
    "category": "Science & Technology",
    "tags": [
        ":(",
        "health",
        "candida",
        "candida albicans",
        "candida diet",
        "tld",
        "jonathan morrison",
        "update",
        "infection",
        "candida crusher",
        "strange amazon",
        "holiday tech",
        "tech",
        "canxida remove",
        "best tech under $50",
        "jonathan morrison diet"
    ],
    "views": 635907,
    "likes": 33514,
    "comments_count": 3092,
    "description": "Feeling :( + something I've never talked about before... SHIRTS! -   The Best Holiday Tech Under $25 -   Never really talked about why I try so hard to be healthy but this is why.   What is Candida?   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "http://www.s2apparel.com",
        "https://www.youtube.com/watch?v=p9VX0yN4O0Q",
        "http://bodyecology.com/articles/unknown_health_epidemic.php",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here, and this is not a tech video, nor is it click bait. It has been a really frustrating almost two weeks now battling an eye infection which is the reason I'm wearing shades inside, and also so you're not subjected to staring at my face. So not this weekend, but the weekend prior I noticed some pain, some swelling. It was definitely annoying, not pretty to look at, but it really didn't slow me down too much the proceeding week. This weekend I thought I was in the clear, I thought things were getting better, but I woke up Monday, looked in the mirror, and said, \"welp, my eye is swollen half shut, \"and it is gross as shit.\" So with that, I normally like to keep things positive, and not focus on negative, but with this, I think it was one of those things where it kind of just wore me down day after day, where I wanted to make videos and had these ideas, but your mind says one thing, and your body essentially gives you the finger. Now because of that, I kind of wanted to spin things, especially with the holidays coming up and throw out a reminder that it's okay to have a bad day, it's okay to be down, it's okay to be sad. Not specifically focusing on me, but if you're having a bad day, whoever you watch, whoever you look up too, they're going to have a bad day too. Conversely, with all that said, and me having way too much time inside my own head, I thought it might be a good time to talk about something I've never really talked about. Most of you out there who know me, especially those who are close with me, know me as \"the healthy guy,\" that stereotypical LA dude is going to eat kale, drink a juice, but I never really explained how I got to this point. So this actually dates all the way back to November, 2011. I remember it was Thanksgiving, I was trying to do this Black Friday deals video but had the worst toothache that shot pain into my sinus and up into my eye, so at that point I knew it was time to see a dentist. From there, I went ahead and got a root canal, which I was strangely excited for, just to get things fixed and on the up and up. But good God, that was just the beginning. Two weeks passed and somehow things seemed to have gotten worse. The pain is amplified, my face is swollen, my eye is swollen, and so I go back, get a second root canal, two more weeks pass, and same situation. The dentist, or the endodontist, rather had no idea what was wrong, or what was going on, just super confused without any answers, so she sent me to an ENT. Naturally, the ENT thought it was just a sinus infection so all they did was prescribe antibiotics. At this point between the root canals, and the ENT, that quickly tallied up four courses of antibiotics, and if you could take one thing from this video, it is please only take antibiotics when you absolutely have to. Question things, do your research because where I was at that point in my life, I really wasn't in that state of mind, I just wanted to feel better, and that was just the beginning of way worse problems later to come. So about four months pass, I am miserable, no one has any idea what is wrong with me, or what is going on. After tons of research, and looking around, I finally found this really well established oral surgeon and it wasn't until then where he discovered that all this time I had a freaking micro-fracture in my tooth. Also, it turns out that the roots of my teeth are really deep. So deep in fact, that they go straight into my sinus cavity, and that is awesome if I got punched in the face because I'm probably not gonna lose my teeth very easy. But in this case, it is what ultimately screwed me. Because there was a microfracture, bacteria would constantly seep through there. So no matter how many root canals, or what was done, it would never get better. And eventually what ended up happening, was the infection ate straight through my sinus cavity. That is not something I wish on anybody. I remember on cold days breathing through my nose, and feeling the air hit the root of my tooth, and being in excruciating pain. At that point the only solution was to pull the tooth, which started a completely new bag of problems. I remember being awake during the process, and seeing how much the dentist struggled to pull the tooth out, I guess because the roots were so deep, that tooth did not want to come out of my jaw. The positive to that though is if it got any worse, because it was so deep in my jaw, it could've easily infected my bone, and that would've not been good. Once the tooth was out, that left a giant hole straight through my sinus, so they had to do a bone graft, and that would take about a year and a half to fully heal. Jumping back to the antibiotics, because of this surgery, that required two more rounds plus steroids to keep the inflammation down. The pain from that post surgery was one of the worst things I've ever experienced in my life. Just imagine every single nerve in your face, and your teeth just feeling like it's on fire. Honestly, it got me to a point where I was in a pretty dark place, pretty down, didn't really make that many YouTube videos that year. The pain was so excruciating and so constant, that I looked forward to being asleep because it didn't hurt when I was asleep. Through all that though my family, and especially my fiancee, Pearl, was really what kept me going. In some strange way, it was almost this really valuable life lesson where all the electronics and technology in the world didn't matter, because what good was it if you didn't feel good to enjoy things with those that you love. So a couple months passed, things are getting better with my sinus, I'm making progress, I'm excited, and then I start to get a really terrible pain in my lower stomach. The best way I can describe this feeling is if someone took a razor blade or a knife, and started scratching you from the inside of your stomach. It had gotten so bad, that the inflammation from my stomach actually pinched a nerve in my back which in turn caused my leg to go numb. I went back to the doctors, and they really didn't know what was going on, they thought it might be diverticulitis which seemed weird and went ahead and prescribed me even more antibiotics. Things weren't getting better, the pain in my stomach was getting worse, my leg was still numb, I ended up seeing chiropractors and doctors, and no one had any idea what was going on. So for the next few months I said, \"screw it, \"I'm gonna do some research, I am going \"to figure this out on my own.\" Everything I learned, everything I read pointed to a yeast infection or candida, which may be a little embarrassing if you're a guy, but if you've taken major courses of antibiotics that wipe out your good bacteria, that is a serious possibility. I'll never forget it, I went back to the doctor, and told them what I think I had, and he essentially laughed at me, and told me I was crazy, that it was just allergies, take these, it's gonna make you feel better. So I of course believed him. I took the allergy medicine. I remember it was my nephew's birthday, I ate cake, candy, ice cream and that destroyed my body. For the next three days, it just felt like my body was lead, I couldn't think, I remember that Monday taking my fiancee through Starbucks, and there were maybe two cars ahead of us, and I could not remember the two drinks she was asking me to order to save my life, and at that point I knew something had to change. So after that, I gave up bread, sugar, dairy, essentially anything that tastes good, and pretty much lived off vegetables, and bone broth for the next few months. Sure and behold, my leg started getting better, the numbness went away, I could think more clearly, I had more energy, it was night and day. Now with that, the turn around was not all rainbows and unicorns, there was definitely some hardship to that. With that, I lost a ton of weight, I remember at one point I had gotten down to around 145 and people were noticing it within the videos. The biggest side effect of the antibiotics, of the steroids, of the heavy doses of ibuprofen, was the stomach damage. The yeast overgrowth, when it gets really bad, will actually turn into a fungal form, where'll it'll eat through your stomach. That in turn causes toxins and things to leak into your bloodstream which is not fun, and completely wipes me out. It's something that I still battle to this day. But over all, three years strong now, I would not change anything if I could go back in time. It made me wiser, it made me appreciate things, I'm not gonna lie, it is definitely a challenge from time to time. Trying to go to a restaurant, and not being able to eat 99% of the things on the menu is extremely frustrating, especially when you have a fiancee. Bless her heart, she has been amazing through this, and again, I would not be here if it weren't for her. So now you guys have a little deeper insight of why I am the way I am. It's definitely tempting to eat a doughnut or ice cream, or candy, or just give in every once in a while, but for me, actually feeling good far outweighs that moment of giving in. Because small things like not paying attention and eating a sauce that has a sugar in it, or even eating too late in the day to where I can't digest it, those things will knock me on my ass for a couple days to where I am useless. If this inspires or changes just one person out there, then I am glad I made this video. Hopefully my eye is on the up and up, I am hungry and chomping at the bit to make some videos, so look out for those. Ending on a positive note, the t-shirts finally dropped, thank you guys for all the support and the love on those. If you haven't checked those out, I'll drop a link down below. I love all of you guys, and I'll catch you later.",
    "transcript_keywords": [
        "things",
        "day",
        "point",
        "pain",
        "good",
        "time",
        "click bait",
        "back",
        "remember",
        "antibiotics",
        "Jonathan",
        "bad day",
        "sinus",
        "tooth",
        "root",
        "stomach",
        "eye",
        "thought",
        "bad",
        "video"
    ],
    "transcript_entity_values": [
        "two",
        "a couple months",
        "a couple days",
        "Black Friday",
        "November, 2011",
        "This weekend",
        "this day",
        "the day",
        "two more weeks",
        "weekend",
        "a bad day",
        "about four months",
        "this weekend",
        "the next few months",
        "four",
        "a ton",
        "LA",
        "Monday",
        "Starbucks",
        "second",
        "the next three days",
        "almost two weeks",
        "Thanksgiving",
        "half",
        "one",
        "that year",
        "about a year and a half",
        "YouTube",
        "three years",
        "Two weeks",
        "Pearl",
        "around 145",
        "99%",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "DATE",
        "EVENT",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "PERSON"
    ],
    "vector": [
        -0.039907485246658325,
        -0.029227545484900475,
        0.0828966349363327,
        0.05520181357860565,
        0.047776274383068085,
        -0.0668654516339302,
        0.10942108929157257,
        0.07214266061782837,
        -0.06589144468307495,
        -0.03983350470662117,
        -0.0753716453909874,
        -0.02113293670117855,
        -0.0301358662545681,
        0.07485940307378769,
        -0.02550651505589485,
        -0.013846289366483688,
        0.008081338368356228,
        -0.06515704095363617,
        -0.09842144697904587,
        0.10630891472101212,
        0.029572291299700737,
        -0.031023364514112473,
        -0.011463243514299393,
        -0.010285667143762112,
        -0.055056553333997726,
        0.09108924120664597,
        0.008549549616873264,
        -0.0573413111269474,
        -0.038882430642843246,
        -0.07073057442903519,
        -0.03601868078112602,
        0.05269846320152283,
        -0.09065985679626465,
        -0.027810366824269295,
        -0.06462493538856506,
        0.01475553959608078,
        -0.02309083193540573,
        0.012968716211616993,
        0.018614618107676506,
        -0.0063363113440573215,
        -0.02969847433269024,
        0.010352046228945255,
        -0.06527131795883179,
        0.02967759780585766,
        0.02748488076031208,
        0.0029040086083114147,
        0.07757754623889923,
        0.04482806846499443,
        0.0384412482380867,
        -0.05422976240515709,
        -0.11647727340459824,
        -0.025028511881828308,
        0.022030772641301155,
        -0.023414811119437218,
        -0.023126816377043724,
        0.061819836497306824,
        -0.04142008721828461,
        -0.05753381922841072,
        0.032647617161273956,
        0.003703640541061759,
        0.011736838147044182,
        -0.060275085270404816,
        0.03681690990924835,
        0.044091712683439255,
        -0.06031219661235809,
        -0.01628722809255123,
        0.000909005175344646,
        -0.020650843158364296,
        0.042255762964487076,
        0.05866046994924545,
        -0.02523915469646454,
        -0.03429504483938217,
        0.0039714486338198185,
        0.03621453419327736,
        0.028485577553510666,
        0.03322705999016762,
        0.08071345835924149,
        -0.1524776667356491,
        0.04690760001540184,
        0.1715724617242813,
        0.10115505009889603,
        0.09492187201976776,
        0.06656652688980103,
        0.00450711976736784,
        -0.034626305103302,
        -0.027732370421290398,
        0.04203484579920769,
        0.030994780361652374,
        0.025106454268097878,
        0.0345318429172039,
        0.03817730396986008,
        0.022613583132624626,
        0.029117083176970482,
        0.06698102504014969,
        0.13492421805858612,
        -0.018556702882051468,
        -0.0731641873717308,
        -0.04551243036985397,
        -0.11562217772006989,
        0.08086112141609192,
        -0.06326939910650253,
        -0.06933477520942688,
        0.07700922340154648,
        -0.043153200298547745,
        0.05824296548962593,
        0.012911811470985413,
        0.00926967989653349,
        -0.006514693144708872,
        0.0384087860584259,
        0.03508468344807625,
        0.04629070684313774,
        0.07214672118425369,
        -0.02129294164478779,
        -0.06773625314235687,
        -0.038847457617521286,
        0.01983596757054329,
        0.07125401496887207,
        0.00986349768936634,
        0.10778408497571945,
        -0.02760673128068447,
        0.02607841044664383,
        -0.044373925775289536,
        -0.009838023222982883,
        -0.04135729372501373,
        0.04766363650560379,
        0.045147936791181564,
        0.05909361317753792,
        1.1528377992361418e-33,
        0.034413907676935196,
        0.017129255458712578,
        0.0003961341571994126,
        0.04502536356449127,
        0.04004122316837311,
        0.040143486112356186,
        -0.0434742197394371,
        0.036963991820812225,
        -0.04825420305132866,
        0.019229043275117874,
        -0.029631705954670906,
        0.02480851672589779,
        -0.04869278520345688,
        0.0380534753203392,
        -0.07969380170106888,
        0.03149455413222313,
        -0.055619850754737854,
        0.029683230444788933,
        -0.029248282313346863,
        0.03338208422064781,
        -0.024110209196805954,
        -0.0807967334985733,
        -0.017914284020662308,
        0.004428024869412184,
        0.00735707301646471,
        -0.014166926965117455,
        0.04439763352274895,
        0.0016389500815421343,
        0.038392528891563416,
        -0.008803864009678364,
        -0.10950271785259247,
        0.049507007002830505,
        0.07434924691915512,
        -0.012233953922986984,
        0.0012068336363881826,
        -0.004527235869318247,
        0.020050518214702606,
        -0.021102257072925568,
        -0.009777119383215904,
        -0.12213381379842758,
        -0.05558079853653908,
        0.10753630846738815,
        -0.020687373355031013,
        -0.023627037182450294,
        -0.023431332781910896,
        0.057089515030384064,
        -0.07956656813621521,
        0.058788470923900604,
        -0.09470932930707932,
        -0.023191574960947037,
        0.03814378008246422,
        0.029174141585826874,
        -0.0014454183401539922,
        -0.0003441867302171886,
        -0.09696550667285919,
        -0.027495361864566803,
        0.006603194400668144,
        0.03657294437289238,
        0.04309369623661041,
        0.01690088026225567,
        0.025057734921574593,
        -0.04307600483298302,
        -0.02251853421330452,
        0.04403204470872879,
        -0.007031264714896679,
        -0.012779551558196545,
        -0.05850972607731819,
        0.01678149774670601,
        0.01669582724571228,
        -0.03545989468693733,
        0.007479304447770119,
        0.02364545874297619,
        -0.021356983110308647,
        -0.06350516527891159,
        0.02992614358663559,
        -0.01519391592592001,
        -0.01605001650750637,
        -0.03548554331064224,
        -0.019246738404035568,
        0.015533248893916607,
        0.07294725626707077,
        -0.02267036959528923,
        0.04104067385196686,
        0.02110748179256916,
        -0.03896951675415039,
        0.03098423033952713,
        -0.0313032791018486,
        -0.001069682533852756,
        -0.024023406207561493,
        -0.016337256878614426,
        -0.018015457317233086,
        0.069740429520607,
        -0.026800008490681648,
        -0.001220243750140071,
        -0.04572353884577751,
        -3.666741936381024e-33,
        0.04573676735162735,
        -0.08209262788295746,
        0.05591649189591408,
        -0.04281817749142647,
        -0.002516742330044508,
        0.0119283152744174,
        0.05970536544919014,
        0.055958621203899384,
        0.04496512562036514,
        -0.06140270456671715,
        0.060895975679159164,
        -0.062124840915203094,
        -0.07271352410316467,
        -0.031494297087192535,
        -0.049452826380729675,
        0.0039169397205114365,
        0.016064170747995377,
        0.0016331097576767206,
        -0.03532469645142555,
        0.004495448432862759,
        -0.04679882898926735,
        0.06437530368566513,
        -0.07059607654809952,
        -0.004723380319774151,
        0.03658078610897064,
        0.0439409576356411,
        0.059255700558423996,
        0.02592669427394867,
        -0.0558893121778965,
        0.013720816001296043,
        0.02320612035691738,
        0.035654664039611816,
        -0.00556418439373374,
        -0.014932578429579735,
        0.024385157972574234,
        0.08896851539611816,
        0.0017672175308689475,
        -0.06989727169275284,
        -0.03992817550897598,
        -0.0785241574048996,
        0.07823625206947327,
        -0.032245535403490067,
        -0.009118447080254555,
        0.0016055447049438953,
        0.034765467047691345,
        -0.04936281591653824,
        -0.030076907947659492,
        0.02012665942311287,
        0.022043371573090553,
        0.06876608729362488,
        -0.0590001717209816,
        -0.005800151731818914,
        -0.025438547134399414,
        0.046867720782756805,
        -0.01983959600329399,
        -0.05079428479075432,
        -0.03156660497188568,
        -0.020297009497880936,
        -0.03727491945028305,
        -0.0018941907910630107,
        -0.032220177352428436,
        -0.10683097690343857,
        -0.07521496713161469,
        -0.07856128364801407,
        -0.019737858325242996,
        0.02357363887131214,
        0.10094042122364044,
        -0.08425427973270416,
        0.16015496850013733,
        -0.05650170147418976,
        -0.009654742665588856,
        0.0002658207667991519,
        -0.06320890784263611,
        -0.11096539348363876,
        -0.0037944933865219355,
        0.028115512803196907,
        -0.03601204603910446,
        0.006586100906133652,
        -0.047046031802892685,
        0.029644187539815903,
        0.013586393557488918,
        -0.04539315029978752,
        0.10845522582530975,
        0.015185600146651268,
        -0.01939835213124752,
        0.047801099717617035,
        0.010538051836192608,
        0.03571109101176262,
        -0.09250717610120773,
        0.05437389016151428,
        -0.05747285112738609,
        -0.001267696381546557,
        -0.11027505248785019,
        0.06084524840116501,
        0.045005638152360916,
        -7.222578801702184e-08,
        0.07329036295413971,
        -0.07481951266527176,
        -0.04393377900123596,
        -0.009038069285452366,
        -0.027983728796243668,
        -0.040765419602394104,
        -0.06481464207172394,
        0.05658223107457161,
        -0.0014560598647221923,
        0.004552952479571104,
        -0.0456777848303318,
        0.09879469871520996,
        -0.043182484805583954,
        0.06341459602117538,
        0.01981167681515217,
        4.736563278129324e-05,
        -0.06901542097330093,
        0.01981569267809391,
        -0.05270226299762726,
        -0.02166646160185337,
        -0.05876978859305382,
        -0.04837127402424812,
        -0.01732141338288784,
        0.03589165210723877,
        0.005418109241873026,
        0.023578399792313576,
        0.0006214517052285373,
        0.05128369480371475,
        -0.02881941758096218,
        -0.055915962904691696,
        0.052799519151449203,
        0.018352214246988297,
        0.01170469168573618,
        -0.0137556791305542,
        -0.03512093424797058,
        -0.05846646428108215,
        0.09760654717683792,
        -0.08866741508245468,
        0.08578698337078094,
        -0.02622043527662754,
        -0.0053041777573525906,
        -0.05262960121035576,
        0.06120045855641365,
        0.02704966999590397,
        -0.08634994924068451,
        -0.09224959462881088,
        0.0019450922263786197,
        -0.003194027114659548,
        0.060868266969919205,
        -0.010428451001644135,
        0.042101677507162094,
        0.03125854209065437,
        -0.005851241759955883,
        0.09068650007247925,
        -0.06963679939508438,
        -0.007972893305122852,
        -0.036816295236349106,
        0.0720655769109726,
        -0.022208817303180695,
        0.01234623696655035,
        0.07717769593000412,
        -0.07499659806489944,
        -0.0609404593706131,
        -0.015021576546132565
    ]
}