{
    "id": "xuaIhbXHsUs",
    "title": "It’s Glorious!! - Whole Home Sonos Audio Setup",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-09-10T20:43:22Z",
    "video_url": "https://www.youtube.com/watch?v=xuaIhbXHsUs",
    "category": "Science & Technology",
    "tags": [
        "Sonos",
        "Home Audio",
        "Wi-Fi Audio",
        "Multi-Zone Audio",
        "Wireless Audio",
        "Sonos Connect Amp",
        "Klipsch",
        "Linus House",
        "Cable Management"
    ],
    "views": 1623457,
    "likes": 62361,
    "comments_count": 2776,
    "description": "Remove your personal information from the web at  and use code LTT for 20% off.  Win a Hennessey Ford Bronco or $75K cash with no purchase necessary with the Ridge Wallet sweepstake! Check out the link below:    Clutter sure does look a lot better when it's organized, and so do 17 Sonos Connect amps. Watch Linus and Alex wall mount this crazy wi-fi audio setup in his house.   STL files for the Sonos Connect:Amp mount:   Discuss on the forum:   Buy 2nd Gen Sonos Connect: Amps on eBay:  Buy 1st Gen Sonos Connect: Amps on eBay:  Buy a Sonos Connect: Amp:  Buy a Klipsch PRO-180RPC In-Ceiling Speaker:  Buy Infinite Cables CAT6a Patch Cables:  Buy Infinite Cables AC Power Cables:  Buy Infinite Cables Rack Mount PDUs:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:21 Wi-Fi Audio 4:00 Dismantling Begins 6:00 Mounting Amps 10:00 Wiring 13:07 Wall Mounting 15:02 Cable Management 16:55 Moment of Truth 19:43 Outro",
    "description_links": [
        "http://joindeleteme.com/LinusTechTips",
        "https://www.ridge.com/LINUS",
        "https://www.printables.com/model/580021-sonos-connect-amp-wall-mount",
        "https://linustechtips.com/topic/1530809-this-is-glorious/",
        "https://ebay.us/d5lf1t",
        "https://ebay.us/ebGgjC",
        "https://geni.us/QwVZAi",
        "https://lmg.gg/hiHkL",
        "https://lmg.gg/3izt8",
        "https://lmg.gg/GOSZO",
        "https://lmg.gg/HD4ns",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "While I've talked plenty about the plan for the multi-zone audio in my new house, I haven't actually shown you guys the setup. The reason for that is shame. Why have you done this Linus? Do you realize how good Bluetooth speakers are now? How expensive was this? Okay, hold on a second. No, no, there's a good justification for this. I know that Wi-Fi audio does come at a bit of a premium, but as much as this might look like a home a pigeon made, it is capable of driving 17 different music zones at up to 2,000 Watts total. And I will have you know, it is not nearly as expensive as it looks because everything here, second hand, baby. Ah? It certainly looks not that expensive given how much you've spent on this. We are going to fix that though. Action roll. As part of operation final deployment for real this time, we've got the all new cable management arches from LPD store. We've got these sick 3D printed amp holders and we've got power tools. This is gonna be a lot of fun today. Fun, like this segue to our sponsor. The Ridge. The Ridge has partnered up with Hennessy Performance and you can score some sick prizes like a Ford Bronco Velociraptor. For every dollar you spend on the Ridge products, get one bonus entry or up to a thousand entries on custom Hennessy products. Use the link below for 10 bonus entries. Did you bring batteries for these? It really doesn't look like it, does it? You must have these in your house though, right? Yes. Okay, cool. So these are just props then, that was your intention? No, these were intended on, I wanted to use the Milwaukee ones cause I assume that yours are bad. Before we get to any of that though, let's talk about some of the benefits of wifi audio. First up, it's not dependent on your phone's range. So you can keep it running in your kid's bedroom while you are out working in the yard. For another, it can be dynamically configured into different zones. So if you had a big room like this with three pairs of speakers in it, they could be one zone or you could have a zone for an entire floor or even 17 different playlists in every room in the house. The biggest one for me though, is that there's no need to re-pair every time you wanna use it with a different device. When you're on the wifi, you've got control. Now Sonos is a pretty premium wifi audio solution and by looking at this, you're probably thinking that I've spent an inordinate amount of money. But one of the cool things about Sonos is that they're also very good at supporting their old products, which means you've got some options. I went with older gen two connect amps that I slowly acquired from eBay for about 260 US dollars a pop. The latest version is better. It's smaller, it's more powerful. It supports HDMI audio input with ARC, but for a home music system, none of that stuff really matters for me. And the only major feature that's missing for me is support for dual mono mode, which is kind of cool because if the intention is to just have music on while you're moving around the house, you're not gonna be enjoying stereo imaging anyway. I just didn't wanna pay an extra $7,500 to just get that feature. And if you wanna save even more than me, you can pick up the gen one version of the connect amp. You're gonna lose all the Atmos and 24 bit audio and you'll have to use the older S1 app. So you'll need to operate any newer and older equipment separately, but those ones can be had for closer to the $100 price range per zone, sort of. Unlike Sonos' speaker products, which are all in one, these are not speakers. They're just amps and you're gonna need some speakers. So the good news is you can spend as much or as little as you want on them. But the bad news is you not only need those speakers, you will also need to wire them up, which could end up being the most expensive part of the project and the biggest pain in the butt. I guess step number one is undo all the work I did. First, how much did you spend on speakers? Klipsch gave me a bro deal. Okay, so. Yeah, no, I wouldn't have spent that much. Not the $21,000 that it would have been if they didn't. There were these really nice Polk ones that I had at the old house that were like $125 a speaker. That's what I was gonna put in here. And then Klipsch was like, bro deal. And I was like, oh, they sound a lot better, let's go. Yeah, don't worry, I haven't completely lost my mind. Completely. Before you start ripping things out, do you know where everything goes? Is this labeled? Can we please just like number everything so that it all goes back together nice and easy? VR room two, middle. Is that labeled on the amp as well? Oh, no. Fun fact, even though this has been hooked up all this time, I have never just gone all 17 zones and cranked it. Oh, we need to do that. We will, I promise. The music is playing everywhere and I'm trying to work. I have never seen them all together before. I upgraded it piecemeal as my eBay orders trickled in because as you'd imagine, buying 17 units of something secondhand is not just like drop by the local value village. One favor that I did to future us is back when I did hook all this stuff up, I separated this from the bundles that were going into the rack. So all we gotta do is just chuck all the excess back up there and then pull them through that hole. But it's easy though, because they're all mostly extracted now. Feels like I'm holding some sort of medieval torture device. I know. 17 tails. This is it. This is all. And the subwoofers. Oh, wait, yes. And the... Oh gosh. Okay. Oh, oh, oh, oh, this is awesome. Do you have any of the really big clamps? Oh yes. I want to show the people this. This is amazing. I asked Tynan for a couple of cable management things. He gave me literally thousands of dollars worth of this stuff. Watch this. So I have a question Linus. We're putting these all on the wall. Yes. But you have a big server rack right here. Yes. With space. Yes. And that space will be gone. More computers are going to go in there. Putting these in the rack takes up a lot more room than you would imagine, because you can't really stack them deep. Like you can, but then the cable management for them would actually get even more complicated. And besides the power for them is going to be coming off the wall anyway. I don't want these sucking up my battery backup if the power goes out, right? So I'm not going to hook them up to my UPS. So the wall felt sensible. Okay. But you can 5X your floor space if you use your walls as more floor. You need to own your house first though. That helps. Actually though, the solution that we are going to be using today is very renter friendly. Let me explain. Rather than mount all of these directly to the wall, which would be a Royal pain in the butt. I mean, who has wall studs in so many different places? We're going to be mounting all of the amps, all of the power distribution and all of the networking for them to this piece of plywood. Then we're going to be mounting that to the wall. I am questioning whether 17 of them are going to fit on this I'm assuming cut line that you've just drawn. They should in theory. Dan did up this solid works model that we have right here. Good gravy. Is that ever tight? That shows, yeah. All of them will fit here, but I want to check before we cut it. Linus, look at the model. Do it the way that we're going to do it. Oh, what are you, what are you doing? I am realizing that my team secretly hates me because what other reason could there be to give me all blue brackets, except for one orange one and one red one. Maybe those are spares or tests. I actually don't know. So you're saying it's someone else who hates me. Yes, it's Dan. Dan hates you. Okay, so we've got lots of room is what you're saying. I don't know if I'd say that. Don't forget, we still need a network switch, power delivery and all the cable management that has to go to all of this. I think I figured out what the two by fours are for. These? To mount these to the plywood. What I don't know is where these are supposed to go. Down here. I'm kind of feeling this kind of positioning, assuming we have space for it. Cause that gives us sort of natural channels for all the cables to follow. All right, before you get too into the cabling stuff, let's rip all of this off, cut the board and go ahead. Cause it is clear that Dan's plan is going to work. Right. Cutting the board. Yeah. I like it. Every time I operate this, I think about Martina from NerdForge. Yeah. And just like, if someone like that, you know, it's highly competent person. Boy, do I ever need to watch out. We're shooting two videos at my house today. Hi Jamie. This look good. Ready to start screwing. Oh, this looks amazing. Did you use drywall screws? Yeah, I used high performance construction screws. Neat. All right. I noticed that you didn't cut off any of the ear mounts when you had the table saw out. Oh, I was hoping you had a chop saw. I do not. But you have that beautiful table saw. I have no chop saw. Okay, we'll do it on the table saw. I already like wheeled it back over there. No wall. Is there another way to do this? Cause this honestly just doesn't even feel like the best way. Really doesn't, does it? That's why I called you down here. Like a really janky kind of stupid way. Honestly speaking. I could go tell Alex that I've solved the problem, but instead I'm going to have it magically solved when he gets back. I found all these little brackets that I kept, you know, just in case when the installers put on our blinds and didn't end up needing these. And it happens that they line up perfectly so I can just screw them into the board. This may seem a minor thing, but did we consider where on the wall the studs are and where we'll need to... Not at all. Cool. And hey, that's not bad actually. Kind of janky, but it's acceptable I think. Yeah, no, it works. It works. Now, a question for you. I saw that either Dan or Jake equipped us with a whole whack ton of banana plugs, but I'm not really feeling it. Do you just want wires straight into these? Well, honestly speaking, banana plugs are going to be a little bit less convenient for us to install with these so close to each other. They're right angle bananas though, aren't they? Are they? Oh, okay. That's kind of cool. Still, it's really tight, Alex. These are pretty nice and everything, but how many of these do we have to do? 17 to 34, two per speaker, two per... 68 times. I think we can all agree that's not nice. Just to clarify, if this was not a permanent installation, I would absolutely use banana plugs. I use banana plugs in my home theater and it's worth the effort if you're ever gonna change out the speakers. It's just a nice, secure, friendlier connection. These are essentially furniture. They're staying. Wow, this looks great. I'm like actually kind of shocked. Why? Well, it's just, it's one thing to see it in CAD and it's another thing to see it in person. You know what? This is gonna look freaking awesome. Can you put it in the wrong hole or is it just fine? Oh no, it's fine. It's just a network switch. So whatever. I guess this is the first time we've actually acknowledged this to you guys. Every one of these units has two ethernet ports on the back and it's a really cool feature because it allows you to daisy chain them. So we can take our main switch here, which is totally overkill and only exists because Jake is a Ubiquiti fan boy and just likes playing around with their new hotness, run maybe four, one to each row, and then daisy chain them all the way up. I'm kind of feeling like these network cables should have been under the power cables though. I think that Jake got us cables for all of these so that they match. Also the lengths are a lot shorter so we wouldn't have so much excess. Yeah, that makes sense. Too late. Yeah, too late. Oh well. Fun fact. A lot of the time, it isn't a lack of planning. It's a whole bunch of geeks whose specialties are not in communication. I am the fourth person to be assigned it. Everyone's done a fair bit of work and it's coming together pretty well, I think. I think it looks freaking awesome. So yeah, no, I'm with you. Yeah, we communicated great. I know this is usually Jake's job, but he's not here to do it. Shout out infinite cables because having these in every possible length, we've got three foot, four foot, five foot is gonna make the cable management a lot nicer here. Man, this feels so permanent and pro compared to what was going on before. Like even though obviously it's been working and I've been listening to music this whole time, this just feels really different. Yeah, now it's like a thing instead of stuff that's on a shoe rack. By the way, to my knowledge, the shape of the gen one and the gen two connect amp is the same. So we would be happy to provide the STL files for these in the video description if you go gen one or gen two. I'm really, really happy with these. The mounts are awesome. Dan designed these, right? Yeah, bang up job. Okay, hold on. I'm under it. I need to move a little bit. Okay. Awesome. Well, but the bit that I was wondering about, about mounting it to the wall. Yeah. Sure, screws are fine. Yeah, they are fine. I love screws. How do we hold it up while it gets screwed in? Strapping young men. Look, there's one. Hi, Andy. Oh yeah, there's a stud there. Okay, yeah, this is the entire width of a two by four and this one seems to be standing on end. Yvonne's out, which means we can unplug her computer as long as we have it plugged back in by the time she gets back. I'm just gonna start some of these screws here. That way our strapping young men won't have to hold this up any longer than they absolutely have to. Yeah, Sam, you're the audio guy. You know how many- You said there's no audio here. It's all audio. Yeah, this is all audio. How's everybody doing? Good. Remember, legs not back. Okay. I think we're past it now. I'm so sorry. We need to get higher somehow, but I don't really know how, because this is sort of where my strength is ending. I can try to give her a little more. Okay. Okay. Are you guys good? Yeah, pretty please. I think this might be right on top of a nail. Good luck. Okay, she's snugged up. I can't get at that one, but I have this one. Hey, she's snugged. Go ahead. You can let it go a little. Oh my God. Okay. There we go. Okay, you guys are good. You guys are good. That's three screws. That's more screws than I put in an entire computer. Woo. Hey, that is freaking awesome. Seriously though, how much better is that? Like the before and after doesn't get much more stark than that. Now for the next 20 minutes or whatever, I get to plug in the speakers. So basically now they just all cram up here. So the whole thing comes this way. And then we basically just make a big coil of it. And we just drop a coiler up into the top there where no one will ever see it again. We need to figure out where exactly this is going. My skateboarding skills. Here comes the ollie. Yeah, I'm not even working today. Who are you people? What are you doing in my house? I have this piece of insulation that's supposed to be here. I don't think that's going up today. Nope, that is pretty clearly not happening. If we hold out of the way, the stuff that has nothing to do with the Sonos setup, that is freaking awesome. Especially when you compare it to what we started with. All those wires are still here. They just look amazing. Okay, so all that we need to do now is, oh boy, plug all this in. Yeah, that's a bit concerning. Yeah, what was this going to? I don't know, it runs under the rack so it's probably important. It makes a noise when you unplug it. So that's good. Oh gosh, there. You know what, you unplugged that. No, I don't know. Oh crap, that's Yvonne's computer again. Oh, balls. A one, a two, and a three. And theoretically, everything is perfectly. Everything's lit up. Good to go and we'll all light up. What about this boy? Yeah, the switch is just not powered on. I think that's the issue. So any of the ones that are plugged straight into the switch don't have their light on. So that's probably why that light's not on. Oh wait, yeah, this just isn't plugged in. The switch isn't plugged in. Yeah, we need to do that. Oh, how do we power the switch? Wait, that's a- It's powered. No, it's powered. Oh, ha-ha. Huzzah. Isn't that, well, I mean, it's a minor detail. What are the odds, Alex, that it all just comes online? I don't know, you're the one that set all this up. I just moved it and maybe broke it in the process. 100%. 100%, I like it. David with the good vibes today. I never, I didn't see it work beforehand. So as far as I'm concerned, it is in the same state that it was when I arrived. But prettier. I see activity on the switch. I see activity here. What happens if I just hit play on one of them? I don't think it works like that. Okay, that's where Yvonne's working, but sure. It's on. Everything's good. They're all working. I think we know what we have to do. All the way up. No, all the way up would be a lot. Yes, exactly. They go. Yes, I know. Yeah, let's go out and see if it's working. I don't hear anything. Oh yeah, I hear it. Oh, it's coming out of the ceiling. Yeah. Yeah. Yeah. The music is playing everywhere and it's gonna work. All the music's playing everywhere. Can you stop it? Yes. It's off in the office. It's not off. It's not off? We may have plugged the office one into the wrong spot. So we'll have to resolve that very shortly for you. Thank you for your patience. Oh, it sounds good in here. Yeah, the high ceilings really do pretty good, hey? Yeah. And don't forget about the outside. Oh, that's seamless. Beautiful. Yeah, my neighbors are gonna hate me. I would be absolutely in love right now if I was them. You know what else my neighbors would love? The segue to our sponsor. Delete me. Do you feel like there's nothing you can do to stop companies from constantly sharing your personal info without your consent? Then you need to check out Delete me. They'll help you find hundreds of online profiles that are sharing your personal information, which could be used by scammers to barrage you with robocalls and spam emails. In more extreme cases, it could even lead to identity theft or fraud, which, fun fact, are both really bad things. Removing all this information by yourself can be a Herculean task taking many hours. But with Delete me's software and their team of experts, it can be done in minutes. On average, Delete me finds and removes over 2,000 pieces of data for customers in their first two years. So if you wanna get your personal information removed from search results on the web, go to joindeleteme.com slash linustechtips and use code LTT to get 20% off. That should be right. Oh, unless we labeled this wrong in the first place. Well, minor issues. If you guys enjoyed this video, then hey, maybe go check out the one where we, oh, check out the one where we hooked the computer up to the pool, water cooling, et cetera. It's working like awesome. This computer is so cool.",
    "transcript_keywords": [
        "Yeah",
        "good",
        "audio",
        "wall",
        "speakers",
        "back",
        "house",
        "time",
        "awesome",
        "kind",
        "switch",
        "Dan",
        "cable management",
        "lot",
        "music",
        "good Bluetooth speakers",
        "power",
        "screws",
        "cool",
        "work"
    ],
    "transcript_entity_values": [
        "Hennessy Performance",
        "one",
        "David",
        "second",
        "thousands of dollars",
        "the next 20 minutes",
        "Jake",
        "four",
        "Ridge",
        "first",
        "eBay",
        "Sam",
        "minutes",
        "17",
        "One",
        "LPD",
        "First",
        "five foot",
        "about 260 US dollars",
        "Hennessy",
        "up to a thousand",
        "21,000",
        "chuck",
        "Yvonne",
        "number one",
        "125",
        "today",
        "Alex",
        "Milwaukee",
        "S1",
        "Ubiquiti",
        "four foot",
        "Ford Bronco Velociraptor",
        "STL",
        "Andy",
        "many hours",
        "Martina",
        "Herculean",
        "10",
        "Tynan",
        "an extra $7,500",
        "Dan",
        "100%",
        "Polk",
        "20%",
        "LTT",
        "up to 2,000",
        "three",
        "34",
        "Huzzah",
        "100",
        "68",
        "slash linustechtips",
        "Jamie",
        "three foot",
        "CAD",
        "Linus",
        "over 2,000",
        "their first two years",
        "Royal",
        "fourth",
        "24",
        "two",
        "Klipsch",
        "Atmos",
        "Wi-Fi",
        "Sonos",
        "NerdForge",
        "hundreds"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERCENT",
        "PERSON",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.07432568818330765,
        -8.586781041231006e-05,
        -0.0972825363278389,
        -0.09160621464252472,
        0.003515459829941392,
        0.03149329125881195,
        -0.051952484995126724,
        0.009449116885662079,
        -0.045928988605737686,
        0.05124058946967125,
        0.03404751792550087,
        -0.01126066967844963,
        -0.019707296043634415,
        0.012730675749480724,
        -0.008689749985933304,
        0.06988049298524857,
        0.0848407968878746,
        -0.018480341881513596,
        0.07658511400222778,
        -0.053367387503385544,
        0.03418368101119995,
        -0.008248980157077312,
        0.03574201092123985,
        0.004395714029669762,
        0.09753884375095367,
        -0.05850694701075554,
        0.06682754307985306,
        -0.012394807301461697,
        -0.0992087572813034,
        -0.11118638515472412,
        -0.04719190672039986,
        -0.03513721749186516,
        0.04685831815004349,
        -0.05442769452929497,
        -0.0689614787697792,
        -0.05899231508374214,
        0.11326951533555984,
        -0.09363347291946411,
        -0.014735550619661808,
        -0.028884483501315117,
        0.0048704613000154495,
        -0.03946825861930847,
        0.015817692503333092,
        -0.027209268882870674,
        -0.05652090907096863,
        -0.0776665136218071,
        -0.034418366849422455,
        0.005776682402938604,
        0.09261388331651688,
        0.002456435700878501,
        0.029925165697932243,
        -0.0763707384467125,
        0.058853164315223694,
        0.018361523747444153,
        -0.03757582977414131,
        0.037183813750743866,
        -0.06295867264270782,
        0.0027438628021627665,
        0.056439321488142014,
        -0.04324330389499664,
        0.04604419693350792,
        -0.03465963527560234,
        -0.01968003250658512,
        0.04590810835361481,
        -0.01818840578198433,
        -0.016407258808612823,
        0.024970553815364838,
        0.08097521215677261,
        -0.017443211749196053,
        0.0063045332208275795,
        -0.03628566488623619,
        -0.002837869804352522,
        0.041383158415555954,
        0.038069888949394226,
        0.10157574713230133,
        0.12485780566930771,
        0.09340060502290726,
        -0.015336974523961544,
        0.028157632797956467,
        0.018701499328017235,
        -0.00656478013843298,
        0.13010451197624207,
        -0.039044760167598724,
        -0.04768863320350647,
        0.017262233421206474,
        0.051538314670324326,
        0.016731707379221916,
        -0.05103845149278641,
        -0.019354818388819695,
        -0.057087238878011703,
        -0.019935280084609985,
        -0.06963728368282318,
        0.034598562866449356,
        -0.0032232473604381084,
        0.0128870764747262,
        -0.030542543157935143,
        -0.054736968129873276,
        -0.07680024206638336,
        -0.05594021454453468,
        0.00844255555421114,
        0.027769742533564568,
        0.013953927904367447,
        0.04586746171116829,
        -0.0699605718255043,
        -0.05146946758031845,
        -0.033816248178482056,
        -0.08363227546215057,
        0.11387377232313156,
        -0.0006915699341334403,
        -0.030298516154289246,
        -0.10219164937734604,
        0.021507006138563156,
        -0.06514547765254974,
        -0.046210162341594696,
        0.046874769032001495,
        0.019018009305000305,
        0.040834423154592514,
        0.06371890008449554,
        0.04805877059698105,
        -0.012754569761455059,
        0.013465016148984432,
        -0.049372315406799316,
        -0.030571211129426956,
        0.07606112957000732,
        0.013636269606649876,
        0.02212635613977909,
        -0.025139398872852325,
        7.310164268893642e-33,
        0.03522316738963127,
        0.13142317533493042,
        -0.02764739654958248,
        0.018817899748682976,
        0.014915554784238338,
        0.009136204607784748,
        -0.03675422817468643,
        0.02219647727906704,
        0.0020047472789883614,
        0.010104809887707233,
        -0.08841295540332794,
        0.014409732073545456,
        -0.044063787907361984,
        -0.051818422973155975,
        -0.006089401431381702,
        -0.054327428340911865,
        -0.009574039839208126,
        -0.0325017049908638,
        0.06031804531812668,
        0.009488538838922977,
        -0.11992186307907104,
        0.057039838284254074,
        0.010598546825349331,
        0.0009719630470499396,
        0.09168687462806702,
        0.012946203351020813,
        0.06460226327180862,
        0.02228151261806488,
        0.009744839742779732,
        0.027212832123041153,
        -0.01729641482234001,
        -0.0008315831073559821,
        0.07191614806652069,
        -0.02778022550046444,
        -0.04045050963759422,
        0.016934677958488464,
        -0.01503079105168581,
        -0.06035972014069557,
        0.016411112621426582,
        -0.010642966255545616,
        0.006034180521965027,
        0.015490199439227581,
        -0.06713836640119553,
        -0.008479972369968891,
        0.006927811075001955,
        -0.09801211953163147,
        0.0022118135821074247,
        0.07822346687316895,
        0.04783986508846283,
        0.023641282692551613,
        -0.05863982066512108,
        0.05168570205569267,
        -0.09591629356145859,
        0.009792654775083065,
        -0.03325954079627991,
        0.0008423858671449125,
        -0.007667087018489838,
        0.019909802824258804,
        0.05087297037243843,
        -0.024863358587026596,
        0.028159264475107193,
        -0.006260436959564686,
        0.06243184953927994,
        -0.08186788856983185,
        -0.17397138476371765,
        -0.04414745420217514,
        -0.014941602014005184,
        -0.033710893243551254,
        -0.07287737727165222,
        -0.026659393683075905,
        0.03425055742263794,
        -0.06258498877286911,
        -0.04494502395391464,
        -0.05570926517248154,
        -0.023883651942014694,
        0.01807689107954502,
        -0.03506593406200409,
        0.004714280366897583,
        0.05299660563468933,
        -0.01172691024839878,
        -0.024438882246613503,
        -0.00315836351364851,
        0.04204324632883072,
        0.029615310952067375,
        0.08607697486877441,
        0.04595795273780823,
        0.025511810556054115,
        -0.0397968590259552,
        0.0149844940751791,
        0.02941572479903698,
        -0.028202315792441368,
        0.020903704687952995,
        0.025515858083963394,
        -0.013540765270590782,
        0.06437791883945465,
        -7.57760098864922e-33,
        0.10290858894586563,
        0.021799547597765923,
        0.031282152980566025,
        -0.048748258501291275,
        0.06815257668495178,
        -0.05888383463025093,
        0.04194642975926399,
        0.021874958649277687,
        0.030123190954327583,
        -0.02890021540224552,
        0.05865892767906189,
        -0.0208391435444355,
        -0.025057626888155937,
        -0.02130889892578125,
        0.025060350075364113,
        -0.029026800766587257,
        0.024958333000540733,
        0.014189687557518482,
        0.06725478917360306,
        0.04393048211932182,
        0.1200142353773117,
        0.040987081825733185,
        0.0676209032535553,
        -0.010398976504802704,
        -0.008064097724854946,
        -0.08698772639036179,
        -0.057611893862485886,
        0.032174479216337204,
        -0.00013192939513828605,
        0.0884697437286377,
        -0.013367499224841595,
        -0.03340378403663635,
        -0.013747374527156353,
        0.036964450031518936,
        0.018825314939022064,
        0.011565339751541615,
        0.08274410665035248,
        0.11116889119148254,
        0.023147016763687134,
        -0.11042986810207367,
        0.011382635682821274,
        0.02753223478794098,
        0.06598728895187378,
        -0.045765820890665054,
        -0.007284671999514103,
        -0.06586584448814392,
        0.014974758960306644,
        -0.026372192427515984,
        -0.08229942619800568,
        0.02923085168004036,
        -0.012420658953487873,
        -0.0685599073767662,
        0.04776071384549141,
        0.03410115838050842,
        -0.06361313909292221,
        -0.005764827132225037,
        -0.016329757869243622,
        0.07954484224319458,
        -0.06363862752914429,
        0.06656304001808167,
        0.019910836592316628,
        -0.010996722616255283,
        -0.0963103324174881,
        -0.05268699675798416,
        0.014451345428824425,
        -0.0655030682682991,
        -0.04873492196202278,
        -0.020333588123321533,
        -0.010570809245109558,
        0.0360722541809082,
        -0.03651612251996994,
        -0.031053878366947174,
        -0.006019447464495897,
        -0.055770840495824814,
        -0.04112951457500458,
        -0.03546980023384094,
        -0.05944090709090233,
        -0.0032230932265520096,
        0.10977378487586975,
        -0.046056754887104034,
        -0.07735596597194672,
        0.08519471436738968,
        0.03302730247378349,
        -0.021284274756908417,
        0.05051175132393837,
        0.02056559920310974,
        0.07970428466796875,
        0.012904259376227856,
        0.05962708964943886,
        0.06373815983533859,
        -0.008716709911823273,
        0.013003849424421787,
        -0.023024363443255424,
        -0.01803574711084366,
        0.024454627186059952,
        -5.6973735951260096e-08,
        0.061589546501636505,
        0.032996635884046555,
        -0.052868787199258804,
        -0.01389989908784628,
        0.019299626350402832,
        -0.10140293836593628,
        -0.005011287983506918,
        -0.06616373360157013,
        0.04129963368177414,
        -0.036719564348459244,
        0.03004818595945835,
        0.02017405442893505,
        -0.010903817601501942,
        -0.02008189633488655,
        0.005969393067061901,
        -0.03162889927625656,
        -0.03754575923085213,
        0.12187108397483826,
        -0.029983606189489365,
        0.014689156785607338,
        -0.028125977143645287,
        0.06867347657680511,
        0.10587897151708603,
        0.0382729172706604,
        0.09574788808822632,
        0.014384943060576916,
        0.04586869850754738,
        0.05133015289902687,
        0.03677378594875336,
        0.0029508734587579966,
        -0.07976119965314865,
        -0.02362561784684658,
        -0.10808370262384415,
        -0.03686986118555069,
        0.08824864029884338,
        0.0031193108297884464,
        -0.10101098567247391,
        0.08814607560634613,
        -0.006463301833719015,
        0.0362401157617569,
        0.002268137177452445,
        -0.11029286682605743,
        -0.021076785400509834,
        0.002566851442679763,
        0.0009232392767444253,
        0.029790332540869713,
        -0.02787182852625847,
        0.031404007226228714,
        -0.08794427663087845,
        0.03716844692826271,
        -0.021082911640405655,
        -0.01508605107665062,
        -0.024890655651688576,
        -0.12618225812911987,
        0.05523242801427841,
        -0.01457941997796297,
        0.04198753461241722,
        0.019723691046237946,
        -0.030177196487784386,
        0.04983220621943474,
        0.014222790487110615,
        0.0025576474145054817,
        -0.03064616583287716,
        0.03727654740214348
    ]
}