{
    "id": "xuBlC_xNBb0",
    "title": "This Touch Bar Isn't A GIMMICK! - ASUS ROG Falchion NX Keyboard",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-12-11T19:43:50Z",
    "video_url": "https://www.youtube.com/watch?v=xuBlC_xNBb0",
    "category": "Science & Technology",
    "tags": [
        "This keyboard is SHARP!",
        "The Touch Bar isn't useless",
        "The Touch Bar is the best part of the keyboard",
        "ASUS",
        "ROG",
        "Falchion",
        "Sword",
        "Compact",
        "Wireless",
        "Game",
        "Gaming",
        "RGB",
        "Macro",
        "Programmable",
        "NX Key Switches",
        "Switch",
        "Performance",
        "Battery life"
    ],
    "views": 573200,
    "likes": 19375,
    "comments_count": 735,
    "description": "Thanks to ASUS ROG for sponsoring todays video! Learn more about the ASUS ROG Falchion NX:  Learn more about ASUS ROG NX switches:   ASUS ROG's Falchion NX Keyboards are more powerful than you'd expect. You have your standard configuration but their new NX switches provide easier typing for faster actions in games, and their touch bar is more useful than gimmicky.   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS --------------------------------------------------- 0:00 - Intro 0:15 - Falchion background information 0:50 - Unboxing 1:50 - Build impressions 4:10 - Touch bar information 4:35 - Function keys and macros 5:14 - Keyboard cover 5:54 - Battery life 6:15 - NX key switch comparison 7:53 - Touch bar impressions and configuration 9:55 - Final thoughts",
    "description_links": [
        "https://lmg.gg/YQG6R",
        "https://lmg.gg/0FRxc",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- \"Good keyboards are expensive comma man.\" So this keyboard is named after a sword and even though this video is sponsored by a ASUS ROG, I just have to read you this because, well, you'll see, it's called the ROG Falchion. And this is verbatim. The name Falchion is originated from French. Given to a rare one handed single edged sword found in Europe around 400 to 700 years ago. The length and weight allow faster strikes and superior maneuverability for advanced sword play. Now, here's the part where it gets really good. \"When in the hands of a true minimalist, ROG Falchion is equally deadly on the virtual battlefield. Everything you need to claim swift victories, wherever you roam is in a compact package without compromise,\" God damn it, I gotta have it. I'm not a true minimalist, but we'll try. See if I can wheedle this thing on the virtual battlefield. I got three in front of me. This one is the Brown switch type, which, you think that'll be the most popular? They also have a reds and blues, but these are not cherry these are ROG switches, more with that in a moment, let's just get through the unboxing. It's pretty small, it's a 65% keyboard, but it's actually smaller than what ACU says is the typical 65 percenter. I've added about 33 centimeters. This thing is 30.6 centimeters, which is actually closer to a 60% keyboard. They say the way they did that was by actually shortening some of the keys, but more on that in a moment too. A, to C cable for charging, this is a wireless keyboard so you don't need this all the time, but if you want wired play, you can do it. (paper rustling) Let's get to the actual keyboard. (paper rustling) There she blows, and there's an extra, there's just an extra for the peel. It is compact, and it has a dongle for a 2.4 gigahertz connection, zero latency, they say. But of course you can play wire too. I liked that there's a spot to hold the dongle and it actually appears to be magnetic. That is like a no scope, freaking gamers. This thing is a tight package, man it doesn't flex it really at all. And well, why would it, and have the size of this? And that is. (keyboard keys clicking) There's so much to think about (chuckling), Some height-adjust, those also are rubberized. Now I got the browns working right now. (keyboard keys clicking) It's tactile, what's that you're holding over there? - [Jono] Oh, are you gonna eat it? - Oh, yeah, I would say this is probably about one and a third bananas and it's about as thick as the tip, yeah, that's cool. (keyboard keys clicking) This is what it sounds like with the browns y'all (keyboard keys clicking) but I'll get them all out and we'll do a sound comparison later. Per key RGB lighting. This is the first wireless keyboard from ASUS that supports Aura sync actually. Cool, these key caps are PVT, double shot injected. They have a cool kind of tactile sandblasty look on the top of them you can see the double shot injector right there. It's white on the inside with the black around it, that's so the light can shine through the legend as you see here. The stems are a little shorter than a typical key cap. That's how they were able to get this shorter than even a normal 65 percenter. There's a trade off with that, which is that replacement key cap may not be compatible with this board. They specifically say that the page up and page down keys, which I never use personally are a non-standard height. I don't know what the rest of the keys, they might fit, but these look like pretty good key caps anyway. I like the legend, it's not too gamery but it's interesting looking, it's kind of sci-fi. Now another thing that's nice about this 65 percenter is it has arrow keys and they're totally normal they're not in a weird configuration or anything like that and when you're typing, what, we have a Shift, right where I'd expected to be on the pinky North American style enter key. I would probably remap the Delete and Insert because this is a non-standard configuration with these nav keys. It's nice that they have nav keys, but since you're gonna have to learn the position to use anyway, I would learn right off the bat having Delete right beside Backspace since they're kinda like, Backspace and Delete they kinda work together. Oh man, I just touched this touch bar thing and my computer did stuff. So this is a re-mappable capacitive touch bar and you can use the software, which we're gonna look at it in a second to change it from being your volume slider, to a battery indicator, to zoom in and out on maps and all sorts of stuff so, that is pretty cool. You can also, if you're afraid of hitting it, I believe you can do Function + Tab and lock it. Yeah, speaking of Function, there's a bunch of function keys on here you can do all the F keys you can see them printed on the bottom side of the key caps there, they're on the number row. There's also a bunch of media control keys in there and if you don't want to hit Function to hit, for each one of those strokes, you can actually do a function lock. You're just in function land, and you don't have to hold anything down. And finally, with the Function key you can do on the fly macros, and they made it super easy you do Function + left Alt. Now I'm in macro recording mode. (keyboard keys clicking) I type my macro and then that's the same thing to get out, Function + left Alt again, and my macro is recorded. And if you don't wanna do that, there's a way to do it in the software too. What about this case cover thing? Does it just friction fit on there? Oh, it's nice, it's snug. There's a bit of play because it actually hits the keys. Oh God, Oh my God (laughs). Maybe turn it off before you put this thing on. Here's what's a little different, you can, oh God, you can see that there's rubberized triangular skates on here as well so you actually meant to put it this way. And when you do that, they say that it will like defuse the RGB, I guess the side view of the RGB. And yes, you can still use the touch bar when it's in there. There's a little cutaway. - [David] Nice. They thought of everything. Now, battery life, they are claiming 450 hours of battery life on a single charge of this puppy. Of course, with RGB off. With RGB on 56 hours, 30 minutes a charge gets you 30 hours of gameplay. And it's all thanks to a 4,000 million power lithium ion battery inside. Now how, oh God, let's do a switch comparison. (paper rustling) How many? - [Jono] They could be with anyone. (keyboard keys clicking) There you go, guys These are the clickiest. (keyboard keys clicking) I like the space bar sound for some reason, it is different than the rest of the keys. (keyboard keys clicking) That's not atypical. This will probably give you a competitive edge in a lamp party because people around you will be annoyed. (Jono laughs loudly) These are gonna be a little harder to press than the Reds we'll check in a second, but you can definitely feel that tactile click. (keyboard keys clicking) And then your brain is like, \"Oh, I should go to the next letter, 'cause I've got it.\" All right, let's go onto the Reds. The linears, the gaming configuration. You wanna be able to press quickly. (keyboard keys clicking) That is pretty smooth. (keyboard keys clicking) Not a bad sound, either. (keyboard keys clicking) Not a bad sound. (keyboard keys clicking) - [Jono] I could use that. (keyboard keys clicking) Picture this in your life. I'm just writing it like a novel. And you guys don't know, but in my mind, it's very... (keyboard keys clicking) These are just so, because they're so small, like it was just so rock solid on the base. Like wanting me out is just dope. I'm gonna go back to the Browns. (keyboard keys clicking) Oh, the happy medium. (laughs) The goldilocks zone. (keyboard keys clicking) I think the Red one is the best. The Blue one sounds almost rattling compared to that. (keyboard keys clicking) Great, well, I like them a lot. Now let's hook them up to the software and see what it's like to really use this touch bar. So here, this is almost like when you're configuring wireless earphones for like what the different inputs do. So the inputs we get are a swipe up, which is you could call that swipe away, swipe up, swipe down, top section Tab, middle section Tab, and bottom section Tab. I don't know how that's demarcated. I don't know if it's like in thirds, I guess, you can make it display battery level, which is what I've got right now. I guess it's kind of like a health bar I'm down to kinda in the middle there, or you can make it sync with your keyboard lighting. That's pretty sweet. It's just basically like breathing RGB. It is possible to change just using your keyboard, the brightness and the pattern of the lights, but then there's lighting controls in here too. Okay, this is a lot more my speed, I like having a GUI instead. You can do the brightness, the speed of the pattern, the direction of the patterns, sick. How about outward ripple, sick. Oh, I like a chonky ripple. How about a slim ripple? Rain drops, sweet. Okay, I digress. I was tryna look at the touch thing. So swipe up, that can be volume, zoom. Okay, wait, if I go into zoom, I can make it zoom in or out. You can play inverted guys, select a key. Oh, I can just, I can pay respects with a swipe? That's dope, man hold on, there, oh, I made it R by accident. Oops, but look at that, you can actually go slow or you can go, you can rip, just like volume, I guess. Swipe down, okay, my body's ready. It's really cool how you can have different, like I can do volume with taps and then zooming in with swipes. This is powerful, robust. Okay guys, I think that is a pretty good overview of this beast, this puppy. I touched a lot of these keyboards. A lot of them, the cheap ones from Amazon, which aren't even that cheap or not this good. This is cool, I'm trying not to shill, but I'm not shilling. It's sponsored, but it's actually, it seems okay at first glance, I'll say that. Yeah, how much does it cost Jono? - [Jono] $159.99. - 160 hey, $160. I mean like the cheapest no-name brand Amazon basics, ones of these are gonna be like 30, 40 bucks, which is, a quarter. But hey, Chinese new years coming on, get those red envelopes. Yeah, good keyboards are expensive, What can I say? See you later. (all laughing)",
    "transcript_keywords": [
        "keys",
        "ROG Falchion",
        "key",
        "Function",
        "keyboard",
        "thing",
        "RGB",
        "key caps",
        "ROG",
        "God",
        "swipe",
        "Falchion",
        "Good",
        "kind",
        "cool",
        "pretty",
        "key cap",
        "bar",
        "function keys",
        "key RGB lighting"
    ],
    "transcript_entity_values": [
        "65",
        "30.6 centimeters",
        "159.99",
        "Brown",
        "ROG Falchion",
        "French",
        "a quarter",
        "three",
        "40 bucks",
        "Falchion",
        "30 hours",
        "thirds",
        "ASUS ROG",
        "60%",
        "Amazon",
        "second",
        "2.4 gigahertz",
        "about 33 centimeters",
        "North American",
        "GUI",
        "4,000 million",
        "Jono",
        "ROG",
        "160",
        "Aura",
        "first",
        "56 hours",
        "PVT",
        "Chinese",
        "the ROG Falchion",
        "ACU",
        "F",
        "30",
        "450 hours",
        "30 minutes",
        "Reds",
        "400 to 700 years ago",
        "RGB",
        "Function",
        "about one and a third",
        "ASUS",
        "65%",
        "David] Nice",
        "Europe",
        "zero"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "PERSON",
        "NORP",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "NORP",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "LOC",
        "CARDINAL"
    ],
    "vector": [
        -0.0772247314453125,
        -0.09438519179821014,
        0.042946550995111465,
        0.00042421722901053727,
        0.033095814287662506,
        0.025301167741417885,
        0.07419367134571075,
        0.0525292344391346,
        0.046375155448913574,
        -0.003990765195339918,
        0.026427919045090675,
        0.08094635605812073,
        0.005228162277489901,
        -0.03296472132205963,
        0.03088378719985485,
        -0.04612231254577637,
        0.07763593643903732,
        -0.10847803950309753,
        -0.04746020585298538,
        0.04030359908938408,
        0.05086354538798332,
        -0.10610240697860718,
        0.038097742944955826,
        -0.10754720866680145,
        -0.011562221683561802,
        -0.08064324408769608,
        0.007603815756738186,
        -0.09177309274673462,
        0.029115227982401848,
        -0.12570416927337646,
        0.0005399921792559326,
        0.07214494049549103,
        0.042634304612874985,
        -0.04263991862535477,
        -0.10967804491519928,
        -0.03505153954029083,
        0.03781111538410187,
        -0.07166238129138947,
        -0.07309465110301971,
        -0.022014815360307693,
        -0.037748388946056366,
        -0.0002449513413012028,
        0.06497280299663544,
        0.06136979162693024,
        0.04277421534061432,
        -0.0610993318259716,
        0.02862371876835823,
        -0.024521276354789734,
        0.06230063736438751,
        0.09221767634153366,
        0.02499345690011978,
        -0.06274489313364029,
        0.06676217168569565,
        -0.005674306768923998,
        -0.0328122079372406,
        0.06320394575595856,
        -0.07895545661449432,
        -0.08040837198495865,
        0.07840175181627274,
        -0.023308487609028816,
        0.06243675574660301,
        -0.00019197606889065355,
        -0.022556127980351448,
        0.016403725370764732,
        0.05584089830517769,
        0.05381131172180176,
        0.015758318826556206,
        -0.017290037125349045,
        -0.022048939019441605,
        0.0021807344164699316,
        0.0179908387362957,
        -0.010447792708873749,
        0.014831067994236946,
        0.002676650881767273,
        0.01451376173645258,
        -0.024568693712353706,
        0.01744277961552143,
        0.03185300901532173,
        0.055571459233760834,
        -0.0023573858197778463,
        0.025557978078722954,
        -0.00024956135894171894,
        0.008765813894569874,
        -0.007027303799986839,
        0.030832450836896896,
        -0.012431547977030277,
        0.034099023789167404,
        -0.004629155155271292,
        0.006380446255207062,
        -0.02524603344500065,
        0.003988989628851414,
        0.050013963133096695,
        0.05555383488535881,
        0.012153699062764645,
        0.011902937665581703,
        -0.05439889058470726,
        0.010953216813504696,
        0.009879836812615395,
        -0.08792158961296082,
        0.03722681105136871,
        0.08119729161262512,
        0.08548463135957718,
        0.04911349341273308,
        -0.013763212598860264,
        -0.029746748507022858,
        -0.001262621721252799,
        -0.03431055322289467,
        0.016983073204755783,
        -0.058060213923454285,
        0.008627491071820259,
        -0.041931744664907455,
        0.00926495622843504,
        -0.10175278037786484,
        -0.01681271567940712,
        -0.07694225758314133,
        0.05152936279773712,
        -0.03750058263540268,
        -0.014754369854927063,
        0.11014065891504288,
        -0.026439564302563667,
        -0.003305707359686494,
        0.027915464714169502,
        -0.13082244992256165,
        0.02323235757648945,
        0.025468667969107628,
        0.09351960569620132,
        -0.07353232800960541,
        5.737206992725522e-33,
        -0.07439986616373062,
        0.07217264175415039,
        -0.07055186480283737,
        -0.10191728919744492,
        0.041279129683971405,
        0.03142649680376053,
        0.011565785855054855,
        -0.039999764412641525,
        -0.04888765886425972,
        0.00024269962159451097,
        -0.04569215700030327,
        0.04732111841440201,
        -0.0669877901673317,
        0.01616058126091957,
        0.07747133076190948,
        -0.06280017644166946,
        -0.029998738318681717,
        0.023883001878857613,
        -0.030440479516983032,
        -0.03853434696793556,
        0.030516227707266808,
        0.05179176479578018,
        0.03406686335802078,
        0.0156529750674963,
        0.040878601372241974,
        -0.01092031504958868,
        0.008002503775060177,
        0.015600040555000305,
        0.032190918922424316,
        -0.009143303148448467,
        -0.0177399143576622,
        -0.07515168190002441,
        0.0063566709868609905,
        -0.026294467970728874,
        -0.05291951447725296,
        0.017747141420841217,
        -0.05600304901599884,
        -0.10481095314025879,
        0.04844645410776138,
        -0.019115310162305832,
        -0.04002641513943672,
        0.01990322768688202,
        -0.05329783633351326,
        -0.063665010035038,
        -0.04553334042429924,
        0.03146332502365112,
        0.02877003699541092,
        -0.030536822974681854,
        0.025354228913784027,
        -0.02430427074432373,
        -0.061992108821868896,
        0.0271617379039526,
        -0.03467491641640663,
        -0.03420446813106537,
        0.052262306213378906,
        -0.08164192736148834,
        -0.03236893564462662,
        0.10564808547496796,
        0.07624486088752747,
        0.041198521852493286,
        0.04977112635970116,
        -0.05374433472752571,
        0.06179553270339966,
        0.01763083040714264,
        -0.07201678305864334,
        0.08318337798118591,
        0.02363419160246849,
        0.02651599980890751,
        0.001154794474132359,
        -0.06219734624028206,
        -0.02526986040174961,
        0.018836602568626404,
        0.03867777809500694,
        0.046447381377220154,
        0.00781900156289339,
        -0.028492406010627747,
        -0.03524116799235344,
        -0.11276362091302872,
        -0.02409200556576252,
        0.01858297362923622,
        -0.039166297763586044,
        0.0825834721326828,
        0.029827313497662544,
        0.04618999734520912,
        0.034498609602451324,
        -0.06022289767861366,
        0.046480998396873474,
        -0.019357092678546906,
        -0.04444790631532669,
        0.024528907611966133,
        -0.044003453105688095,
        -0.031982358545064926,
        -0.10083933174610138,
        -0.03284988924860954,
        -0.03293067589402199,
        -5.3042812395253047e-33,
        -0.09536964446306229,
        -0.03652334585785866,
        -0.03805292397737503,
        0.08256689459085464,
        -0.025870736688375473,
        0.0029162908904254436,
        0.06775561720132828,
        -0.0010671991622075438,
        -0.015844564884901047,
        -0.12329713255167007,
        0.026111558079719543,
        0.1106121763586998,
        0.00757437152788043,
        -0.032245419919490814,
        0.05050031468272209,
        -0.007229518610984087,
        0.043389711529016495,
        0.017219949513673782,
        0.0076631810516119,
        -0.08970963209867477,
        0.05349854379892349,
        0.031809207051992416,
        0.007603765465319157,
        0.16589826345443726,
        -0.04557701572775841,
        0.004497172776609659,
        0.0434236153960228,
        0.02088250033557415,
        -0.00221308134496212,
        0.02439923584461212,
        0.01434357650578022,
        0.08064033836126328,
        -0.017809730023145676,
        0.016580061987042427,
        0.021323855966329575,
        0.023738251999020576,
        0.048311907798051834,
        0.13733568787574768,
        -0.007443908601999283,
        -0.020565936341881752,
        0.06435715407133102,
        0.019004732370376587,
        0.07271984219551086,
        -0.01387026533484459,
        -0.008541387505829334,
        -0.005415570922195911,
        -0.09923327714204788,
        -0.08205235004425049,
        -0.00758130569010973,
        0.027347315102815628,
        0.007826070301234722,
        -0.06053758040070534,
        0.015959640964865685,
        -0.05010487884283066,
        -0.027153920382261276,
        -0.0006610463024117053,
        -0.03645811229944229,
        0.0053241560235619545,
        0.014101492241024971,
        0.001710158889181912,
        0.04200955107808113,
        0.00038783138734288514,
        0.010474912822246552,
        -0.024645313620567322,
        0.04490692541003227,
        -0.06102374196052551,
        0.00883016549050808,
        0.037707604467868805,
        -0.024072477594017982,
        0.04207287356257439,
        -0.04058723896741867,
        0.054779354482889175,
        -0.03808014467358589,
        -0.040778566151857376,
        -0.02706732042133808,
        0.05481408163905144,
        0.06857342272996902,
        0.0038577395025640726,
        -0.0283617302775383,
        -0.057090502232313156,
        -0.03134046122431755,
        -0.01997687853872776,
        0.060847967863082886,
        0.0271571334451437,
        0.0005350321880541742,
        0.1326662003993988,
        0.019420014694333076,
        0.04961591213941574,
        0.024988515302538872,
        0.028488608077168465,
        -0.027229970321059227,
        -0.0634143203496933,
        -0.05811363086104393,
        0.06445685029029846,
        0.05828689783811569,
        -5.547394010818607e-08,
        0.024201611056923866,
        0.04949790984392166,
        0.08238569647073746,
        -0.03262465074658394,
        -0.024739988148212433,
        0.008777742274105549,
        -0.03614877164363861,
        -0.0741422101855278,
        -0.03160838410258293,
        -0.05630544573068619,
        -0.004589783027768135,
        -0.05630883947014809,
        -0.039564233273267746,
        0.011835498735308647,
        0.006996531039476395,
        0.08057013899087906,
        -0.03085349313914776,
        0.0873643010854721,
        -0.022197606042027473,
        -0.08823072165250778,
        0.010954417288303375,
        0.02992814965546131,
        0.054916225373744965,
        0.05546990782022476,
        0.03384748846292496,
        0.020603783428668976,
        0.008687370456755161,
        0.07847258448600769,
        0.101250559091568,
        -0.10224378854036331,
        0.007274122908711433,
        -0.026659464463591576,
        0.0132373608648777,
        -0.06717351824045181,
        -0.03912746533751488,
        -0.06784788519144058,
        -0.0006980212638154626,
        0.0443122424185276,
        0.081462562084198,
        0.07186737656593323,
        -0.003847649320960045,
        -0.10279747098684311,
        0.0024594999849796295,
        -0.009405630640685558,
        -0.1015004813671112,
        0.030358724296092987,
        0.03293163701891899,
        -0.05568224936723709,
        0.0037019893061369658,
        0.021388713270425797,
        0.004367627203464508,
        -0.03477823734283447,
        -0.02453644387423992,
        0.015735022723674774,
        0.029984544962644577,
        0.03536270186305046,
        -0.031937889754772186,
        0.0742492824792862,
        0.06655576080083847,
        0.03607138246297836,
        -0.017580730840563774,
        -0.09225817024707794,
        -0.11515390872955322,
        0.06920749694108963
    ]
}