{
    "id": "XUwSOfQ1D3c",
    "title": "Sony's Clever but Flawed PlayStation Copy Protection--And How They Might Have Fixed It",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-03-26T02:36:44Z",
    "video_url": "https://www.youtube.com/watch?v=XUwSOfQ1D3c",
    "category": "Science & Technology",
    "tags": [
        "PlayStation",
        "copy protection",
        "DRM",
        "disc swapping",
        "disc swap",
        "modchip",
        "CD-ROM",
        "PS1",
        "PSone",
        "PS one",
        "Sony",
        "Play Station",
        "ATIP",
        "CD-R"
    ],
    "views": 5452312,
    "likes": 122534,
    "comments_count": 8014,
    "description": "You can support this channel on Patreon!  Link below The original PlayStation is a pretty neat thing.  Using the CD as a storage medium was a smart move.  But, Sony needed to add anti-piracy features to the disc to prevent miscreants from making bootleg copies of Crash Bandicoot.  This video tells the story of how that works, why it wasnt infallible, and also proposes a potentially impervious solution (24 years late, though).  Heres that paper on reading optical discs.  Its a good read:   You can support this channel on Patreon!  Patrons of the channel are what keep videos like this coming.  If youre interested in supporting the channel through a voluntary contribution, please check out my Patreon page.  Thanks for your consideration!   And thank you to the following Patrons! Charlie Quigley, Tommi Hares, Tomas, Dakota Williams, Chuck Floyd, Eitan Tal, Callum Brieske, Paul Fisher, Stephen Vrazel, Applied Science, peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, twiglet, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Sam Hodge, Matthew Rossi, Paul Craigie, Paul Williams, Tyler, Gerald Monaco, Kelly Rose, Tab Patterson, Jason Weathered, Sergey Kiselev, h.drew foy, Roger Beal, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Clara Latter, Elijah Reeds, Christopher Jett, Justin Talbot, Francisco Vogliotti, Steven Metcalf, Verysofisticated, Lolucoca, Matt Standish, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, rn Arnarson, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Ellis M. Eisen, Francis Fisher, Kedar Deshpande, Boris, Bill Basch, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kiera Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, Bjrn Vegar Torseth, Yaniv, Andr, Andres Plaza, Charlie Hankin, Craig Leverenz, Casey Kikendall, Sebi Jecklin, Tianyu Ge, Daniel J Schless, Justin Smith, The8TrackKid, Scott Emmett ODonnell, Jon-Andr Haraldstad, Ashley Grant, Boh00711, Drew McClain, Michael Snoden, Jesse Cardone, Hason Portwood, Kevin Terrell, Clara Latter, Nick, Ed Hall, Julian Rapoport, Christopher Bassett, Ryan Cozzubbo, Marcus Schwartz, Steven Hidy, Patrick Meister, Josef Citrine, The Automatic Filmmaker, Thomas Jew, Johan Schoeman, Joseph Spiros, Matt Taylor, Patrick Musson, Lars JJ, Carles Codony, Richard Lindsey, PK, Christopher Carpenter, blouerat, Frank Harris, Magnus Tranam, Robert Toth, Jason McMillon, George Dale, Mrpirate707, John Semander, Joseph Hill, Samuel Blakey, Marc Ethier, Luke Biddle, Winfield Trail, Giacomo Scaparrotti, Brady Brown, Hank Eskin, Stein Strindhaug, foophoof",
    "description_links": [
        "https://pdfs.semanticscholar.org/f772/6d20c43b22fb13f8788c8c64df2dbe9fa44f.pdf",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "When Sony released the PlayStation, the first commercially successful game console to use the compact disc as its storage medium, they had a problem on their hands. Using a CD gave them all sorts of advantages, but the CD burner and CD-R presented a challenge. Whats to stop someone from making illegal copies of our precious intellectual property? Well, they thought of a solution. If I take this copy of Parappa the Rapper and pop it in my computers CD drive, it can see whats on there. And it will gladly make a copy. My duplicate disc has exactly the same files on here. Awesome! It should work! And yet, it doesn't. The PlayStation knows that this is a counterfeit disc, and it wont play it. Why? Well, the data on these two discs may be exactly the same, but this disc is missing something which cannot be replicated by a CD burner. Now, its actually pretty easy to get around this. Mod chips and disc swapping were two well known ways to bypass this copy protection. And of course these days, there are emulators, so using the console itself isnt even required. Now Im not going make a comment on the pitfalls of DRM or the people who circumvent it. Sony has valid reasons for using it, and there are also perfectly legitimate reasons for an individual to use a copied disc--for example to provide a backup of your software library. But in this video, Id like to suggest a way that Sony could have made the PlayStation discs almost impossible to copy. Theres a certain quirk in the design of these consoles that suggests they might have had this in mind, but abandoned it. So first, lets take a quick look at the history of the console, as well as how the copy protection actually works. The original Sony PlayStation was a groundbreaking product in a number of ways. Though not the first video game console to use the compact disc for data storage, it was the first to achieve widespread success. Theres a fascinating history as well as a juicy tale of corporate backstabbing behind the PlayStations creation which I wont go into here in much detail. But if you werent aware, the PlayStation started as an accessory for the SNES. Yep, Nintendo hired Sony as a hardware accessory partner, and after deciding that the terms of the contract werent to their liking in regards to software rights, Nintendo just shoved Sony aside and instead announced a new partnership with Philips. Rather than just abandon their work, Sony decided to make their own game console as the ultimate F.U. to Nintendo. Using optical storage for game data had tons of advantages over the then standard ROM cartridges. They were cheaper to make, could hold MUCH more data, were smaller, more versatile, and due to that extra data, allowed for things such as CD-quality audio alongside gameplay. The CD-ROMs biggest disadvantage was that of a slow load time, as the data being read from the disc isnt coming in particularly quickly. A ROM cartridge could be read at any point randomly and with higher data throughput, allowing many games to load nearly instantly. Oh, and the CD was also pretty fragile, so theres that, too. And, uh, early consoles suffered from a poorly designed CD reader, so well they werent perfect. Even though the original PlayStation only has a measly 2 megabytes of RAM, a normal CD only outputs 1.2 megabits per second. The CD-ROM drive in the PlayStation could operate at 2X speed, but even then it would take 6.5 seconds to fill the RAM completely. But of course, it usually took longer than that, as the laser would have to dart around the disc to get all of the data it needed to load the next environment. Want to play a skirmish in Twisted Metal 4? Youll be staring at this screen and listening to this for a good while. [Sound of console seeking data on CD] Anyway, though there were downsides, the CD-ROM is arguably what made the original PlayStation so successful. But it also introduced that unique problem for Sony. All cartridge based video game systems are essentially immune to counterfeit copies being made of their games. Youd need to have awfully specialized equipment to duplicate one of these, and then youd need to track down a blank cartridge with writable memory. So, it was pretty much never done. But the CD-ROM, well thats easy as pie to copy! Although they were pretty expensive at the time, the CD Burner was very much a thing when the PS1 was released, and so was the CD-R. Obviously worried about the potential for piracy, Sony engineered a pretty clever trick into the system to ensure only legit discs could be played. However, it wasnt actually that clever. OK, well, the actual feature is, but the implementation wasnt. Like I said before, in reality it was pretty easy to get around the copy protection. So then, how does the copy protection on the PS1 discs work? First, lets get it out of the way and say that the black color of the disc has nothing to do with it, whatsoever. Though one promo video about the PlayStation suggests that this could be the purpose, it isnt. This is just for looks. [NARRATOR: Black ink is added to the plastic to give the CD its distinctive, cool PlayStation-only look. This also helps protect the CD from illegal copying.] Actually, its not even black, its a very deep purpley-blue. This is a similar color of plastic to what's commonly found in front of infrared light sensors on a device with a remote control. Its completely transparent to infrared light, but mostly opaque to visible light. There was nothing special about the PlayStations CD-ROM drive that allowed it to read these discs. The infrared light of a normal CD laser will read it just fine. Side note--In my last video, I made an error in suggesting that DVD players dont have an infrared laser, and use their red laser to read a CD. This is not true, in fact many early DVD players have two complete laser pickups on a single sled, and later devices used the same laser with two diodes. The wavelength of light is pretty important for reading an optical disc correctly--its tuned to the size of the pits--so a second infrared laser diode is necessary to read a CD. I had completely forgotten about the importance of wavelength, and thankfully the comments set me straight. One commenter noted that CD compatible DVD laser pickups usually have two adjustment pots on them, one for the IR laser, and one for the red laser, and sure enough, there they are! Anyway, What Sony actually did was to add two things to the disc during mastering that werent normally there on a garden variety compact disc. Well, actually, it was one addition that accomplished two tasks. To understand what they did requires a little bit of knowledge into the laser pickup system of any optical disc format. Its impossible to produce a CD, DVD, Laserdisc, Blu-Ray, or economic policy that is exactly perfect. There will always be some imperfections. The discs arent usually completely flat, so the distance between the disc and laser lens is constantly fluctuating. The disc is also never exactly centered, so the pits usually move back and forth with each rotation. To handle this, the objective lens is sort of floating, and electromagnets can lift it (or lower it) as well as wiggle it left and right it to make sure the pits are in focus, and that its following the data spiral. To see this in action, its actually easiest to look at a Laserdisc. This disc is badly warped, and towards the edges the laser is bouncing pretty wildly to keep its focus distance constant. Though almost never this extreme, a CD player or PlayStation needs to do this, too. In fact, heres the laser of a PlayStation wiggling back and forth ever so slightly to read the data from this Audio CD. This clip also shows how the laser carriage only moves for coarse tracking in steps. Notice how it moves outward, but the position of the lense relative to the disc doesnt change. Now, the lasers movement is only there to maintain tracking on the data stream. A CD player couldnt care less about what the Laser is doing, it just wants to see the data. Any wobbliness of the track is irrelevant to its goal of reading the data; so as long as the wobble isnt too extreme, its presence is of no consequence. Generally, the circuitry in charge of this tracking and focus is part of the laser pickup assembly. This task is done at the hardware level, and can be considered automatic from the perspective of the circuitry that actually processes the data itself. Theres a really great paper linked in the description that goes over how this is actually accomplished. What Sony did was introduce a way to actually keep track of how the laser lens moved. The hardware would monitor the horizontal movement of the objective lens, and it was looking for a specific wobble in the data its reading. As part of the mastering process in PlayStation discs, the very first sectors of data in the pregap are recorded with a wobble of a specific frequency. Rather than a smooth spiral, the track looked something like this. The wobbling was also used for encoding which region the disc was for. The region code was amplitude modulated into the wobble itself, and if the code on the disc didnt match the consoles BIOS, it would not play. The reason this worked was that any ordinary CD drive would just ignore this wobble. Actually, ignore isnt quite the right word. It was unaware of the wobble. The tracking circuitry in its laser pickup would just do its job and keep the laser in line with the data stream. It didnt matter how the data wobbled, or even if the data wobbled. Its job was just to get the data. When you made a copy, that copy would be missing the wobble. When the CD drive is reading the disc to make an image file for burning, it isnt even aware of the wobble. The data captured during the disc read is all that matters for burning the disc. Now, a CD burner is looking for a wobble on a CD-R, but for a very different reason. A CD-R has a premade wobble molded into the polycarbonate--thats the plastic the disc is made of. This wobble contains the ATIP, which tells the CD burner the properties of the disc such as its capacity and maximum write speed, and throughout the rest of the disc it wobbles at a constant frequency. A CD burner is looking for this wobble as it writes to a disc both to maintain proper tracking as it writes on it, as well as to maintain the proper writing speed. Because this wobble is already there on a CD-R, even if a CD drive could detect the region-encoding wobble on a PlayStation disc, it couldnt recreate it. To recreate the wobble of a PlayStation disc would require jumping in and out of this premade groove, which the burner cant do. Even if it tried, by crossing the premade lines, the data would likely be impossible to read correctly. Where Sony failed was by being a little lazy with how disc authenticity is checked. With few exceptions, the console only looks for this wobble at bootup. People figured this out, and by defeating the lid switch and carefully watching a disc spin, you can see when its checking for the wobble and swap in a burned copy for a real disc with a little practice. The reason this worked is that Sony built in a healthy bit of tolerance for damaged discs; so as long as you are fast enough, it will just pass the disc off as being scratched, thus needing multiple attempts to read the data. But disc swapping was annoying and also could damage your discs and perhaps even the console, so the other option was to install a modchip that would inject the code into the system at the right time, so even though the laser wasnt seeing the wobble, the processor would think that it did. Game developers eventually created ways to detect a modchip, so this wasnt completely infallible, but it was still a relatively easy way to play a burnt disc. So now that you know what the PS1 does to determine the validity of a disc, as well as why it was so easy to get around it, heres where my little theory comes into play. I had mentioned theres a design quirk. When you open up the lid of a PS1, you might notice that the area that holds the CD is MUCH larger than the CD itself. Could it be that Sony had originally intended for PS1 discs to be larger than a standard CD? Some people think the PS1 discs contain data outside the range of a normal CDs laser carriage, and that this is how the copy protection works. While this isnt the case, Sony could have done that. And if they did it by going outside the normal readable area, they could have really locked this down. Imagine that the PlayStation discs were an extra 3 centimeters across, making it a 15 centimeter disc rather than 12. If Sony had extended the rails on their CD drive in here, the laser could read all the way to the edge of this slightly larger disc. Not only would this have increased the amount of data on the disc, but it would have made copying them almost impossible. Almost every CD drive has a second insert for 8 cm discs, and top loading drives can of course handle them, too. The physical size of a CD can be smaller, and it will still work. But if Sony had gone bigger, you could not physically fit a PlayStation disc into the standard five and a quarter inch CD burner in your PC. If would fit fine in here, but theres no way it will make it in here. If they had done this, the PS1 could still play audio CDs just fine. It wouldnt remove any functionality from the system. Its already more than capable of playing an 8 cm CD OK. And if they had always ensured that some of the game data was written outside the 12cm diameter of a normal CD, even on smaller games which needed less than the 700 megabytes of data available on standard CD, a copy would be impossible to make without the console noticing. If Sony had gone this route, can you imagine how difficult it would be to make a duplicate disc? No one was making CD drives capable of reading a disc that large, and there would be little incentive to start doing so. Even if a CD burner appeared on the market which could handle a 15 centimeter disc, how easy do you think it would be to get your hands on a 15 centimeter CD-R? Now, its obvious why Sony didnt do this. The whole point of using the CD was to make manufacturing games quick and cheap. To make a 15cm CD is really to make an entirely new format. That would require new disc pressing machinery, or at the very least significant retooling of existing machinery. Also, a new case design would be needed, with a physically larger disc being more difficult to store. The standard CD jewel case already had the support of countless storage systems. But if they had decided to just make the discs a tiny bit bigger, which the design of the early consoles suggests was possible, if not intended, mod chips and disc swapping couldnt have done a thing. A burned PlayStation game simply couldnt exist. Thanks for watching, I hope you enjoyed this video. If this is your first time coming across this channel, please consider subscribing so you wont miss the next ones. And, you can now follow me on Twitter @ TechConnectify. Thats what happens when youre late to the party. Of course, Id like to take the time to thank my Patreon supports. Patrons of the channel are what keep these videos coming. If youre interested in becoming a patron as well, please check out my Patreon page. Theres a link on your screen, or you can find one in the description. Thanks for your consideration, and Ill see you next time! [Snaps fingers] And That!... is the end.",
    "transcript_keywords": [
        "disc",
        "Sony",
        "data",
        "laser",
        "discs",
        "wobble",
        "PlayStation",
        "PlayStation discs",
        "copy",
        "make",
        "read",
        "console",
        "burner",
        "game",
        "compact disc",
        "CDR",
        "disc swapping",
        "drive",
        "original Sony PlayStation",
        "Sony PlayStation"
    ],
    "transcript_entity_values": [
        "Blu-Ray",
        "15cm",
        "Twisted Metal 4",
        "ATIP",
        "DRM",
        "SNES",
        "8 cm",
        "Nintendo",
        "Audio",
        "Sony",
        "two",
        "tons",
        "6.5 seconds",
        "F.U.",
        "PlayStation",
        "five and a quarter",
        "Patreon",
        "3 centimeters",
        "12",
        "pregap",
        "Twitter @ TechConnectify",
        "Laserdisc",
        "first",
        "RAM",
        "one",
        "these days",
        "Burner",
        "12cm",
        "2 megabytes",
        "One",
        "PlayStations",
        "Laser",
        "1.2 megabits",
        "First",
        "second",
        "IR",
        "15 centimeter",
        "2X",
        "Philips"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.038536690175533295,
        -0.06954324245452881,
        -0.0029268234502524137,
        -0.12224573642015457,
        0.05511745437979698,
        0.03362150117754936,
        0.023638097569346428,
        0.08869482576847076,
        -0.007164511363953352,
        0.08300390839576721,
        -0.018521757796406746,
        0.11558068543672562,
        -0.0039353324100375175,
        -0.03371291235089302,
        -0.005462045315653086,
        -0.023104945197701454,
        0.010961856693029404,
        -0.026501350104808807,
        -0.015182094648480415,
        -0.006801554001867771,
        0.009960013441741467,
        -0.10649052262306213,
        -0.01531726773828268,
        0.023347487673163414,
        -0.0644531175494194,
        0.004928640555590391,
        -0.0487070307135582,
        0.026830382645130157,
        -0.04528215155005455,
        -0.05211504548788071,
        -0.03569117188453674,
        0.08551595360040665,
        0.0182799119502306,
        -0.009244857355952263,
        0.001152619137428701,
        -0.059405356645584106,
        0.018241042271256447,
        -0.03197840228676796,
        -0.052386488765478134,
        -0.003721852321177721,
        -0.01141759566962719,
        -0.021947652101516724,
        -0.0464680977165699,
        0.033393848687410355,
        -0.02202742174267769,
        -0.04880625009536743,
        0.02207891084253788,
        -0.010955395177006721,
        -0.010171675123274326,
        0.005196635145694017,
        -0.04091048613190651,
        0.014161301776766777,
        0.12532870471477509,
        0.03850925713777542,
        -0.011583501473069191,
        -0.05919734388589859,
        0.06373466551303864,
        0.048270776867866516,
        0.021154843270778656,
        0.022643519565463066,
        0.07125139981508255,
        -0.06512700766324997,
        -0.10122302919626236,
        -0.005923659075051546,
        0.06733399629592896,
        0.034941527992486954,
        0.033785730600357056,
        0.06905078142881393,
        0.0314943790435791,
        -0.01244991272687912,
        -0.06256721168756485,
        0.06140568479895592,
        0.0481557622551918,
        0.038897547870874405,
        0.005439854692667723,
        0.002726982580497861,
        -0.021113593131303787,
        -0.014167265966534615,
        -0.0016753260279074311,
        -0.015155347995460033,
        0.03268355131149292,
        -0.04608982428908348,
        -0.028041142970323563,
        -0.06788119673728943,
        -0.010872304439544678,
        0.07655935734510422,
        0.027036461979150772,
        0.02048921398818493,
        -0.022363092750310898,
        -0.005214590113610029,
        -0.044024962931871414,
        0.032024938613176346,
        0.12859880924224854,
        -0.004122175741940737,
        -0.03172672539949417,
        -0.027321707457304,
        -0.014678615145385265,
        -0.14055435359477997,
        -0.016548259183764458,
        0.05730057880282402,
        0.008076054975390434,
        0.009009001776576042,
        0.00487172557041049,
        -0.09159354865550995,
        -0.0502142608165741,
        -0.08349353075027466,
        0.049622148275375366,
        0.04090459272265434,
        0.052470862865448,
        0.06036382541060448,
        -0.10885912925004959,
        0.08781911432743073,
        -0.06776818633079529,
        0.013735786080360413,
        0.002018035389482975,
        0.0826474130153656,
        -0.025459373369812965,
        0.1021440252661705,
        -0.0158337764441967,
        -0.0655418261885643,
        0.07040520012378693,
        -0.03714143857359886,
        -0.020780539140105247,
        -0.02576306089758873,
        0.05948799103498459,
        -0.09005765616893768,
        0.04558417573571205,
        4.22744282348967e-33,
        0.016195565462112427,
        0.11457694321870804,
        -0.01654277928173542,
        -0.049005888402462006,
        -0.00511368690058589,
        -0.05822392553091049,
        0.030439412221312523,
        0.041538041085004807,
        -0.10354162752628326,
        0.01752178929746151,
        0.08696005493402481,
        0.008079617284238338,
        -0.06584646552801132,
        0.04793989658355713,
        -0.020733578130602837,
        0.005506298970431089,
        -0.12096034735441208,
        -0.01532280445098877,
        0.001922854222357273,
        0.0006034136167727411,
        0.019853781908750534,
        -0.03317442908883095,
        0.021505005657672882,
        0.012688952498137951,
        0.007136604283004999,
        -0.016289904713630676,
        -0.08804778009653091,
        -0.026226170361042023,
        0.15313269197940826,
        0.041315969079732895,
        -0.09337758272886276,
        0.04991399496793747,
        0.03550662845373154,
        -0.026461413130164146,
        0.049644600600004196,
        -0.01822519861161709,
        -0.08283449709415436,
        -0.08491549640893936,
        -0.011416423134505749,
        0.008551495149731636,
        0.05784452706575394,
        -0.007033742032945156,
        0.009921661578118801,
        0.0067716557532548904,
        -0.0005020762328058481,
        -0.04238829389214516,
        0.07152798771858215,
        -0.03060259483754635,
        -0.04118188098073006,
        0.048630524426698685,
        -0.028521563857793808,
        0.0391593798995018,
        -0.03935607150197029,
        -0.06822184473276138,
        0.007161482237279415,
        -0.0018132129916921258,
        -0.000476968998555094,
        -0.014427218586206436,
        0.06659886986017227,
        -0.03191855922341347,
        0.16781876981258392,
        0.013819833286106586,
        0.08169721066951752,
        -0.061404645442962646,
        -0.09898117184638977,
        0.04985886812210083,
        0.06846069544553757,
        -0.03422924876213074,
        0.022497830912470818,
        -0.004089214839041233,
        -0.08497878164052963,
        -0.04897104576230049,
        -0.04693974554538727,
        -0.12057295441627502,
        -0.002791902283206582,
        0.0055203125812113285,
        -0.06239822879433632,
        0.043491583317518234,
        0.049451738595962524,
        -0.016874687746167183,
        -0.0259698498994112,
        -0.052535392343997955,
        -0.027539385482668877,
        -0.013320738449692726,
        -0.029432475566864014,
        0.054035115987062454,
        0.018709953874349594,
        -0.003251706948503852,
        -0.04687438905239105,
        -0.0670848861336708,
        0.03306027501821518,
        -0.05510670319199562,
        0.016813356429338455,
        0.06333994120359421,
        0.04520423337817192,
        -3.5784549637945775e-33,
        -0.05592978373169899,
        -0.08442619442939758,
        0.027093783020973206,
        -0.0012958726147189736,
        -0.05345628038048744,
        -0.0776909664273262,
        -0.06964509189128876,
        -0.01119287870824337,
        0.004070634488016367,
        -0.06019283086061478,
        -0.06962300837039948,
        -0.022226983681321144,
        -0.10112446546554565,
        -0.0403963141143322,
        -0.07214851677417755,
        -0.10491208732128143,
        0.02094496786594391,
        0.008137710392475128,
        0.03364092856645584,
        -0.039493389427661896,
        0.04407963901758194,
        0.06313902884721756,
        0.0350908599793911,
        0.05515328422188759,
        0.033813945949077606,
        0.035839248448610306,
        0.05420449376106262,
        0.011281548999249935,
        0.0885925367474556,
        0.042875949293375015,
        0.04945341497659683,
        -0.002456790069118142,
        -0.03272714093327522,
        -0.07243715971708298,
        -0.004244236275553703,
        0.014685136266052723,
        0.03603732958436012,
        0.014145560562610626,
        -0.06750770658254623,
        -0.08840665966272354,
        0.019983019679784775,
        0.06711117923259735,
        -0.07708868384361267,
        -0.07989776879549026,
        -0.017682911828160286,
        -0.012538270093500614,
        0.03904004395008087,
        0.031097829341888428,
        0.046691570430994034,
        0.03394902125000954,
        0.07309674471616745,
        0.0016853747656568885,
        0.030882231891155243,
        -0.03744859620928764,
        0.08584518730640411,
        0.023455990478396416,
        -0.03930351138114929,
        0.03603861480951309,
        0.05157502368092537,
        -0.008388541638851166,
        -0.07610657811164856,
        0.005722319707274437,
        -0.03331534564495087,
        0.005470283795148134,
        0.0033116259146481752,
        0.00885813683271408,
        0.11172696202993393,
        0.11624656617641449,
        -0.026270532980561256,
        0.033121589571237564,
        -0.0025534818414598703,
        0.05758058279752731,
        0.0626901313662529,
        0.0253653135150671,
        0.037420641630887985,
        0.015330654568970203,
        -0.06897435337305069,
        0.018560465425252914,
        -0.0960877388715744,
        0.08191420882940292,
        -0.06506258994340897,
        -0.01322181522846222,
        -0.008852592669427395,
        0.09658428281545639,
        0.06155038997530937,
        -0.008878286927938461,
        0.04185701534152031,
        -0.062098387628793716,
        -0.04950478672981262,
        -0.015889529138803482,
        -0.01291344128549099,
        0.04835303872823715,
        -0.020657118409872055,
        0.08874315768480301,
        0.033475324511528015,
        -5.603619257499304e-08,
        0.06795335561037064,
        -0.021844666451215744,
        0.0017894970951601863,
        0.0405021533370018,
        0.011896619573235512,
        -0.10193754732608795,
        0.006168626714497805,
        0.008102510124444962,
        -0.03174814581871033,
        -0.002378548262640834,
        0.035762056708335876,
        -0.005021487828344107,
        -0.02396688237786293,
        0.0023282745387405157,
        0.00407050084322691,
        0.020483799278736115,
        0.020409245043992996,
        0.09084943681955338,
        -0.06450539827346802,
        0.01176232099533081,
        0.039177898317575455,
        -0.004068087786436081,
        0.13892285525798798,
        -0.04674467444419861,
        0.07422059774398804,
        0.05923699960112572,
        0.027070414274930954,
        -0.08972734212875366,
        0.017670685425400734,
        0.018599307164549828,
        -0.00024252556613646448,
        -0.01868230663239956,
        -0.06107147037982941,
        -0.02736443281173706,
        -0.003084279829636216,
        -0.014413551427423954,
        -0.015066897496581078,
        0.05166560783982277,
        0.024732176214456558,
        0.0351957231760025,
        0.030658861622214317,
        -0.017740286886692047,
        -0.012372657656669617,
        0.043136149644851685,
        0.038444142788648605,
        0.010065118782222271,
        -0.06439803540706635,
        -0.015424964018166065,
        -0.027142079547047615,
        -0.0020513974595814943,
        0.004884135443717241,
        0.032450221478939056,
        -0.00875520333647728,
        0.04856404662132263,
        0.06569276005029678,
        0.030757557600736618,
        0.044540662318468094,
        0.06748951226472855,
        -0.014662270434200764,
        0.06692977249622345,
        0.04364330321550369,
        -0.052332665771245956,
        0.04327728971838951,
        0.04575638845562935
    ]
}