{
    "id": "XwO2qJ1cGoE",
    "title": "10 STEAM features you didn't know about. PART 2",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-08-06T16:55:30Z",
    "video_url": "https://www.youtube.com/watch?v=XwO2qJ1cGoE",
    "category": "Science & Technology",
    "tags": [
        "10 steam secrets",
        "I can't believe I didn't know this about steam",
        "10 coolest secret features on steam",
        "steam secret features"
    ],
    "views": 1254146,
    "likes": 54325,
    "comments_count": 2149,
    "description": "Get 3DEXPERIENCE SOLIDWWORKS for Makers (20% Off $99USD/year!) at  or learn more at   Wouldnt you know it, as soon as we do a video about steam, they change everything! Were back to show you some of the amazing new features (and some awesome older ones we missed)!  Discuss on the forum:   Buy a 64GB Steam Deck:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:55 1. New in-game overlay 2:22 2. New settings interface 3:26 3. Steam beta client 4:07 4. Dynamic library collections 5:09 5. New library interface 7:09 6. Augmented Steam 8:18 7. SteamCMD & Steam cafe 8:38 8. Remote desktop 9:42 9. Sign out devices 10:33 10. New big picture mode",
    "description_links": [
        "https://lmg.gg/3DSW",
        "https://Img.gg/f03c8",
        "https://linustechtips.com/topic/1524361-10-steam-features-i-love-and-one-i-hate/",
        "https://geni.us/OPbe",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "If you're like me, Steam is for games and everything else is just annoying window dressing that needs to stay out of my way So I can get to my games, but every once in a while It is nice to stop and appreciate the curtains, isn't it? Especially when valve worked so darn hard on them. In the few short weeks since our last steam video they have completely overhauled the user interface with some mind-blowing new features and You guys also flagged a bunch of other awesome things that steam can do that we Well totally missed last time. Also for those of you who make it to the end I do have some constructive feedback for the team at valve this time Oh, and I also have a message from our sponsor Solidworks They're 3d experience solid works for makers delivers professional grade design tools for your hobbies Personal projects and more check them out at the link down below First up is the star of the show the new and improved in-game overlay Which some of you might think of as that thing that opens when I accidentally hit shift tab But guys that changes today because if you are not using this now You are not gaming properly friends on Top of prettifying up the existing overlay components like the game guide window and screenshot manager valve has added some entirely new Features like this one this awesome notes tool that lets you take game specific notes that will synchronize to the cloud so they're accessible across all of your devices like ah Every game should have this and now thanks to steam they do they also massively improved the built-in web browser with snap your performance and Most importantly for my fellow ADHD ears they have added the ability to pin it on top of your gaming session so that you can watch your favorite streamer or a Video walkthrough or anything you want while you play you can even tweak the opacity to ensure that you don't get Snacked up on from behind some boring video from Michael Reeves now pinning isn't available for every overlay window But it does work for the ones you'd care about like guides achievements and notes. What an absolute game changer this customization comes courtesy of the slick new icon bar that also adds instant access to Steam input and some other crucial mid session settings valve has also given the whole steam interface a fresh coat of paint Unifying the experience across desktop steam deck and big picture They've tweaked fonts colors UI elements and the back end to help keep all those interfaces a little more aligned moving forward One of the best places to see the changes is the settings interface where things look pretty different from last time The storage manager that we highlighted is now easily accessed with its own menu item and we get way more granular control of Notifications with the ability to choose what shows up on mobile what appears as a pop-up toast notification on the desktop And what just gets sent to the notifications drop down to die a slow and painful death and hey while we're in settings Did you know you can limit your download speeds to stop steam from bringing mom's Netflix grinding to a halt? It's right there under downloads So easy and if you have bandwidth to spare you can also set steam to continue downloading games while you're playing I wouldn't configure this while you're doing anything intensive But if you just want to kill time with something light while you're waiting, it's a great option Speaking of which did you know how easy it is to test new features before they come out under interface? Just click client beta participation and you will immediately get access to upcoming versions of the steam client This is also available for individual games, too Though developers don't always use this feature the same way some ignore it outright No beta for you others do use it for public testing and I was delighted to find out that beat games actually uses it to provide players with Access to older versions of beat saber that allows you to keep using your existing mods When a new version of the game comes out and breaks everything so awesome while we're in the library Are you taking advantage of dynamic collections? This features been around for a while now But I am surprised at how few of my friends around the office are using it. Just click the little icon here Define your parameters Let's say co-op games with controller support that we both own and haven't played yet And there it is the overwhelming text tsunami is now a digestible list that puts to an end once and for all What do you want to play? I don't know What do you want to play and if we click save as a dynamic collection? It is permanently added to the lists in the left panel. No more choice paralysis The coolest part is that any new game that fits those parameters gets automatically added to the list Dynamic collections are also available as a shelf that we can select and organize on the library home screen We can also sort our shelves by the way by steam reviews Metacritic scores and achievements completed which oh We have some work to do on those but not till later first there's a bunch more stuff I want to mention about the library I'll let's just pull up the old game shelf and whoo You know how some games haven't bothered to update their cover art to fit the new steam libraries dimensions Well, no matter we can simply replace their artwork with our own right click manage set custom artwork And you can pick any JPEG or PNG that you like it even supports animations though that might get old pretty fast While we were doing that you guys might have noticed another interesting option in there but hide this game isn't just for keeping your kids out of your Naughty game collection. It's also great for weeding out games that happened to be an amazing bargain in a humble bundle, but Realistically, you're never gonna touch Then if you're really bored and looking for something, please anything to do All you've got to do is go to view hidden games and you can see the collection by the way Your kids probably know about that. So none of this is a substitute for actual parenting one last thing in the library though I'm pretty sure we've mentioned bulk uninstalling games before but a similar method works for installing games Just control select your games right click install selected pick a path and you're done while that's running Why don't we take a peek at the friends list for a second? sad But let's imagine that we did have some friends. One of my favorite features is being able to set nicknames Every group has that one person who is constantly changing their steam handle and that's you know, that's cool You be you but at the same time I'd much rather look at my list and see mom rather than Cougar MILF underscore four to zero Nicknames frankly are an essential feature and they should be supported absolutely Absolutely everywhere and the same goes for this next one Why is it that steam asks me to verify my age every time I open a store page? I should be able to do that once and it should remember it and While the fix isn't an official steam feature rather It's an open source Chrome extension called augmented steam But it does exist and it is super cool to the point where covering augmented steam would probably require its own video But we can at least run through some of the main stuff it includes current and historical pricing Including from other regions and from third-party stores. It's got high vis flagging of third-party DRMs like Danubo It's got a ton of added customization for the store and the search pages like removing annoying developer live streams adding a view in library button and Highlighting owned and wish listed games It's got better filtering when browsing and a bunch of quality of life features for community market users Now naturally valve doesn't officially support or endorse augmented steam But they don't appear to be doing anything to block it at least for now and it's open source So the code can be scrutinized by the community So if the reviews and the user base or anything to go by I'd say it's worth at least giving a try for these next Two I'm not gonna say too much But if they're useful for you, you know who you are and you're gonna love them We're gonna have links in the description so you can learn more first is steam command. That's steam CMD which is the command line version of the steam client It is great for running dedicated game servers Say for example, you wanted to run a persistent Valheim world for your buddies without being logged in 24-7 Steam command is the way to do it. The second quickie here is steam cafe, which is Fantastic if you're setting up a school gaming club a VR Center or an internet cafe You can get special commercial licenses for hundreds of games that are accessible on every station in your LAN and all Manageable through a single account. We actually use steam cafe here in our gaming center in our employee lounge How about something sneaky for our next one? Did you know you can use steam remote play to remote control your whole PC not just games valve doesn't officially allow it but it is surprisingly easy to do just add a program like Notepad as a non-steam game on your host computer then stream that app on a remote steam client It's gonna look like we're trapped in the notepad window, but we're actually not just click on the file menu Then press the left arrow key to get the icon menu where we can minimize notepad. Hey, voila. We are now controlling the remote desktop It's not a fully featured remote desktop client and I can't speak to the security or lack thereof But the latency is super low and it even has cool features like following around your cursor if you move on to a different display It also looks great speaking of security, by the way, have you ever reviewed what devices are signed into your steam account? I'm betting you haven't because valve makes it a real pain in the butt to do So if you go looking for this feature in the desktop or the web client the closest you're gonna come is the nuclear option Where you just sign out everything But if you take out your phone and fire up the steam app, not the chat one the one with steam guard Click the little shield icon and then on the even littler settings button in the bottom right corner Lo and behold there it is an authorized devices button down at the bottom It works exactly like you'd expect and why an important security feature like this is hidden away in the mobile app I have absolutely no idea. Oh And since I know you're watching by the way valve, there's some other stuff that I kind of can't fathom Can we talk about the new big picture interface for a sec with one click of the shoulder buttons? I used to be able to jump right into my library Now that does nothing and then wasn't it left stick to get into the menu of all the you know The library and store and everything that does nothing to now I just mash buttons on my controller and okay up is search I guess I'll hit a suddenly half the screen is keyboard. I mean I can hear you guys already It's supposed to be like that. It's like the Steam Deck interface Linus. Yeah dummy, but why a 7 inch and a 70 inch display are completely different scenarios It's not like I'm gonna get right up to my TV and start Stabbing at letters with my new stubby screwdriver from LTT store dot com and again, I hear you Linus You just have to hit the menu button. Are you blind? Well, first off what if I am don't judge and second that is three interactions for what used to be one Then once you get to the library, well, hey, this is good At least the shoulder buttons actually do something again But I can't say the same about the new store where you've got the exact same bar of buttons at the top of the screen But the shoulder buttons don't do anything. You have to navigate there with the deep What the heck you guys with that said the store is better than it used to be but there are still some big problems here The little help bar at the bottom tells me to hit Y to filter but that doesn't appear to do anything at all You just got to navigate to the right side instead and also hitting B for back That wasn't working for the writer of this video It would just hop between the two windows on either side But then for me the Xbox button wouldn't bring up the menu at all and I had to use B and it did go back To the main screen what is with this inconsistency? It's like why does the filtering mechanism work completely differently in the library? It's like each section was made by a different team and none of them have ever even had lunch with each other I mean, I know valve has an unorthodox internal structure, but Come on guys I'm rooting for you which is why I'm not gonna nitpick at all the other little things and highlight the fact that overall valve has done a pretty good job with Steam over the years. I'm sure you guys are gonna love some of the new features We've talked about and I have faith that they're gonna get these kinks worked out Eventually, it's just a matter of someone over there Maybe flying up from New Zealand and taking ownership and making it happen Just like I'm making this segue happen to our sponsor Solidworks calling all makers hobbyists and tinkerers You can get the digital tools you need for your personal projects with the affordable 3d experience solid works for makers offer For just $99 a year or $10 a month. You'll get everything you need to make your vision a reality they're cloud connected tools for designing fabricating and rendering can be both locally installed or browser based and You'll have access to a dedicated online support community to help with any questions You might have you'll also have access to an active online design community That is full of fellow makers where you can connect share your work get tips and become inspired Please be aware that 3d experience solid works for makers is not for commercial use and it is limited to a maximum of $2,000 of profit per year in US dollars Elevate your maker game on your terms without compromise and within your means by getting started today at solid works dot com slash makers if you enjoyed this video why not check out our previous steam features video Most of what we showed off will still work even after this update",
    "transcript_keywords": [
        "Steam",
        "games",
        "game",
        "steam features video",
        "steam client",
        "features",
        "Steam Deck interface",
        "valve",
        "augmented steam",
        "library",
        "click",
        "steam deck",
        "steam feature",
        "official steam feature",
        "feature",
        "video",
        "interface",
        "remote steam client",
        "time",
        "previous steam features"
    ],
    "transcript_entity_values": [
        "the years",
        "one",
        "UI",
        "second",
        "Notifications",
        "Netflix",
        "first",
        "LAN",
        "Steam",
        "New Zealand",
        "Valheim",
        "One",
        "10",
        "2,000",
        "First",
        "70 inch",
        "Michael Reeves",
        "today",
        "Danubo",
        "JPEG",
        "Naughty",
        "the few short weeks",
        "Stabbing",
        "Cougar",
        "four to zero",
        "7 inch",
        "Metacritic",
        "a ton",
        "3d",
        "MILF",
        "Xbox",
        "just $99",
        "US",
        "LTT",
        "three",
        "Solidworks",
        "Dynamic",
        "Chrome",
        "sec",
        "third",
        "Linus",
        "24",
        "two",
        "Access",
        "half",
        "Lo",
        "hundreds"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.10562599450349808,
        -0.04971231892704964,
        0.004909347742795944,
        -0.04811258986592293,
        0.11882469803094864,
        0.08064961433410645,
        -0.010345333255827427,
        0.020372767001390457,
        -0.02639361470937729,
        -0.005747787654399872,
        -0.0293134693056345,
        0.0008504641009494662,
        -0.10303357243537903,
        -0.016980092972517014,
        0.03517131507396698,
        -0.02670549415051937,
        0.06483360379934311,
        -0.018866615369915962,
        -0.08909019082784653,
        -0.05197082459926605,
        0.0034640866797417402,
        -0.09899454563856125,
        -0.014521414414048195,
        -0.01398935355246067,
        0.030377056449651718,
        -0.014931054785847664,
        -0.013318018056452274,
        -0.04925554245710373,
        0.050872042775154114,
        -0.022257568314671516,
        -0.02183074690401554,
        0.07883940637111664,
        -0.01440003328025341,
        0.0039844876155257225,
        0.013147404417395592,
        -0.11069682240486145,
        0.03529937192797661,
        -0.0936926081776619,
        -0.11055326461791992,
        -0.052378639578819275,
        0.02052353322505951,
        -0.02877315692603588,
        -0.03469030186533928,
        0.021062884479761124,
        0.013692180626094341,
        0.010965768247842789,
        0.03952652961015701,
        -0.0720299556851387,
        -0.02143220230937004,
        0.07509399950504303,
        -0.01625484973192215,
        -0.09155235439538956,
        -0.03809196501970291,
        0.011552609503269196,
        -0.04165688902139664,
        -0.026839178055524826,
        0.007550900802016258,
        0.0675043985247612,
        -0.0022189002484083176,
        0.024127457290887833,
        0.033132653683423996,
        -0.09320659190416336,
        -0.03480236977338791,
        0.05802595615386963,
        0.011652224697172642,
        -0.03125326335430145,
        -0.053700704127550125,
        0.09750310331583023,
        -0.04911017045378685,
        -0.048304978758096695,
        -0.004351187963038683,
        0.010441750288009644,
        0.006231421604752541,
        0.062379904091358185,
        -0.0034307397436350584,
        -0.07824081182479858,
        0.032156698405742645,
        -0.03607190027832985,
        -0.0189136303961277,
        0.01060943678021431,
        0.018882878124713898,
        0.048518870025873184,
        0.027773259207606316,
        -0.027010338380932808,
        -0.03898967429995537,
        -0.022272750735282898,
        0.019969431683421135,
        0.024745328351855278,
        -0.05954516679048538,
        -0.060127392411231995,
        -0.06410546600818634,
        0.07781043648719788,
        0.01428090687841177,
        0.02441912703216076,
        -0.005506936460733414,
        0.03393229842185974,
        0.010870835743844509,
        -0.09596140682697296,
        0.018375404179096222,
        0.06621510535478592,
        -0.015037339180707932,
        0.03297995775938034,
        0.021081512793898582,
        -0.0038187236059457064,
        -0.0855967178940773,
        -0.02625381015241146,
        0.03757481649518013,
        0.09198718518018723,
        0.002171963220462203,
        -0.025209028273820877,
        -0.0179651640355587,
        0.026327382773160934,
        -0.06739967316389084,
        -0.06654395908117294,
        0.059593506157398224,
        -0.09095544368028641,
        -0.04989628121256828,
        -0.003632292151451111,
        0.03978591784834862,
        -0.010212971828877926,
        0.023447243496775627,
        -0.035008665174245834,
        -0.0010305566247552633,
        0.034395262598991394,
        -0.04867520555853844,
        0.028582017868757248,
        0.023938307538628578,
        3.677233315297609e-35,
        -0.006280652247369289,
        0.026576470583677292,
        -0.05583103001117706,
        0.012296735309064388,
        0.07099957764148712,
        0.0066289147362113,
        0.024187766015529633,
        -0.008029693737626076,
        -0.06524927914142609,
        0.06571190804243088,
        -0.003013713052496314,
        0.04728955775499344,
        -0.09995667636394501,
        0.0994923934340477,
        0.047723438590765,
        -0.10938943177461624,
        -0.04026752710342407,
        0.07176536321640015,
        0.033999018371105194,
        -0.03159239888191223,
        0.004912002477794886,
        0.016355639323592186,
        0.047133851796388626,
        -0.034149765968322754,
        0.07043866813182831,
        -0.06385284662246704,
        0.011175104416906834,
        -0.041727062314748764,
        0.04466622695326805,
        0.014757374301552773,
        -0.032289545983076096,
        -0.00869722105562687,
        0.03795863315463066,
        -0.08620215952396393,
        -0.014321261085569859,
        0.008345577865839005,
        -0.1194973737001419,
        -0.11602865904569626,
        0.03597375378012657,
        0.013191130943596363,
        0.004295878577977419,
        0.022001856938004494,
        -0.11666424572467804,
        -0.09657019376754761,
        -0.09876689314842224,
        0.02092875726521015,
        0.08568555861711502,
        -0.006822854746133089,
        0.03579945117235184,
        0.015163595788180828,
        -0.011806950904428959,
        0.051896024495363235,
        -0.1379488706588745,
        0.007162691559642553,
        0.049882788211107254,
        -0.084991455078125,
        0.017796549946069717,
        -0.046933792531490326,
        0.10316194593906403,
        0.039831407368183136,
        -0.02242937497794628,
        -0.03167081996798515,
        0.047332875430583954,
        -0.06253897398710251,
        -0.053701478987932205,
        0.06663663685321808,
        0.049882542341947556,
        0.04170313477516174,
        -0.0048987045884132385,
        -0.012340339832007885,
        -0.13472819328308105,
        0.011477990075945854,
        0.007819541729986668,
        -0.07815395295619965,
        0.05102673918008804,
        -0.025035129860043526,
        -0.0744967982172966,
        -0.043203502893447876,
        -0.0488206148147583,
        0.032592788338661194,
        -0.10465336591005325,
        0.019371381029486656,
        0.0208720900118351,
        0.025322765111923218,
        -0.017436938360333443,
        -8.064346184255555e-05,
        0.0027757699135690928,
        -0.02406761236488819,
        -0.04700592905282974,
        -0.004057004582136869,
        -0.044586192816495895,
        0.002756842179223895,
        0.0240271408110857,
        -0.0008085874724201858,
        -0.00012283666001167148,
        -2.6810159038066326e-33,
        -0.022231517359614372,
        0.018730299547314644,
        -0.09352954477071762,
        0.005307876504957676,
        0.004178742878139019,
        -0.014307120814919472,
        0.0282053891569376,
        0.025515802204608917,
        0.02883022464811802,
        -0.028107205405831337,
        -0.011453038081526756,
        0.0017077289521694183,
        -0.07642242312431335,
        0.020425869151949883,
        -0.09180978685617447,
        -0.06625806540250778,
        0.024868395179510117,
        -0.05870334059000015,
        0.05706600099802017,
        -0.03167352452874184,
        0.08151944726705551,
        0.0012695109471678734,
        -0.025669150054454803,
        0.04833240061998367,
        0.019020358100533485,
        0.04251980036497116,
        -0.022437432780861855,
        -0.000566580391023308,
        0.049395523965358734,
        0.059548042714595795,
        0.03443943336606026,
        -0.03046378120779991,
        -0.005868694745004177,
        -0.02611142210662365,
        0.04164309427142143,
        -0.02545609511435032,
        0.1538001447916031,
        0.08188614994287491,
        -0.07347239553928375,
        -0.031626708805561066,
        0.08840754628181458,
        -0.07205277681350708,
        0.010206179693341255,
        -0.031232640147209167,
        -0.011365067213773727,
        -0.007951490581035614,
        -0.030919162556529045,
        -0.009040727280080318,
        -0.027330422773957253,
        0.03261632099747658,
        0.03093813546001911,
        -0.06630001962184906,
        0.038501426577568054,
        -0.026469718664884567,
        0.03244650363922119,
        -0.07392881065607071,
        -0.0031615779735147953,
        0.0009494915138930082,
        0.01199023425579071,
        -0.011771485209465027,
        0.05258921906352043,
        -7.826211913197767e-06,
        -0.021582171320915222,
        -0.019897427409887314,
        0.009060018695890903,
        0.03126727417111397,
        0.05140672251582146,
        0.018808970227837563,
        -0.06664420664310455,
        0.023981235921382904,
        -0.021142158657312393,
        0.020202865824103355,
        0.030952828004956245,
        -0.06738970428705215,
        -0.06814546138048172,
        0.016054591163992882,
        0.09324279427528381,
        0.020475395023822784,
        0.07606901228427887,
        -0.028717154636979103,
        -0.045369889587163925,
        0.0389711819589138,
        0.09304071962833405,
        -0.008879078552126884,
        0.06449533998966217,
        0.06391765922307968,
        0.01576387509703636,
        -0.026298977434635162,
        0.033736780285835266,
        -0.020799757912755013,
        -0.04226844385266304,
        0.06061252951622009,
        -0.020076602697372437,
        0.06825995445251465,
        0.057070400565862656,
        -6.743725577962323e-08,
        -0.09302754700183868,
        0.038894206285476685,
        0.009273807518184185,
        0.005986732896417379,
        -0.06782703101634979,
        -0.06425678730010986,
        0.05271387845277786,
        0.07250505685806274,
        0.020882751792669296,
        -0.06565798074007034,
        0.038863711059093475,
        -0.10107459127902985,
        0.0037073593121021986,
        0.0038980299141258,
        0.1125941127538681,
        0.036450132727622986,
        -0.03957424312829971,
        0.004289493430405855,
        -0.00017021775420289487,
        -0.04060903191566467,
        -0.03841306269168854,
        0.043391771614551544,
        0.133779376745224,
        -0.01969793625175953,
        -0.046500273048877716,
        0.02367657981812954,
        0.05519914627075195,
        0.08665109425783157,
        0.12290602922439575,
        -0.04568994417786598,
        -0.01995924487709999,
        -0.013258594088256359,
        -0.005385919939726591,
        0.021414630115032196,
        0.08108649402856827,
        -0.02599126659333706,
        -0.08440251648426056,
        0.05208977684378624,
        0.016999727115035057,
        0.027853816747665405,
        -0.0652640238404274,
        0.047994889318943024,
        0.028328001499176025,
        0.01933167688548565,
        0.08794461935758591,
        0.0007956312620081007,
        -0.011701354756951332,
        -0.08040867000818253,
        -0.031599145382642746,
        0.007299006450921297,
        -0.04848138242959976,
        0.0284100454300642,
        -0.017066681757569313,
        0.09990444779396057,
        0.10199102014303207,
        0.04248993843793869,
        -0.030473986640572548,
        0.027875063940882683,
        -0.02790180779993534,
        0.07114644348621368,
        0.0003874030080623925,
        -0.08327885717153549,
        -0.017266253009438515,
        0.09731639921665192
    ]
}