{
    "id": "XYfkJI9dbC4",
    "title": "Game Console Myths",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-04-13T18:05:45Z",
    "video_url": "https://www.youtube.com/watch?v=XYfkJI9dbC4",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 161423,
    "likes": 5230,
    "comments_count": 133,
    "description": "Are these myths real or just urban legends? 15 Smartphones that FAILED to Beat the iPhone:  We Tried Netflix Gaming So You Dont Have To:  I SCAMMED Goodwill:  This Should be BANNED:  We Tried WISH for Rich People:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Gaming Myths 0:05 Did the FBI make a mind-control arcade game? 1:10 Do PlayStations have a kill switch? 2:16 Did blowing into NES cartridges fix them? 3:19 Can you fix the Red Ring of Death with towels? 4:45 Can you install Windows on the Xbox? 5:22 Are there Halo easter eggs inside Xboxes? 6:04 Does Nintendo create artificial console rarity? 7:30 Does Pikachu hate Sony? 8:19 Did Shenmue kill the Dreamcast? 9:24 Did Atari bury millions of cartridges in the desert? 11:24 What do you think?",
    "description_links": [
        "https://youtu.be/-E9VPBtAUXU",
        "https://youtu.be/-DlpJHcbtHE",
        "https://youtu.be/cvFZdvdEC_w",
        "https://youtu.be/jA_cGZpgYK8",
        "https://youtu.be/sPOu5YN7X94",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Hello and welcome to This Is. Today we got some gaming console myths like, did the FBI make a mind controlling arcade game? - Yes, they did because we made our very first episode of This Is all about the myth of Polybius which is actually a myth and not actually a (murmurs). - Yeah, this is totally an urban legend. So in 1981, supposedly the government placed some arcade cabinet in Portland, Oregon. The game was said to be so addictive that people would fight over who got to play next. And it was reportedly causing hallucinations, amnesia insomnia seizures, and night terrors. - There were lots of arcade cabinets that were put in test markets and seeing things come and go. Maybe not with final branding, it's not outside the realm of possibility that people got a little punchy on the the real reason behind the mind controlling arcade cabinets, especially when there were stories back in the 80s of kids, like, you know, gaming for hours and hours and hours, and actually having like seizures and stuff because they didn't eat or drink for 10 hours at a time or something. - This is my favorite part of the story. All they had was like orange soda and Coke for like three days straight and they got so constipated that they had to go to the hospital. - Oh, okay. That's not what I thought it's going- So, because they couldn't (weird noise) their pants. Now there's a mind controlling arcade cabinet. This one's debunked. Let's see what the next one is. - Do plays stations have a kill switch. This is not a myth that I had heard before we started doing research for this video. But supposedly, especially in Japan there was a lot of myths that Sony and specifically for the PlayStation division, were porting in sort of planned obsolescence with their consoles. - So the reason this, this was connected to the PlayStation was because the batteries in the PS3 and PS4s, it was a CMOS battery and those started to die. And when they were dead they couldn't connect to the Playstation Network. - The idea was that if, at some point in the future PSN no longer works and you didn't have that CMOS battery that was charged, your console wouldn't know the date, wouldn't be able to activate. - Yeah. - Wouldn't be able to really do much of anything. Again, like most myths, there were kernels of truth here, in that, if they didn't fix some of these things PS3s and PS4s would die at some point. But even though I might not be the biggest fan of some of Sony's decisions when it comes to business, I don't think that they are as nefarious as this to port a hidden kill switch inside their consoles. - I mean, they're not Apple with their iPhones. - Okay, Matt, that's a, that's not a game console myth. - That's not a game console myth, but you know what is a game console myth? Did blowing into the NES or SNES cartridges fix them? - No. - Absolutely. - But yes. Of course it did. - Like. (blowing sounds) - Did blowing into them help with them loading. It absolutely did, but it wasn't the actual blowing that made this work. So, most people assume the trick worked because they were cleaning dust from the contacts. - Yeah. - But NES had a weird connection method. They required zero insertion for it, - ZIF, - Kinda like- - As the kids say. - Yeah, they wanted it to feel springy, which was cool, especially on the SNES when you had that awesome push button spring, however, this caused the connections to kind of bend and wear out quickly. If you had just unplugged it, plugged it back in without blowing on it, probably would've fixed it regardless of blowing on it. Now moisture from your breath could actually help with the connection. - And that's the crazy thing that I think actually makes this myth a little bit realistic because, you know if your game's not working, you blow on it. You put it in, you're immediately gonna think it works. But, part of the reason for that was, there's condensation in your breath. Having a little bit of extra moisture on the pins could help to bridge those electrical connections. It's also a little bit of a superstitious kind of thing. So people have just kind of continued to do it. - You know what's not superstition, this next myth. - Can you fix the Xbox 360 red ring of death with towels? I'm sad to say that I feel we actually have to explain what the red ring of death is because some people weren't- - 'Cause we old. - Alive when that happened. So the OG model of the Xbox 360 that launched in 2005 had what was known as the red ring of death. Which is essentially an issue of overheating due to a couple of technical problems when they actually were producing the consoles, which would basically mean that after a while, your console would lock up, you get the three little red rings. Done-zo. It was over. That is not a myth. That was a 100% of fact. And it was hugely costly to Microsoft, but what was, was how to fix it, using the towel trick. As a naive, however old I was teenager, traded in all of my, like PSP, most every video game I had to my local video game store in order to buy a used Xbox 360. And it gave the red ring of death about a month after I did that. I took it back to them and they fixed it, by I think, doing the towel trick. - Can you tell me what the towel trick will was? Yeah, overheat the (weird noise) out of your Xbox. - So basically you wrapped it in a towel. - Let it get super hot. Let it reflow the solder, let it warp things back into place. The thing was, this actually did kind of work but it kind of worked in the way that you could slow your car down by running into a brick wall. The problem though- - But it wasn't a fix. - It was not a fixed, in fact it was very likely to end up killing your Xbox entirely once you did this a few times. - So, the myth that it was a fix, is busted. Can you install Windows 10 on the Xbox One or Series X? - The thing is, is that while the Xbox One and the Series X are based on, it used to be like Windows, I think eight, now it's like windows 10. - Yeah. The hardware is coded. It's the southbridge, northbridge, the proprietary design. So they don't make drivers that work with Windows 10 for the, the Xbox. - It's based on that same kind of architecture. It is so heavily locked down, that there's no way for us as mere mortals to do it. Now, if Microsoft wanted to, I feel very confident they could make this happen but why would they and why would they undercut PC sales with these series X at $500 that racks everything at 1500 bucks? - I will admit that I am the idiot who believed this one, next slide please. Are there Halo Easter eggs in all of the Xbox consoles? Can you tell me about this Austin Evans? - Yes, I can, because I think I was one of the first people to find these. So it began in the Xbox One S. I believe it was on the (mumbles) or the power spot or something but there was a little Master Chief Easter egg there. I remember I was really excited cause that was one of those first moments where we found something that was really exclusive and that no one had figured it out. And then it went viral, with people just screenshotting my video and not-- - Not tagging you in it. - Yeah. But yeah, the Series S and the Series X and actually have multiple things. So they actually put a lot of Easter eggs inside these consoles. I know, cause I open a lot of Xbox's but actually this is not a myth. This is a 100% confirmed. Microsoft are crafty little boogers. This one is, does Nintendo create artificial scarcity for their consoles? Now you might walk down the street and see your local Target out of Switch OLED's, out of Switch lights. Not selling the, the new 3DS XL, they should still make it. But the thing is, I don't believe that this myth this true. Now it's, it's a complicated thing. It's, it's hard to say, like making and manufacturing consoles is difficult and Nintendo, one of the very few companies who actually profit off of the sale of consoles. It is very difficult, especially with supply chains as they are now, to keep stuff like Switches in stock. Because let's face it. People are absolutely still crazy about the Switch, even though it has been out for five years now. - Yeah. It's, that's, that's absurd to me. People just really like the Switch and they're buying 'em up left and right. It's the number one selling console in the world. - And you have to kind of keep into context, right? They switch came after the Wii U, which was a historically horrible flop that Nintendo really wishes that you would completely forget about. So, it's understandable that they were a little bit, sort of slow on the Wii. And to be fair, I dunno why Nintendo gets singled out. Sony's no better. Microsoft is only slightly better. I mean it's a hard business to decide are you're gonna make you know, a hundred million dollars worth of PS5's or a hundred- - Especially- - Billion dollars. - Yeah, especially when we're in a chip shortage, if they were artificially doing this, they would jack up the prices. To be fair, I think the Switch should be about 50 bucks less across the board, but that's just my opinion. - I mean, a hundred million people disagree with you. - I agree, that they disagree. But you know what we don't disagree with? We can all agree on our next myth. - Does Pikachu- - Hate Sony. - I was gonna do that one, but no, no, no, no, no. - It like, Hey You, Pikachu was a game for the N64 where it had the microphone and you could talk to Pikachu. It was incredibly rudimentary, right? Even for its time, it was very limited. And the rumor was that if you said Sony or PlayStation, Pikachu get mad. And to be fair, that did kind of happen sometimes. We also could say a word like bread and Pikachu might get mad. Like it was, it was just so rudimentary. - What it probably was, was frustration from Pikachu, not understanding what you're actually trying to say. - Yeah. And in fact, later on when the game was actually decompiled, it was found that there were no Sony or Playstation. This just was not a real thing. - They weren't even in his list of vocabulary. - But you know what is? - Which probably just frustrated this tiny little AI brain. - You know what it was in his vocabulary, - What? - Our next myth. How Sega has killed its console business with the most expensive game of all time. - Many people blame that Shenmue was the reason that Dreamcast failed, because it was so expensive and failed to break even. You know, what really killed the Dreamcast? There's no type of like copy protection on any of the discs. - 'Cause they were like one gig- - It was just a- - CDs or something right? - It was just a one. Yeah. It was just a base CD. Everyone I knew who had a Dreamcast had a massive collection, they never bought games for it. - Yeah. Other thing was specifically when it was related to Shenmue. So this was an expensive game for the time, right? And it was very unique looking title, but the thing is, while it was expensive the estimates kind of put it maybe between like 45 to 70 million dollars. Shenmue was expensive but the Dreamcast was doomed to failure far before this actually came out. The other thing was, there were other issues that sort of kept the Dreamcast from reaching its full potential, because Nintendo and say, and Sony were really starting to dominate the space. Sega had kind of been a little bit on the back foot really since the Saturn had failed to kind of take off. The Dreamcast had everything going against it and it inevitably crashed and burned. And we got the Xbox. - Did Atari make an ET game so bad that they buried millions of cartridges in the desert. - When I hear the word gaming myths, this is and I think will always be number one. Because this was an absolutely massive urban legend. So to set the stage, back in the early eighties this was really the peak of home console gaming, right? So the Atari 2600 was huge and there were big, big dollars flowing around. But there was trouble looming because one of the issues with the Atari games was that they were turning quickly into shovelware. They were just literally shovelware. - Anyone could develop anything for any system. There was no quality control. Anyone could make whatever the hell they wanted for these devices. - So with shovelware on the rise and Atari getting incredibly punchy by doing things like creating 12 million copies of the PacMan game when they had only sold 10 million consoles. And then there was stuff like ET, which was a huge movie tie in. Atari was convinced that they were gonna just make an absolute pile of money on it. And because of that, they forced a single guy to make the whole game in like five weeks. And it was terrible, widely regarded as one of the worst games of all time. So you've got the stage where Atari are making horrible financial decisions, printing more games than they have made consoles to play said games. So Atari, in the dead of night took millions of games or at least hundreds of thousands of these unsold cartridges, dumped them in a landfill, never to be seen again. Now this seems so outrageous and ridiculous that it was not believed until 2014, in which for a documentary, they excavated at the site that supposedly happened and they found the games. And in fact, I think actually a lot of them got like sort of authenticated and sold. I'd love to have one of these games 'cause that'd be awesome to have in a collection. It's a wild story - For the longest time. This was along those sign, the lines of, you know, oh my uncle at Nintendo told me X whatever. So like, I mean the myth that they buried, buried millions is, is probably debunked. This is crazy to find out something such, such a big urban legend. - Over 20 years later. - This would be along the same lines. Imagine if Polybius turned out to be real, that we found out like recently. - Imagine- - That'd be crazy. - Imagine if the millions of people who are watching this video right now, forgot to hit the subscribe button to ring-a-ling the notification bell to always be updated the next time that your buddies Austin and Matt hit you with some spicy gaming myths. And until next time, stay out of the landfills friends because it's mostly garbage there. You're not gonna find any more Atari games.",
    "transcript_keywords": [
        "game console myth",
        "Xbox",
        "myth",
        "game",
        "Yeah",
        "Kind",
        "consoles",
        "games",
        "people",
        "console myth",
        "thing",
        "console",
        "game console",
        "Atari",
        "switch",
        "Sony",
        "make",
        "Atari games",
        "Nintendo",
        "Pikachu"
    ],
    "transcript_entity_values": [
        "zero",
        "XL",
        "three",
        "millions",
        "Target",
        "Coke",
        "OG",
        "Pikachu",
        "20 years later",
        "Polybius",
        "Series",
        "Halo Easter",
        "CMOS",
        "70 million dollars",
        "FBI",
        "Atari",
        "Nintendo",
        "Xbox 360",
        "Microsoft",
        "500",
        "SNES",
        "the early eighties",
        "Xbox",
        "NES",
        "Windows 10",
        "Polybius",
        "a hundred million dollars",
        "like five weeks",
        "10 hours",
        "Nintendo",
        "Matt",
        "at least hundreds of thousands",
        "1500 bucks",
        "hours and hours and hours",
        "Austin",
        "Xbox One",
        "1981",
        "2014",
        "the Atari 2600",
        "Xbox",
        "first",
        "between like 45",
        "a hundred million",
        "Portland",
        "10",
        "PacMan",
        "the Series X",
        "Today",
        "PS5",
        "Oregon",
        "Windows",
        "about 50 bucks",
        "Shenmue",
        "the Playstation Network",
        "Xbox One S.",
        "Pikachu",
        "Switches",
        "N64",
        "Switch OLED's",
        "100%",
        "the Series X",
        "10 million",
        "spring",
        "Playstation",
        "about a month",
        "Dreamcast",
        "Sega",
        "PlayStation",
        "the Series S",
        "Saturn",
        "12 million",
        "Austin Evans",
        "one",
        "five years",
        "Apple",
        "Xbox 360",
        "Easter",
        "2005",
        "eight",
        "three days",
        "iPhones",
        "Japan",
        "Wii",
        "Sony",
        "Atari",
        "Switch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "DATE",
        "TIME",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "GPE",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "EVENT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "GPE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        0.04913070797920227,
        -0.02482941746711731,
        -0.030007435008883476,
        -0.12044923007488251,
        0.07173263281583786,
        0.06593646109104156,
        0.06362620741128922,
        0.0379023402929306,
        -0.0019894735887646675,
        0.1166919618844986,
        -0.009153296239674091,
        0.06120229512453079,
        0.09451974183320999,
        0.010267546400427818,
        0.04882150888442993,
        0.009351546876132488,
        0.038450390100479126,
        -0.018877577036619186,
        -0.05443274602293968,
        0.02484116144478321,
        -0.02051500603556633,
        -0.06160163879394531,
        -0.03642215579748154,
        0.027229515835642815,
        -0.06398630887269974,
        0.04584155231714249,
        -0.04503769800066948,
        -0.05442814901471138,
        -0.12232344597578049,
        0.021061290055513382,
        -0.048645224422216415,
        0.02081049047410488,
        -0.010351135395467281,
        -0.03570137917995453,
        0.030225852504372597,
        -0.07102876156568527,
        0.054725635796785355,
        -0.0492347814142704,
        -0.021794559434056282,
        -0.05058145523071289,
        -0.06464560329914093,
        -0.018724780529737473,
        -0.011585017666220665,
        0.05835716426372528,
        -0.024952903389930725,
        -0.0299847275018692,
        -0.06782571226358414,
        -0.045960187911987305,
        -0.06100642308592796,
        -0.009472088888287544,
        -0.05379302427172661,
        0.029423119500279427,
        0.12077029049396515,
        0.014609192498028278,
        0.031108427792787552,
        -0.05513373389840126,
        -0.01122324913740158,
        0.017665762454271317,
        0.09776528924703598,
        -0.00614932319149375,
        -0.08167163282632828,
        -0.0364711619913578,
        -0.017112767323851585,
        0.02792157605290413,
        0.0059997341595590115,
        -0.011049234308302402,
        0.03925953432917595,
        -0.019077282398939133,
        0.006799052935093641,
        -0.01680075190961361,
        -0.06547296792268753,
        0.008140971884131432,
        0.009356854483485222,
        0.011973490938544273,
        -0.031332828104496,
        0.046497635543346405,
        -0.02852649800479412,
        0.009699907153844833,
        -0.061846211552619934,
        0.011483337730169296,
        0.05953739210963249,
        -0.0020719305612146854,
        0.0031991316936910152,
        -0.04281606152653694,
        -0.06472309678792953,
        0.054864633828401566,
        -0.08152642101049423,
        0.045352254062891006,
        -0.014244785532355309,
        -0.013852342031896114,
        -0.037189632654190063,
        0.003571515902876854,
        0.11497417092323303,
        0.027971895411610603,
        0.08171212673187256,
        -0.028437312692403793,
        -0.04403406009078026,
        -0.05025463178753853,
        -0.024060280993580818,
        -0.0029801810160279274,
        0.028896456584334373,
        -0.012636513449251652,
        -0.0539376325905323,
        -0.05940631777048111,
        0.06487772613763809,
        -0.006232038140296936,
        -0.08244658261537552,
        0.02839306741952896,
        -0.01865389756858349,
        0.009933637455105782,
        -0.08129718899726868,
        -0.00521183991804719,
        -0.00579075887799263,
        -0.004762149881571531,
        0.057192396372556686,
        0.04988257959485054,
        -0.012089651077985764,
        0.05035833269357681,
        -0.021567150950431824,
        0.012330083176493645,
        0.07374057173728943,
        0.04439299553632736,
        0.023885617032647133,
        0.03163107484579086,
        0.09028342366218567,
        0.005794128868728876,
        -0.04957876354455948,
        -1.8401965496069585e-33,
        0.009442406706511974,
        0.02086513116955757,
        0.0027064578607678413,
        0.018811993300914764,
        0.0229216068983078,
        0.0022944591473788023,
        0.011875031515955925,
        0.08588939160108566,
        0.05729641020298004,
        0.04864152520895004,
        -0.0020667770877480507,
        0.05504880100488663,
        -0.10710082948207855,
        0.01783899776637554,
        0.08081725239753723,
        0.0364999957382679,
        -0.04153944179415703,
        -0.05071185529232025,
        0.004666320979595184,
        -0.02129198983311653,
        -0.003283813362941146,
        0.02843993529677391,
        0.05997930467128754,
        -0.06371036171913147,
        -0.015390669927001,
        0.04046330973505974,
        -0.1509256660938263,
        -0.019690658897161484,
        0.12426254898309708,
        0.04027838259935379,
        -0.09071354568004608,
        -0.04742126539349556,
        -0.02846803143620491,
        0.004119564779102802,
        0.06228749826550484,
        -0.022224105894565582,
        -0.020316433161497116,
        -0.07503515481948853,
        -0.04544397071003914,
        0.10738029330968857,
        -0.030942212790250778,
        0.0009570837719365954,
        -0.12650726735591888,
        -0.010863691568374634,
        0.07455837726593018,
        -0.004426521714776754,
        0.021603692322969437,
        -0.07547912001609802,
        -0.12730273604393005,
        -0.016013383865356445,
        -0.023512788116931915,
        0.07298068702220917,
        0.004300272092223167,
        -0.04337945953011513,
        -0.022014204412698746,
        -0.04688701778650284,
        0.013429529033601284,
        -0.07781869173049927,
        0.00370497303083539,
        0.02079772762954235,
        0.03885384276509285,
        -0.02614673040807247,
        0.009764607064425945,
        -0.030206650495529175,
        -0.10321897268295288,
        -0.0023783270735293627,
        0.09804242849349976,
        0.044460367411375046,
        -0.04753924533724785,
        0.03751027211546898,
        0.042597878724336624,
        0.03770364820957184,
        -0.03426440805196762,
        -0.02429371513426304,
        0.0014991355128586292,
        0.025772608816623688,
        -0.02132106013596058,
        -0.0073411292396485806,
        -0.08462583273649216,
        -0.04786486178636551,
        0.054136600345373154,
        0.04456073045730591,
        -0.03042064607143402,
        0.01732790656387806,
        -0.011814852245151997,
        0.011880176141858101,
        0.042502760887145996,
        -0.04250859096646309,
        -0.0004117628850508481,
        -0.026946866884827614,
        -0.10721366852521896,
        -0.06583067774772644,
        -0.0014288447564467788,
        0.037379197776317596,
        -0.04100774973630905,
        -4.151963137361921e-34,
        -0.06237249821424484,
        -0.09965623170137405,
        -0.03392249718308449,
        0.005917076487094164,
        -0.02126433700323105,
        -0.09196433424949646,
        -0.04949266090989113,
        -0.028926638886332512,
        0.03616110607981682,
        -0.0506773479282856,
        -0.06879859417676926,
        0.05414889007806778,
        -0.004242308437824249,
        0.06207723915576935,
        0.00020076677901670337,
        -0.0809524804353714,
        0.015041986480355263,
        -0.013056295923888683,
        -0.015524523332715034,
        0.008051219396293163,
        0.059923529624938965,
        -0.008580350317060947,
        -0.07634923607110977,
        0.03772855922579765,
        0.05864357203245163,
        0.08387868851423264,
        0.019823512062430382,
        -0.027079137042164803,
        0.06607340276241302,
        0.05217762663960457,
        0.023709271103143692,
        0.04859566688537598,
        0.1009049192070961,
        0.03914249688386917,
        0.057113319635391235,
        0.0453282967209816,
        0.12191334366798401,
        -0.016692887991666794,
        -0.0350276380777359,
        -0.07246509194374084,
        0.0037286621518433094,
        -0.005367850419133902,
        -0.0937303975224495,
        -0.01675224117934704,
        -0.019352518022060394,
        0.03941711038351059,
        -0.0285738967359066,
        0.018022993579506874,
        0.05627910792827606,
        -0.002064575208351016,
        0.03597421571612358,
        -0.007776942104101181,
        -0.04740040376782417,
        -0.009331903420388699,
        -0.07186413556337357,
        -0.06158798933029175,
        -0.09439480304718018,
        0.007115201558917761,
        0.05549049749970436,
        0.019878271967172623,
        0.015442180447280407,
        0.06654168665409088,
        -0.10802151262760162,
        0.0008122887811623514,
        0.014095042832195759,
        0.003189247800037265,
        0.09041675925254822,
        0.04613047093153,
        -0.009854955598711967,
        -0.07907350361347198,
        -0.017921140417456627,
        -0.03547833114862442,
        -0.007434588856995106,
        0.044815558940172195,
        0.011680240742862225,
        0.06759104132652283,
        -0.04392880201339722,
        -0.06149562448263168,
        -0.005886050872504711,
        0.055011726915836334,
        -0.02068842388689518,
        -0.007229402661323547,
        0.06238779053092003,
        0.039215728640556335,
        0.04770410805940628,
        0.019491927698254585,
        0.004596604034304619,
        0.03483298420906067,
        -0.08918436616659164,
        -0.057147443294525146,
        0.008520266972482204,
        0.008087122812867165,
        -0.002634291537106037,
        0.1481931209564209,
        -0.01567966304719448,
        -5.4311914965410324e-08,
        0.07850738614797592,
        -0.007795725483447313,
        0.010420295409858227,
        0.03472214192152023,
        0.02895006723701954,
        -0.012288638390600681,
        0.005284625105559826,
        0.03594602271914482,
        0.025718610733747482,
        0.03450530767440796,
        -0.0073948511853814125,
        0.0009327708976343274,
        -0.05677731707692146,
        0.04284615442156792,
        0.06313122808933258,
        0.0955931767821312,
        -0.019164564087986946,
        -0.049408599734306335,
        0.010477355681359768,
        0.038124509155750275,
        0.07083532214164734,
        0.0875067487359047,
        0.03521541878581047,
        -0.1260434091091156,
        -0.050567902624607086,
        -0.05215725302696228,
        -0.09735169261693954,
        -0.009096206165850163,
        0.01620521955192089,
        0.1319320797920227,
        -0.01005761232227087,
        -0.10762200504541397,
        -0.02778998389840126,
        -0.04700235649943352,
        0.044606104493141174,
        -0.03826482966542244,
        0.06616339087486267,
        -0.010917247273027897,
        0.05617290362715721,
        -0.08281441777944565,
        0.006457007955759764,
        -0.06660206615924835,
        -0.006132904905825853,
        -0.00035119650419801474,
        0.017221029847860336,
        -0.018517037853598595,
        -0.10482337325811386,
        -0.049398817121982574,
        0.00016938045155256987,
        0.0022553368471562862,
        0.011029704473912716,
        0.02036689966917038,
        0.030862122774124146,
        0.05174063518643379,
        0.10813909024000168,
        -0.07507685571908951,
        0.00968188513070345,
        -0.01462099514901638,
        -0.01114348042756319,
        -0.04876667261123657,
        0.06619973480701447,
        7.835969154257327e-05,
        0.01418936625123024,
        0.05049620941281319
    ]
}