{
    "id": "Y1usMCRo108",
    "title": "OnePlus 5T Teardown! - Hidden water resistance?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-11-21T17:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=Y1usMCRo108",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 5T",
        "OnePlus",
        "flagship killer",
        "smartphone",
        "android",
        "tech",
        "one plus 5t",
        "review",
        "OnePlus 5t unboxing",
        "teardown",
        "dissassembly",
        "repair",
        "guide",
        "how to fix",
        "fix",
        "screen",
        "battery",
        "one plus 5 repair",
        "water damage",
        "water resistance",
        "cracked screen"
    ],
    "views": 1409172,
    "likes": 24640,
    "comments_count": 1514,
    "description": "The OnePlus 5T is up for a teardown. Watch in this video as I open up the newest OnePlus 5T and show how the screen and battery can be removed and replaced. Whether you just like seeing tech from the inside, or you actually have something to fix on your own phone, this is a good video to watch.   I will remove the screen from the OnePlus 5t first, followed by the battery and the cameras. The Cameras on the OnePlus 5T do not have OIS unfortunately... but we still get a close up look at the way those are assembled.   HERE ARE REPLACEMENT PARTS:   As always let me know if you have any questions. And leave any tips for people attempting this repair - if you have already attempted it yourself.   Awesome iPhone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://goo.gl/zP2iCD",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The OnePlus 5T has survived my durability test, and it's time for the teardown. I review technology from the inside. It'll be interesting to see if OnePlus had added any unadvertised water resistance to their newest flagship. Let's get started. [Intro] At the bottom of the phone there are two tiny screws. My pentalobe screwdriver did work for this, but I think the actual bit is a T2. Just make sure not to strip the screws. The SIM card tray does come out at this point as well. This time it is mandatory. Now, lifting off the screen is pretty difficult. I feel like the 5T is much tighter than the previous OnePlus 5. I am using a thin metal pry tool to get between the plastic edge of the screen and the metal edge of the phone. There is no adhesive holding the screen down, but the clasps are extremely tight. So as you get one up and out, the rest of them get pinched in harder, making the screen difficult to remove. But the good news is is that the screen is attached to the pretty solid mid-frame which gives it stability, and also includes the motherboard and battery. So the whole thing lifts up and out as one unit, leaving the back panel and charging port behind. This also exposes the totally not red battery. Kind of disappointing, but maybe next year OnePlus will go back to the cool looking insides they used to have. We can always hope. The back of the phone is still attached with two ribbons: the first is for the ceramic fingerprint scanner. I'll unplug that ribbon like a little Lego and then fold over the back panel so I can unplug the battery and charging port ribbons. Both of these ribbons are hidden under a metal latch. I did remove the screw next to the latch, but it's actually a new screwless design it just unclips with a little leverage. Interesting. I'll unplug the battery connection first, and then the charging port ribbon. This allows the back panel to be completely removed from the phone. This metal panel has the fingerprint scanner and a bunch of gold contact pads for the antennas and button connections. We'll talk more about the charging port and headphone jack components in a second, but first, let's remove the battery. I remove one little screws at the bottom right of the motherboard and then unclip the metal bracket over the extension ribbon and fold it back away from the battery. Then I can grab the green pull tab at the right side of the battery and it was refreshingly easy to remove. Not much force is holding it in place, making this a pretty simple repair. The battery is a 3300 milliamp hour, and it also says it's not removable. Oops. The loud speaker in side the OnePlus 5T is held in place by 6 normal Phillips head screws. The loudspeaker then pulls away, revealing a circular vibration motor and the other side of the extension ribbon cable. The dual cameras are up here at the top of the phone. The connectors are held down by yet another metal bracket and one silver screw. Then both cameras can unplug and come away from the phone. Now, neither of these lenses have optical image stabilization. Both have the same focal point as well, meaning there is no wide angle or telephoto lenses, just the normal portrait mode. I do kind of wish the camera had a few extra perks to it, like that OIS or telephoto. They are pretty important, but it is what it is. There are 6 silver screws holding down what's left of the motherboard. I'll remove those and set them off to the side in an organized fashion and unclip the black signal wire from the edge of the board. This allows the whole thing to pull away from the phone body. Even though the OnePlus 5T has a flagship grade, Qualcomm Snapdragon 835 processor inside, it does not have any kind of copper heat pipe or thermal cooling system like other flagships have. The difference in performance and lifespan will probably be negligible, but sometimes those little details do matter in the long run. The front facing camera does not have OIS either, but most smartphones don't. The screen is still attached to the mid-frame at this point, and if the screen does need to be replaced, I would use heat to soften the adhesive between the two layers and pull them apart... a lot of heat. But that also destroys the screen and I want my phone to still work when I put it back together. Only do that if your screen is unsalvageable. I'll link all the replacement parts and tools in the video description. The buttons, like the volume and power are also attached to the mid-frame, so just make sure that the new screen has all the parts you need from your old screen before you put it back together. I'll set the motherboard back down into the frame and get those 6 screws screwed back in to hold it down. And then set the dual camera unit into it's slot and plug both of them in with the silver metal bracket holding it all down. The signal wire gets plugged in and then we'll mosey on down to the loudspeaker. I'll plug in the extension ribbon cable first and then secure the whole thing in place with the 6 silver screws. Now as far as waterproofing this phone goes, OnePlus did not talk about any IP ratings for the 5T. But it looks like they were playing with the idea of including an IP water resistance rating in the future. The phone does have a mesh screen protecting the insides of the loudspeaker from water. Plus the USB-C charging port has it's own red rubber ring around the tip. This could be for water resistance or shock absorption from plugging and unplugging the charging cable every day. Either way, rubber is a good thing. At least something inside the phone is red. Thumbs up for that. The inside of the frame does have foam running around the entire edge and this is probably to keep things tight with no squeaks or sounds. There is no tackiness or adhesive element to it, so it's not for water resistance. So even though it looks like OnePlus is thinking about water resistance in the future, definitely don't trust anything yet. I'll tuck the boring yellow battery into the frame and then plug in the extension ribbon cable over the top and protect it with that metal bracket and bottom right screw on the motherboard. The charging port is next. I'll clip that right by the battery, which plugs in last. And the whole thing is held down by the last metal latch and the final screw. The fingerprint scanner gets plugged in and then the whole contraption can fold over back on top of the phone. The screen is mostly held in place by friction and the metal tabs around the side, but I'm being careful not to apply too much pressure because glass is still glass, and too much pressure can break it, which would be pretty unfortunate at this stage of the game. Lucky for me though, the whole thing still turns on. I'll add those final two bottom T2 screws and call it a success. The OnePlus 5T might be hard to get inside of initially, but it's pretty repairable once you get in there. If you haven't seen the durability test of the OnePlus 5T, go check that out. And make sure to follow me over on Twitter we have a good time over there. Thanks a ton for watching. And I'll see you around.",
    "transcript_keywords": [
        "screen",
        "phone",
        "back",
        "battery",
        "metal",
        "OnePlus",
        "charging port",
        "screws",
        "charging",
        "ribbon",
        "extension ribbon",
        "metal bracket",
        "water resistance",
        "back panel",
        "port",
        "remove",
        "thing",
        "pretty",
        "water",
        "screw"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "OnePlus 5",
        "Qualcomm",
        "6",
        "Lego",
        "two",
        "jack",
        "Phillips",
        "SIM",
        "next year",
        "5",
        "T2",
        "first",
        "second",
        "835",
        "3300 milliamp hour",
        "one",
        "Twitter",
        "IP"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.13046367466449738,
        0.13209721446037292,
        0.13942331075668335,
        -0.027080420404672623,
        0.06708396971225739,
        -0.0887102410197258,
        0.02135700359940529,
        0.04541075974702835,
        0.009309952147305012,
        0.05237770453095436,
        0.02573741227388382,
        0.00032350426772609353,
        -0.0673648938536644,
        0.060087334364652634,
        -0.03518451750278473,
        -0.031193431466817856,
        -0.030385876074433327,
        -0.016286006197333336,
        -0.022581368684768677,
        0.000361670448910445,
        0.014667785726487637,
        0.014333592727780342,
        0.04128626361489296,
        -0.011713678948581219,
        0.02273509092628956,
        0.021062474697828293,
        0.005560093559324741,
        0.00338696944527328,
        -0.09000617265701294,
        -0.0758582055568695,
        0.05731385201215744,
        0.039983682334423065,
        -0.09051303565502167,
        0.004190512932837009,
        0.004685239400714636,
        -0.03706919401884079,
        0.06390600651502609,
        -0.0298733152449131,
        -0.041394948959350586,
        -0.06888950616121292,
        0.009105214849114418,
        0.037639208137989044,
        -0.008762998506426811,
        -0.004271903075277805,
        0.027031883597373962,
        0.03306218609213829,
        0.04248766601085663,
        -0.034080494195222855,
        0.0516384094953537,
        -0.02074223943054676,
        -0.033447522670030594,
        -0.008432486094534397,
        0.027767742052674294,
        0.019325997680425644,
        -0.09256157279014587,
        -0.011923560872673988,
        -0.008846823126077652,
        -0.024187622591853142,
        0.06232278794050217,
        -0.09154883027076721,
        0.10881050676107407,
        0.001764547429047525,
        -0.018815621733665466,
        0.09714165329933167,
        -0.005363469943404198,
        0.021072207018733025,
        -0.026540366932749748,
        -0.09379086643457413,
        0.012209816835820675,
        0.02169516310095787,
        -0.03645223006606102,
        -0.02366458624601364,
        0.02982330322265625,
        -0.04513682425022125,
        -0.021796362474560738,
        0.061814889311790466,
        0.010594497434794903,
        0.017532141879200935,
        0.02122465893626213,
        0.04989522695541382,
        0.0032178573310375214,
        -0.019533410668373108,
        0.002085170242935419,
        0.040816113352775574,
        0.02392921969294548,
        0.04212795943021774,
        0.033544592559337616,
        0.04822530597448349,
        0.050408702343702316,
        -0.12317153066396713,
        -0.04714816436171532,
        0.030024880543351173,
        -0.040562793612480164,
        0.024772049859166145,
        0.011559595353901386,
        -0.08173937350511551,
        -0.07923970371484756,
        -0.0997743234038353,
        -0.05535335838794708,
        0.03355981037020683,
        0.008528207428753376,
        -0.02194936014711857,
        0.08527063578367233,
        0.012606353498995304,
        0.01878856122493744,
        -0.05054490640759468,
        -0.060963355004787445,
        -0.024915441870689392,
        0.06171787157654762,
        0.033511605113744736,
        -0.02552878111600876,
        -0.009540091268718243,
        -0.01941244676709175,
        0.049723245203495026,
        0.07357624173164368,
        0.01458634715527296,
        -0.10253743827342987,
        0.05814303457736969,
        0.06310144811868668,
        -0.046074528247117996,
        -0.003401367925107479,
        -0.02704153209924698,
        -0.08069270849227905,
        0.03434951975941658,
        0.04903831332921982,
        0.04415707662701607,
        -0.022236589342355728,
        3.286403759674765e-33,
        0.0563189834356308,
        0.04795430600643158,
        0.0083865225315094,
        0.03127599507570267,
        -0.005711274221539497,
        0.023437153548002243,
        0.07228699326515198,
        -0.04468521475791931,
        0.016555465757846832,
        0.06321993470191956,
        -0.05536223575472832,
        -0.01120670884847641,
        -0.054793741554021835,
        -0.035874828696250916,
        -0.002101458376273513,
        -0.08215083926916122,
        0.036649879068136215,
        -0.03547924384474754,
        -0.04583059251308441,
        0.02204407937824726,
        -0.023231901228427887,
        0.03379793092608452,
        -0.05428370460867882,
        0.01414572075009346,
        0.1388671100139618,
        0.04663198068737984,
        0.041199732571840286,
        -0.031209653243422508,
        0.09509393572807312,
        0.02219475619494915,
        -0.06611505895853043,
        -0.003853016532957554,
        0.05050966888666153,
        0.02818385884165764,
        -0.002273871563374996,
        -0.004027334973216057,
        0.039163507521152496,
        -0.02154877968132496,
        0.055344246327877045,
        -0.030491584911942482,
        -0.08193996548652649,
        0.02386114001274109,
        0.02875896915793419,
        -0.04456477239727974,
        0.046015091240406036,
        -0.021621400490403175,
        -0.00776700908318162,
        0.027678705751895905,
        0.04588465765118599,
        -0.06466162949800491,
        -0.00011091033957200125,
        -0.03394105285406113,
        -0.006418800912797451,
        -0.024481961503624916,
        -0.11697598546743393,
        0.008031624369323254,
        0.010094119235873222,
        0.01875845156610012,
        0.05085312947630882,
        0.0835966169834137,
        -0.007238661404699087,
        0.039068177342414856,
        -0.033188074827194214,
        0.014568555168807507,
        -0.04356801137328148,
        0.025070806965231895,
        -0.0035366672091186047,
        0.009165744297206402,
        -0.012468709610402584,
        0.009950031526386738,
        -0.08951190114021301,
        -0.025309117510914803,
        0.020763318985700607,
        -0.021515248343348503,
        -0.022568052634596825,
        0.062204357236623764,
        0.03525257110595703,
        -0.06999363750219345,
        -0.004460837226361036,
        -0.01359053235501051,
        -0.04926992207765579,
        -0.0027232221327722073,
        0.09511302411556244,
        0.01932549849152565,
        0.013914254494011402,
        -0.060603294521570206,
        0.021882811561226845,
        -0.0615292489528656,
        0.04265380650758743,
        0.0861806869506836,
        0.03499407693743706,
        -0.03955457732081413,
        -0.038149427622556686,
        -0.05366883426904678,
        0.038392696529626846,
        -4.194358167643792e-33,
        -0.021520262584090233,
        -0.09223069995641708,
        -0.0031250102911144495,
        -0.03260868042707443,
        0.061556994915008545,
        -0.012120768427848816,
        0.04344576969742775,
        0.10341619700193405,
        0.07351571321487427,
        -0.01290544681251049,
        -0.007891998626291752,
        0.016475297510623932,
        -0.11833202093839645,
        -0.05340161174535751,
        -0.061078719794750214,
        0.006572287529706955,
        0.03816637769341469,
        -0.0036388421431183815,
        0.04864601790904999,
        0.0634380653500557,
        0.06511654704809189,
        0.05763717368245125,
        0.07820247858762741,
        0.026950491592288017,
        0.0160941444337368,
        0.07062042504549026,
        0.07018396258354187,
        -0.06187259033322334,
        0.028614625334739685,
        -0.04916669428348541,
        -0.07359188795089722,
        -0.023858146741986275,
        0.024057786911725998,
        0.047789521515369415,
        0.03449122607707977,
        0.07718878984451294,
        0.019485462456941605,
        -0.014703513123095036,
        -0.031132452189922333,
        -0.06072906032204628,
        -0.04027746990323067,
        0.025902338325977325,
        0.01757018081843853,
        -0.052840668708086014,
        -0.015124235302209854,
        0.0014386894181370735,
        -0.019516291096806526,
        0.018878895789384842,
        -0.06670800596475601,
        0.011576661840081215,
        -0.026935826987028122,
        0.01459730975329876,
        -0.05441909283399582,
        0.019244804978370667,
        0.025808725506067276,
        -0.05531977489590645,
        0.15274442732334137,
        -0.09397435933351517,
        -0.11611031740903854,
        0.013723207637667656,
        0.1273449957370758,
        0.05894624441862106,
        0.061687178909778595,
        -0.0022023464553058147,
        -0.0031895118299871683,
        -0.03518927842378616,
        0.0957561805844307,
        0.024087797850370407,
        -0.031796857714653015,
        -0.006101020146161318,
        -0.010475758463144302,
        -0.046202804893255234,
        0.045668404549360275,
        -0.12399039417505264,
        0.11883865296840668,
        0.006058374885469675,
        -0.1259366273880005,
        -0.004101661965250969,
        0.031059321016073227,
        -0.032671332359313965,
        0.07123532891273499,
        -0.011559962294995785,
        -0.014949641190469265,
        0.02692808397114277,
        0.1079186275601387,
        -0.011917025782167912,
        0.062238674610853195,
        0.07859746366739273,
        0.039409201592206955,
        0.05161358788609505,
        -0.053741373121738434,
        -0.014429849572479725,
        -0.003114301012828946,
        0.01781032793223858,
        -0.002051140647381544,
        -4.994860702822734e-08,
        0.024584045633673668,
        -0.01284752320498228,
        0.01953725889325142,
        -0.02482607215642929,
        -0.008915336802601814,
        -0.041698798537254333,
        0.015496546402573586,
        0.056649770587682724,
        0.0746081992983818,
        -0.07214445620775223,
        -0.03278785198926926,
        0.002536931075155735,
        -0.014152217656373978,
        0.04720816761255264,
        -0.09155967831611633,
        0.06176678463816643,
        -0.08633733540773392,
        -0.0012890745420008898,
        0.005996423307806253,
        -0.02333521470427513,
        -0.10018347948789597,
        -0.014431752264499664,
        0.049294471740722656,
        -0.061590708792209625,
        0.06554082781076431,
        0.039684806019067764,
        -0.12461420148611069,
        -0.05934762582182884,
        0.09472343325614929,
        -0.019425904378294945,
        -0.036677706986665726,
        -0.07552280277013779,
        -0.03716740012168884,
        0.02325870655477047,
        -0.01472392212599516,
        -0.031311582773923874,
        -0.04761476814746857,
        0.06362307816743851,
        -0.007082735188305378,
        0.048201169818639755,
        -0.060236334800720215,
        -0.01799902133643627,
        0.038062844425439835,
        0.026705095544457436,
        0.012702331878244877,
        -0.023167351260781288,
        0.07034862041473389,
        -0.07961864024400711,
        -0.08178387582302094,
        -0.03971775621175766,
        -0.10235104709863663,
        -0.02051413245499134,
        -0.06733180582523346,
        -0.05145689472556114,
        -0.04423906281590462,
        -0.01107697281986475,
        0.029002731665968895,
        -0.014299157075583935,
        -0.03848080709576607,
        -0.010951213538646698,
        -0.014506819657981396,
        -0.05586136505007744,
        0.008362696506083012,
        0.08984141796827316
    ]
}