{
    "id": "Y4hV_OksQM8",
    "title": "AMD just won laptops.",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-03-30T14:24:22Z",
    "video_url": "https://www.youtube.com/watch?v=Y4hV_OksQM8",
    "category": "Science & Technology",
    "tags": [
        "amd",
        "asus",
        "rog",
        "ryzen",
        "laptop",
        "gaming laptop",
        "zephyrus",
        "zephyrus g14",
        "g14",
        "rog zephyrus g14",
        "ryzen mobile",
        "ryzen 4000",
        "ryzen mobile 4000",
        "ryzen 4000 mobile",
        "notebook",
        "rtx",
        "nvidia",
        "intel",
        "gaming",
        "tech",
        "review",
        "teardown",
        "benchmark",
        "gameplay",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 1361746,
    "likes": 44862,
    "comments_count": 3718,
    "description": "The Asus ROG Zephyrus G14 is one of the best all around gaming laptops period right now. A truly unique and interesting tech podcast I really enjoy...ahem...  I bought the worst new PC   Our second channel @thisis!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.relay.fm/testdrivers",
        "https://youtu.be/91m7JB5eRVE",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- PS5 or Xbox Series X. Well, if your answer is neither and you wanna go on the PC Master Race side of things, then this is absolutely something to consider. And by something to consider I mean, it's my new favorite thing. (upbeat music) Inside the ROG Zephyrus G14, is nearly the exact same processor as you'll find in the next generation of consoles including the Xbox Series X as well as the PS5. Now last month, before all the world ending stuff, I took a trip out to AMD's headquarters in Austin, Texas where I got a deep dive on the brand new Ryzen Mobile 4000 series. There is a lot of cool stuff here and I'll probably cover more in future videos on all these new laptops that are coming out with Ryzen but the gist of it is this. You're getting the same Zen 2 core from the desktop, on mobile as well as of course, in that next generation console. And the cool thing is, you're getting the same level of performance too as we have that full eight-core design in a Ryzen laptop for the first time. Now yes, we hear desktop processor and tiny, thin and light laptop that might not gel. This is a 35 watt chip with a serious amount of power behind it. Now let me be clear, we're not looking at some cut-down version of Ryzen for mobile. Yes, there's certainly some small differences. When it comes to the actual CPU, this is the full eight-core, 16-thread design and inside the G14, it's able to boost it 3.7 gigahertz under sustained 100% load aka, slightly faster than the processors that you'll get inside the Xbox Series X and the PS5. I mentioned how thin this laptop is? Can we all take a second here and just recognize the fact that for years and years, Intel has dominated laptops right? And especially when you're getting gaming laptops, there were pretty much were no AMD options up until last year and yet, here we are at the beginning of 2020 and we have a thin and light laptop, 14-inch laptop with more power than pretty much any Intel processor in a laptop that you can get and at lower power. This is a 35 watt chip as opposed to the 45 watt chips that Intel usually use. Now while, yes 10th Gen Intel stuff is probably right around the corner and we'll see how close it gets but it is incredibly impressive to see AMD not only taking over on the desktop side, not only obviously dominating the consoles but now, significantly moving into laptops and considering there's a lower wattage version of this chip with the full eight-core design available in Ultrabooks soon, I mean, it's a good time to be Team Red. You know I could load you up with benchmarks, showing just how fast this is but Anandtech exists. So instead, let's actually take a look to see what it really is capable of. So this is powered by that Ryzen 9 4900HS and is backed up with an RTX 2060 Max-Q, 16 gigs of RAM, one terabyte SSD. There's a lot to like here and especially when you consider that, this is all in a 14-inch thin and light package. Well okay, let me be specific. A 17.9 millimeter thin package but still quite small for a full gaming laptop. There's a lot to like here. What I like about this is that, as a 14-inch laptop, it is much closer to the size of something I would actually want to daily. It's not too far off of something like a Razer Blade Stealth but with much much more power. Now speaking of power, not only do we have the ASUS ErgoLift hinge which means that, you get a little bit of a better typing angle as well as more airflow. This guy is rocking a 14-inch 1080p 120 Hertz display. It is, spoiler alert, excellent. Like seriously. Color is great, brightness is great and of course having that super high 120 Hertz refresh rate is much appreciated on a laptop which again is fairly thin, fairly light, fairly, I was gonna say gamery but actually, this is one of the most subdued ROG designs I've ever seen. So inside the G14, we have woah, a lot of stuff. So first of all, we have access to our DDR4 memory although it looks like only one DIMM is actually available. So you can upgrade this theoretically to 24 gigs I think. We also have our M.2 slot which is available if I wanted to unscrew it. So this has the one terabyte drive so not really gonna touch that. What we see here, is a very interesting heat pipe situation. So we have two fans and we have, one, two, three, seven individual heat pipes. And it does have a decent-sized 76 watt hour battery. So something that I haven't spent a ton of time with is actually doing battery life testing during gaming. But for light use, I've easily been able to get eight to nine hours to this guy, no problem. Okay so this is really stupid, no one should ever care about this. I really dig the way this looks on the inside. The red PCB with all the black components. This thing looks great. I mean seriously, look at that. That's like a work of art especially when you consider that the outside is so nice and clean. This is gonna be one of those rare situations where I have no criticisms, not really. And honestly, in my testing, this thermal solution has been more than adequate right? CPU is able to boost, GPU is able to keep a good frequency. I'm very impressed. So let's put this to the test with a game of Gears 5 which coincidentally is one of the only games I've actually played on the real Xbox Series X. Now a couple of caveats. First of all, while the processor is very similar to what we get in the next gen consoles, we are taking advantage of only RTX 2060 graphics which just aren't as powerful but one of the things we do know is that, they're working on a 120 FPS mode for Gears 5 on the console so why don't we see what it takes to get that running on laptop, considering it's got a 120 Hertz display? So right now, we are playing on medium settings pretty much across the board at 1080P, and why don't we see what we can do? We're 91, 90 frames per second or so. That's actually really not bad. And you can see that our CPU is significantly faster. It is definitely being bottleneck by the RTX 2060. And honestly, if we wanted to really cap it at 120 FPS we could easily crank it down to say, 1080P low. So we end up getting 90 FPS but the CPU frame rate was 202 so if we had more powerful graphics, we could very easily have hit a super capped 120 FPS. That's actually really impressive. Look, this is so much power for a laptop right. This is so much power not just for a thin and light laptop, this is so much power for a laptop full stop. As I wait to join the game, I am encouraged with 215 frames per second with maxed settings at 1080P. So obviously for the video, you can't really see the difference but I can say right now, I'm seeing somewhere between 150 and 200 frames per second and it is incredibly smooth. I feel like if I had this, I would never lose in Broke versus Pro ever again. I feel like we're actually gonna win this. Look at that. Look how great the Zephyrus is at not dying. I wanna play another game. That's not so easy to play. All right so for our next game, we have F1 2019. Now this is the game I've been playing a lot lately although certainly not with a controller and dude, this is absolutely no problem. 1080P high settings, we're over a 140-150 frames per second on this thing. If I have my wheel, I'd feel much better. Oh no, oh no no no no no! (laughing) I'm legitimately impressed with what kind of performance you're getting. Yeah sure, we could certainly use like a 2070 or something but a 1080P, 120 FPS, it's not that hard to get a really nice locked experience here. The ROG Zephyrus G14 has plenty of power for gaming but you know what it doesn't have? I don't know. That's pretty much everything as far as I'm concerned. So obviously the G14 has the performance but there's a lot more to this laptop that I really do like. Now first of all, there's the design. Yes, it's thin. Yes, it's a smaller laptop. But the fact is this, when you look at it in the white color, is so clean. Now this is the non AniMe Matrix design. I said it right, I almost said something else. But you can see that, it has these little tiny dimples. However, we took a look at the one with the full LED panel at CES and it is really cool. You can put up GIFs and whatnot there but we all know the real reason why that laptop exists, because DJs and people like Ken who pretend to be DJs wanna have a cool flashy laptop for their sweet DJ sessions. If you're not Ken, the standard model really is the one to get. As if you wanna get the AniMe Matrix display, you have to go for the QHD panel which is 60 Hertz. I much prefer the 1080P, 120 Hertz option. Now beyond just the screen and the specs, I really have to give them props. This might be my favorite ROG design yet. Now look, nothing against black and red gaming laptops, like all of these but the white, the silver, the very clean lines, this honestly is something that I would have no problem dailying on a regular basis. - [Myke] I'm Myke. - I'm Austin. We are The Test Drivers. Wow, what great speakers and what a great sounding podcast available at relay.fm/testdrivers. Link in the description. (clears throat) So the speaker setup is actually really impressive on the G14 as we have four speakers. So you have two tweeters that are upward firing and then on the bottom, you have two much beefier speakers on the bottom and because we have that ErgoLift design, it actually has a little bit of echo underneath. Honestly, while it's not as good as something like the 16-inch MacBook, for a smaller gaming laptop, two huge thumbs up and the praise keeps going. This keyboard is rock-solid. We've got nearly two millimeters of travel. It feels great. It's a good layout. They actually have some really thoughtful keys so we actually have dedicated buttons for volume up and down, the arrow keys are nice and separated. ASUS has made a lot of really smart decisions with this guy and I really like it man. I didn't expect to like this laptop as much as I do. And while yes, it's got the power and yes, it's got the great screen but there's so many little hardware tweaks that make such a huge difference then I found myself dailying a gaming laptop for the first time in a while. There's also solid port selection so we have a pair of USB-A, HDMI as well as two USB-C, one of which actually supports not only a video out but also USB-C power delivery. Now as this is a gaming laptop, it does have the standard barrel plug and you're gonna need the normal power adapter for gaming. If you're out and about if you're doing lighter tasks, then you can use pretty much any USB-C power brick and it will give you enough power to keep the laptop up and running. Did I actually point to the right port this time? Here? - [Ken] After four takes of this, yes. - I can't see anything from this angle Ken. Now it's not all perfect. So we do have a fingerprint sensor supported by Windows Hello built into the power button. Something you don't see on a lot of gaming laptops and it is a newer style of fingerprint sensor where even if the laptop is off, you can just put your finger on it and it will record your fingerprint and then as soon as Windows fires up, it will then send it over to Windows Hello versus most which will actually have to press the button, wait for it to turn on then put your finger down which is kind of annoying. But the problem is that, it's not crazy accurate. Now I'll give some props to ASUS because I have many fingerprint issues on most Windows laptops. It takes me several times of training before it kind of gets fairly accurate. But still a nice feature and if I'm nitpicking, I will say that, while I love the feel of the keyboard, the backlighting isn't super uniform. This is an early unit so they may get that fixed in the next couple months before it ships. But besides that, there's really not a lot that I can complain about. It's a really solid piece of hardware, it's a really solid piece of engineering and I don't have a good way to end this point. Bringing it all together, this Zephyrus is actually reasonably priced. So this is an upper mid spec model which is a Ryzen 9, RTX 2060. It's one terabyte SSD, as well as 16 gigs of RAM for only $1449. There also is a base model available for just over a $1,000 that lacks the high refresh rate display but still has pretty decent specs like the Ryzen 7 as well as a 1650. But realistically, this is the sweet spot. I'm really impressed with the Zephyrus G14 and the fact that it's powered by this new AMD Ryzen processors is a huge win. We're getting almost desktop level performance and a 14-inch thin and light laptop and especially when you consider that, that same processor is living inside both of the Xbox Series X as well as the PS5, it is a very good time to rise up with your console brethren and play games together? If that sounds like a good idea. Make sure to subscribe to the channel. If you think that was a really dumb way to end in the video, well then you should click on a different video now. (upbeat music) - [Ken] They're not gonna live together. They hate each other a lot. We can all use the same processors though Ken. (upbeat music)",
    "transcript_keywords": [
        "Master Race side",
        "Master Race",
        "laptop",
        "Xbox Series",
        "power",
        "Ryzen",
        "gaming laptop",
        "light laptop",
        "Series",
        "laptops",
        "AMD Ryzen processors",
        "lot",
        "thin",
        "gaming",
        "Xbox",
        "Race side",
        "Ryzen laptop",
        "real Xbox Series",
        "great",
        "light"
    ],
    "transcript_entity_values": [
        "between 150 and 200",
        "Zephyrus",
        "1080P",
        "Ryzen Mobile",
        "Gears 5",
        "G14",
        "AMD Ryzen",
        "120 FPS",
        "first",
        "10th",
        "2020",
        "two",
        "AMD",
        "four",
        "120",
        "Myke",
        "215",
        "one",
        "60",
        "QHD",
        "202",
        "CES",
        "a ton",
        "AniMe Matrix",
        "14-inch",
        "Broke",
        "last year",
        "1080P",
        "GPU",
        "2070",
        "Ryzen",
        "2",
        "MacBook",
        "Ryzen",
        "Ken",
        "USB",
        "Austin",
        "17.9 millimeter",
        "DIMM",
        "ROG",
        "Hertz",
        "Windows",
        "90",
        "only $1449",
        "the Ryzen 7",
        "16",
        "SSD",
        "35 watt",
        "140-150",
        "FPS",
        "1,000",
        "Zephyrus",
        "seven",
        "Team Red",
        "PS5",
        "daily",
        "3.7 gigahertz",
        "91",
        "AMD",
        "the next couple months",
        "Xbox Series X.",
        "eight",
        "ROG",
        "ASUS",
        "2060",
        "100%",
        "76 watt hour",
        "eight to nine hours",
        "the Xbox Series X",
        "years",
        "the ASUS ErgoLift",
        "CPU",
        "Ryzen",
        "Texas",
        "First",
        "the Zephyrus G14",
        "three",
        "Gen Intel",
        "The ROG Zephyrus G14",
        "2019",
        "USB-C",
        "RAM",
        "Xbox Series",
        "Anandtech",
        "USB-A",
        "Windows",
        "PCB",
        "Austin",
        "last month",
        "second",
        "Intel",
        "45 watt",
        "Razer Blade Stealth",
        "16-inch",
        "Ultrabooks",
        "24"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "MONEY",
        "EVENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "TIME",
        "EVENT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "EVENT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "DATE",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.04708287492394447,
        0.004665777552872896,
        0.03822606801986694,
        -0.017214873805642128,
        0.09175211191177368,
        -0.042700741440057755,
        0.013498819433152676,
        0.03546806052327156,
        -0.007085725665092468,
        -0.007783337030559778,
        -0.023903392255306244,
        0.10059922933578491,
        0.007627564482390881,
        -0.0395604744553566,
        0.015032167546451092,
        0.041087355464696884,
        0.13877955079078674,
        -0.12617996335029602,
        -0.04394114762544632,
        -0.025742653757333755,
        -0.009655540809035301,
        -0.05667691305279732,
        0.0024776600766927004,
        -0.011527122929692268,
        0.04603030905127525,
        0.03300262987613678,
        0.057415783405303955,
        -0.021243970841169357,
        -0.018168233335018158,
        0.022823212668299675,
        0.017715200781822205,
        0.025657622143626213,
        -0.05639651045203209,
        -0.011846968904137611,
        -0.03644026815891266,
        -0.04346093162894249,
        0.06201491132378578,
        -0.08301085233688354,
        -0.012327813543379307,
        -0.09885597229003906,
        -0.022163381800055504,
        7.477372128050774e-05,
        0.017793990671634674,
        0.02729424275457859,
        0.05876065418124199,
        -0.049993742257356644,
        0.015200825408101082,
        -0.14268001914024353,
        -0.0036742822267115116,
        -0.004917590878903866,
        0.0036724014207720757,
        -0.04722335562109947,
        0.015877410769462585,
        -0.012866112403571606,
        -0.10122288763523102,
        0.08333330601453781,
        0.021036652848124504,
        -0.01975134201347828,
        0.02056311070919037,
        0.025400791317224503,
        0.02916138805449009,
        -0.13375809788703918,
        -0.03297694772481918,
        0.02724449150264263,
        0.020665835589170456,
        -0.0735081285238266,
        0.07424609363079071,
        0.05243293195962906,
        0.06981386989355087,
        -0.01598520763218403,
        -0.01966777816414833,
        0.03196879103779793,
        0.018945086747407913,
        0.06950482726097107,
        -0.03499152138829231,
        0.04654150828719139,
        0.029985660687088966,
        -0.05407880246639252,
        0.0725894421339035,
        0.02402590773999691,
        0.04731934145092964,
        -0.011667921207845211,
        0.011906464584171772,
        -0.14399676024913788,
        0.05187836289405823,
        -0.017438199371099472,
        -0.001150102587416768,
        0.012926335446536541,
        0.01589883677661419,
        -0.07130131125450134,
        -0.05438785254955292,
        0.04618007317185402,
        0.05091418698430061,
        0.019615594297647476,
        0.0029214920941740274,
        0.017349015921354294,
        0.056291837245225906,
        -0.05553271621465683,
        -0.0034036082215607166,
        0.03990549221634865,
        0.03529990464448929,
        0.05141373351216316,
        0.034246038645505905,
        0.02344372682273388,
        -0.06991847604513168,
        -0.018684158101677895,
        -0.07224655151367188,
        0.05489163100719452,
        -0.061226096004247665,
        -0.0822349488735199,
        -0.06227676942944527,
        0.05770642310380936,
        -0.03724566847085953,
        -0.005305116530507803,
        0.04875189810991287,
        0.026762932538986206,
        0.020966745913028717,
        0.05457969382405281,
        0.004060510080307722,
        0.03153623268008232,
        -0.028782717883586884,
        -0.03907227888703346,
        -0.06748513877391815,
        0.007680154871195555,
        0.07777255773544312,
        0.024281665682792664,
        -0.13890771567821503,
        4.954233715529813e-33,
        0.007250257767736912,
        0.06569382548332214,
        -0.012793448753654957,
        0.00808672048151493,
        0.01158697996288538,
        -0.020534077659249306,
        0.013087661005556583,
        -0.031952980905771255,
        -0.003759875427931547,
        0.08809321373701096,
        -0.016109144315123558,
        0.012416143901646137,
        -0.0006959963357076049,
        0.011400582268834114,
        0.03544335067272186,
        -0.09777741879224777,
        -0.04958627000451088,
        -0.028677279129624367,
        -0.06834256649017334,
        -0.03229523077607155,
        0.012948806397616863,
        0.06916508078575134,
        0.038950659334659576,
        -0.0007961891242302954,
        0.05959998816251755,
        0.014662323519587517,
        -0.011908360756933689,
        -0.04766840487718582,
        -0.01621672511100769,
        0.027497949078679085,
        -0.03577045723795891,
        -0.07716552913188934,
        -0.1091361939907074,
        -0.027162844315171242,
        -0.05173437297344208,
        0.03470572829246521,
        -0.0451299250125885,
        -0.10774090886116028,
        0.08497095853090286,
        -0.04293328896164894,
        -0.014736848883330822,
        0.041637640446424484,
        -0.07905399799346924,
        -0.02120301127433777,
        -0.012232046574354172,
        0.045456863939762115,
        -0.022255245596170425,
        -0.012717751786112785,
        -0.026376601308584213,
        -0.027693424373865128,
        -0.09194499254226685,
        0.030097132548689842,
        0.037737734615802765,
        0.0307995043694973,
        0.03390011563897133,
        -0.06864260882139206,
        0.07457024604082108,
        -0.0034217783249914646,
        0.148496612906456,
        0.13035959005355835,
        0.01612217165529728,
        -0.021901050582528114,
        -0.0778585821390152,
        0.012249075807631016,
        -0.06645645946264267,
        0.05944044142961502,
        0.09305913001298904,
        -0.02462591417133808,
        -1.1757201718864962e-05,
        0.04952181875705719,
        0.03826748579740524,
        -0.0010235289810225368,
        0.04222026839852333,
        -0.024181541055440903,
        0.11652449518442154,
        0.02304929308593273,
        -0.06061452627182007,
        -0.02774173393845558,
        -0.08005182445049286,
        -0.005885612219572067,
        -0.019315222278237343,
        0.08109832555055618,
        -0.07482060045003891,
        0.025116782635450363,
        -0.02595881186425686,
        0.05850828066468239,
        -0.010617945343255997,
        -0.07705781608819962,
        0.04904454946517944,
        0.01163081917911768,
        0.003412016900256276,
        -0.051513805985450745,
        0.08449148386716843,
        0.07607898861169815,
        -0.06452137976884842,
        -3.437667474764531e-33,
        -0.007533225696533918,
        -0.02535160817205906,
        0.022074908018112183,
        0.03266206011176109,
        -0.003895310452207923,
        0.018763549625873566,
        0.0631520077586174,
        -0.02259218879044056,
        -0.052977390587329865,
        -0.09586861729621887,
        0.05934746563434601,
        0.04320898279547691,
        0.019579913467168808,
        0.06351249665021896,
        -0.008025928400456905,
        -0.014179793186485767,
        -0.010093429125845432,
        -0.06885247677564621,
        0.0822688490152359,
        -0.005988688208162785,
        0.03308011591434479,
        0.06612665206193924,
        -0.001806721556931734,
        0.03332255035638809,
        0.02063053287565708,
        0.012511440552771091,
        -0.048901595175266266,
        -0.051110897213220596,
        0.026572082191705704,
        -0.006906623020768166,
        0.009006782434880733,
        0.0034748476464301348,
        0.04911472275853157,
        -0.002521052723750472,
        0.09862186759710312,
        0.021011974662542343,
        0.07404503226280212,
        -0.03445092961192131,
        -0.048908863216638565,
        0.024182800203561783,
        0.021863268688321114,
        0.09744212031364441,
        -0.01127417478710413,
        0.03543863818049431,
        -0.016526859253644943,
        -0.010139910504221916,
        -0.058277878910303116,
        -0.0209610965102911,
        0.06230636313557625,
        -0.028197303414344788,
        0.02512982115149498,
        -0.06557940691709518,
        0.0012591587146744132,
        -0.04127950593829155,
        0.007024162914603949,
        -0.0714568942785263,
        -0.059020400047302246,
        0.019014624878764153,
        -0.05456884205341339,
        0.03507230803370476,
        0.04855838790535927,
        -2.4413957362412475e-05,
        0.017391076311469078,
        -0.05404902994632721,
        0.016465269029140472,
        0.0031810624059289694,
        0.09194876998662949,
        0.05564344674348831,
        -0.009425483644008636,
        -0.04233597218990326,
        -0.031717896461486816,
        -0.01192220114171505,
        -0.04475794732570648,
        -0.018083125352859497,
        0.02181405760347843,
        0.008291343227028847,
        0.03553399443626404,
        -0.03732497990131378,
        -0.0540284737944603,
        -0.014752103015780449,
        -0.011420371942222118,
        -0.019313786178827286,
        -0.0050445860251784325,
        0.006931654177606106,
        0.036141786724328995,
        -0.032981161028146744,
        0.006579176988452673,
        -0.021057309582829475,
        -0.021072616800665855,
        -0.06373947113752365,
        0.0194653682410717,
        0.0002110454806825146,
        -0.09343331307172775,
        0.07151568681001663,
        0.0594201534986496,
        -5.1521897859174715e-08,
        0.044020891189575195,
        -0.0023842628579586744,
        0.028324373066425323,
        0.04434492811560631,
        0.027512164786458015,
        -0.022097701206803322,
        0.013854291290044785,
        -0.06415791064500809,
        0.051820773631334305,
        0.06784111261367798,
        0.08106286078691483,
        -0.057366419583559036,
        0.03803963586688042,
        0.006893646437674761,
        -0.02475007437169552,
        0.08591731637716293,
        -0.06368093937635422,
        0.08922193199396133,
        0.006287768948823214,
        -0.016485029831528664,
        0.03312772139906883,
        0.10781461745500565,
        0.08166781812906265,
        -0.0749407634139061,
        0.047355663031339645,
        -0.03893390670418739,
        -0.04479048028588295,
        0.015591024421155453,
        0.10032571107149124,
        -0.004965979605913162,
        -0.09992358833551407,
        -0.011910541914403439,
        0.07695662975311279,
        -0.010259144008159637,
        -0.0147473169490695,
        -0.08160733431577682,
        0.0644446313381195,
        0.07558350265026093,
        0.08387673646211624,
        0.02400211989879608,
        -0.06867155432701111,
        -0.09407773613929749,
        -0.013190463185310364,
        0.03159021586179733,
        -0.07508388161659241,
        -0.05841953307390213,
        -0.038788747042417526,
        -0.1387510746717453,
        -0.035380322486162186,
        0.05181882902979851,
        0.014893604442477226,
        0.009591721929609776,
        0.06998422741889954,
        0.02936793491244316,
        0.07216379046440125,
        -0.04089127480983734,
        -0.11957959085702896,
        0.06201339140534401,
        0.0031100467313081026,
        -0.0023344443179666996,
        0.04057930037379265,
        -0.05290950462222099,
        -0.006921565160155296,
        -0.0005308412946760654
    ]
}