{
    "id": "y4r-9HsGpe0",
    "title": "The All WOOD Gaming Setup!",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-06-15T18:56:07Z",
    "video_url": "https://www.youtube.com/watch?v=y4r-9HsGpe0",
    "category": "Science & Technology",
    "tags": [
        "all wood pc build",
        "can you build a wooden pc",
        "no rgb",
        "battlestation",
        "most beautiful pc",
        "classy pc",
        "building a bc out of wood",
        "can you buy a wood pc",
        "grove made",
        "pc build",
        "watercooling",
        "water block"
    ],
    "views": 2420481,
    "likes": 83097,
    "comments_count": 3470,
    "description": "Check out Grovemade and use our code LTT10 to get 10% off at:   Want to be notified of the Noctua Edition LTT Screwdriver launch? Sign up here:   We take a break from filling PC towers with RGB LEDs and take a more subtle approach to a Gaming PC. With simple lines, quiet cooling and beautiful solid wood accents, this rig looks great in any room!  Discuss on the forum:   Buy an Intel Core i9-13900k CPU:  Buy a MSI MPG Z790 Carbon WiFi Motherboard:  Buy a Sabrent Rocket 4 Plus-G 2TB NVMe M.2 SSD:  Buy an ASUS ROG Strix GeForce RTX 4090 OC Graphics Card:  Buy a Fractal Design North Mesh ATX Case:  Buy an EK Quantum Velocity Squared 1700 Lignum Edition - Walnut CPU Water Block:  Buy an EK CoolStream SE 240 Radiator:  Buy a Corsair RM1000x Shift PSU:  Buy an EK-HDC Lignum 12mm Compression Fitting - Walnut:  Buy an EK Quantum Kinetic FTL 80 D5 Pump/Reservoir:  Buy an EK Quantum Surface S360 Radiator:  Buy EK-HD PETG Tubing:  Buy a Cooler Master Universal Vertcal Graphics Card Holder V2:  Buy a Noctua NF-F12 iPPC-2000 PWM Cooling Fan:  Check out Walnut Keycaps on Etsy:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:45 Some parts ain't wood 1:29 Wood CPU cooler 2:09 Motherboard & Friends 2:40 Case 3:33 VERY cool power supply 5:00 Wooden fittings! 6:00 Radiator & Fans 6:54 Watercooling begins! 7:53 THE WOOD GPU 10:10 Watercooling continues! 12:55 Turning it on 13:40 Wood Accessories & Peripherals 15:20 Outro",
    "description_links": [
        "https://lmg.gg/Grovemade",
        "https://www.lttstore.com/products/noctua-screwdriver",
        "https://linustechtips.com/topic/1513381-the-all-wood-gaming-setup/",
        "https://geni.us/tAPLm",
        "https://geni.us/zb2FnE",
        "https://geni.us/NKyVXy",
        "https://geni.us/omtfp",
        "https://lmg.gg/Jy7L1",
        "https://geni.us/8d3v",
        "https://geni.us/NwtTwc",
        "https://geni.us/Bdvj",
        "https://geni.us/GVxTW0A",
        "https://lmg.gg/8sZLN",
        "https://geni.us/SGndNTa",
        "https://geni.us/31zAiA",
        "https://geni.us/3xpav",
        "https://geni.us/LUlJI",
        "https://lmg.gg/72ChH",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(upbeat music) - Your SO's had enough of the giant glowing RGB tower, and if you're being honest, so have you. But the solution obviously isn't to stop gaming. What if we could tone things down a little though? Wooden computers have been around since at least the Apple 1, but it's only recently that the aesthetic has made it's way into high performance gaming hardware. Wooden case? Check. Wooden mechanical keyboard? Double check. Is this a wooden water cooling fitting though? And how about this wooden segue to our sponsor? Grovemade, who is also wooden. All the gorgeous minimalist desk accessories that you'll see in this video are made by Grovemade. Their high quality products make any desk look better, learn more about them later in the video, or at the link down below. (upbeat music) You might be thinking, \"Come on, there's no way you can build a whole PC out of wood-accented parts.\" And you'd be right. A search for wooden RAM is just gonna give you a bunch of little carvings of sheep. But that may not always be the case. The world's very first wooden transistor was revealed just a few weeks ago. So it's not that farfetched to envision a future where biodegradable memory and CPUs could take a dent out of the world's E-waste problem. But for now, with the wooden transistor running at less than one cycle per second, that's one, not one megahertz, and measuring about three centimeters across, we can safely assume that we'll be waiting a while for Intel to release the tree 86. - [Jordan] Boo. - The core iTree. - [Jordan] Boo. - Yeah, that's fair. We're gonna kick this off with our CPU cooler, the EK-Quantum Velocity Squared 1700 Lignum Edition, which is apparently Latin for wood. (David laughs) Get your mind out of the gutter. I mean, lignum doesn't sound like something particularly savory to me but I'm not in charge of EK's branding, okay? Anyway, the point is, at a $190, it's even more expensive than their standard Quantum Velocity Squared. But as far as we can tell, EK is the only one that's making wood-accented water cooling parts. And our goal was to build something that you could actually replicate at home, assuming that you had copious amounts of disposable income. We're gonna be installing it on an MSI Z790 Carbon WiFi. 'Cause after all, what is carbon, if not burned wood? (cymbal clangs) Okay, no, but seriously, the motherboard had more to do with just having a relatively clear CPU socket area for our hardline tubing. For our CPU, we've gone with a 24-core, Core i9 13900K, since by the time we spent this much on our block, why not? And then we've paired it with a 32 gig kit of 6,000 mega transfer per second CL32 RAM from G.Skill. (ram slots click) Okay, it does look pretty cool, though I do have to question why this costs so much more than the acrylic one given that this case, the Fractal Design North comes with so much more wood, and is only a $120 for the whole case. It also supports up to a 360 millimeter rad in the front, a 240 millimeter in the top, and has all the modern connectivity you'd want, including USB Type-C. It's available in a number of different color schemes. But we settled on the black and walnut 'cause we figured, I mean, we'd be idiots to choose anything else. That's what we have. (laughs) This is cool. I like Fractal's completely recyclable packaging for their accessories. And look at this. (case top clatters) Little leather pull tab. Ooh, our power supply. Okay, this might not seem to have anything to do with our wood theme here but the Corsair RM1000 X Shift is super cool. It moves it's modular interface from this side to this side. That gives us extra room down here in the basement for our EK-Quantum Kinetic FLT 80 D5 pump reservoir combo, where no one will notice that they are not made of wood. Truth is, certain things shouldn't be made of wood and power supplies and water cooling reservoirs are chief among them. Oh wow. This is quite the endeavor. Look at that. Not bad, not bad at all. Totally hidden. Stealthy. One kind of bummer with this power supply is it means you can't use off-the-shelf replacement cables. So hopefully black matches the theme of your build. How did nobody ever think of this? And it just keeps getting smarter. They've got six of their PCIe CPU connectors over here, and then they've got two of them over here. Why? So they can run straight up here to where the 8-pin is on most motherboards. Look at that. Clean. Flat. There's one odd choice from a cable management perspective here. There is no pass-through on this side of the top of the motherboard. So you just have to kind of go through either this hole, or way over here by the 8-pin connector. If there's something else that I would've said, \"No, please, no, not out of wood.\" It would've been fittings for our water blocks. This kind of reminds me of back when they did acrylic fittings and they all cracked, obviously, but here we are, the EK-HDC Lignum 12 millimeter is available with a walnut collar that honestly kind of looks amazing. Can't deny that looks pretty cool, but it drives the cost up to 17 US dollars per fitting. Shout out EK for sending these over, because that's over a $150 in fittings, and there's just 10 of them in the whole build. We're using a Sabrent Rocket 4 Plus-G 2 terabyte, because on the one hand, we're balling outta control, but on the other hand, we spent all our money on wood water cooling fittings. So this has got nice, little, middle ground. For radiators, we've chosen EK's Quantum Surface series for the front for it's superior performance, and their CoolStream SE series for the top for it's thinner profile and easier fit. Really EK? (screw clatters) I mean, don't get me wrong, love the wooden stuff, couldn't have done this build without you, but you used different threaded screws for your different lineups of radiators? Oh, oh my God, they have different heads on them too. (Linus grunts) Naturally, we've gone with Noctua's Industrial PPC 2000 RPM fans, meaning this machine is going to sound as good as it looks, and as good as the LTT screwdriver feels. (screwdriver clacking) Man. Should we do a wood one? Can we do a wood one? - [Jordan] Yeah. - Okay, if that's possible, then maybe. But for now, you can sign up for a notification for the Noctua Edition one or just get the regular black one, lttstore.com. I moved these fans to make it a little bit easier to do this run. And I think we're ready to tube. We've pre-done most of our tubing runs cooking show style, but we are going to have to do at least one of them because we screwed it up, so (laughs), so let's start by doing this back run here. These work exactly the same way that any other hardline tubing fitting would. You know what? I think we could probably just shorten this a touch, try and get it level and then we're good. I have actually never used a pipe cutter like this before. Oh wait. Can you tell? Time to double-sided tape our reservoir pump combo down, because, yep, that's how we're doing it. (chuckles) How am I supposed to get in there? However, I've got an idea. I've got an idea. We're just gonna, ow. Let's see how close it is. I mean, hey, that's not bad. Right? It's pretty straight-ish. Don't look that close. What are you doing? Get, get, get outta here. And now, we get to mount our GPU, which is, oh, by far the most exciting part. This is a Vector Squared block that EK whipped up for us for the Asus Strix RTX 4090. They don't actually have this one available on their site yet, but I guess nothing would prevent them from making it available if someone wanted it. It looks freaking awesome. That means the last thing we wanna do is put it in like this, where we're barely gonna see it. No, no. We want the showcase position for it. Oh, it's gonna look so good. But for that, we're gonna use one of these Cooler Master universal horizontal to vertical mount adapters. We just plug our PCIe 16X in here. There we go. Then we take this bad boy and just kinda (grunts) mash it down. Little something like that. Bit of a tight fit back there, but seems to kind of work. Okay. And now this guy. Oh boy. Ooh, that's actually a pretty tight fit, you gotta love the RTX 4090. And this, my friends, is why we created the stubby version of the LTT Screwdriver. Wow, that's really heavy. Do we have a support brace or anything by any chance? - [Jordan] No, but we can find something. - No? Okay. I mean, oh, idea. Wood? Hm. Nope, nevermind. Oh, crap. If I get this, I expect applause. Oh yeah. Oh yeah, no problem, no problem. Piece of cake. (hands clapping) One. Now we just need our second RGB connector. Wait, what is this one for? - The pump probably. - Oh, that's for our reservoir. We don't need that. - We don't even need that one. - Oh, interesting, the CPU block doesn't have RGB. At that price? Okay. Well, this is progress. Whoa, the theme of the build is wood, and sagging, flacid wood. Yeah, it's not clipped on, that's why. It has hooks. See that? These hooks weren't on. There we go. I mean, it's still a little sketchy, but that's a lot better. You know what's actually kind of nice about these fittings? Even if you're not into the wood aesthetic, because they're a little bit bigger than most fittings, it's really easy to thread them on. Okay, where's my last collar at? Right, this is the one where I'm missing an O-ring, and I'm extremely upset about it. Okay, maybe, if I do this, it'll appear. (computer rattling) - [Jordan] Yep. - Oh, did it really? - [Jordan] By your foot, the right foot. - Yes. I got my O-ring back. I get so upset about little things like missing O-rings, because little things can cause big problems. Someone goes to do a wood-themed PC sometime in the future, and they use that fitting without realizing that someone put that fitting away without realizing that there was no O-ring, water goes everywhere and you've ruined an RTX 6090, nice, or something like that. And now, we have the fitting. That looks freaking awesome. This'll be interesting. We actually tried to fill a loop with this particular reservoir combo yesterday, and it was challenging. And it's not right side up again. So. Cool. Yeah, maybe I'll just lay the computer down on it's side. That does make it a little bit more difficult for me to see what's going on. But who needs to see anything? Let's go. You know what I feel like we need, David? - [David] What up? - Somewhere for the air that the water is displacing to go. We're gonna crack a fitting somewhere in this system. So I think what we're gonna do. Yeah. Yeah. Like this. We're gonna pile up a bunch of paper towel here, and then I'm basically just gonna crack this fitting in the top radiator and we're just gonna run it. I mean, wood's waterproof, right? They leave trees out in the rain all the time. Are you guys, are you seeing any water in the tubes? Hey, look at that. Man, if we had a taller tube here, we could actually fill even more of it. Okay, this is where things are gonna get really sketchy. If this wasn't sketchy enough for ya. Okay, I'm just gonna crack this just a little. (water whirring) - [Jordan] Just there? - Just a little. Just a little while the water starts moving. Just a little, just a little crack. You know? Just a little. And then when the water goes, then I'm just gonna jam the tube back in. Oi. (water whirring) Okay, the water, it squirted out a little bit, and everything is fine. The loop's filled, the setup is set up. Oh, I like it. Hey, have we actually seen this thing POST yet? Oh boy. Fired up fresh. Show me the output. Oh man, I feel bad covering it up. (side panel clangs) Yeah, that sucks. Hey. I do not know where my delete key is. I don't think it gets much more wooden than this, my friends. - [David] Is the experience good, Linus? - Is the experience good? I mean, you tell me. How flipping quiet is this, okay? Even with bubbles in the pump, this thing makes no noise at all, it looks absolutely amazing. Oh, I guess now's as good a time as I need to shout out our sponsor for all these cool desk accessories. It's a pencil. Got their headphone stand. They've also got, oh, does anyone have an iPhone? I have an iPhone, no, I don't have an iPhone. I lied, actually, I told you guys I had an iPhone earlier. Boom. - [David] Whoa. - Whoa. Three teams notifications. What a popular guy probationary employee number 37. This keyboard is sick. Is this from Grovemade? - [Jordan] No. - No, well, it's sick anyway. Wow. - [Jordan] The key caps are off of Etsy. - Sorry, how much are these key caps? - [Jordan] $300. - $300 key caps? Was the idea to make these EK blocks look affordable? Geez, I mean, they look great though. Don't they? Got my Grovemade wrist rest. The mouse, I gotta say the mouse is really letting it down though. It's not walnut like basically everything else, it's bamboo. And yeah, I think the most positive thing I can say about it is it's patent-protected. Just like this patented segue to our sponsor. The aesthetics of this setup wouldn't have been possible without all the gorgeous desk accessories provided by Grovemade. Their products are not only aesthetically-pleasing, but also functional and designed to help you do your best work. Grovemade offers a variety of products from monitor stands to headphone stands to MagSafe chargers and wrist rests. All their products are made with high quality materials like solid wood, stainless steel, and natural cork. And thanks to those high quality materials, you can trust that Grovemade products are built to last. If you're looking to take your setup to the next wooden level, then check out Grovemade at the link in the bio. Bio, video description. New customers will get 10% off. (techno music) If you liked this video, maybe you'll like the one where Alex, and I try to water cool a bed. I mean, yeah, that was a- - No, watch the wooden PC. The wooden PC's better, not the water bed. - They can't, what? What wooden PC? - [Alex] The one that I made. - Oh, that one. Oh, that one's sick. Yeah, go watch the other wooden PC we made.",
    "transcript_keywords": [
        "Wooden",
        "wood",
        "Yeah",
        "water",
        "glowing RGB tower",
        "giant glowing RGB",
        "Grovemade",
        "fitting",
        "CPU",
        "fittings",
        "made",
        "cool",
        "kind",
        "giant glowing",
        "water cooling",
        "good",
        "build",
        "Velocity Squared",
        "things",
        "wooden water cooling"
    ],
    "transcript_entity_values": [
        "EK",
        "one",
        "Latin",
        "Carbon WiFi",
        "second",
        "Lignum",
        "iTree",
        "37",
        "first",
        "120",
        "Corsair RM1000 X Shift",
        "One",
        "Vector Squared",
        "300",
        "RGB",
        "12 millimeter",
        "32",
        "17 US dollars",
        "Grovemade",
        "Quantum Velocity Squared",
        "150",
        "10%",
        "a Sabrent Rocket 4 Plus-G 2",
        "about three centimeters",
        "80",
        "16X",
        "GPU",
        "86",
        "David",
        "less than one",
        "Quantum Surface",
        "iPhone",
        "Alex",
        "Three",
        "Wooden",
        "one megahertz",
        "4090",
        "just 10",
        "13900",
        "USB Type-C.",
        "at least one",
        "RAM",
        "D5",
        "8",
        "ram",
        "6090",
        "LTT",
        "6,000",
        "Cooler",
        "G.Skill",
        "CPU",
        "a 240 millimeter",
        "Bio",
        "six",
        "the LTT Screwdriver",
        "CoolStream SE",
        "Linus",
        "Fractal",
        "190",
        "24",
        "Jordan] Boo",
        "two",
        "yesterday",
        "Intel",
        "Core",
        "Asus Strix",
        "Etsy",
        "Noctua",
        "just a few weeks ago"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.04157804697751999,
        -0.034292660653591156,
        0.010310492478311062,
        -0.008894327096641064,
        0.014703081920742989,
        -0.00505836820229888,
        -0.0617675743997097,
        0.052123621106147766,
        -0.0342119038105011,
        0.007235267199575901,
        -0.037298232316970825,
        0.01032237708568573,
        -0.03858532756567001,
        -0.02635314129292965,
        0.043918777257204056,
        0.06751997768878937,
        0.11295948922634125,
        -0.05119435489177704,
        0.0313715897500515,
        -0.015599862672388554,
        0.025218090042471886,
        -0.09004030376672745,
        -0.062365613877773285,
        -0.08127734810113907,
        0.023276712745428085,
        0.009010178968310356,
        0.06777982413768768,
        0.030414624139666557,
        -0.0197309460490942,
        -0.03003114089369774,
        0.06627856194972992,
        -0.04562987759709358,
        -0.05663945898413658,
        0.01375240832567215,
        -0.038522616028785706,
        -0.036340124905109406,
        0.05571867525577545,
        -0.11945756524801254,
        -0.06513166427612305,
        -0.038165003061294556,
        -0.03806164488196373,
        -0.02819332666695118,
        0.059234533458948135,
        0.062286376953125,
        0.03477776050567627,
        -0.0027318389620631933,
        -0.017621532082557678,
        -0.07728461176156998,
        0.035681068897247314,
        -0.0441519059240818,
        -0.024424444884061813,
        -0.10200008004903793,
        0.025451181456446648,
        -0.028377989307045937,
        -0.0756966695189476,
        0.0714886263012886,
        -0.03362564742565155,
        -0.12030748277902603,
        0.035736534744501114,
        -0.09752362966537476,
        0.08298191428184509,
        -0.05156714841723442,
        -0.016077285632491112,
        0.055329203605651855,
        0.010702689178287983,
        -0.02525169402360916,
        -0.02370060421526432,
        -0.0019887685775756836,
        0.010485833510756493,
        0.037929434329271317,
        0.007292964030057192,
        0.05666804313659668,
        -0.006334212608635426,
        -0.026013623923063278,
        -0.023903990164399147,
        0.023653654381632805,
        0.027705281972885132,
        -0.02369476854801178,
        0.04526473954319954,
        0.025766443461179733,
        0.0066445451229810715,
        0.02878277562558651,
        0.005503423046320677,
        -0.03928104415535927,
        -0.009421942755579948,
        -0.017752747982740402,
        0.041136421263217926,
        0.0688868835568428,
        -0.02669074945151806,
        -0.0770992785692215,
        0.07689297944307327,
        0.040950462222099304,
        0.07116110622882843,
        0.04055257514119148,
        0.033395763486623764,
        0.027557671070098877,
        -0.01813453994691372,
        -0.04109549894928932,
        -0.07431301474571228,
        -0.0007731961086392403,
        -0.001433020457625389,
        0.06653491407632828,
        0.09693413972854614,
        0.005300641991198063,
        -0.08351214975118637,
        -0.00013112626038491726,
        -0.08225293457508087,
        0.07743819057941437,
        -0.0009896854171529412,
        -0.06605465710163116,
        -0.06785119324922562,
        0.02049294300377369,
        -0.07527925819158554,
        0.0638686865568161,
        -0.0016624920535832644,
        -0.0066764806397259235,
        -0.01744726672768593,
        -0.013528168201446533,
        0.014067528769373894,
        0.010405360721051693,
        -0.005212869495153427,
        -0.024189496412873268,
        -0.04302354156970978,
        0.09975095838308334,
        0.06983202695846558,
        0.028543638065457344,
        -0.046090513467788696,
        1.329514232822747e-32,
        0.022594697773456573,
        0.08662228286266327,
        -0.06643391400575638,
        -0.009887315332889557,
        0.042926639318466187,
        -0.005633574910461903,
        0.014449076727032661,
        -0.048700567334890366,
        -0.0022945385426282883,
        0.08293171226978302,
        0.0059476266615092754,
        -0.0294395349919796,
        -0.06543785333633423,
        0.057325951755046844,
        0.059270165860652924,
        -0.10326836258172989,
        -0.00644748704507947,
        -0.030555518344044685,
        -0.003958289511501789,
        -0.005103747826069593,
        0.03321957588195801,
        0.007765643764287233,
        -0.006223851349204779,
        0.015715068206191063,
        0.029228834435343742,
        0.02046542428433895,
        0.01667040027678013,
        -0.018476374447345734,
        -0.010289573110640049,
        0.016756588593125343,
        -0.006054998375475407,
        -0.09947307407855988,
        -0.1115930899977684,
        -0.027390478178858757,
        0.03149000182747841,
        -0.03349001705646515,
        -0.020578524097800255,
        -0.06083991378545761,
        -0.0030300531070679426,
        -0.05324211344122887,
        -0.010985033586621284,
        0.08434219658374786,
        -0.047823648899793625,
        -0.06779097020626068,
        0.000797051761765033,
        0.004818751011043787,
        0.010013994760811329,
        0.06403958797454834,
        -0.015371760353446007,
        0.008080578409135342,
        -0.08525874465703964,
        0.09107223898172379,
        -0.010216888040304184,
        0.08962756395339966,
        0.002835288643836975,
        -0.049267228692770004,
        0.0785815566778183,
        0.010232764296233654,
        0.05776841193437576,
        0.07401520758867264,
        0.008988214656710625,
        -0.07693836092948914,
        -0.030081704258918762,
        -0.0008938944083638489,
        -0.08246931433677673,
        0.09284957498311996,
        0.06645739823579788,
        -0.026844630017876625,
        -0.044591035693883896,
        0.0010982800740748644,
        0.026781493797898293,
        -0.051941484212875366,
        0.040845803916454315,
        0.005977013148367405,
        0.03809632733464241,
        0.030443497002124786,
        -0.01211236510425806,
        -0.022164655849337578,
        -0.08066537231206894,
        -0.059995684772729874,
        -0.056964434683322906,
        0.04619603976607323,
        -0.029930200427770615,
        0.050049569457769394,
        0.052396465092897415,
        -0.06422027945518494,
        -0.0075294687412679195,
        0.05800080671906471,
        -0.013769524171948433,
        0.01416319701820612,
        -0.015055133029818535,
        -0.06259555369615555,
        0.05162077024579048,
        0.0544738844037056,
        -0.04283569008111954,
        -1.0881193414468884e-32,
        -0.041057173162698746,
        -0.05839453265070915,
        0.018846547231078148,
        0.059459179639816284,
        0.05673176422715187,
        0.030254652723670006,
        0.07800080627202988,
        -0.052650514990091324,
        0.04996496066451073,
        -0.06422481685876846,
        0.03307667002081871,
        0.07033351063728333,
        -0.032296109944581985,
        -0.001975125866010785,
        0.0011999191483482718,
        -0.012515050359070301,
        0.004797694273293018,
        -0.036484282463788986,
        0.0588882640004158,
        -0.0004913000739179552,
        0.08935276418924332,
        0.09188640117645264,
        -0.01953457109630108,
        -0.014503675512969494,
        0.030833564698696136,
        0.06524678319692612,
        0.02371235564351082,
        -0.018742216750979424,
        -0.08328615128993988,
        0.0799177959561348,
        0.0003197177138645202,
        0.03718608617782593,
        0.02814980037510395,
        -0.035310354083776474,
        -0.03237280994653702,
        -0.015697548165917397,
        0.1274081915616989,
        0.06245043873786926,
        -0.001867635059170425,
        -0.03417457267642021,
        0.08702026307582855,
        0.04581476375460625,
        -0.018534626811742783,
        0.007669555954635143,
        -0.042898014187812805,
        0.031189659610390663,
        -0.020154515281319618,
        -0.07845263183116913,
        0.03345517814159393,
        0.08459107577800751,
        -0.04881161451339722,
        -0.05846762657165527,
        0.05378173291683197,
        0.01095780823379755,
        -0.004284736234694719,
        -0.11412922292947769,
        -0.0041762907058000565,
        0.030002398416399956,
        -0.0122390640899539,
        -0.07149333506822586,
        -0.003487231442704797,
        0.07152488827705383,
        -0.03143973648548126,
        -0.07546354085206985,
        0.07313063740730286,
        -0.07986386120319366,
        -0.009681359864771366,
        0.01951225847005844,
        0.023834193125367165,
        -0.035370517522096634,
        -0.1399281620979309,
        0.0226710457354784,
        0.005926340352743864,
        -0.0036462154239416122,
        0.0147332064807415,
        0.020162273198366165,
        0.08954032510519028,
        0.006699136923998594,
        0.10157561302185059,
        0.01467252429574728,
        -0.09486839920282364,
        -0.001489474205300212,
        0.006928321905434132,
        -0.008193735033273697,
        0.0973925068974495,
        0.014206187799572945,
        0.0071435002610087395,
        0.035034921020269394,
        0.018820594996213913,
        -0.07911736518144608,
        0.020183030515909195,
        0.04946586862206459,
        0.04942156374454498,
        0.06025554612278938,
        -0.0039039093535393476,
        -6.162810706200617e-08,
        -0.04881981387734413,
        0.0018080875743180513,
        0.013581117615103722,
        0.02969430945813656,
        -0.016288407146930695,
        -0.10606969147920609,
        0.054025523364543915,
        0.00902453064918518,
        -0.027612268924713135,
        -0.06511886417865753,
        0.07220560312271118,
        -0.03193085640668869,
        -0.03005070984363556,
        0.031990811228752136,
        0.0015330202877521515,
        0.014246122911572456,
        -0.0395556204020977,
        0.0804816409945488,
        -0.028678983449935913,
        -0.060410261154174805,
        0.029233844950795174,
        -0.02115689590573311,
        0.12105198949575424,
        0.04991680756211281,
        -0.029491432011127472,
        0.036240141838788986,
        0.005081801675260067,
        -0.03883923962712288,
        0.12660574913024902,
        0.0398026704788208,
        -0.05781238153576851,
        0.025429338216781616,
        0.06753739714622498,
        -0.01724795624613762,
        0.024868398904800415,
        -0.022843090817332268,
        -0.01909302920103073,
        0.1229168027639389,
        0.09242725372314453,
        0.025254014879465103,
        -0.036202508956193924,
        -0.08574149012565613,
        -0.06948336213827133,
        -0.029618514701724052,
        0.010245608165860176,
        -0.013805840164422989,
        -0.09349863231182098,
        -0.033514607697725296,
        -0.021386075764894485,
        0.0534643828868866,
        -0.06829605251550674,
        -0.029139811173081398,
        -0.047189317643642426,
        0.01786818914115429,
        0.07156271487474442,
        -0.029979992657899857,
        -0.014426181092858315,
        0.07471804320812225,
        0.07299697399139404,
        0.016419677063822746,
        0.04317370429635048,
        -0.11631868034601212,
        -0.14926229417324066,
        0.014862766489386559
    ]
}