{
    "id": "Y9UulQbxSYs",
    "title": "Galaxy S9 Teardown - Variable Aperture Camera lens Revealed!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-03-13T15:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=Y9UulQbxSYs",
    "category": "Howto & Style",
    "tags": [
        "Galaxy S9 Teardown",
        "Galaxy S9",
        "s9",
        "samsung galaxy s9",
        "smartphone",
        "tech",
        "unboxing",
        "hands on",
        "review",
        "technology",
        "galaxy s9+",
        "samsung s9",
        "samsung galaxy s9 review",
        "variable aperture camera lens",
        "battery replacement",
        "screen fix",
        "repair",
        "tutorial",
        "disassemble",
        "repair galaxy s9"
    ],
    "views": 1524490,
    "likes": 35647,
    "comments_count": 2383,
    "description": "Customize your Galaxy S9 with these:  Its time to teardown the Galaxy s9, Samsungs latest flagship smartphone. There hasnt been a whole lot of change from the Galaxy S8, but one of the new additions is the 12mp variable aperture camera lens. Its time to review this tech from the inside. Magnets make the world go round, and the same is true here with the OIS and aperture switch inside this camera unit.   If you break anything on your Galaxy S9, this video shows the process of me repairing and replacing all the major components. Whether it is a cracked screen, broken charging port or a dead battery it all comes out in this video.   Fix your Galaxy with repair guides and parts from iFixit!:   Galaxy S9 Durability Test HERE:   Current Galaxy S9 Pricing on Amazon:   Awesome Smartphone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/jerryrig-s9",
        "https://ifix.gd/2zMN4Xf",
        "https://youtu.be/HJYqgZDmsZo",
        "https://amzn.to/32tYviZ",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRig..."
    ],
    "transcript": "It's time to tear down the Galaxy S9 and take a look inside of that crazy variable aperture camera unit. My phone has been through a lot lately and it's not quite over yet. Let's get started. [Intro] You've already seen me open up glass backed phones a million times, so you know the drill. Heat is your best friend. Glass is glass. And luckily replacement panels are pretty cheap if you accidentally break one. Or if you manage to scuff up the paint on the underside of the glass, a dbrand skin is equally inexpensive. I'll link all the stuff down in the video description. Let's get to the good stuff. There are 15 screws holding down those black plastics and the wireless charging coil. I'll pop off that coil, the center plastic, and the bottom loud speaker, and then I'll unplug the battery. There's some very strong adhesive holding this battery to the frame of the phone. You can see how it bent my pry tool trying to get this thing out. I'll soften up the adhesive a bit with my heat gun and give it another shot. Prying out that 3000 milliamp battery... it's the same size as the previous Galaxy S8. Samsung claims 95% battery capacity retention after 2 years. Meanwhile Apple says plan for a 20% drop in capacity about every year if they don't manually throttle you first anyway. You know what you sign up for. The screen ribbon unclips like a little Lego, and then I'll make my way up to the front facing camera. It's an 8 megapixel, HDR capable unit, and pretty much the exact same thing we saw in last year's phone. We'll get to the new stuff here in a second, but first I'll unclip the volume buttons and these little signal wires down at the bottom, along with the white and blue wire cables. And then of course the SIM card tray comes out with it's 400 gigabyte capacity SD card slot. It also has the water resistant rubber ring around the opening. The whole motherboard can fold up and out of the phone at this point, allowing us to access the final Lego-style connector attached to the bottom of the motherboard for the charging port. I'll set the motherboard off to the side so we can tear open that camera unit in a second. The interior of this phone is solid metal. Samsung must anodize the entire frame at the same time, because it's all painted the same color inside and out. But you can see the metal shining through the scratch marks underneath. It's a very very solidly built phone. There is a long copper heat pipe to help keep the processor cool. And then another copper sticker over some of the front facing sensors. And lastly, a water damage indicator right up here by the SIM card tray. This is how Samsung knows if your phone has gotten wet or not. Remember, the Galaxy S9 is ip68 water resistant. Definitely not the same thing as water proof. I would just plan on keeping your phone dry. It's got a little circular coin vibration motor inside with it's little gold contact pads. I still need to make that vibrator explanation video since there are several types used in cell phones these days. So watch out for that one. Our little buddy jack is tied in with one screw and a Lego-style connector here at the bottom of the phone. I'll release those and pop him out. Then there are 4 more screws holding down the charging port into the phone frame. There's a little bit of adhesive under there, but the whole thing pulls up and away pretty smoothly. It's got a little rubber ring around the USB-C port to help keep water out out and the microphone hole is down here on this board as well. Now if I was going to do a screen replacement, I would use a ton of heat and basically break the screen off of the phone frame. There are massive machines that can do this safely and salvage the display if it's not already damaged, but without those machines, just plan on the screen breaking completely during the removal process and then installing your new one. Let's jump into one of the major improvements on this Galaxy S9: the camera. I don't tear down cameras very often, but I'll make an exception for this one. After popping it out from it's slot in the motherboard, we can see a couple things. First, we still have that optical image stabilization, that IOS that helps keep video footage looking super smooth, but that's pretty common. Now I'm interested in this variable aperture, you know, the little gizmo that physically changes how much light can hit the sensor at a given point. Popping off the protective housing, we can see that this aperture variation happens on the exterior of the lens since I can touch it with my tweezers. And the control mechanism for that aperture happens over here on the left hand side of the lens where I can manually open and close the little circle by sliding my tweezers up and down on the internal switch. Of course all of this happens electronically automatically inside the camera. It would automatically switch from 1.5 to 2.4 depending on the lighting situation on hand. But it's cool to see the hardware side of things during a teardown. Thumbs up to Samsung for doing something new. This is the same hardware you would find in a professional DSLR camera. Apple is usually about 2 years behind, so you'll see this in an iPhone around 2020. We aren't done with the teardown though. I'll pop out the lenses from the housing to reveal the camera sensor underneath. This multicolored 12 megapixel rectangle is what receives the light through the lens and turns it into an image for your phone. One last look at the switch on the side of the lenses for the aperture movement. That switch, including the optical stabilization, are most likely accomplished through magnets since you can see each side of the lens has a little magnet attached that attracts this screw. And each magnet lines up with the copper coils inside of the housing. Pretty cool. They help keep things balanced and stabilized. I'll start reassembling the phone. The camera won't ever be the same since there are some tiny little stabilizing rubber balls inside that escaped when I took it apart. Luckily, replacement cameras are pretty inexpensive so I'll just buy another when replacements become available. The charging port is in place and screwed down. And if we look up here on the left we see Bixby's little home. It's got the one button and a little ribbon with some gold contact pads. It looks pretty easy to remove if someone wants to be adventurous. They can just pop the button out, or leave the button in place and just rip out the contact pads so he never works again. I'm not suggesting murder, I'm just saying it's possible. The motherboard gets clipped in at the bottom first with the charging port and then set down into the aluminum frame of the Galaxy S9. If you noticed, I'm leaving the camera unattached right now, but the phone should still work without it. The front facing camera is plugged in and then the screen ribbon is clipped into the motherboard like a little Lego, along with the 3 little signal wires at the bottom. Now one more subtle difference between the S9 and the S8 that you probably won't hear anywhere else is about the camera flash. It's still a single colored LED flash, but the S9 has a diffuser in it while the S8 does not. Light diffusers are usually preferred among photographers since it's a little less harsh on the image. And the Galaxy S9 now has one in place. Not a reason to go out and buy a whole new phone of course, but it is still something new. And I guess if I have to be nice, Apple has been diffusing their flashes on their iPhones for quite a while now. Anyway, the battery is back in place and plugged in, along with the headphone jack and this little screw. And this is the part where you would normally get the plastics back on and the 15 screws screwed back into place, but since my phone has been torn down and clarified a bit, this portion of the video is going to be a little different. I'll get some double sided tape to hold that glass back panel in place. And after clipping in the fingerprint scanner, I can see if the whole phone works or not. It turns on even without the camera unit in place. And the whole thing appears to be working. It finds Wi-Fi, Bluetooth, and the front camera works. But as soon as I flip it to the rear camera, the camera app dies with a camera failed warning...probably because it just doesn't exist anymore. But yeah, if you're bored of a normal looking phone, make sure you check out the dbrand link in the description. Show them some love for supporting my channel, and build your own phone by clicking that link. I think this camo skin is pretty sweet. Thanks for joining me on the teardown on this Galaxy S9, and if I've earned it, hit that subscribe button. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "phone",
        "camera",
        "Galaxy",
        "pretty",
        "camera unit",
        "place",
        "phone frame",
        "bottom",
        "glass",
        "inside",
        "motherboard",
        "thing",
        "charging port",
        "battery",
        "front facing camera",
        "frame",
        "charging",
        "water",
        "port",
        "Samsung"
    ],
    "transcript_entity_values": [
        "8 megapixel",
        "iPhone",
        "95%",
        "2020",
        "ip68",
        "15",
        "2.4",
        "Lego",
        "SD",
        "IOS",
        "3000 milliamp",
        "Wi-Fi",
        "Glass",
        "jack",
        "about every year",
        "20%",
        "about 2 years",
        "400 gigabyte",
        "S8",
        "12 megapixel",
        "Galaxy S8",
        "S9",
        "1.5",
        "a ton",
        "4",
        "SIM",
        "last year's",
        "Apple",
        "iPhones",
        "first",
        "second",
        "Samsung",
        "First",
        "the Galaxy S9",
        "these days",
        "DSLR",
        "2 years",
        "3",
        "One",
        "Bixby",
        "the Galaxy S9",
        "this Galaxy S9",
        "USB",
        "one",
        "a million"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.10603675991296768,
        0.08476444333791733,
        0.07777094841003418,
        -0.05203878879547119,
        0.07080405950546265,
        0.011559664271771908,
        0.05245475098490715,
        0.11268676817417145,
        -0.08149874955415726,
        0.0156656913459301,
        0.032690443098545074,
        -0.008417805656790733,
        -0.048582375049591064,
        0.08833552151918411,
        0.04202776029706001,
        -0.0747404620051384,
        0.022669630125164986,
        -0.05344589427113533,
        -0.04061281308531761,
        0.050037141889333725,
        0.03904695063829422,
        0.050154946744441986,
        -0.013091817498207092,
        -0.04958523437380791,
        0.03451443091034889,
        0.005877782590687275,
        0.0024671161081641912,
        -0.04856261983513832,
        -0.08097865432500839,
        -0.04592612013220787,
        0.009786281734704971,
        0.12630198895931244,
        -0.10138599574565887,
        0.07083499431610107,
        -0.0019258529646322131,
        -0.08415038883686066,
        -4.360545790405013e-05,
        -0.0010566902346909046,
        0.01252633985131979,
        -0.0038830351550132036,
        -0.07873371988534927,
        0.06861422210931778,
        0.041773997247219086,
        -0.05244136601686478,
        0.03327376767992973,
        -0.03454775735735893,
        0.12401668727397919,
        -0.029086973518133163,
        0.03559555113315582,
        0.03998314589262009,
        -0.05319584161043167,
        0.016802970319986343,
        0.009240669198334217,
        0.04944561421871185,
        0.013180693611502647,
        0.010507122613489628,
        -0.019672147929668427,
        -0.07334870845079422,
        0.0005629209917970002,
        -0.06150919944047928,
        0.04026828333735466,
        -0.04233286529779434,
        0.013135458342730999,
        0.07174810022115707,
        0.03471782058477402,
        0.012876675464212894,
        0.04270284250378609,
        -0.1142241358757019,
        0.006918227765709162,
        0.01973705366253853,
        0.0015354258939623833,
        0.0202482957392931,
        -0.08050952106714249,
        -0.018588349223136902,
        -0.02243485115468502,
        0.09385211765766144,
        0.03589848428964615,
        0.010779968462884426,
        0.03168468922376633,
        0.05813644453883171,
        0.04253017529845238,
        -0.022542746737599373,
        0.014602972194552422,
        0.04886335879564285,
        0.03978901728987694,
        -0.039655447006225586,
        0.006520573049783707,
        0.029039399698376656,
        -0.005691633094102144,
        -0.021788502112030983,
        -0.022771086543798447,
        0.02117077261209488,
        -0.02546793222427368,
        -0.039777971804142,
        0.0052424329333007336,
        -0.020578421652317047,
        -0.07645171880722046,
        -0.07307454943656921,
        -0.059185177087783813,
        0.06823039054870605,
        0.05852152407169342,
        -0.036549270153045654,
        0.014141826890408993,
        0.006234964355826378,
        0.029903460294008255,
        -0.014987919479608536,
        -0.011426202952861786,
        0.03114350140094757,
        -0.033655859529972076,
        -0.03107539191842079,
        -0.00039379188092425466,
        0.06841853260993958,
        -0.034394051879644394,
        -0.04902200773358345,
        0.02185088023543358,
        0.003564417827874422,
        -0.031550146639347076,
        0.005277280230075121,
        0.020268132910132408,
        0.06917843967676163,
        0.012677911669015884,
        0.015460287220776081,
        -0.10442624986171722,
        0.007177936844527721,
        0.036229208111763,
        0.032124489545822144,
        -0.06176457554101944,
        1.882815566663959e-33,
        0.05078022554516792,
        0.0664539709687233,
        0.04465079307556152,
        -0.02607385441660881,
        -0.03950098529458046,
        0.025759760290384293,
        0.02199818380177021,
        0.0953199490904808,
        -0.0015808924799785018,
        0.00866491999477148,
        -0.049283117055892944,
        0.02155008167028427,
        -0.07899931818246841,
        -0.026871390640735626,
        0.030980810523033142,
        -0.08027127385139465,
        0.02171371504664421,
        0.0077305445447564125,
        -0.022735483944416046,
        -0.010372655466198921,
        0.01011652685701847,
        0.0018629377009347081,
        0.012645810842514038,
        0.013335198163986206,
        0.10639189928770065,
        0.08925764262676239,
        0.1095900610089302,
        0.0507185123860836,
        0.004675241652876139,
        0.025164658203721046,
        -0.030217880383133888,
        0.035725172609090805,
        0.04503055289387703,
        -0.005650897044688463,
        -0.03780965134501457,
        -0.05285625904798508,
        -0.014614768326282501,
        -0.01728072762489319,
        0.01766623929142952,
        -0.05006757751107216,
        0.021377915516495705,
        0.05936424061655998,
        -0.03842249512672424,
        0.00952827651053667,
        0.07636808604001999,
        -0.02973342500627041,
        -0.07056161761283875,
        0.01694338209927082,
        -0.002564162015914917,
        0.009939187206327915,
        0.017557771876454353,
        -0.09270546585321426,
        0.005809118039906025,
        0.0058753308840096,
        -0.07133307307958603,
        0.005322976503521204,
        -0.01357228308916092,
        -0.006617504172027111,
        -0.07073619961738586,
        0.07806043326854706,
        0.06655877828598022,
        -0.07918401807546616,
        -0.06459889560937881,
        0.01743786409497261,
        -0.030971335247159004,
        0.0013058481272310019,
        0.026931392028927803,
        0.028545647859573364,
        -0.04061606898903847,
        -0.004298801068216562,
        -0.009119623340666294,
        -0.035998668521642685,
        0.030775660648941994,
        0.024368619546294212,
        0.022083047777414322,
        0.05511811375617981,
        -0.030144141986966133,
        -0.00353856454603374,
        0.01700490154325962,
        -0.03070891462266445,
        -0.04850832372903824,
        -0.009760093875229359,
        0.08014120161533356,
        0.0071579166688025,
        -0.046393878757953644,
        -0.060895517468452454,
        0.019109895452857018,
        -0.04532013460993767,
        0.012923480942845345,
        -0.047490302473306656,
        0.015711499378085136,
        0.008128737099468708,
        -0.03398265317082405,
        -0.051565781235694885,
        -0.05083352327346802,
        -3.54480570331832e-33,
        -0.01840793900191784,
        -0.06707051396369934,
        -0.047534167766571045,
        -0.01717778667807579,
        0.0011261285981163383,
        0.010445808991789818,
        0.08081533759832382,
        0.08756711333990097,
        0.030866073444485664,
        -0.02526780776679516,
        -0.052085891366004944,
        -0.0025065368972718716,
        -0.06110505014657974,
        -0.11322221904993057,
        -0.05035004764795303,
        -0.05181237310171127,
        -0.04420243203639984,
        -0.028116995468735695,
        0.03354509547352791,
        0.0505116768181324,
        0.02190074324607849,
        0.09028108417987823,
        0.14469391107559204,
        0.002677737735211849,
        0.027423568069934845,
        -0.015044381842017174,
        0.03382965549826622,
        -0.0021393762435764074,
        0.053895190358161926,
        0.0309161264449358,
        0.014636018313467503,
        -0.08137989044189453,
        -0.020565519109368324,
        0.10751640051603317,
        0.0107865110039711,
        0.02735278755426407,
        0.03402845934033394,
        -0.07467631995677948,
        0.048191893845796585,
        -0.03969180956482887,
        0.07329390943050385,
        0.05772341042757034,
        0.01767008751630783,
        -0.023487480357289314,
        -0.007654533255845308,
        -0.06968489289283752,
        0.008174321614205837,
        0.07338599860668182,
        0.02707374468445778,
        0.025574039667844772,
        -0.05147802457213402,
        -0.08918709307909012,
        0.010444281622767448,
        0.04793795570731163,
        -0.03868209943175316,
        0.0018391911871731281,
        0.0358278788626194,
        -0.11574118584394455,
        -0.0194874107837677,
        0.04049576073884964,
        0.08041033893823624,
        0.06523359566926956,
        -0.05363890156149864,
        -0.033525221049785614,
        -0.003918096888810396,
        -0.07422907650470734,
        0.0465271882712841,
        0.01764647290110588,
        0.025237154215574265,
        -0.05130792409181595,
        0.04143546521663666,
        -0.03220560774207115,
        -0.03242200240492821,
        -0.056042060256004333,
        0.09609436243772507,
        0.03421521186828613,
        -0.1089271605014801,
        -0.010410286486148834,
        0.01627928577363491,
        -0.005456354469060898,
        0.06279733031988144,
        -0.08556854724884033,
        0.024876980111002922,
        0.04661284014582634,
        0.09018701314926147,
        -0.030618926510214806,
        0.035032711923122406,
        0.06447829306125641,
        0.07474251091480255,
        0.021323157474398613,
        -0.15358173847198486,
        0.01611359417438507,
        -0.0208663921803236,
        0.055579572916030884,
        -0.014918678440153599,
        -5.089395216373305e-08,
        0.05947808548808098,
        0.049342911690473557,
        -0.009513115510344505,
        0.02222546376287937,
        -0.0034191294107586145,
        -0.09949590265750885,
        -0.05172279104590416,
        -0.0038602997083216906,
        0.048720937222242355,
        -0.03919459879398346,
        0.003842002712190151,
        -0.02353810705244541,
        -0.03349741920828819,
        -0.006364284548908472,
        -0.02339351922273636,
        -0.01210222952067852,
        -0.024500882253050804,
        0.0966574102640152,
        0.0032245153561234474,
        0.010981697589159012,
        -0.08415701985359192,
        0.008738764561712742,
        0.05949034541845322,
        -0.09616798907518387,
        0.03968581557273865,
        0.05779407545924187,
        -0.174894317984581,
        0.020876148715615273,
        0.10089075565338135,
        0.025397993624210358,
        0.01904459111392498,
        -0.0521855466067791,
        -0.00850381888449192,
        -0.005943979602307081,
        -0.11753121763467789,
        -0.07173223793506622,
        -0.018546121194958687,
        -0.015203069895505905,
        0.10894240438938141,
        0.03693269565701485,
        -0.030989615246653557,
        -0.03031960129737854,
        0.003267345717176795,
        0.013841537758708,
        -0.062369827181100845,
        -0.051088135689496994,
        0.08064070343971252,
        -0.032335687428712845,
        -0.06442542374134064,
        -0.00900553073734045,
        -0.05851433798670769,
        -0.01904125139117241,
        -0.1329459547996521,
        -0.037140510976314545,
        0.009300759062170982,
        -0.0955200046300888,
        0.09996012598276138,
        -0.00971958041191101,
        -0.04061676189303398,
        0.05814795196056366,
        0.017103156074881554,
        -0.029778458178043365,
        -0.07292662560939789,
        0.025152839720249176
    ]
}