{
    "id": "y_3ay13Ib0k",
    "title": "Austin Evans is WRONG about Nintendo",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-05-28T15:58:45Z",
    "video_url": "https://www.youtube.com/watch?v=y_3ay13Ib0k",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "nintendo",
        "switch",
        "switch lite",
        "snes",
        "nes",
        "gameboy",
        "gameboy advance",
        "gbc",
        "gba",
        "wii",
        "wii u",
        "nintendo entertainment system",
        "super nintendo",
        "nintendo switch",
        "nintendo switch lite",
        "nintendo wii u",
        "gaming",
        "tier list",
        "nintendo 64",
        "wii u 2020",
        "super famicom",
        "game boy micro",
        "gba sp",
        "consoles",
        "games",
        "tech",
        "technology",
        "pokemon",
        "mario",
        "super mario 64",
        "quest 64",
        "dsi",
        "ds",
        "3ds",
        "nintendo ds",
        "2ds",
        "nintendo 3ds"
    ],
    "views": 143213,
    "likes": 4559,
    "comments_count": 744,
    "description": "What's your god tier Nintendo console?! Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Does MKBHD Know Tech?  Galaxy Z Flop:  Does Snazzy Labs ACTUALLY Know Phones?  Does Austin Evans ACTUALLY Know Phones?  Buying the TINIEST Phones on Wish:   Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "https://youtu.be/AEuCh_79z2U",
        "https://youtu.be/ZskdtxrPJoE",
        "https://youtu.be/O8ri-QIP1eE",
        "https://youtu.be/Ltq96nc-64M",
        "https://youtu.be/UGYfi06PGJU",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello welcome to \"This Is\" Nintendo create many many consoles over the years so today Matt and I are going to create the ultimate tier list of which Nintendo Console is true the greatest. Can I just say Virtual Boy and we're done with the video or is that not okay? - Virtual Boy was horrible. - The virtual boy was ahead of its time though literally twenty years ahead of its time. So it had the advantage of giving you a real sort of 3D effect, it looked cool, okay who am I kidding here. Virtual Boy sucked I think just for the novelty I would give it D. - I'll concede to D. - Okay excellent so we're driving that to D. - I want it noted though that you are significantly more lenient than I am. - Very true, very true. Would you have to pick the next console my friend. - Let's talk about the Wii U. - The Wii U while we're just going from strength to strength here (giggling) - I think we are all gonna agree that the Wii was amazing. The Wii U followed up with zero of that momentum. - Whoa, whoa, whoa, whoa I'm gonna cut you up right there. So the Wii U a lot of ways was I prototype for the switch we have today. It had the controller which obviously had that tablet function you could play without even the console tied to a TV if you want to and there were a ton of great games on the Wii U right? - The problem is is that all of those games literally almost any exceptions had been moved over to the Switch which means that there's not a lot of reason to actually play the Wii U. - The tablet was legitimately cool when it came out. But you could only have the one tablet. It would have been so much cool to have that be an option to have like multiplayer. I can literally think of only one, maybe two uses for the Wii U tablet that were legitimately you know, like actually groundbreaking. - It was almost like the DS problem right? Of so many games on the DS didn't really do anything with the second screen right? Like it was a cool idea and some games were able to take advantage of it. With the Wii U it was very, very much \"a oh, this will be cool\" but it never found its killer app. - FTR. - FTR thumbs down. - Let's go with the original Game Boy. This is a device that has a very fond place in my heart but we have to consider the original Game Boy was way behind pretty much all of its competitors in a lot of key areas. - What, wait, hold on, was it behind because it came out before any other competitor? - Within a year or two okay, fair. - The game gear came out after the the original Game Boy so it's hard to say that they're behind. It was a very you know 80s, 90s strategy for Nintendo if it's not broke don't fix it. Problem is they did wait a little too long to fix it. - That's the thing so with all these tiers we're considering the console as a whole right? So the Game Boy, the Game Boy pocket, the Game Boy Light, it's all lumped into one tier and the thing is the Game Boy color I do believe was a sequel. But even if was a fairly minor sequel it took almost 10 years to come out. - Nostalgia is definitely playing a factor in here so I'm biased on this one but this is S tier to mean no brainer, I still have my original Game Boy from 1998. - The only thing I would say against it being S tier is that if you go to try to play an original Game Boy today that green screen is rough, there's no back lighting and even though it had decent battery life that thing still eats through four double A batteries really quickly. I feel like today I would much rather play like a Game Boy advance like SPR or something which is the only reason why I kinda feel like the original Game Boy may need to be A tier instead of S tier. - We wouldn't have the the Game Boy Advance if the Game Boy you know... The Game Boy walked so the SP could run. - Alright I can't argue with that. Next up let's take a little bit of a trip into weird land with the Nintendo 64. I know where to start with the 64 right? Like so the 64 had some major issues right at the gate. It was the only console that didn't really in this generation move over to a CD or an optical disc. Which I think heard it in some ways it really meant that the games had to be much smaller. The Nintendo 64 also had a huge advantage of being incredibly powerful. It was significantly ahead of rivals like the Saturn and especially the PlayStation. And on top of that it had some of the most revolutionary games I mean look, how are you trying to tell me that Mario 64 is not one of the most important games of all time. - I'm personally not a huge Mario fan but I agree with you that you know it's a super important game, my big issue with the N64 was that there was no built-in memory with it. You know, you can argue that well, neither did the PlayStation you did the Saturn but that was like supposed to be the trade-off you get from going to the optical drive versus the cartridge. The cartridge was supposed to have onboard memory, I didn't have a memory card for the N64. So I just kept replaying games from the beginning every time. - I thought most games actually saved on the cartridge though. - So like I remember I had Quest 64 which was like a you know, a knockoff between Final Fantasy and Zelda, so it was like kinda somewhere in between the two of them. That one did not save to the cartridge. N64 instilled some really bad habits in me and it's not very green so I'm gonna give it a B. - You know I will 100% agree, I think N64 definitely deserves B tier on this one. - Let's talk about the NES. - Oh okay. - The NES was an absolute masterpiece when it came out. They did so many things right with this console because at the time no one in America cared about video games. In fact video games were a dirty word in America. Video games were considered toys, there was a whole crash in the 80s of like Mattel stuff and no one wanted to have any of those. So they rebranded that as the NES. The Nintendo Entertainment System. And then made it look like a VCR so that way people in America who were too stupid to realize is a video game would buy that and it totally worked. - Well and that's why it's called the Nintendo Entertainment System because it came with Rob the robot initially right, like it was meant more as a toy in the video game was just a way to interact with the robot to sort of sneak into the big toy stores of the world. Look there's a lot we could say about NES this was the most straightforward on the list, this is S tier no question to me. - Alright let's get into a little bit of a newer console, the Nintendo Switch. Now this was a little bit harder to judge cause obviously with all of these other consoles they've all ... they had to run, it's really clear to see their impact, the Switch has only been out for two or three years now at this point but I think it's really clear to say that after coming from the Wii U, the Switch was a huge turning point for Nintendo. Especially with games like Animal Crossing Now, Switches years later after they first come out, have been completely sold out for months right? I think that the Switch is probably one of the most important Nintendo consoles that have ever been designed. - I 100% agree with you but at the same time I have been severely underwhelmed with the Switch. So I paid like $450 for mine in the first week, I bought it from some eBay scalper. I was so excited to have this. The games that come out for it are either a kind of mediocre to me, I mean Breath Of The Wild is great but that's a Wii U port but again like I said I'm not a huge Mario fan so like I would you know, there was this promise of having more third party titles coming to it which there have been. There's been a lot of ports of great games to the Switch but then so many of those games run terribly on the Switch. - I will say though on the flip side of that argument the Switch is seen more third-party support from games that you would traditionally find on Play station or Xbox. And there's a lot of games on the Switch that are not only of course running on the original sort of TV mode, where you know you can compare it in iOS then maybe not quite as good as an Xbox or PS4 but when you look at it in the handheld mode is it legitimately really impressive experience? - I'm never expecting them to look as good as Xbox or PlayStation. You look at Pokemon Sword and Shield you know, again this was this was like the promise of the Switch was to get the the Pokemon game that we always dreamed of with more power what not. And then like just none of it's been delivered. I'm somewhere in between A and B you know like, I do agree the console itself is amazing. It's like the ecosystem around the console that I'm like, huh I don't know. - I'm a firm A on this one. I feel like there's no way to discount the huge impact with us which has had. Also you have to consider the switch's pretty much absorbed both the handheld and the mainline consoles right? Like Nintendo doesn't make DSS or 3Ds's or wheeze or anything like that anymore. The switch is everything. To me firm A tier. - I mean I'll give you the A tier, I wish that it was S tier. - Next up let's talk about the Game Boy Color. Now this definitely has a lot of stock attached. This was my very first Game Boy. I grew up playing that Game Boy color, like Pokemon in the backseat of the car but the problem with the Game Boy Color is that it's almost not even a full generation upgrade, right? So, it technically was about twice as powerful as original Game Boy but it came ten years later, it did introduce color but the thing is most Game Boy Color games, would still run on the game board right? There are very few games that were exclusive to the Game Boy Color. I feel like Game Boy color is a C tier. It was a upgrade but it wasn't a huge upgrade and it really didn't move the needle very far considering that it was for ten years later from the original Game Boy of nine years later. - Yeah fully agree with you on that one. - C tier, okay your turn next my friend. - Let's do the Game Boy Advance. You could make the same argument for the Game Boy Advance. Like the games were better but same thing like it wasn't a huge jump from the color and the original Game Boy Advance still didn't have the backlit. I mean I don't know if people today understand the struggles of trying to play one of these game boys in the back of the car at night. You turn on the light in the backseat and your dad's like, \"No, turn it off I can't see.\" So you're trying to play these games using the the street lamps as you're driving by. You could make the argument for the original Game Boy Advance that's not a huge jump but if we're comparing the Game Boy Advance and we're including like the Game Boy micro or the Game Boy SP then I think it's a major jump. Yeah so there's a bunch of things to talk about with the Game Boy Advance first of all this was a legitimate upgrade in performance right? So most people consider the Game Boy to be almost like a portable SNES and I don't think that's wildly off right? So the Game Boy Advance had a wider screen display it displayed minimal colors, it added the shoulder buttons and honestly the original Game Boy Advance actually was nice and comfortable to use that sort of got rid of the vertical form factor but when you consider something like the Game Boy Advance SP that was on a whole other level. You had the backlit screen, you had a rechargeable battery, you had a folding form factor which honestly I mean, I would still play the Game Boy Advance SP today, it was great it was a very cool experiment. To me Game Boy Advance is a very firm B tier. I think that it was personally although obviously the tier list has to be a little bit more, I'm biased with this, personally my favorite Game Boy in my favorite handheld console that Nintendo ever made. - So I never had an SP or the Micro. I acknowledged that they were the big update. I'm with you on the B tier on that. - How about the Nintendo Wii? So the Wii is kind of difficult because it still is the best-selling home console that Nintendo has ever put out right? Show the D's and the Game Boy also on the portable side but the Wii was an absolute phenomenon. I remember years after it came out people would still be getting in fights over trying to buy a Wii at Christmas time. You had the fact that it had full backwards compatibility. The first time that a Nintendo home console had it and you even had the game cube but memory card ports, you had the actual slots on the top, it would take GameCube games and then you also had the fact that it had what I would say a lot of revolutionary features for the time. It had Wi-Fi built-in, you had the Wii remote with all the motion controls, there was a lot going for the Wii. - You know a couple of my friends and I had actually bought one not even for the game. We like we went in on it as a group because it had Wi-Fi and you could put Netflix on it. This is when you had to actually get a disc from them to install it on cause there's no like App Store to download Netflix directly. But having Wi-Fi with Netflix was like a major deal when this came out. The problem with the Wii though is that while it had a lot of very cool features ultimately it was a slightly more powerful GameCube which meant that while it went in a very different direction unlike previous consoles like the GameCube was absolutely up same with N64, like they were very competitive. But the Wii just simply could not compete remotely with a PS3 and Xbox360 which meant that the Wii got a lot of terrible games, terrible games right? Like sure they were the first part in Nintendo titles, there were some of the fun party games but beyond that it was a whole lot of My Little Pony and stuff that really wasn't anywhere near to the same level which I think really hurts that on this list. - I agree but I feel like the Wii almost was not marketed for your typical gamer. It's marketed towards more adults than anything with like Wii Fit and you know, Wii sports and whatnot and then like all the games that you got for it we're like the games for like someone's five-year-old. You know so they can play mom and dads Wii instead of buying a whole nother console. - As far as I'm concerned while the Wii has a lot going for it, it also has a lot of negatives. I think it puts it pretty much squarely in the middle of my list I would give it C tier. - Yeah I'll accept that. - All right I would like to pick the next console the SNES. - ho-ho going for the big guns. - For me it was hard to imagine a better console when that came out. It obviously is before any type of like joysticks, were you know the thumb sticks were a thing. I thought this was the pinnacle of gaming technology, I love that there was a cartridge adapter that you play all your Game Boy games on the screen. You had a lot of like TV and movie tie-in games which were really fun. I remember like spider-man, there's a great Power Rangers game, Ninja Turtles. I thought so many good things came to this console and I think the peak for me gaming wise. To me this is minimum A tier. - Yeah I'll go with A tier on this one as well. I think there's no doubt the Super Nintendo was a big step forward from the NES, tons of great classics, it was a very solid console and ultimately was a major bridge between the NES and then sort of the newer 3D generation getting into the N64. So I would definitely agree that Super Nintendo was A tier. Let's talk the 3DS. The problem with the 3DS is that it launched at $250. It pretty much immediately got a price cut within sight of a year or so. It had a terrible launch live. There are very few games that were available for 3Ds for quite a while and the thing is it was a little more powerful but you look at something like the Vita, it was a massive, massive step forward. The Vita was so much better technically a pretty much across the board. Now obviously the 3Ds had the great advantage of tons of excellent first party titles then you had the new 2D SXL it was a major step forward. For me I think this is pretty firmly an C tier. I think that there's a lot going for the 3Ds but also it was very forgettable. I don't think it really sort of moved the envelope in a way that I think it really could have. - I would actually put it in D tier. I didn't think the 3Ds platforms found it's legs until the 2D SXL. I'm sticking I'm with D tier. - I still feel like that's a little bit harsh but I'll go with you the three years goes in D tier. Next up lets talk Game Cube. This is kinda hard to place because on one hand the GameCube personally was one of my favorite consoles. In fact the GameCube was actually my very first home console from Nintendo. Before that I had like a PlayStation that never had an SNES or an NES. I always played that at like friends house. This is the first time that I actually purchased a home console a home Nintendo console for myself. The GameCube was very well respected as far as performance went. It was really quite powerful, very much better than something like the PS2. It had finally optical discs although they were small and it was kind of caused some issues but the GameCube had some excellent, excellent games. - I never had a Gamecube and I think I've only played GameCube maybe twice in my whole life. - Well that was one of the big problems with the Gamecube is that it didn't really sell all that well and ultimately is one of the reasons why Nintendo decided to go a very different direction with the Wii. The GameCube I think personally I like a lot but ultimately in the confines of this list I feel like definitely deserves C tier. - I'm gonna agree with you because I don't have enough experience to argue otherwise. - I will say, I don't think the comments will agree with us. I think the GameCube is widely loved. - Well so the only people I knew who loves the GameCube were the Smash community. - Yeah of course, of course. All right we'd like to tee up the last item. - So we have the Nintendo DS. - Did you ever own a Nintendo DS? - I did not. - Whoa! really? - It was a weird time age-wise for me of like, I was in high school it wasn't you know that it wasn't cool to be playing Game Boy. So I had a PSP around the same time. So that was what I went with handheld wise. Now I fully acknowledge and I did look at the DS and I did really want one and I didn't get one basically because of peer pressure. - It was an interesting hybrid as so many of these Nintendo consoles were. If you look at something like the PSP technically far superior and honestly I had a PSP and I loved it right. But the PSP was really capable of playing some incredible games especially given the time frame. But the D also pushed Nintendo forward in some key areas While we were talking about the Wii, it's great how it had like Wi-Fi on, all these things the DS had it two-three years beforehand, two years beforehand, three beforehands something like that. And ultimately the DS while it was not incredibly powerful would go on to be one of the most popular consoles of all time, with the DS lite, with the DSI, with the DSI XL. There were a ton of versions of the DS and there were some really great games of course there's a lot of shuffle whereas with most of these Nintendo consoles. There are also some absolute killer games with the DS and for me this is a really easy B tier. I think DS was one of the best Nintendo handhelds of all time. - Okay. - And so with that we have the official ultimate Nintendo tier list designed by Austin and Matt. Matt would you like to give any pre-emptive apologies to the fans who I'm sure are going to be very happy with all of our decisions here. - I'm not gonna preemptively apologize. I'm gonna say we like what we like and you like what you like. Let us know what your rankings are in the comments. (upbeat music)",
    "transcript_keywords": [
        "Game Boy advance",
        "Game Boy",
        "original Game Boy",
        "Game Boy color",
        "Game Boy games",
        "Game",
        "Boy advance",
        "Boy",
        "games",
        "Boy Color games",
        "original Game",
        "Nintendo",
        "Wii",
        "Boy color",
        "Game Boy Light",
        "Game Boy today",
        "Game Boy micro",
        "Virtual Boy",
        "playing Game Boy",
        "favorite Game Boy"
    ],
    "transcript_entity_values": [
        "zero",
        "Game Boy",
        "Animal Crossing Now",
        "the Game Boy Color",
        "SNES",
        "three",
        "the Game Boy Advance SP",
        "twenty years",
        "GameCube",
        "Mario",
        "a year or so",
        "Rob",
        "Pokemon",
        "PSP",
        "Virtual Boy",
        "Smash",
        "Nintendo",
        "SPR",
        "64",
        "Mario 64",
        "Game Cube",
        "tons",
        "SNES",
        "NES",
        "nine years later",
        "D.",
        "third",
        "Wii",
        "Game Boy Advance",
        "ten years later",
        "250",
        "Matt",
        "DS",
        "Austin",
        "Game Boy of",
        "SXL",
        "Xbox",
        "the first week",
        "Netflix",
        "Micro",
        "ho-ho",
        "first",
        "a ton",
        "eBay",
        "only one",
        "two or three years",
        "SP",
        "DSI",
        "the 80s",
        "Wii Fit",
        "Christmas",
        "Super Nintendo",
        "N64",
        "100%",
        "Game Boy",
        "3Ds",
        "Wi-Fi",
        "Wii U",
        "Power Rangers",
        "3DS",
        "second",
        "Gamecube",
        "FTR",
        "PlayStation",
        "Saturn",
        "Wii",
        "Ninja Turtles",
        "almost 10 years",
        "1998",
        "the three years",
        "PS3",
        "Zelda",
        "450",
        "one",
        "PS4",
        "four",
        "The Nintendo Entertainment System",
        "the Nintendo Entertainment System",
        "The Game Boy",
        "Xbox360",
        "today",
        "Pokemon Sword",
        "3Ds",
        "two years",
        "the years",
        "months",
        "a year",
        "two-three years",
        "90s",
        "America",
        "the Nintendo Switch",
        "two",
        "years later",
        "Wii",
        "Mattel",
        "Pokemon",
        "Game Boy Advance",
        "Vita",
        "five-year-old",
        "Final Fantasy",
        "Switch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "ORDINAL",
        "FAC",
        "PERSON",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "EVENT",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.053527288138866425,
        0.01259353756904602,
        0.08595624566078186,
        -0.17018501460552216,
        0.019781623035669327,
        -0.011615362949669361,
        0.05574154108762741,
        0.06299874186515808,
        -0.028519006446003914,
        0.081184521317482,
        -0.03998832404613495,
        -0.020741840824484825,
        -0.04467497020959854,
        -0.018328765407204628,
        0.04995100572705269,
        -0.04112362861633301,
        0.08513712137937546,
        0.027054814621806145,
        -0.06713405251502991,
        0.07462316751480103,
        0.040401391685009,
        0.029273496940732002,
        0.014434484764933586,
        0.015277732163667679,
        -0.00032357414602302015,
        0.11048320680856705,
        -0.01485944353044033,
        -0.009614704176783562,
        -0.008925105445086956,
        -0.0004548387951217592,
        -0.05990774184465408,
        0.07455681264400482,
        0.08537884801626205,
        -0.02295290306210518,
        -0.024936391040682793,
        -0.04396851733326912,
        -0.03407077118754387,
        -0.07127342373132706,
        -0.07222489267587662,
        -0.04290447384119034,
        -0.1021619662642479,
        0.045488033443689346,
        -0.013407185673713684,
        0.034860678017139435,
        0.0032581237610429525,
        -0.05610648915171623,
        -0.056041158735752106,
        -0.08962596952915192,
        -0.05847560241818428,
        0.04970097169280052,
        -0.06461596488952637,
        -0.0587390698492527,
        0.14853765070438385,
        -0.02296360209584236,
        -0.005240750964730978,
        0.123747318983078,
        0.037338972091674805,
        0.04354780167341232,
        0.06463062763214111,
        0.08125625550746918,
        -0.01600351370871067,
        -0.041613783687353134,
        0.004041374195367098,
        -0.009354324080049992,
        -0.021364647895097733,
        0.002029657829552889,
        -0.013562336564064026,
        -0.00042492346256040037,
        -0.07092882692813873,
        0.016711948439478874,
        0.01711982861161232,
        0.05152294784784317,
        0.040991827845573425,
        0.020684655755758286,
        -0.021906083449721336,
        0.04560170695185661,
        0.01782786287367344,
        0.015559069812297821,
        0.04428299516439438,
        0.02461651712656021,
        0.09073950350284576,
        -0.039311107248067856,
        -0.10470961779356003,
        -0.04659278690814972,
        -0.0359477773308754,
        -0.015794795006513596,
        0.02581610530614853,
        -0.07227099686861038,
        -0.05709781497716904,
        0.05716414377093315,
        -0.04576269909739494,
        0.04987109452486038,
        0.09310931712388992,
        0.004822935909032822,
        0.0693800076842308,
        -0.02016853727400303,
        -0.042108628898859024,
        -0.08859064429998398,
        -0.04204538092017174,
        0.06024057790637016,
        0.0050569986924529076,
        0.057573333382606506,
        0.018513912335038185,
        0.04144276678562164,
        0.055853575468063354,
        -0.005842141341418028,
        -0.034648921340703964,
        -0.011037842370569706,
        -0.031914301216602325,
        0.033401861786842346,
        -0.020501520484685898,
        -0.0347733348608017,
        0.005770972929894924,
        0.009797114878892899,
        0.03144162520766258,
        0.007826906628906727,
        0.005429716780781746,
        0.125259667634964,
        0.05114607885479927,
        -0.02063629776239395,
        -0.015938740223646164,
        0.045884087681770325,
        0.004351753741502762,
        0.05825221538543701,
        0.01583860069513321,
        -0.1284608095884323,
        0.021531835198402405,
        3.0351903313284723e-33,
        0.03272511437535286,
        0.09135843813419342,
        0.015951624140143394,
        0.02659960649907589,
        0.02195611596107483,
        0.01937817968428135,
        0.011123757809400558,
        0.06391287595033646,
        -0.04964076355099678,
        -0.010654480196535587,
        -0.035141050815582275,
        0.03145869821310043,
        -0.05549567937850952,
        0.051752787083387375,
        0.07321019470691681,
        -0.03152501583099365,
        -0.09069562703371048,
        -0.06550251692533493,
        0.04475850984454155,
        0.02034774422645569,
        0.04084257036447525,
        0.005027871113270521,
        0.03291160985827446,
        -0.07044576853513718,
        -0.02981659211218357,
        -0.046495188027620316,
        -0.05901450663805008,
        -0.008690999820828438,
        0.03815705329179764,
        0.017096297815442085,
        -0.08995115756988525,
        -0.04801124334335327,
        0.022972606122493744,
        -0.013541663996875286,
        0.0750325545668602,
        -0.01999371498823166,
        0.02655188739299774,
        -0.08236277103424072,
        -0.0688776969909668,
        0.07767520099878311,
        -0.05364067852497101,
        -0.0016211803304031491,
        -0.11855500191450119,
        0.02508314698934555,
        -0.010018870234489441,
        0.05458556488156319,
        0.030964594334363937,
        -0.0987808108329773,
        -0.031005527824163437,
        -0.008401739411056042,
        -0.054352305829524994,
        0.014894272200763226,
        -0.0019219921668991446,
        -0.09844737499952316,
        0.025172170251607895,
        -0.0879296287894249,
        0.05121230334043503,
        0.06338506191968918,
        0.020697476342320442,
        0.05401027575135231,
        0.021159250289201736,
        0.023471295833587646,
        0.049364689737558365,
        0.008241946808993816,
        -0.07817726582288742,
        0.05071005970239639,
        0.024926582351326942,
        -0.027726994827389717,
        0.010249246843159199,
        -0.02269761636853218,
        -0.03545934706926346,
        0.0046271756291389465,
        -0.054327234625816345,
        -0.09818297624588013,
        0.050017405301332474,
        -0.006385918706655502,
        -0.07487545907497406,
        0.009450911544263363,
        -0.02429312840104103,
        -0.059999968856573105,
        0.01781087927520275,
        0.00804621260613203,
        -0.09088718891143799,
        -0.013813012279570103,
        0.011194721795618534,
        -0.10746249556541443,
        0.06262610852718353,
        -0.04199481010437012,
        0.07247571647167206,
        0.0291104968637228,
        -0.1384858787059784,
        -0.08059874922037125,
        0.01414197776466608,
        0.006434996146708727,
        -0.008922531269490719,
        -3.538017590784306e-33,
        -0.017213482409715652,
        -0.03289295732975006,
        0.013659486547112465,
        0.09137221425771713,
        -0.03608313947916031,
        -0.05054756626486778,
        0.026542777195572853,
        0.0496060773730278,
        0.014441641978919506,
        -0.09772332012653351,
        -0.04354427009820938,
        0.025697683915495872,
        -0.029830599203705788,
        -0.03883800655603409,
        -0.003684906056150794,
        -0.0176655575633049,
        0.009118331596255302,
        -0.06405725330114365,
        -0.03648163005709648,
        -0.024527693167328835,
        0.11044172942638397,
        -0.04726281017065048,
        -0.08139342814683914,
        0.061968844383955,
        0.01554053369909525,
        0.04080118238925934,
        0.02368958853185177,
        0.006367207039147615,
        -0.010986085049808025,
        -0.009946008212864399,
        0.0462794154882431,
        0.01291702687740326,
        0.012821270152926445,
        0.07005440443754196,
        0.0818202868103981,
        0.06769738346338272,
        0.06600595265626907,
        0.06876704096794128,
        -0.004913009703159332,
        -0.06445475667715073,
        -0.02338884212076664,
        -0.049308646470308304,
        -0.0635414645075798,
        -0.015647385269403458,
        0.010618369095027447,
        -0.014985382556915283,
        -0.015521800145506859,
        0.03413151204586029,
        0.02938670851290226,
        0.030733363702893257,
        0.008728972636163235,
        0.0018092526588588953,
        -0.03960520774126053,
        -0.015294205397367477,
        -0.08429179340600967,
        -0.0933535024523735,
        -0.01203232817351818,
        0.012895680963993073,
        0.03465311974287033,
        0.0645652785897255,
        0.10375343263149261,
        -0.06399587541818619,
        -0.026926249265670776,
        -0.07301156222820282,
        -0.03585464507341385,
        0.002665730193257332,
        0.10102205723524094,
        -0.017060711979866028,
        0.05775171145796776,
        -0.04188259318470955,
        -0.02594652585685253,
        -0.00011566789908101782,
        -0.034980833530426025,
        0.0004391587572172284,
        0.025247160345315933,
        0.050466082990169525,
        -0.012959776446223259,
        -0.03653861582279205,
        -0.007535184733569622,
        -0.015803368762135506,
        0.03085336461663246,
        0.01260728295892477,
        0.055612578988075256,
        0.03466828912496567,
        0.011390052735805511,
        0.08528836071491241,
        0.05982885882258415,
        0.007967962883412838,
        -0.030462251976132393,
        0.003733331337571144,
        0.022003836929798126,
        0.017022928223013878,
        -0.060123737901449203,
        0.005156433209776878,
        0.004872793797403574,
        -6.51806146834133e-08,
        0.03848031908273697,
        -0.012188410386443138,
        0.0003272274334449321,
        0.012405656278133392,
        0.11321816593408585,
        0.056286901235580444,
        -0.02906263992190361,
        -0.005623190198093653,
        0.04847561940550804,
        0.014918464235961437,
        0.011049089953303337,
        0.03785061836242676,
        -0.09161810576915741,
        0.04508856311440468,
        0.1376301348209381,
        0.11508684605360031,
        -0.0887676551938057,
        -0.016221197322010994,
        -0.015021317638456821,
        0.0644816979765892,
        0.043359700590372086,
        0.08620047569274902,
        -0.04117091745138168,
        -0.08180009573698044,
        -0.03408605605363846,
        -0.06660887598991394,
        -0.03209323063492775,
        0.002627105452120304,
        -0.025410111993551254,
        0.020147567614912987,
        0.06349239498376846,
        -0.05260709300637245,
        -0.0997948944568634,
        -0.042120229452848434,
        0.01814783364534378,
        -0.10335884988307953,
        0.015599291771650314,
        -0.018077801913022995,
        0.03624919429421425,
        -0.028285928070545197,
        -0.0194599237293005,
        -0.002102722181007266,
        0.011237594299018383,
        0.053982798010110855,
        -0.013499324209988117,
        -0.01728156767785549,
        -0.04505857080221176,
        0.01931588724255562,
        -0.06171255186200142,
        0.0020090853795409203,
        -0.02148984745144844,
        -0.01813013106584549,
        -0.07693682610988617,
        0.019314000383019447,
        0.0485805869102478,
        -0.039957839995622635,
        -0.013609559275209904,
        0.01615215465426445,
        -0.07286056131124496,
        -0.002631034469231963,
        0.08980191498994827,
        -0.017793457955121994,
        0.003992130514234304,
        0.028003977611660957
    ]
}