{
    "id": "y_5gqV_TQ04",
    "title": "Samsung Galaxy S21 and S21 Ultra Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-01-17T22:24:19Z",
    "video_url": "https://www.youtube.com/watch?v=y_5gqV_TQ04",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 582516,
    "likes": 20480,
    "comments_count": 1898,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we're unboxing the brand new Samsung Galaxy S21 phones. We have the Samsung Galaxy S21 Ultra 5G and the S21 5G. Samsung released three new phones this past week, and they also came out with these new SmartTags and the Galaxy Buds Pro. We have two of the three to check out. The other phone that they announced was the S21 Plus 5G. Which is basically just a little bit larger of a phone than the S21. Today's just gonna be a quick unboxing and then later on in the week, I'm gonna have a full review of both of these phones. Can you guys believe that it's 2021? Like I'm still kind of processing that. This is the first phone unboxing of the new year. Let's start with the S21. The one thing that you're gonna notice is there's not a charging brick in the box. If I roll my eyes any harder, they're gonna fall out of my head because do we remember not too long ago when everyone was like, oh my God! I can't believe Apple didn't put a charger in the box. We knew this was gonna happen, it's like not a surprise. So are you shocked? No, am I shocked? Absolutely not. The colors though, of these new Samsung devices are so freaking beautiful. (gasping) Oh my gosh, it's the purple. This is the Phantom Violet. I love that they're calling all of the colors the Phantom. The one thing that you're gonna notice on the camera bump is they did sort of like this integrated design. So they kinda took the entire camera bump and made it a part of the camera. So it's one very smooth, seamless design. So there's no kinda separation between the camera bump, it's like actually a part of the phone. This purple is nice. They also came out with a Phantom Black, Silver, and then there's a Gold and Red, and will take a few more weeks to come in. And then the S21 Ultra comes in a Phantom Black and the Phantom Silver. There's also a Phantom Titanium, Navy, and Brown that's made to order and ships in four to five weeks. The back is way less smudgy than previous phones. They kinda have like this hazy glass finish. So it's a really nice, really, really nice matte finish. I love this purple. Obviously, I love the color pink but I think that I actually, This is probably the phone that I would choose. Is there anything else in the box? Like a charging brick that is non-existent, which is fine. Well, there's no charging brick, you do have a very nice USB-C cable. Have you ever seen one of these? No, you haven't? First time? Welcome to the world of USB-C. Of course a SIM card ejector, very important. Hmm, T-Mobile. So this is the S21 and this has a 6.2 inch AMOLED Dynamic, 120 hertz display, that's 1300 nits of brightness. It has 8 gigs of RAM, 128 gigs or 256 gigs of storage. It has a triple camera set up on the back, it has the ultra wide and wide at 12 megapixels and a 64 megapixel telephoto, and the front camera is 10 megapixels. It has a 4,000 milliamp battery, a fingerprint scanner, and IP68 rating. Now, the S21 Plus is almost identical to the S21, but it does have a 6.7 inch display and a 4,800 milliamp battery so you are gonna be having a larger display and also longer battery life with the plus. Now, do we open up this S21 Ultra, baby? I have stuff all over this desk, I'm trying to be clean and it's not really working. I've already seen pictures and videos of this Phantom Black and I'm so excited about it. They made this huge deal about the Phantom Black, how they went through this crazy process, to try to make the perfect black and I'm hoping that in person, it's as good as it looks in photos. I'm so hyped, I'm so hyped to get ready for it. Oh yeah, oh yeah. This does not disappoint. So they weren't joking about how nice this camera bump actually is. It looks so good having it actually integrated into the camera so there isn't this big notch or cut out around the side and obviously, that's a little excessive. You can't really get away with that unless you made this entire back this thick and nobody wants that. So this has a 6.8 inch Dynamic QHD, 120 Hertz adaptive display with brightness up to 1500 nits. I have a field monitor that I use when I'm out shooting with my actual regular camera like this and that is a 1500 nits monitor, and it's really incredible because of the screen brightness. I'm actually able to see out in the brightness of a sunny day. So I love the fact that the screen brightness is pretty bright. So you have two different options, you have a 12 and 16 gig RAM option but if you decide to get the 12 gig model, you can get either 128 or 256 gigs of storage. But if you get a 16 gig model, you only have the option of getting 512 gigs of storage. So that is kind of give or take. If you want the 512, you're then gonna have to get the 16 gigs of RAM. What will I ever do with those four gigs extra of RAM? Maybe play X-Box games like maybe Halo. The front camera is 40 megapixels and it has a new quad camera set up here on the back. With this all new enhanced 108 megapixel sensor, you'll have a 12 megapixel ultra wide, 108 megapixel wide and these new dual telephotos zoom lenses that's 10 megapixels. Plus there's an additional laser auto-focus sensor. This is obviously gonna help so much with focusing and also doing portrait mode photos, very excited to test that out. With a 5,000 milliamp battery, you're obviously gonna get much better battery life over the and S20 and S21 Plus. And this is actually one of the first S devices that has S Pen support. Obviously, the Notes have the built-in pens, whereas this one does not. But, the fact that this has support for the S Pen or the S Pen Pro that they also showed in the unpacked event is pretty exciting because I love being able to use that. And now that's just one more added option and another reason to get the Ultra. As far as pricing is concerned, the S21 starts at 799, the S21 Plus 999 and the S21 Ultra is starting at 1,199. And I think all they got the ultra is gonna be able to shoot shoot 4K 60 frames on every single lens. Normally one of the things that's always kind of upsetting is they kind of lack on the front facing camera. So the fact that, yes, you are able to shoot 4K 60 on the facing and every other lens on this camera hyped about that. Of course, both of these phones shoot 8K video, which when we kind of just wrap our minds around that, phone's shooting 8K, you're also gonna be getting the 100X zoom. I'm sure you guys remember last year on the S20 when they were hyping up the 100X zoom. Yes, it's a novelty because let's be real, quality was not the best but they have done some things here in the S21 Ultra to improve that, using AI and additional stabilization. Some of the demos that I saw, it actually looked like it was improved. So that'll be something that we're gonna test out as soon as I take this out in the field. In the field, am I going in a field? Like, why do people say in the field ? Now that I'm saying it out loud and hearing myself say it, maybe I will go into field. You're also able to do these 8K video snaps, so if you are shooting an 8K, you can be able to get a 33 megapixel, basically a screenshot from that 8K video. They've also enhanced the single take. And they have this new Director View with a Vlogger View option, so you can be filming on the front and back camera at the same time, which we've talked about this before using various apps on the iPhone. So this is kind of exciting. I must say that I haven't really ever used it that much but the fact that this is something that you can do. I think there is a lot of cool implementation to be able to film both front and back. But also I feel like a lot of the times that I probably would have used this is when I was traveling. And this whole world shut down, I really just never really needed it. Also, we have the new Buds Pro, which these look really cool. They're talking about a cool feature, where you can do multi mic recording with the Buds Pro. So you're not only able to record the ambient sound but you're able to record your voice as well. So that's gonna be something that's kind of need. Take a little look at these. I would also love to know from you guys, like what would you like to see me do with these? Like, should I maybe go on like a little COVID safe road trip with it, in the field, do a little testing. Those look so good, look at that! Look at that! That's gonna match that Phantom Black. What else is in here? Oh, another cable. Just what we need. What's this? This is the smallest little box I've ever seen. Look at this, it's so small. Wow, it's so little, it's so cute. Oh, so many goodies. You guys, hyped for 2021 tech, I'm not gonna lie. And then the last thing that we have here is one of the Samsung SmartTags. I love things that can help me find my things. So this will connect to your phone... And I also love all of the integrations that they were talking about, also in unpacked with all of your smart home devices, being able to unlock your car with your phone. So I'm sure you guys have all seen tile trackers before. This is something very similar. Check that out. I was watching my sister's video and she dropped this on the floor that she couldn't find it. She's like, well, I can use my phone to find it because that's basically what you're supposed to do, find the tile, tracker, tag. I'm wondering if Apple was just waiting for Samsung to release theirs so that they can be like, \"Oh, here's ours.\" I have a feeling that's probably what they were doing, because those air tags have been rumored for so long. Like at this point, do we even want them anymore? Yeah, the answer is of course, yes we do. I'm gonna put this on something and then I'm gonna have Tyler or Jenna hide it from me and then I'm gonna go find it. Doesn't that sound like a 2021 version of hide and seek. Sounds fun to me. I also didn't turn on these two lights purposely because I knew we were doing like a Phantom Black color today, so I wanted it to be a little moody, okay! So here we go! This is kicking off the year, just right. We've got our as 21 Ultra and our S 21, I'm gonna set these up and prepare for my full review. Again, if there's anything that you guys would like to see me do with this, please leave in the comments below because I would love to integrate your comments into my actual review. And if you have any questions, also leave those. I'm not gonna lie, I'm getting kind of bored of the sort of same routine that I feel like I find myself in when I'm doing reviews. So I'd love to hear from you guys, like what do you wanna see? What would you like me to test? I think maybe it would be kind of fun to sort of bring your comments into the actual review video. I don't know, I wanna try some new things this year. I know last year was kind of interesting 'cause we really didn't have many options, like I couldn't really go anywhere, and we still really can't go anywhere or do anything. But I wanna find a nice safe way to take this out and test and not have to be around many people. I will see you guys in the comments. And now, oh God, I can't wait to freaking test this out. Oh, this looks so good. I'm hyped. I'll see you later. Bye. (bright upbeat music)",
    "transcript_keywords": [
        "Phantom Black",
        "Samsung Galaxy",
        "Phantom",
        "camera",
        "Ultra",
        "Galaxy Buds Pro",
        "kind",
        "phone",
        "Samsung",
        "Black",
        "love",
        "Galaxy",
        "Phantom Black color",
        "guys",
        "gigs",
        "Galaxy Buds",
        "Buds Pro",
        "camera bump",
        "phones",
        "Justine"
    ],
    "transcript_entity_values": [
        "12 megapixels",
        "Navy",
        "one",
        "S21",
        "USB-C",
        "108 megapixel",
        "T-Mobile",
        "16",
        "the S21 Ultra",
        "last year",
        "the Buds Pro",
        "Dynamic QHD",
        "Hertz",
        "Buds Pro",
        "AI",
        "Tyler",
        "the Phantom Black",
        "first",
        "4,000 milliamp",
        "S21 Plus 999",
        "Phantom Black",
        "512",
        "4",
        "1,199",
        "the year",
        "S21",
        "this past week",
        "the Phantom Violet",
        "RAM",
        "today",
        "the Galaxy Buds Pro",
        "1300",
        "Brown",
        "First",
        "120",
        "a few more weeks",
        "120 hertz",
        "21",
        "Justine",
        "799",
        "View",
        "iPhone",
        "three",
        "a sunny day",
        "6.8 inch",
        "Vlogger View",
        "the week",
        "Samsung",
        "the new year",
        "8",
        "four to five weeks",
        "12 megapixel",
        "6.2 inch",
        "this year",
        "128",
        "6.7 inch",
        "5,000 milliamp",
        "S Pen",
        "the S Pen",
        "SmartTags",
        "64 megapixel",
        "the S Pen Pro",
        "33 megapixel",
        "the S21 Plus",
        "108",
        "USB-C.",
        "Notes",
        "12",
        "Samsung Galaxy S21",
        "Halo",
        "Phantom",
        "10 megapixels",
        "2021",
        "Apple",
        "256",
        "Today",
        "40 megapixels",
        "four",
        "this Phantom Black",
        "Phantom Titanium",
        "two",
        "1500",
        "4,800 milliamp",
        "Jenna",
        "S20"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "EVENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PRODUCT"
    ],
    "vector": [
        -0.05174291506409645,
        -0.07913316786289215,
        -0.05589819326996803,
        -0.08509879559278488,
        0.011639581061899662,
        0.08146721869707108,
        -0.03394671157002449,
        0.01017955131828785,
        -0.03520095720887184,
        0.022214388474822044,
        0.04639250040054321,
        0.005286185536533594,
        0.059137117117643356,
        -0.011256408877670765,
        -0.008563783951103687,
        -0.031039945781230927,
        0.0023663281463086605,
        -0.03811640292406082,
        -0.012449447065591812,
        0.04027437046170235,
        0.0006243897369131446,
        0.013228905387222767,
        0.015896178781986237,
        0.02473919652402401,
        0.0384710356593132,
        0.021496905013918877,
        -0.015259785577654839,
        -0.023465173318982124,
        -0.03397311642765999,
        -0.06991357356309891,
        0.09357422590255737,
        0.051653239876031876,
        0.10047652572393417,
        0.0581088624894619,
        0.025700820609927177,
        -0.10618568956851959,
        0.019335031509399414,
        0.004824853502213955,
        -0.028519313782453537,
        -0.05065677687525749,
        -0.03714520484209061,
        -0.02217346616089344,
        -0.007917570881545544,
        -0.04863695055246353,
        -0.04565364122390747,
        -0.09057517349720001,
        -0.007878978736698627,
        -0.07547246664762497,
        0.015049946494400501,
        0.03490591049194336,
        0.014563300646841526,
        -0.0015342698898166418,
        0.0267952773720026,
        0.06445416808128357,
        -0.0450904555618763,
        0.024600766599178314,
        -0.05737801641225815,
        -0.01252141036093235,
        0.06075203791260719,
        -0.0817384347319603,
        0.05769046023488045,
        -0.06003117933869362,
        0.006166764069348574,
        0.01177005935460329,
        -0.036994483321905136,
        -0.044120095670223236,
        0.02983025275170803,
        0.00549969170242548,
        0.006634501274675131,
        -0.007330345921218395,
        -0.08569415658712387,
        0.02715495228767395,
        -0.036560315638780594,
        0.049927204847335815,
        -0.020329371094703674,
        0.05576055496931076,
        0.013009745627641678,
        -0.04660307615995407,
        -0.008118737488985062,
        0.06527537852525711,
        0.04655178263783455,
        -0.07159242779016495,
        -0.07815636694431305,
        0.0002586111659184098,
        0.029348598793148994,
        0.00408102897927165,
        -0.034755975008010864,
        0.05577912554144859,
        -0.027178432792425156,
        -0.0336228646337986,
        -0.051466215401887894,
        -0.004728180356323719,
        -0.01158227864652872,
        0.0161211509257555,
        -0.023213451728224754,
        -0.07425887882709503,
        -0.06800363212823868,
        -0.01572062447667122,
        -0.037823379039764404,
        0.029622483998537064,
        0.07146643102169037,
        -0.02194174751639366,
        0.004925879649817944,
        -0.051249872893095016,
        0.009048362262547016,
        -0.08864344656467438,
        -0.016477419063448906,
        0.020763104781508446,
        0.00426115607842803,
        0.050019681453704834,
        -0.021868376061320305,
        0.055310238152742386,
        -0.031274665147066116,
        0.0017100146505981684,
        -0.04413073509931564,
        0.12011509388685226,
        -0.017177805304527283,
        0.057346098124980927,
        -0.018244771286845207,
        -0.0005254693678580225,
        -0.027310686185956,
        -0.10103236138820648,
        -0.025801144540309906,
        -0.02057378739118576,
        -0.012786215171217918,
        0.05349482223391533,
        -0.05256174877285957,
        1.2955008629713225e-32,
        -0.0015193622093647718,
        0.046157218515872955,
        -0.050707921385765076,
        0.04859466478228569,
        0.010988413356244564,
        0.023563267663121223,
        0.0107553880661726,
        0.09254255145788193,
        0.016842389479279518,
        0.009231037460267544,
        -0.050341177731752396,
        0.07232183963060379,
        -0.06079896166920662,
        0.02416986972093582,
        -0.008317645639181137,
        -0.06845192611217499,
        0.010402517393231392,
        -0.08068037778139114,
        -0.05650408938527107,
        0.0016992425080388784,
        0.013141000643372536,
        0.028753843158483505,
        -0.009910931810736656,
        0.05335967242717743,
        0.11057577282190323,
        0.03236711025238037,
        0.07951131463050842,
        0.005513717420399189,
        0.08829902857542038,
        0.027529114857316017,
        -0.06581825762987137,
        -0.07626309990882874,
        0.027383185923099518,
        -0.03495503216981888,
        0.023163603618741035,
        0.0006375554949045181,
        -0.04636286571621895,
        0.004118525888770819,
        0.052899304777383804,
        0.008870861493051052,
        0.012675978243350983,
        -0.004191712476313114,
        -0.08625166863203049,
        -0.033638227730989456,
        0.08144672214984894,
        0.03108838200569153,
        0.03264119476079941,
        0.1131931021809578,
        -0.07287678122520447,
        0.011573469266295433,
        -0.011916937306523323,
        -0.01446749921888113,
        -0.07412397861480713,
        -0.0433967225253582,
        -0.031564194709062576,
        -0.06381280720233917,
        -0.0837123841047287,
        0.06413891166448593,
        -0.009237589314579964,
        0.06458306312561035,
        0.02413545735180378,
        -0.016251716762781143,
        -0.018812956288456917,
        0.005479335784912109,
        -0.00847670529037714,
        0.076035276055336,
        0.017598964273929596,
        -0.021442703902721405,
        -0.027605557814240456,
        0.043925583362579346,
        0.028336675837635994,
        -0.0005608514766208827,
        0.06553374230861664,
        -0.009709411300718784,
        0.045742880553007126,
        0.01872595213353634,
        -0.041887279599905014,
        -0.0374288484454155,
        0.042257387191057205,
        -0.04003340005874634,
        -0.08233442157506943,
        0.09819118678569794,
        -0.031357862055301666,
        0.08623979985713959,
        -0.03547627851366997,
        -0.08737500011920929,
        -0.017076080664992332,
        -0.033676717430353165,
        -0.052677303552627563,
        0.004088343121111393,
        0.010403375141322613,
        0.030482972040772438,
        -0.04107131436467171,
        -0.013327074237167835,
        -0.02355652116239071,
        -1.1515421840563449e-32,
        0.031149670481681824,
        0.046535197645425797,
        0.01428285799920559,
        -0.03757356479763985,
        0.08491688966751099,
        0.010595454834401608,
        0.08306503295898438,
        0.0995304137468338,
        0.04496616870164871,
        -0.09185966104269028,
        0.046078890562057495,
        -0.09361241012811661,
        -0.13400551676750183,
        -0.010680346749722958,
        -0.03269502893090248,
        -0.060774315148591995,
        -0.040255479514598846,
        -0.06303168833255768,
        0.0167921781539917,
        -0.005377878434956074,
        0.038062140345573425,
        0.1346399486064911,
        0.10225746035575867,
        0.06481339037418365,
        -0.031189551576972008,
        0.005201714113354683,
        0.024530217051506042,
        0.08329840004444122,
        0.04947918280959129,
        0.0796651691198349,
        0.055432192981243134,
        -0.05911853909492493,
        -0.0036760279908776283,
        -0.031152458861470222,
        -0.027627555653452873,
        0.050255224108695984,
        0.024335309863090515,
        0.05683952942490578,
        0.03845924511551857,
        -0.13883738219738007,
        0.021844709292054176,
        0.02921409346163273,
        -0.03126515448093414,
        0.021875880658626556,
        0.05028824880719185,
        -0.08509201556444168,
        -0.08815917372703552,
        -0.012698318809270859,
        0.027845140546560287,
        -0.06855832785367966,
        -0.08127249777317047,
        -0.04707886278629303,
        0.024459058418869972,
        0.01813781075179577,
        -0.011532620526850224,
        0.013467952609062195,
        -0.02338935248553753,
        -0.04575788229703903,
        0.03890491649508476,
        -0.014143027365207672,
        0.10621315985918045,
        -0.006098877638578415,
        -0.10012944787740707,
        -0.061066120862960815,
        0.007776238955557346,
        -0.11110098659992218,
        0.03985906392335892,
        0.004423520527780056,
        0.046646084636449814,
        0.017792008817195892,
        -0.011094547808170319,
        -0.00893790740519762,
        -0.014065910130739212,
        0.0008939568651840091,
        0.032197847962379456,
        0.05743131414055824,
        -0.12017106264829636,
        -0.03358010947704315,
        0.08461679518222809,
        -0.0903274267911911,
        -0.0398218110203743,
        0.024829668924212456,
        0.031178954988718033,
        0.08671489357948303,
        0.09155163168907166,
        0.048923663794994354,
        0.06544964760541916,
        -0.0564156174659729,
        -0.027478136122226715,
        0.05536089092493057,
        -0.06641962379217148,
        0.004549914039671421,
        0.06322703510522842,
        0.09928157180547714,
        -0.06804563105106354,
        -5.976493611115075e-08,
        0.07095398008823395,
        0.010574284940958023,
        -0.02375366911292076,
        0.0005369012942537665,
        0.003034303430467844,
        -0.08416330814361572,
        -0.019238527864217758,
        0.04333767294883728,
        0.10797238349914551,
        -0.0723419338464737,
        0.02751368284225464,
        -0.0541703887283802,
        -0.03831787034869194,
        0.05598553642630577,
        0.05048052594065666,
        0.03320657089352608,
        -0.046613551676273346,
        0.1101304367184639,
        -0.040323544293642044,
        -0.02019752934575081,
        -0.011615753173828125,
        0.09355303645133972,
        0.016100985929369926,
        -0.000507837045006454,
        0.04955637454986572,
        0.029186788946390152,
        0.006044561974704266,
        0.03704161196947098,
        0.07155519723892212,
        0.012470286339521408,
        -0.07394693046808243,
        -0.0862668827176094,
        -0.007231810595840216,
        0.04555094987154007,
        -0.06273370236158371,
        -0.041066236793994904,
        -0.019467556849122047,
        -0.059842299669981,
        0.08442305028438568,
        0.013651246204972267,
        0.04274929687380791,
        -0.07713797688484192,
        -0.03064790926873684,
        -0.01125867385417223,
        0.0028691976331174374,
        -0.11297007650136948,
        0.053914669901132584,
        -0.001118297572247684,
        -0.041245754808187485,
        0.04067399725317955,
        -0.03634108975529671,
        -0.01018483191728592,
        -0.022482844069600105,
        -0.06392183154821396,
        0.08252941071987152,
        -0.004468587692826986,
        0.03276906907558441,
        0.0422716848552227,
        -0.016467848792672157,
        0.03350186347961426,
        0.0617043636739254,
        0.03280895575881004,
        -0.10308685153722763,
        0.02337629161775112
    ]
}