{
    "id": "YBUqBk17tAI",
    "title": "This Cooler Makes No Sense - Fluix Tri-Swift",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-08-08T17:00:18Z",
    "video_url": "https://www.youtube.com/watch?v=YBUqBk17tAI",
    "category": "Science & Technology",
    "tags": [
        "Fluix",
        "Tri-Swift",
        "Water Cooling",
        "Liquid Cooling",
        "Custom Loop",
        "Soft Tube",
        "12900K",
        "Intel",
        "Core i-9",
        "CPU",
        "Cooling"
    ],
    "views": 1814550,
    "likes": 66367,
    "comments_count": 2066,
    "description": "Visit  and use offer code LTT for 10% off  Save 10% and Free Worldwide Shipping at Ridge Wallet by using offer code LINUS at   Turbulent blocks have been around for a while, but when the Tri-Swift from Fluix was claiming to be 25% better than the competition with pricing to match, we had to test it for ourselves against an EK Quantum Velocity on the same custom loop.  Discuss on the forum:   Buy an EKWB Pro CPU Quick Disconnect:   Buy an EKWB Quantum Velocity 2:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:10 A New Challenger 2:30 Marketing 3:20 Tynan Explanation 4:20 History 7:00 Results 9:15 The Storm V2 12:14 Conclusion 14:10 Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1448296-this-cooler-makes-no-sense/",
        "https://lmg.gg/SdOZC",
        "https://lmg.gg/DLHIO",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Intel's core I9-12900K in performance mode gets hot. Too hot to cool with a traditional heatsink. Too hot even for an all-in -one liquid cooler. Ugh, smells nasty. Surely our mighty custom loop can save the day. All right, so we're getting there. But what if we had three tubes instead of two? FLUIX is a newcomer in the custom water cooling space and claims that their Tri-Swift water block is the best on the market, surpassing the latest and greatest from well known brands like EK and Swiftech. Their approach? Divide the coolant to conquer the heat. According to Tynan in from our engineering department their theory does hold some water, but there's only one way to see if adding extra speed holes to your water block will make your CPU as fast as this to our sponsor. - Ridge Ridge wallet has redefined the traditional wallet with its compact frame and RFID blocking plates. The bulge in your pants, shouldn't be from your wallet. Use offer code Linus to save 10% and get free worldwide shipping today. - This is the quantum velocity squared water block from EK. It's one of the top performing blocks on the market and like our challenger, the FLUIX tri-swift it can cost a whopping 200 plus US dollars depending on options like material choice. That's just for the block, which means that to test these monsters, we first had to dig up all the other components of a quick custom water cooling loop. Then we grabbed our CPU frame from Thermal Grizzly cranked our Noctua fans and D5 pump to their max speeds and configured the classroom blender benchmark to a whopping 3000 path samples. With our CPU in the default power profile, our EK block here barely cracked 72 degrees once our loop preached thermal equilibrium. That's a tough mark to beat. It's significantly better than some of the air and all-in-one water coolers that we've looked at recently but FLUIX is going to have to do it because when you're spending this kind of money on cooling every fraction of the degree matters. And as I learned in my product management days, the demand for the second best custom water block is essentially zero. I don't think that's gonna be a problem though. Since FLUIX promises to win by a lot more than a fraction of a degree, I mean, look at this, two inlets instead of one. That's right, double the water flow to your-- wait, it's just a why splitter? (beep) We're back, sorry. They explained this better than I can. Here's the product description, emphasis mine. The FLUIX tri swift is the highest performance block on the planet. (sped up) Five millimeter micro-channels. Proprietary sinu-soidal pattern jet plate. Great turbulence mixing chamber. Something, something. This allows our tri-swift water block to lower CPU temperatures by eight to 10 degrees Celsius during intensive workloads compared to substitute water blocks. Here's the thing, guys. We don't really review water blocks anymore but these are some bold claims. Almost as bold as my claim; that you'll find all the best behind the scenes extras and exclusives over on floatplane.com. Like Alex making joystick condoms. Anywho, buried in that long winded marketing speil that you just endured are some actual grains of truth. Tynan is gonna fill you in. - They're basically saying that their twin inlets assisted by these wavy jet plates will increase their fluid turbulence, improving the thermal transfer between the copper fins and the water in your loop. It's a fundamentally sound theory because turbulent flow does help to prevent the formation of boundary layers. A boundary layer is a thin zone where the friction between the fluid and the solid slows down the flow causing the already warm fluid to kind of stick to the copper, slowing down thermal transfer. You can see this in action for yourself with a simple experiment. The room you're sitting in right now almost certainly contains weak air currents but you probably can't feel them. This is thanks to the natural friction between your body and the surrounding air that creates a zone of prewarm air next to your skin. A boundary layer. Simply wave your hand in the air like this, to disrupt this boundary layer. And you'll feel an immediate, though temporary, cooling effect. Neat, right? - Certainly. But what it isn't is new. FLUIX's first mistake was citing the deep water cooling magic to me, which I was there when it was written. First generation commercial water blocks from the early 2000s did suffer from lackluster performance for a number of reasons. First up, their simple ma style designs did almost nothing to increase surface area directly over the CPU die. And second, because most DIY water coolers were using low pressure, cheap aquarium pumps. They intentionally used very wide water channels to avoid restricting flow. That means that much of the water flow inside them was laminate rather than turbulent. That's bad 'cause you'll find substantial boundary layers, basically, well, everywhere in a Danger Den Maze three from 2002 but then something happened. Our water cooling Lord and savior, certified Xtreme Systems legend, Stew \"Cathar\" Forster, created the Little River Whitewater. It was the first commercial block that intentionally restricted the flow of water at the block inlet creating a jet of water that blasted the copper cold plate. Why did you do this? Turbulent flow. To say this it was a game changer would be an understatement. With a high pressure pump, the Whitewater and its successors, the Cascade and the Storm, would absolutely dominate the custom water cooling scene for the next few years. The Storm was super cool, but devilishly complicated to manufacture. The high volume version actually used a midplate with 35 micro jets that fired into machined cups to create a hyper turbulent zone directly above the CPU die. It left everything else in the dust and when truly stronger competitors finally emerged, nearly all of them leaned on the same fundamental design principles. Out competing the Storm only by increasing surface area directly over the CPU die, optimizing the shape of the cooling patch for the heat spreader designs of contemporary processors or by bow out the base for extra mounting pressure. These evolutionary changes yielded a grand total six degree improvement over the 10 year span that we tested back in 2016. Since then, skived copper bases, where they actually shaved the copper and bend it up to make the fins, have taken over for cast or machined micro pins. So while I haven't personally tested them I suspect that the top designs today like this one from EK are probably at least a couple degrees better than what we saw. That means then (chuckles) long story short, by my rough math, the total water block performance improvements from basically flat chunks of copper in 2002 to the skived copper bases we see today is in the neighborhood of 17 degrees. With all of that in mind FLUIX's patent pending fluid turbulence technology has a lot of work ahead of it to beat anything by eight to 16 degrees, as they claim, let alone, a modern block that, by the way definitely makes use of jet induced turbulence, like every other decent design on the market. So how's the performance? (fart noises) (laughing) This is bad, not just a little bit bad, like comically bad. Hey, future Linus is coming at you. FLUIX responded to our results and said that they have a new cold plate coming for 12th gen. It's possible, nay, probable, that this will improve performance. But the cold hard truth is that at least some of the things they're doing like accounting for the concavity of the IHS. They should have known, if they were serious about designing a high performance water block and they were up against a competitor that doesn't even use a skived copper base, not to mention that it looks amazing where FLUIX is at best hoping to get closer in performance and also looks like it came from AliExpress. There's not a huge market for ugly custom water cooling hardware, either. The truth is I, I don't, I just don't make the rules and that's what they had for sale. So that's what we reviewed. All right, back to the video. With our CPU in default mode, maximum package temperatures hit 85 degrees with the FLUIX block with an average of 82. That is over 10 degrees higher than our EK block. It pulled about 10 more Watts. Okay, so fair enough. But our average core clocks were actually slightly worse which would indicate to us that that higher power draw was likely due to higher thermals, not higher performance. Cranking things up with our 12900K in performance mode, letting it turbo to high heaven and pull nearly 300 Watts. Our EK block did manage to pull it off. I mean, it's hot at 97 degrees, but it didn't throttle. Meanwhile, the tri-swift throttled so quickly, we didn't even bother letting it complete the full 3000 sample render. Having not looked closely at this thing before green lighting this review these results are much worse than I expected. So bad, in fact that I actually-- damn it, where'd I put it? Dug up my old Storm V2 from the moth balls to test against it. The unit I have was manufactured under licensed by swift tech back in the mid 2000s and cost about 80 us dollars. It uses a pretty janky mounting adapter that Jake made by hand but meh. - I cut that with tin snips. We had very few tools back then. - Yes. At least one. Aye, (beep) roasted. You tried both. - [Jake] Yeah. - Oh, just for LOLs. - [Plouffe] I tried swapping it, in case I was doing something wrong. - [David] You're leaking, you're leaking. - Linus, it's leaking. - Oh, well that's not optimal. We have not pretested this. We have no idea what's going to happen. So whatever happens happens. Here we go. Bring on the Storm. Okay, it's not as good as it seems to be so far. It's set like 73, 74 on the package but the fluid hasn't heated up yet so we're gonna have to give it a little bit. We can't take these results as final just yet. You can see here, I held the fans to speed up the fluid heating up right here and we reached a maximum of 87. But since then it has actually settled back down to 83 to 85 degrees Celsius on the CPU package. We landed at 84 degrees. Now I wanna show you something. Here's a better look at the Storm. We've got our micro jet midplate. There's those finicky little bastards. And then we've got the cups on the bottom and you can see as I alluded to before, this is a really, really small cooling patch. Where there's actual turbulent flow. It was designed for direct die cooling on older CPUs that didn't have a heat spreader over top of the die. So the fact that this performs anywhere near the FLUIX tri-swift, which has a gigantic cooling patch and gets to take advantage of much much more modern machining techniques. It's kind of hilarious. Clearly there's more turbulence here than here. For comparison, I also took apart the quantum velocity squared and oh, that's interesting. This does not use skiving even though EK is not using skived fins, you can see they are much finer than the ones in the FLUIX tri-flow. Oh, and this is notable. (clears throat) There's this mid plate here. This slotted midplate that sits over top of the fence. Gee, I wonder what that does. So then by going FLUIX we not only get performance that's comparable to a design that was optimized for CPUs from 2005, we add complexity to our loop with more potential points for leakage thanks to the Y-splitter. Yay. It's ugly as hell. And yes, again with the price, it's a whopping 230 US dollars on sale. Even adjusted for inflation, it costs twice as much as the Storm with some budget left over for our awesome new swim trunks on LTT store.com. The only way that I can imagine FLUIX justifying their turbulent juice marketing nonsense is if they've only ever tested this thing using the anemic pump that they bundle with the AIO version. From talking to Tynan, it is possible that with an extremely weak pump their design may actually help to increase turbulence in the CPU block. But while I could test this thing, frankly I have spent enough of both my time and money evaluating this piece of junk. And the reality is that anyone spending this kind of moolah on a water block is gonna drop more than 40 bucks on their pump and they're gonna get a proper D5. So probably the only good thing that came out of this whole video is that it was an excuse for me to talk about water cooling again after so long. Maybe someday we'll see a wild new block design that nobody ever thought of and it'll be a quantum leap forward and performance but it is not this day. If you wanna get into custom loops we're gonna have everything we use linked down below. But for now we would probably recommend sticking with the tried and true EK block. It's much less expensive. Yeah, that's the, that's the real kicker. The $200 one I showed you guys before, that's with all the extra bells and whistles. It's like actually a lot cheaper. And while they're not manufactured in the USA at least they're made in a machine shop rather than in a shoe factory. And this segue was made in our segue factory. To our sponsor. - Squarespace. Need a website but don't have the know how? Squarespace makes it easy. There's a wide selection of award-winning templates all optimized for mobile. So it looks great on all devices. Create members only content for extra revenue using Squarespace's member areas. Grow and engage your audience with the powerful and easy to use email campaign system. And if you ever need additional help Squarespace also offers webinars, help guides and you can contact their 24/7 customer support via live chat and email. So get started today and head to squarespace.com/LTT to get 10% off your first purchase. - If you guys enjoyed this video make sure to check out our easiest water cooled PC video. We are well aware now of how much time it takes to do a proper custom loop. (clicks tongue)",
    "transcript_keywords": [
        "water block",
        "water",
        "custom water cooling",
        "block",
        "water cooling",
        "FLUIX",
        "TriSwift water block",
        "custom water",
        "CPU",
        "cooling",
        "performance water block",
        "water block performance",
        "custom water block",
        "performance",
        "degrees",
        "Storm",
        "CPU die",
        "water cooling loop",
        "custom",
        "FLUIX block"
    ],
    "transcript_entity_values": [
        "EK",
        "the mid 2000s",
        "one",
        "the 10 year span",
        "about 80 us dollars",
        "second",
        "D5",
        "Xtreme Systems",
        "At least one",
        "Jake",
        "first",
        "the next few years",
        "12th",
        "Swiftech",
        "17 degrees",
        "eight",
        "six degree",
        "IHS",
        "zero",
        "First",
        "LTT store.com",
        "3000",
        "10%",
        "200",
        "10 degrees",
        "today",
        "Ridge Ridge",
        "Alex",
        "the Little River Whitewater",
        "AliExpress",
        "85 degrees",
        "97 degrees",
        "Whitewater",
        "2005",
        "2002",
        "nearly 300",
        "Watts",
        "230 US dollars",
        "83",
        "the early 2000s",
        "your--",
        "Tynan",
        "D5",
        "73",
        "2016",
        "more than 40 bucks",
        "16 degrees",
        "72 degrees",
        "Cascade",
        "Thermal Grizzly",
        "three",
        "USA",
        "85 degrees Celsius",
        "CPU",
        "200 plus US dollars",
        "Squarespace",
        "RFID",
        "82",
        "FLUIX",
        "87",
        "35",
        "Five millimeter",
        "Linus",
        "the day",
        "74",
        "84 degrees",
        "this day",
        "prewarm air",
        "only one",
        "AIO",
        "two",
        "DIY",
        "Intel",
        "about 10",
        "Noctua",
        "10 degrees Celsius"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "QUANTITY",
        "DATE",
        "GPE",
        "PERSON",
        "LOC",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "DATE",
        "DATE",
        "CARDINAL",
        "LOC",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.09154713153839111,
        -0.04056287556886673,
        -0.019383395090699196,
        0.00902518630027771,
        0.009796452708542347,
        -0.02806217223405838,
        0.008097033947706223,
        -0.02215300314128399,
        0.041678428649902344,
        -0.033395856618881226,
        0.06418006122112274,
        -0.04153132811188698,
        -0.04777749627828598,
        -0.07607071101665497,
        0.0673445388674736,
        -0.04635194316506386,
        0.07600724697113037,
        -0.08031303435564041,
        -0.07201587408781052,
        -0.09473682194948196,
        -0.03175764158368111,
        -0.03464465215802193,
        -0.013086128979921341,
        0.0489618182182312,
        0.02458779886364937,
        -0.024330036714673042,
        -0.01642139069736004,
        -0.018009910359978676,
        0.05725150555372238,
        -0.07313670963048935,
        0.07296903431415558,
        0.04147236794233322,
        -0.08147784322500229,
        -0.03291529044508934,
        0.03871674835681915,
        -0.0380512997508049,
        -0.009410819970071316,
        -0.06877061724662781,
        -0.05348498374223709,
        0.025454184040427208,
        -0.02269582636654377,
        -0.02027484029531479,
        0.024740684777498245,
        -0.03682838752865791,
        0.0150044159963727,
        0.06145882606506348,
        -0.004555229563266039,
        -0.0404832661151886,
        -0.001499866833910346,
        0.00518655963242054,
        -0.024059897288680077,
        -0.08025171607732773,
        0.04122207313776016,
        -0.01734103448688984,
        0.015970565378665924,
        0.09588416665792465,
        0.017195677384734154,
        -0.02009597234427929,
        0.02795656956732273,
        -0.037978749722242355,
        0.04725971817970276,
        -0.042740289121866226,
        -0.01588865928351879,
        0.06319823116064072,
        0.0395822636783123,
        0.009621934033930302,
        -0.06301458925008774,
        0.04215157404541969,
        -0.004060608800500631,
        -0.0008384866523556411,
        0.06790974736213684,
        -0.05050356686115265,
        0.04853610321879387,
        0.07660554349422455,
        0.05695781856775284,
        -0.003864710219204426,
        0.03707215189933777,
        -0.037850942462682724,
        0.014988234266638756,
        0.0331578254699707,
        0.019735198467969894,
        -0.0742979422211647,
        0.003320840420201421,
        -0.06664041429758072,
        0.029365696012973785,
        -0.042470112442970276,
        0.11314454674720764,
        -0.03333370387554169,
        -0.031516481190919876,
        -0.10948624461889267,
        0.06449264287948608,
        0.04120079055428505,
        0.12491816282272339,
        -0.00920108798891306,
        0.02814396284520626,
        0.10597982257604599,
        -0.04034844785928726,
        0.013657881878316402,
        -0.04052159562706947,
        0.001489112270064652,
        0.04176457226276398,
        0.029430963099002838,
        -0.05256189778447151,
        0.09442797303199768,
        -0.02542622573673725,
        -0.05953679606318474,
        0.03751834109425545,
        0.01383468508720398,
        0.008505641482770443,
        0.0005603016470558941,
        -0.0347830131649971,
        0.05612768232822418,
        -0.0047374204732477665,
        -0.02782643586397171,
        -0.003894724417477846,
        0.006890700664371252,
        -0.06618256121873856,
        0.06513156741857529,
        0.05304047837853432,
        0.042712077498435974,
        -0.03138484060764313,
        0.01409848127514124,
        -0.01689297705888748,
        0.1013290211558342,
        0.001676624990068376,
        0.03969138115644455,
        -0.028304653242230415,
        9.656304974696036e-34,
        -0.016288738697767258,
        0.02441634051501751,
        -0.07189997285604477,
        -0.05539495125412941,
        0.02941710874438286,
        -0.048053331673145294,
        -0.00018372316844761372,
        -0.08612941950559616,
        -0.016357801854610443,
        0.011021001264452934,
        -0.03859022259712219,
        0.02942030131816864,
        -0.08658662438392639,
        0.058760516345500946,
        -0.010810524225234985,
        -0.10157489776611328,
        -0.06485879421234131,
        -0.0355013832449913,
        0.017652906477451324,
        0.01941542513668537,
        0.05490279197692871,
        -0.08473511785268784,
        -0.06570068001747131,
        0.038638077676296234,
        0.011903134174644947,
        -0.0037623881362378597,
        0.0631774365901947,
        0.03452889993786812,
        0.0065117510966956615,
        0.05489381030201912,
        -0.04597246274352074,
        -0.04680695757269859,
        -0.020184826105833054,
        -0.06910191476345062,
        -0.031579624861478806,
        0.009492726996541023,
        -0.04452652484178543,
        -0.00509831216186285,
        -0.002910037524998188,
        0.035636771470308304,
        -0.009949062950909138,
        0.04075920209288597,
        -0.11038965731859207,
        -0.03819727152585983,
        -0.0643029659986496,
        0.005792820826172829,
        0.04627034068107605,
        0.020153889432549477,
        0.013617811724543571,
        -0.015527578070759773,
        -0.036976296454668045,
        -0.0469292551279068,
        -0.0865258127450943,
        -0.005062855780124664,
        0.06380823999643326,
        -0.022008413448929787,
        0.07275377959012985,
        -0.05259840562939644,
        0.039240512996912,
        0.08505383133888245,
        -0.03640143945813179,
        -0.0007791443495079875,
        0.0036931911017745733,
        -0.05024804174900055,
        -0.05183200165629387,
        0.10969412326812744,
        0.042105644941329956,
        -0.051907286047935486,
        -0.09476076811552048,
        -0.03957681730389595,
        -0.05001946538686752,
        0.057276029139757156,
        0.01877632923424244,
        -0.061396703124046326,
        0.07723867148160934,
        -0.049073025584220886,
        -0.05878856033086777,
        -0.05460203438997269,
        -0.04656659811735153,
        -0.051365096122026443,
        -0.033071063458919525,
        0.009566943161189556,
        0.03526362404227257,
        0.06998085975646973,
        0.026635099202394485,
        -0.12265969067811966,
        -0.03479020670056343,
        0.009937038645148277,
        -0.031060347333550453,
        0.024675054475665092,
        -0.01595432311296463,
        0.012036084197461605,
        0.06886573135852814,
        0.0010324687464162707,
        -0.07566867023706436,
        -1.1577523758130367e-33,
        -0.018628833815455437,
        0.009567879140377045,
        -0.03591768443584442,
        0.07214415073394775,
        0.04419076070189476,
        0.013762343674898148,
        0.09809258580207825,
        0.026069454848766327,
        0.06976667046546936,
        -0.015641961246728897,
        -0.01591688208281994,
        -0.004449835978448391,
        -0.09879303723573685,
        -0.03405182063579559,
        0.04062527418136597,
        -0.04883451387286186,
        0.009644534438848495,
        -0.07493443042039871,
        0.04655734449625015,
        -0.018878407776355743,
        0.0680285170674324,
        -0.08871887624263763,
        0.023953117430210114,
        0.009496143087744713,
        -0.0068026441149413586,
        0.06976798176765442,
        0.03966173902153969,
        0.028027165681123734,
        0.011257481761276722,
        -0.045684169977903366,
        -0.0086933309212327,
        -0.027996663004159927,
        -0.014004961587488651,
        -0.004636671859771013,
        -0.020165320485830307,
        0.004011309240013361,
        0.0869583785533905,
        0.09119199961423874,
        -0.022934740409255028,
        -0.10596825182437897,
        -0.007135101594030857,
        0.026029353961348534,
        0.037683289498090744,
        -0.06116211414337158,
        0.0015732233878225088,
        0.0509243942797184,
        -0.0158913042396307,
        -0.04596755653619766,
        0.0017511742189526558,
        -0.011025471612811089,
        -0.005075204651802778,
        -0.07351124286651611,
        0.07106072455644608,
        0.14265048503875732,
        -0.07031047344207764,
        0.024551669135689735,
        0.005533773452043533,
        0.041847050189971924,
        -0.028350550681352615,
        -0.024589283391833305,
        0.08644966781139374,
        -0.04429684206843376,
        0.023434268310666084,
        -0.005767129361629486,
        0.05905957892537117,
        -0.052111878991127014,
        -0.021787036210298538,
        0.01147851999849081,
        -0.0385291688144207,
        0.07538606226444244,
        0.028653617948293686,
        -0.008803652599453926,
        -0.002442298922687769,
        -0.07815931737422943,
        -0.06737010180950165,
        0.04963609203696251,
        0.011865491047501564,
        -0.022280484437942505,
        0.07948309183120728,
        -0.0005356870242394507,
        -0.07808510214090347,
        0.10987965762615204,
        0.013502290472388268,
        -0.034863751381635666,
        0.05044823884963989,
        -0.000756345980335027,
        0.022862257435917854,
        -0.040793031454086304,
        0.06172705441713333,
        0.005929464474320412,
        -0.033634502440690994,
        -0.031279996037483215,
        0.035568900406360626,
        0.0050016287714242935,
        0.02776981331408024,
        -5.534723968025901e-08,
        -0.020716765895485878,
        -0.038390688598155975,
        -0.055328596383333206,
        0.09269502758979797,
        0.035355329513549805,
        -0.043315012007951736,
        -0.010682369582355022,
        0.00025717445532791317,
        0.07921071350574493,
        -0.008561619557440281,
        0.07491052895784378,
        -0.012452417984604836,
        -0.05213173106312752,
        0.05646585673093796,
        0.01697261817753315,
        -0.010893885977566242,
        -0.07116089016199112,
        0.019846994429826736,
        0.03542102873325348,
        -0.08355564624071121,
        0.012432577088475227,
        0.07674920558929443,
        0.022236701101064682,
        -0.027719376608729362,
        -0.022713519632816315,
        0.12238365411758423,
        0.07580611109733582,
        0.03734414279460907,
        0.13787487149238586,
        -0.0885026603937149,
        -0.12929724156856537,
        -0.0022640761453658342,
        -0.0012826467864215374,
        0.008518570102751255,
        -0.015205560252070427,
        -0.04918929189443588,
        -0.09340695291757584,
        0.11128083616495132,
        0.06793078780174255,
        0.08762449771165848,
        0.005009038839489222,
        0.02908657304942608,
        -0.013285882771015167,
        0.01812698505818844,
        0.07770226895809174,
        -0.03563602268695831,
        -0.02982049062848091,
        -0.032521214336156845,
        0.005913619417697191,
        0.08919859677553177,
        -0.0011647363426163793,
        -0.027549946680665016,
        -0.033017534762620926,
        0.058434292674064636,
        0.0042833732441067696,
        -0.03483692556619644,
        -0.06360937654972076,
        -0.04068338871002197,
        -0.06514289230108261,
        0.0581086240708828,
        -0.012682035565376282,
        -0.1409357190132141,
        -0.04900066927075386,
        0.09295867383480072
    ]
}