{
    "id": "Yc7zYx_WRpU",
    "title": "Gold Apple Watch Series 4 - Unboxing and review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-09-19T13:35:52Z",
    "video_url": "https://www.youtube.com/watch?v=Yc7zYx_WRpU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "apple watch",
        "series 4",
        "unboxing",
        "gold apple watch",
        "running",
        "walkie talkie",
        "watch OS 5"
    ],
    "views": 4984356,
    "likes": 67460,
    "comments_count": 6405,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we are unboxing the brand new Apple Watch. I'm trying to contain my excitement because this thing is so beautiful. This is the 40 millimeter gold version. I've even got my gold knife ready to unbox. Got a few Apple Watch Bands as well. I don't even need my knife, it has a little pull tab. Well, I've got the knife out so we're gonna use it. Oops. What's this? Wow. Look at that! Whoa, what an experience! Oh gosh, how can I do it again? It was so cool! I just, it was like this! It just opened up. It's like hello! Look how cool this looks. So here's the front of the box. Okay let's open it up. We've got our paperwork, we've got our charging brick, Apple Watch charger, and the Apple Watch itself. Right inside, look at this little teeny tiny case that it comes in. Oh wow! (soft music) (gasps) This is probably the coolest thing ever. What a cute, little protector! Matches the 10s, so perfectly. So they have the Apple Watch Band separately. Beautiful gold. It's kind of like a rosy, brass-ish color because when I think of gold I think of this knife color. So here they are next to each other, the ceramic version. It is kind of sad that they're not making the ceramic Apple Watches anymore. These have been so adorable and really, really great. I just love the look of it, but this, wow. Let's take a quick little time travel back to some of the previous versions of the Apple Watch. The first Apple Watch that I got was this one, it's the 38 millimeter. This is the aluminum one. (playful music) It looks just like it looks in the store! (playful music) And from there they announced the stainless steel, so I thought, hmm, I should probably get a bigger one. That makes sense. Wow and it's so big! It's freaking real big! At the time I was thinking yo this 38 real tiny, well now I'm thinking holy crap 42. Then they announced that they had a rose gold, so of course I got that one in the 42 millimeter, and this poor little thing. It definitely took a fall, but that's okay. I guess it's okay, now I just keep it as a memento. (gasps) Oh god, it looks good. This is rose gold, this is pink. So after that the Series 2 came out. This is the ceramic, of course I thought, hey 42, definitely really enjoying this large watch face. Oh wow, the white looks so fresh, so freaking fresh. And then when the Series 3 came out, I got two different sizes. I got the 42 which I planned on keeping, and then I also got the 38 just to test out. I think I might like the 38. I can't go back to a 38. Do you know why? I have invested a lot into Apple Watch Bands, and they're all for a 42. Well it turns out that I ended up really liking the 38 much better. See here it is. So this is my current watch. This is the 38 with cellular. And now here we are with the brand new Series 4. There's a bunch of new differences in this one. So the back of the new Apple Watches is a combination of ceramic, and the sapphire crystal. They now moved the microphone next to the digital crown. And over here is the speakers, and they actually made the speakers 50% louder. One of the reasons that I love my Apple Watch so much is obviously I can get notifications, but the health benefits for this thing is really what I use it most for. I also like knowing now that if my heart rate happens to elevate or drop too low, my Apple Watch will let me know. That rhymes. I should be a poet. It'll also be able to tell irregular heartbeats and now with the new ECG, you'll be able to get a very clear reading on your heart, just by holding here for 30 seconds, when you're inside the ECG app. (gasps) It's starting up! So this is my old phone, I haven't actually entirely set up this one yet, so I'm just gonna sync it for the time being. I love that it asks you which wrist that you're wearing it on, left or the right. Most people do wear watches on their left hand, but because I write with my left hand I wear it on the right. I'm also weird, I like to wear the digital crown on the left. More on the health benefits. You can now track in watchOS 5 hiking and yoga. I'm about to actually head to a yoga class right now so I'm gonna test this out. One of the biggest differences is the sizes. So they now come in a 40 millimeter and a 44 millimeter, so previously it was 38 and 42. But the crazy thing is the actual overall size when you're looking at it or you have it on your wrist, it doesn't feel much larger. But because they extended the screen all the way to the edges and they've even rounded the corners, it makes the screen feel like I'm watching a freaking IMAX movie. This is the new 40 millimeter version and this is Jenna's old 38 millimeter. The actual watch itself is thinner, and the screen size now is the same size as the 42 millimeter which was the previous biggest version. Let's check out some of these new Apple Watch Bands. It says 40 millimeters now, but the good news is that all of the previous watch bands that you have are still compatible with the new one. Oh it's a hibiscus Sport Loop. I love the Hibiscus Refresher from Starbucks. Hibiscus Refresher! Oh yeah, color me freaking impressed! The thing that I've been worried about, it's not even that big of a concern, is because the gold, I'm very particular about color combinations. Oh, okay. That's actually not bad. The nice salmon, oh I love these. I've just been getting into the Sport Loop. For whatever reason I kind of avoid getting them but they're so, okay this looks great. I'm in love with this color combination. These are basically like my two favorite colors, like a salmon pink and a rose gold. This is a lavender band. I'm not sure how the lavender and gold will look. That's the one thing I did like about the white. I feel like everything matched it. Oh hello, the lavender and the gold look good, too! The Milanese Loop will be reserved for fancy functions. Oh wow that looks really good. I'm surprised, I mean I don't know why I'm surprised. Okay so now that my Apple Watch is all set up, I'm gonna go find my sister and we are going to continue testing this thing out. I still have to show you guys all the new watch faces. Before that, I'm going to go take a yoga class right now and see how that, whoa the haptic feedback feels so cool! I'm so not used to that. (bouncy music) So it's a little echoey in here but we are now in the yoga studio and I'm gonna be testing out the new Apple Watch. Some of my most favorite features in watchOS 5, is that you can track hiking and yoga. I've said this so many times, but it's my favorite watchOS 5 update. So that isn't something that is exclusive to the new watches, if you guys update your watch OS you will also have access to these as well. So you can see here when you go into the workout section, there's yoga, strength training, other. So now let's test out the yoga, and get some cool B-roll of me acting like I'm actually doing a yoga class right now. I'm not, I did one earlier today. (serene music) So that was my fake little yoga workout. We're gonna end it, and this gives you your total time, your active calories, and your average heartbeat. All of my friends who are friends with me on my Apple Watch in the Health app, they'll get a notification that I just completed my goal. Which was, really bad. I hope that they don't see that one, 'cause it was only seven minutes of yoga. - [Jenna] Look that's you, you did a little yoga! - There is another thing where you can challenge your friends. Should I send a competition notice to Marques and Johnathon? This digital crown is now an electrical heart sensor, so that allows you to take an ECG reading of your heart. This was just recently FDA cleared, so it's not available yet, but it will be available in a software update coming very soon. (upbeat music) So, I'm not a runner, but if you are, there are some new running features that you guys might be into. So you can choose your target pace, and then your watch will alert you if you're ahead or behind of that pace. Also new is when you raise your wrist, it'll tell you how many steps per minute that you have. So let's give this a quick test and see, see how good I am at running, which I'm not. Ready? (gasps) (laughs) I wasn't ready. (electronic music) (sighs) Okay, let's end this. I ran for five minute, 53 seconds .38 miles, 29 calories, average pace 15 23, wow, I'm not winning any awards with that one. 121 steps per minute, average heart rate 128, weather, 76 degrees, it's very nice, we should go outside. - [Jenna] (singing) If you're basic and you know it clap your hands. (claps twice) - So we're now outside and we're gonna test out the hike. I can't really say that this is a very extensive hike but at least we'll be able to see the elevation features. Let's go, it is so beautiful. (cheerful music) So we finished our hike, it was probably, well it wasn't very long, but I got the prompt to end my workout. Because one of the newest features is if you forget to stop your workout it'll say hey, finish your workout? We hiked for 14 minutes, total distance .26 miles, I burned 18 calories, look at that. Let's tell all my friends. You went hiking for the first time with the workout app. Dismiss, I hope everyone is so proud of my workout. Now, I wanna send a competition request to Marques. I'm inviting MKBHD to a seven-day competition, invite. He has 48 hours to accept. What if he doesn't accept my competition? (drone buzzing) I hear a drone. (scaly music) They announced the Walkie-Talkie feature in watchOS 5 at WWDC and since then, I have been patiently awaiting, so here we are. Talk with friends, Apple Watch to Apple Watch. Contacts you add can talk to you whenever you're set to available. I'm inviting my friend Dakota. See who else I can add. You don't have watchOS 5 yet. Going to invite Johnathon, MKBHD, invited Ed. Oh my god! I think, oi! (watch beeping) Hello, am I doing this right? (watch beeping) - [Marques] I think, it's working. - Oh my gosh! (watch beeps) I'm freaking out, I'm filming right now and I just got this, oh my gosh this is an authentic reaction. (watch beeps) - [Marques] I never wanted to Walkie-Talkie before, but the watch kinda makes it better. - (watch beeps) This is so cool. (watch beeps) Can you say, can you talk back to me or is that it? Hey, hey. - [Jenna] You have to hit the button. - Yeah but I'm waiting for a response back. (gasps) (laughs loudly) Did you get my competition request? I hope you're ready (watch beeps) - [Marques] I did, and I fully expect to win, but we'll see. - It has to be super real time because as I was talking, he basically responded two seconds later. - [Jenna] And he's what, across the country? - I'm so excited about Walkie-Talkie! It's such a simple feature. Am I overreacting? No I'm excited! Let's go finish filming this video. (laughs) This is gonna take me 500 hours to edit. Now all you have to do if you wanna activate Siri is just raise it. Text Jenna Ezarik and tell her that she's doing a really great job filming this video for me, and I appreciate her, she is nice, and the best sister ever, exclamation point. - [Siri] Okay, I'll send this. - Did you get it? - [Jenna] Yeah! - Wow, I can't wait for you to get Walkie-Talkie. We're gonna be having so much fun. Matty I wish you had Walkie-Talkie. Do you remember when you were a baby and I put an Apple Watch on you for size comparison? The Apple Watch is also now 50% louder, so you'll be able to hear Siri, you'll be able to hear phone calls better. Actually, let me test it out. Call Ed Palumbo. - [Siri] Calling Ed Palumbo. - It's really loud! - [Voicemail Recording] Forwarded to an automatic voice. - Okay how about you set the camera (phone ringing) Oh, Ed's calling me back! I declined it. I pushed the wrong button. I pushed the wrong button. Hi, sorry, I'm making a video and I went to answer it but I don't ever use, like making phone calls very often so I hit the wrong button instead of answer. (laughs) - [Ed] (laughs) - And I hung up on you. - [Ed] (mumbles) that's why I didn't answer at first. - How do I sound? Do I sound good? - [Ed] Is this a video? - This is a video, I'm talking to you from my Apple Watch. - [Ed] Oh, no way! (mumbles) I can't tell. - Really? Hold on, the dog just stole some chap stick. Oh gosh, oh no. Matty, come here. Hey, chap stick boy. - [Ed] (mumbles) - So it sounds good? It sounds good? - [Ed] Yeah. - Cool. - [Ed] I, If you didn't tell me I never would have known. - Ed said bye. - [Ed] Matty, Matty you want a treat? Matty you want a treat? - He's looking around, he's confused. (laughs) So I've been trying out the Apple Watch now for a few days and I've been having so much fun with it. I would say that my favorite thing is how incredible the screen size is. So this is now the smallest version of the Apple Watch that they have. I'm enjoying some of the new activity sharing features. I've got a competition now going on with my sister Jenna and Marques. The Walkie-Talkie is so cool, I think it's probably one of my new favorite features. And I'm excited to test that out with some more of my friends, who I'm waiting for them to accept my requests. Well thank you guys so much for watching, hope you guys enjoyed this, let me know if there's any other things that you would like me to test out on the Apple Watch, or any other videos that you'd like to see me make here. Whether it's Apple related or not, I am always down to read your suggestions and take them. So I'll see you later. (electronic music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Bands",
        "Watch",
        "Apple",
        "Watch Bands",
        "Apple Watch charger",
        "Apple Watches",
        "yoga",
        "gold",
        "thing",
        "Wow",
        "millimeter",
        "previous watch bands",
        "test",
        "good",
        "ceramic Apple Watches",
        "cool",
        "workout",
        "Watch Band separately",
        "features"
    ],
    "transcript_entity_values": [
        "500 hours",
        "53 seconds .38 miles",
        "Matty",
        "One",
        "WWDC",
        "one",
        "a 40 millimeter",
        "IMAX",
        "only seven minutes",
        "the Apple Watch",
        "The Milanese Loop",
        "121",
        "the Apple Watch Band",
        "2",
        "two seconds later",
        "Johnathon",
        "40 millimeter",
        "14 minutes",
        "Sport Loop",
        "Apple",
        "Walkie-Talkie",
        "the Hibiscus Refresher",
        "29",
        "seven-day",
        "Siri",
        "38",
        "38",
        "4",
        "ECG",
        "Dakota",
        "30 seconds",
        "48 hours",
        "5",
        "MKBHD",
        "76 degrees",
        "Marques",
        "18",
        "Ed Palumbo",
        "Siri",
        "Starbucks",
        "3",
        "40 millimeters",
        "the 42 millimeter",
        "10s",
        "ECG",
        "Ed",
        "two",
        "38 millimeter",
        "Jenna",
        "128",
        "Jenna Ezarik",
        "The Apple Watch",
        "The Walkie-Talkie",
        "Apple Watches",
        "FDA",
        "42",
        "50%",
        "42",
        "Health",
        "a few days",
        "first",
        "Walkie-Talkie",
        "Apple Watch",
        "five minute",
        "15 23",
        ".26 miles",
        "Apple Watch Bands",
        "a 44 millimeter",
        "42 millimeter",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "TIME",
        "TIME",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "LOC",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.01919151283800602,
        -0.07977060973644257,
        -0.024997884407639503,
        -0.07684392482042313,
        0.02075747586786747,
        0.07039729505777359,
        0.05180386081337929,
        -0.007066871039569378,
        -0.019160736352205276,
        0.04357018694281578,
        -0.010377557948231697,
        0.023082200437784195,
        -0.034077830612659454,
        -0.00666073290631175,
        -0.015968382358551025,
        0.033549848943948746,
        0.04897674173116684,
        -0.04563620686531067,
        0.005857848096638918,
        0.0520184300839901,
        -0.0013638760428875685,
        -0.10343892127275467,
        0.03417574241757393,
        0.028589928522706032,
        -0.01900787651538849,
        0.09115193784236908,
        0.012725482694804668,
        0.030656801536679268,
        -0.09617801010608673,
        -0.07077467441558838,
        -0.039735838770866394,
        0.0037802071310579777,
        0.1032157763838768,
        0.0076826480217278,
        -0.006598925217986107,
        -0.04010758176445961,
        0.04594928026199341,
        0.016642803326249123,
        -0.06812481582164764,
        -0.03892402723431587,
        0.007980996742844582,
        0.00041303556645289063,
        0.007937172427773476,
        0.013302893377840519,
        -0.056711822748184204,
        -0.058933548629283905,
        0.007653858978301287,
        -0.057579685002565384,
        0.0471036359667778,
        0.05535203963518143,
        -0.03975636139512062,
        -0.013165554963052273,
        0.055362436920404434,
        0.04068278893828392,
        -0.03286704421043396,
        -0.025060588493943214,
        -0.1027742475271225,
        -0.020689336583018303,
        0.05235655605792999,
        -0.07712801545858383,
        0.0517987422645092,
        -0.04543462023139,
        -0.03344624117016792,
        0.02537834830582142,
        -0.04808449745178223,
        -0.022459032014012337,
        -0.006604564376175404,
        0.03332800790667534,
        0.018440397456288338,
        0.00023684672487434,
        -0.0944809541106224,
        0.05924917384982109,
        -0.015748614445328712,
        0.02571243606507778,
        -0.0029640512075275183,
        0.07835445553064346,
        0.03323967009782791,
        -0.09952723979949951,
        0.007748486939817667,
        0.05309825390577316,
        0.0006953871343284845,
        -0.045456334948539734,
        -0.06480318307876587,
        0.004009010270237923,
        0.0328979417681694,
        0.013639029115438461,
        0.006833961233496666,
        -0.00616644648835063,
        -0.05862409248948097,
        -0.07373427599668503,
        -0.045081887394189835,
        0.01648842915892601,
        0.016885381191968918,
        0.0028172419406473637,
        0.018688956275582314,
        -0.04330110177397728,
        -0.03692585602402687,
        -0.01894102618098259,
        -0.030800431966781616,
        0.05188131704926491,
        0.08300565928220749,
        -0.040444135665893555,
        0.007944532670080662,
        -0.0458642840385437,
        0.002714618109166622,
        -0.13460472226142883,
        -0.05699874460697174,
        0.047424815595149994,
        0.015802331268787384,
        0.06977029889822006,
        -0.04287682846188545,
        0.02568504400551319,
        -0.07257445901632309,
        -0.01212779525667429,
        -0.016655776649713516,
        0.13397900760173798,
        -0.07536748051643372,
        0.08223763853311539,
        0.029409488663077354,
        0.03418374061584473,
        0.031763311475515366,
        -0.06019752100110054,
        -0.005491227842867374,
        0.04814717918634415,
        0.023929398506879807,
        0.0038275953847914934,
        -0.048847466707229614,
        1.2120797023133111e-32,
        -0.051552511751651764,
        0.03014552593231201,
        -0.009795131161808968,
        0.05221687629818916,
        0.019539423286914825,
        -0.04602932557463646,
        -0.005439605563879013,
        0.0930510088801384,
        0.015019237995147705,
        0.07572319358587265,
        -0.004783949349075556,
        0.07404141128063202,
        -0.05476296320557594,
        0.03069566749036312,
        0.03176037222146988,
        -0.06765197962522507,
        0.013583649881184101,
        -0.05773160234093666,
        -0.03574340045452118,
        -0.004212746396660805,
        -0.020728807896375656,
        0.002714316826313734,
        -0.010117190890014172,
        0.07639363408088684,
        0.040043655782938004,
        0.09039030224084854,
        0.034509655088186264,
        0.0016326085897162557,
        0.09106597304344177,
        0.02043956145644188,
        -0.0445210337638855,
        -0.07403039187192917,
        -0.003690332407131791,
        -0.0834304466843605,
        0.001123299589380622,
        0.0039739301428198814,
        -0.07166977971792221,
        0.017645765095949173,
        -0.0091408621519804,
        -0.006806333549320698,
        -0.028678838163614273,
        -0.025332970544695854,
        -0.059259895235300064,
        -0.08122080564498901,
        0.10583600401878357,
        0.01090798806399107,
        0.03293333575129509,
        0.08102712780237198,
        -0.037244513630867004,
        0.012079603970050812,
        -0.009266656823456287,
        -0.02175460010766983,
        -0.035805996507406235,
        -0.024658583104610443,
        -0.034676965326070786,
        -0.05092828348278999,
        -0.026305267587304115,
        0.035209301859140396,
        0.03242909535765648,
        0.0481831356883049,
        0.015823617577552795,
        -0.003636545967310667,
        -0.023969076573848724,
        -0.0025616134516894817,
        -0.06730646640062332,
        0.11433152109384537,
        0.051828645169734955,
        -0.05602006986737251,
        -0.038497406989336014,
        0.08127565681934357,
        0.009751373901963234,
        0.027239346876740456,
        0.04705817997455597,
        0.023720985278487206,
        0.03221077844500542,
        0.04679371416568756,
        -0.060144711285829544,
        -0.029358474537730217,
        0.019467756152153015,
        -0.030439618974924088,
        -0.0892992839217186,
        0.10220219194889069,
        0.01159083191305399,
        0.1308474987745285,
        -0.05349016189575195,
        -0.037534117698669434,
        0.012498092837631702,
        -0.021235084161162376,
        -0.03624821826815605,
        0.013370526023209095,
        0.027378298342227936,
        0.06431039422750473,
        -0.081337109208107,
        -0.056145455688238144,
        -0.052153315395116806,
        -1.1982733742261095e-32,
        0.043395623564720154,
        0.011359665542840958,
        0.023886164650321007,
        -0.04547916352748871,
        0.06904547661542892,
        0.01433023251593113,
        0.009978735819458961,
        0.1154681146144867,
        0.07513654977083206,
        -0.04912905395030975,
        0.06086895987391472,
        -0.09863609820604324,
        -0.12362764775753021,
        0.04702449217438698,
        -0.039403509348630905,
        -0.009373720735311508,
        -0.04257369413971901,
        -0.03634369745850563,
        0.025814617052674294,
        -0.030036574229598045,
        0.10446101427078247,
        0.12344778329133987,
        0.09519223123788834,
        0.002049283590167761,
        0.02016804926097393,
        -0.023695532232522964,
        0.04236835986375809,
        0.07218055427074432,
        0.047210242599248886,
        0.05749144032597542,
        -0.00777892442420125,
        -0.052661675959825516,
        0.009109621867537498,
        0.003677953267470002,
        0.004506003577262163,
        0.036449726670980453,
        0.039670754224061966,
        0.04824196174740791,
        -0.009997554123401642,
        -0.042175378650426865,
        0.0398482084274292,
        0.020767850801348686,
        -0.0010363433975726366,
        0.0019377655116841197,
        0.04600158706307411,
        -0.08523217588663101,
        -0.07819902896881104,
        0.10577817261219025,
        0.016497552394866943,
        0.00016138586215674877,
        -0.09329257905483246,
        -0.07073858380317688,
        -0.03925008699297905,
        -0.029480550438165665,
        -0.07241467386484146,
        0.040435854345560074,
        -0.04853767529129982,
        -0.014733962714672089,
        0.03160180523991585,
        0.011900931596755981,
        0.014437449164688587,
        -0.03589390963315964,
        -0.04909949377179146,
        -0.06848541647195816,
        0.0007688107434660196,
        -0.07124311476945877,
        0.06280340999364853,
        0.019484302029013634,
        -0.027056146413087845,
        0.0007004864746704698,
        -0.027440497651696205,
        0.009371159598231316,
        -0.0019486775854602456,
        -0.027493003755807877,
        0.053558170795440674,
        0.00309960194863379,
        -0.08596666157245636,
        -0.01337355375289917,
        0.04638791084289551,
        -0.046240437775850296,
        -0.054644014686346054,
        0.030422981828451157,
        0.05763125419616699,
        0.06368645280599594,
        0.09984616935253143,
        0.0980839654803276,
        0.10387544333934784,
        -0.020548488944768906,
        -0.03587982431054115,
        0.0697539895772934,
        -0.00037087572854943573,
        0.026157375425100327,
        0.07889623939990997,
        0.103901706635952,
        -0.10898709297180176,
        -6.079173431317031e-08,
        0.029238926246762276,
        0.03231131657958031,
        -0.03566144406795502,
        -0.05262310057878494,
        -0.009269357658922672,
        -0.0767207220196724,
        -0.07168202847242355,
        0.01886213757097721,
        0.06418164074420929,
        -0.046399060636758804,
        0.08115420490503311,
        -0.04061209410429001,
        -0.10517391562461853,
        0.09621792286634445,
        -0.008101270534098148,
        0.004669472109526396,
        -0.07760942727327347,
        0.09320782124996185,
        -0.04159269481897354,
        -0.048273853957653046,
        -0.014668679796159267,
        0.06241917610168457,
        0.042994339019060135,
        -0.0029956495855003595,
        0.034801073372364044,
        0.022837722674012184,
        -0.023493323475122452,
        -0.012725810520350933,
        0.03055446408689022,
        0.011563740670681,
        -0.05358453094959259,
        0.02699551358819008,
        0.0047675385139882565,
        -0.03020675852894783,
        -0.09530073404312134,
        -0.07245746999979019,
        -0.048504628241062164,
        -0.02657381258904934,
        0.01474999450147152,
        0.030380651354789734,
        0.035780277103185654,
        -0.12233596295118332,
        -0.07625294476747513,
        -0.001867519342340529,
        0.011357573792338371,
        -0.10000854730606079,
        0.03742731735110283,
        -0.08332356065511703,
        -0.030448460951447487,
        -0.03551255166530609,
        -0.03181824833154678,
        0.028751328587532043,
        0.020712995901703835,
        -0.0445789135992527,
        0.07188736647367477,
        -0.002661518519744277,
        0.04033724591135979,
        0.008143951185047626,
        -0.03759954869747162,
        0.0015245449030771852,
        0.0616314522922039,
        -0.016781223937869072,
        -0.0699983760714531,
        0.033585552126169205
    ]
}