{
    "id": "YcoqR9fTgFA",
    "title": "This ring is being used to detect COVID-19. It can't.",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-07-31T13:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=YcoqR9fTgFA",
    "category": "Science & Technology",
    "tags": [
        "oura",
        "oura ring",
        "oura smart ring",
        "smart ring",
        "NBA oura",
        "nba smart ring",
        "NBA",
        "NBA ring",
        "smart tech",
        "covid ring",
        "oura tech",
        "NBA tech",
        "covid 19 tech",
        "covid tech",
        "wearable",
        "tech wearable",
        "wearable tech",
        "NBA games",
        "NBA season",
        "NBA athletes",
        "NBA game",
        "players",
        "covid 19",
        "covid",
        "coronavirus",
        "pandemic",
        "sports",
        "athletes",
        "wnba",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 86941,
    "likes": 2010,
    "comments_count": 131,
    "description": "The NBA bought 2,000 Oura smart rings from wearable company Oura Health as part of its COVID-19 prevention plan. The league wants to use the rings to flag any athlete who might be getting sick. However, there isnt any evidence that wearables can predict illness.   Learn more:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Buy the Oura ring:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/2XhXzgS",
        "http://bit.ly/2TQsqjB",
        "https://ouraring.com/product/heritage-silver",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- There are very few things about me that are similar to an NBA player. For one I'm 5'4\", but today I have at least one thing in common with a professional basketball player. I'm wearing this Smart Ring. The NBA has bought 2000 of these rings, which are made by Oura Health, as part of their COVID-19 safety plan. The league offered them to players in the anti COVID-19 bubble at Disney world, where they'll finish the rest of the season. Inside the bubble, the NBA is using the rings to predict if someone might be developing symptoms of an illness, like COVID-19. The problem is, there's no proof that predicting any disease, including COVID-19, via wearables is possible, yet. - [James] We simply don't know enough right now. - [Nicole] That's James Gilmore, a wearable technologies researcher at Clemson university. - [James] A lot of the reporting that's happening around the NBA's decision risks inflating this wearable ring into this sort of mystical object, that anybody can buy, and anybody can use to, you know, see if they're gonna have COVID-19 or not, which is not the case, based on the understanding that we have today. - The Oura Ring monitors things like heart rate, steps, body temperature, and sleep. The theory is that subtle changes in those measures can detect illness before you even feel sick. NBA players who choose to use the ring, will have their data shipped off to researchers at the University of Michigan. Those scientists will produce an illness probability score for each player. If they think the data indicates that someone could be sick, they'll be flagged for additional COVID-19 testing. - [James] The NBA's also said that they're gonna be testing people pretty much every day, which to me, makes me ask, so what's the point of the Oura Ring, except for just kind of running an experiment. - The idea that wearable technology could predict illness has been floating around for years. It isn't new with COVID-19. For a while now, researchers have been working with devices like Fitbits, and Apple watches. There are anecdotal stories about people who see changes in their wearable data just before they start to feel sick. And previous research found that there are certain patterns in that data that tend to appear before people with Lyme disease start showing symptoms. Oura started looking into illness prediction after seeing a Facebook post from a user. Oura's CEO, Harpreet Rai told me how it all played out. - [Harpreet] He happened to be traveling the week before, and he opens his app up, and it says, Hey, your readiness score is 54, and it looks like you're actually getting a temperature. He then starts to think like, wow, I've never gotten a score that low, and he didn't even feel any symptoms. He describes himself as asymptomatic. He's like, you know what? I was traveling. I was in Austria, and it looks like there was one COVID case there. Now I'm gonna get tested, and he ended up being positive. - So, the company pivoted to disease prediction. Two ongoing studies at the University of California, San Francisco, and at West Virginia University, are checking to see if data from the ring, along with symptom surveys, and AI models can actually predict that someone is getting sick, in general. They'll also see if it can predict COVID-19 specifically, but the NBA placed an order for the rings before there were any published studies proving that they worked, which isn't surprising to experts. This isn't the first time a pro sports league has turned to an unproven wearable tech solution. Athletes and pro sports leagues have previously turned to devices that are big on flash, but fuzzier on substance before. A quick tech fix is appealing, but it's especially appealing to elite athletes. We're always striving for a sliver of competitive edge. (high intensity techno music) Back in 2016, a device called the halo sport was popular with NFL players and other athletes. It sends a stimulating current into the motor cortex of the wearer's brain. After wearing it for 20 minutes during your warmup, it claims to help people build physical skills and develop muscle memory more quickly. So it would make training a physical skill, like throwing a football, more efficient. Some athletes felt like it helped them. And there's some studies, mostly in mice, showing that this type of electrical stimulation of the brain can prime it for learning. It's a plausible theory, but it hadn't been proven by the time the NFL started using the halo device. Another wearable device called the Whoop, is also used by dozens of pro athletes. Like an Oura Ring, it monitors things like heart rate, and sleep, and says it's algorithms can help people optimize their workouts and their recovery. It claims that wearers have fewer injuries, and a lower resting heart rate. There hasn't been much independent evaluation to say if using the Whoop actually does help people improve their performance, but that didn't stop the NFL Players Association from naming it an official recovery wearable. Tech like this is appealing, because it offers easy solutions to complex problems. If strapping on a wearable can tell you how much sleep you need to get, to get the most out of your workout the next day, that sounds pretty good. At the highest level of sport, the difference between the best and the worst athlete can come down to millimeters. Everyone is interested in trying anything they can to chip away at those gaps. For the past decade, people have increasingly relied on science and data to push performance forward. - [James] We seem to be increasingly interested in athletes' data. And this is something that is true of their performance during the game. It's true of the coaches and trainers who are developing those athletes. It's true of how the athletes internalize themselves. They kind of become a testing ground for devices that can measure different elements of athlete data to try and improve their performance. - But there are risks when that data comes from unproven products. In a 2016 paper, sports scientists warned that wearables that aren't fully validated could cause anxiety for athletes. They might push out data that isn't quite accurate, and people may make changes based on those numbers. There are also privacy issues at stake. Pro athletes definitely don't want information on their physical health being used in contract negotiations against them. - [James] When the Players' Association formed, they actually created a wearables committee that was designed for the players to work on developing protocols in a way that would help the players learn from the devices while sort of shielding that data from being gobbled up by the organization. - To be clear, the NBA has protections in place around the ring data. Coaches can't see it. When a league like the NBA uses something like the Oura Ring, it boosts the credibility of the products before we actually have the research to know if that's warranted. The Oura team knows this is still experimental. The product wasn't designed to be an illness prediction tool, but during the pandemic, anything that can pivot to COVID-19 will, and that ups the stakes. - [James] The tricky issue here is because Oura has entered into sort of this COVID-19 sort of solutionism framework, it runs the risk of people buying it, thinking that it's going to tell them when they are experiencing COVID-19 related symptoms, but I don't think that it can do that right out of the box. - Oura isn't explicitly making any claims about the device's ability to predict anything. They're more suggesting it's a possibility, based on what they've seen so far, but the case of the Oura user who saw a change in their data before they tested positive is just a story. It takes a lot more evidence to prove that something is actually predicting an illness. Wearable advocates argue though, that getting more information about your body is good. People might still be able to see a relationship between their own personal stats, and when they start to feel ill. But really, this is all just one big experiment. Sports leagues like to experiment, and experiments are good. They help give us important critical information, but they also come with risks. When we filmed this video, there weren't any major outbreaks inside the NBA bubbles. So I guess sticking a bunch of people in a hotel and testing them every day, actually works. Thanks for watching, and be sure to follow the rest of our coronavirus coverage at theverge.com.",
    "transcript_keywords": [
        "Oura Ring",
        "NBA",
        "Oura",
        "Ring",
        "data",
        "people",
        "wearable",
        "Athletes",
        "players",
        "Oura Ring monitors",
        "illness",
        "NBA player",
        "Smart Ring",
        "NFL players",
        "rings",
        "university",
        "NFL Players Association",
        "ring data",
        "NBA bubbles",
        "wearable ring"
    ],
    "transcript_entity_values": [
        "Oura Health",
        "this Smart Ring",
        "one",
        "Apple",
        "the next day",
        "54",
        "Whoop",
        "the week before",
        "COVID-19",
        "AI",
        "today",
        "2000",
        "COVID-19",
        "West Virginia University",
        "NBA",
        "Disney",
        "Austria",
        "Oura",
        "solutionism framework",
        "COVID-19",
        "Clemson university",
        "dozens",
        "Lyme",
        "years",
        "the past decade",
        "the NFL Players Association",
        "Harpreet Rai",
        "the Oura Ring",
        "Oura Ring",
        "2016",
        "at least one",
        "the Players' Association",
        "the University of Michigan",
        "Oura",
        "20 minutes",
        "Two",
        "Facebook",
        "NFL",
        "first",
        "James",
        "every day",
        "James Gilmore",
        "the University of California, San Francisco"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "LOC",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG"
    ],
    "vector": [
        0.01647164113819599,
        0.05824919417500496,
        -0.07318306714296341,
        -0.073713518679142,
        0.06424123793840408,
        -0.011734583415091038,
        0.11941372603178024,
        0.03616927191615105,
        0.0602889247238636,
        0.011582869105041027,
        -0.018512969836592674,
        0.03757386654615402,
        0.028901562094688416,
        0.024134250357747078,
        0.01102038286626339,
        -0.011482604779303074,
        0.07202240079641342,
        0.0038488248828798532,
        -0.07775254547595978,
        -0.01828041858971119,
        -0.003995521459728479,
        0.02177530713379383,
        0.012291391380131245,
        0.05937579646706581,
        -0.13642676174640656,
        0.004918824415653944,
        0.002106042578816414,
        0.02040773257613182,
        -0.14216768741607666,
        0.023980895057320595,
        -0.0240315031260252,
        0.04534847289323807,
        -0.025241095572710037,
        0.029058195650577545,
        -0.09411033242940903,
        -0.07304457575082779,
        -0.09253466129302979,
        0.08607476949691772,
        -0.07894780486822128,
        -0.055085454136133194,
        0.04264112561941147,
        -0.052806880325078964,
        0.06728719174861908,
        0.03450079634785652,
        -0.014149379916489124,
        0.04878649488091469,
        -0.11066531389951706,
        0.04627811163663864,
        0.020124461501836777,
        0.022516770288348198,
        -0.02896749973297119,
        0.01815871335566044,
        0.08331645280122757,
        -0.008154698647558689,
        0.10919339209794998,
        0.07759325206279755,
        -0.05202101543545723,
        -0.06286446750164032,
        0.013670914806425571,
        0.021252812817692757,
        0.0860937088727951,
        -0.055082596838474274,
        -0.006963522173464298,
        0.016748694702982903,
        -0.05204298347234726,
        0.026952657848596573,
        0.025463053956627846,
        -0.007538017351180315,
        -0.008564135991036892,
        -0.047172341495752335,
        0.05004066228866577,
        0.015649715438485146,
        -0.1016218289732933,
        -0.0033849701285362244,
        0.05837883800268173,
        0.1180729866027832,
        -0.001368435681797564,
        -0.07072848081588745,
        0.034122250974178314,
        0.015870630741119385,
        0.007720739580690861,
        -0.04210939630866051,
        0.16759128868579865,
        -0.003265825565904379,
        -0.01760461926460266,
        0.038053855299949646,
        -0.008039888925850391,
        -0.014408277347683907,
        -0.04273522272706032,
        0.023152368143200874,
        -0.0011413180036470294,
        -0.03769734874367714,
        -0.019737785682082176,
        -0.028477173298597336,
        0.04391526058316231,
        0.045189522206783295,
        -0.07097697257995605,
        -0.10059479624032974,
        -0.0880652517080307,
        0.05244472622871399,
        -0.018468527123332024,
        -0.09141543507575989,
        0.026027776300907135,
        0.027244703844189644,
        0.025597915053367615,
        -0.02645072154700756,
        0.01873817853629589,
        0.019088881090283394,
        0.048135094344615936,
        0.07670245319604874,
        -0.03688865900039673,
        0.06886808574199677,
        0.03169908747076988,
        -0.004811790771782398,
        -0.004377610981464386,
        0.08964959532022476,
        -0.03208358213305473,
        0.10241266340017319,
        0.07753577828407288,
        0.009844637475907803,
        0.06093212589621544,
        0.018410280346870422,
        -0.02691960148513317,
        -0.006311623379588127,
        0.049205854535102844,
        0.04098092392086983,
        -0.018230529502034187,
        1.94926681332892e-33,
        0.01837690733373165,
        0.044963665306568146,
        0.1101875901222229,
        -0.013007649220526218,
        -0.0426003560423851,
        -0.02189582586288452,
        -0.012296540662646294,
        -0.04327068477869034,
        0.04994776472449303,
        -0.0564933605492115,
        -0.007109805475920439,
        0.05329476296901703,
        0.0060678874142467976,
        0.02617313340306282,
        0.058352548629045486,
        0.013071786612272263,
        -0.00914128590375185,
        -0.04329515993595123,
        -0.10062883049249649,
        0.04230618104338646,
        0.00497021246701479,
        -0.06868649274110794,
        0.021133380010724068,
        0.0815882459282875,
        -0.06279278546571732,
        0.02276880480349064,
        -0.04766356945037842,
        -0.007419032510370016,
        0.05765755847096443,
        0.01773434318602085,
        -0.06873602420091629,
        0.07053222507238388,
        0.018592994660139084,
        -0.004189334809780121,
        0.025731243193149567,
        0.0435054637491703,
        -0.036119766533374786,
        0.027931783348321915,
        -0.0075253816321492195,
        -0.010227757506072521,
        0.09583426266908646,
        -0.051766443997621536,
        -0.03102867864072323,
        -0.06030072644352913,
        -0.018114564940333366,
        -0.012878181412816048,
        -0.02657284401357174,
        -0.03088759444653988,
        -0.15491360425949097,
        0.03043338656425476,
        0.04975935444235802,
        0.04799510911107063,
        -0.017956167459487915,
        -0.07990704476833344,
        -0.05097748339176178,
        -0.021209459751844406,
        -0.023288041353225708,
        -0.06902588158845901,
        0.05108574777841568,
        -0.06286843866109848,
        0.04649573937058449,
        -0.006304251495748758,
        -0.02305685169994831,
        0.044384267181158066,
        -0.07964900881052017,
        0.0038803310599178076,
        0.013247763738036156,
        -0.05060428008437157,
        -0.01704268716275692,
        0.019247839227318764,
        0.08718003332614899,
        0.06613806635141373,
        -0.04573427513241768,
        0.06904221326112747,
        -0.039506714791059494,
        -0.027966495603322983,
        -0.01278091873973608,
        0.060206089168787,
        -0.013775426894426346,
        -0.014799468219280243,
        0.02500695176422596,
        -0.002203186973929405,
        0.053313590586185455,
        -0.006241518538445234,
        -0.02859489805996418,
        -0.06420821696519852,
        -0.06334947049617767,
        0.0068336245603859425,
        -0.03057652898132801,
        -0.01325399149209261,
        0.011311505921185017,
        0.03689190745353699,
        -0.022236155346035957,
        0.07913339883089066,
        -0.07647658884525299,
        -4.252532281040033e-33,
        -0.05467233806848526,
        -0.07338747382164001,
        0.08641922473907471,
        -0.01502465084195137,
        0.0924765095114708,
        -0.03595536947250366,
        0.05759022384881973,
        0.020882515236735344,
        0.03408939391374588,
        -0.027159199118614197,
        -0.0040098801255226135,
        -0.026581620797514915,
        -0.09563764929771423,
        -0.0189659483730793,
        0.1127953976392746,
        -0.04659681022167206,
        0.019173122942447662,
        0.03728816285729408,
        -0.04200325161218643,
        0.03398272022604942,
        0.07728205621242523,
        0.023355748504400253,
        -0.04581841826438904,
        0.017297422513365746,
        -0.09452296048402786,
        0.019605733454227448,
        0.024076491594314575,
        -0.04392324760556221,
        -0.028955701738595963,
        -0.01516174990683794,
        -0.07363120466470718,
        0.04554304853081703,
        0.0004703426093328744,
        0.06734393537044525,
        -0.0296526700258255,
        0.007477765902876854,
        -0.004034843761473894,
        -0.06983954459428787,
        -0.02680906653404236,
        -0.06889129430055618,
        0.012934572994709015,
        0.048465993255376816,
        -0.04887109994888306,
        -0.017061224207282066,
        0.04012877866625786,
        -0.00658935122191906,
        0.1019701436161995,
        -0.0018109527882188559,
        -0.0046972669661045074,
        -0.012547099031507969,
        0.006991427857428789,
        0.026777783408761024,
        -0.03287763521075249,
        0.026567233726382256,
        -0.10691910237073898,
        -0.002603179542347789,
        -0.025404172018170357,
        -0.08680213242769241,
        -0.016667038202285767,
        -0.0035976124927401543,
        -0.025705015286803246,
        -0.014879180118441582,
        -0.08877041190862656,
        -0.046993620693683624,
        0.009813226759433746,
        0.07357105612754822,
        0.07385118305683136,
        -0.006100522819906473,
        -0.004142546560615301,
        -0.047218721359968185,
        0.003765815170481801,
        0.018647562712430954,
        -0.027829496189951897,
        -0.0661381408572197,
        -0.02751993015408516,
        -0.032495807856321335,
        -0.05259595066308975,
        0.11206516623497009,
        -0.0071334862150251865,
        -0.006796929985284805,
        -0.015302090905606747,
        -0.06999311596155167,
        0.04553470388054848,
        -0.03191087394952774,
        0.12826281785964966,
        -0.03817741200327873,
        0.03654918819665909,
        -0.035146359354257584,
        -0.12221541255712509,
        0.07382860779762268,
        -0.05817243829369545,
        0.009807330556213856,
        -0.05646343156695366,
        0.025585809722542763,
        0.05601707100868225,
        -4.8986034784093135e-08,
        0.061611562967300415,
        0.02077089250087738,
        -0.019686121493577957,
        -0.01098186057060957,
        -0.019447794184088707,
        0.039466194808483124,
        0.021291444078087807,
        -0.0029212110675871372,
        0.09257234632968903,
        -0.04349379241466522,
        -0.001441765925846994,
        -0.0035511148162186146,
        -0.018006430938839912,
        -0.013659920543432236,
        0.028529375791549683,
        0.09114336222410202,
        -0.12457587569952011,
        0.0065353624522686005,
        -0.05983598530292511,
        0.048581816256046295,
        -0.005188378505408764,
        -0.009837612509727478,
        0.013443991541862488,
        -0.0024923309683799744,
        -0.040306296199560165,
        -0.011043954640626907,
        -0.025950239971280098,
        0.02689141221344471,
        0.0074776653200387955,
        0.007941835559904575,
        -0.030658109113574028,
        -0.05246425420045853,
        -0.0072286794893443584,
        -0.01979265734553337,
        -0.04574831202626228,
        -0.07024159282445908,
        0.11126358807086945,
        -0.057881955057382584,
        0.09454570710659027,
        0.0314052440226078,
        -0.02240121178328991,
        -0.06105538085103035,
        -0.09147358685731888,
        0.03269222006201744,
        0.060164015740156174,
        -0.07923893630504608,
        -0.0033183761406689882,
        -0.051705460995435715,
        -0.089166060090065,
        0.008282801136374474,
        -0.0329047366976738,
        0.017800603061914444,
        0.024049166589975357,
        0.02087966911494732,
        0.00046468907385133207,
        0.02818036638200283,
        0.06670307368040085,
        0.029369086027145386,
        -0.05539186671376228,
        -0.016595544293522835,
        -0.010459676384925842,
        -0.05668250843882561,
        -0.03033560886979103,
        0.04319234937429428
    ]
}