{
    "id": "ydiPWpehYIE",
    "title": "Did I find my new GAMING mouse? - Glorious Model D-",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-09-21T21:32:32Z",
    "video_url": "https://www.youtube.com/watch?v=ydiPWpehYIE",
    "category": "Science & Technology",
    "tags": [
        "PC",
        "Gaming",
        "FPS",
        "Game",
        "Pixart",
        "Sensor",
        "RGB",
        "USB",
        "Wired",
        "Wireless",
        "Light",
        "Best",
        "David",
        "Unboxing",
        "Razer",
        "Logitech",
        "G Pro Wireless",
        "Model D-"
    ],
    "views": 321607,
    "likes": 14941,
    "comments_count": 1856,
    "description": "Start your 30-day free trial of Audible today at   The Glorious PC Gaming Race peripherals have been making waves for over a year now as they are affordable and high-performing compared to the established brands like Logitech, Corsair, and Razer. They made the D- model, and is it good enough to make David switch to a wired mouse?   Check out PCGR D- Gaming Mouse at   Buy PCGR Glorious Model O Mouse On Amazon (Paid Link):   On NewEgg (Paid Link):   Buy Razer Ultimate Viper Mouse On Amazon (Paid Link):    On NewEgg (Paid Link):  On BestBuy (Paid Link):   Buy Logitech G Pro Wireless Mouse On Amazon (Paid Link):     On Best Buy (Paid Link):   On BHPhoto (Paid Link):      On NewEgg (Paid Link):    Buy Logitech G403 Wireless Mouse On Amazon (Paid Link):     On Best Buy (Paid Link):   On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://amzn.to/312VFmo",
        "https://lmg.gg/kbeBU",
        "https://geni.us/WGTITYE",
        "https://geni.us/Jci6",
        "https://geni.us/fX2I",
        "https://geni.us/wFPZFEl",
        "https://geni.us/gVpibd",
        "https://geni.us/00hEZr",
        "https://shop-links.co/1725432050424677290",
        "https://geni.us/vHCB",
        "https://geni.us/8KLbq2z",
        "https://geni.us/CngUR1s",
        "https://shop-links.co/1725432051446392830",
        "https://geni.us/XCqCmLF",
        "https://geni.us/wneUlDL",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Is the Model D Minus an A-plus or an F? Let's talk about that. Roll the intro. Oh, we don't... (upbeat rock music) ShortCircuit ShortCircuit Let's unbox tech, let's unbox tech Okay, let's unbox it. For those in the know, Glorious PC Gaming Race is a fairly new company and they started making desk pads and mice pads, moved to keyboards, and now they're making mice. They've had good success making wired, really light mice. They have the Model O, the Model D, the distinction: the Model O is ambidextrous, the Model D is a right-handed mouse. This is the D Minus, so that's right-handed, smaller, and I'm very excited. This is a highly anticipated mouse, and what's special is that it's a reasonable price. For the matte version it's 49.99; and for the glossy version, which I really wouldn't want, I don't want glossy things, it's $59, so $10 more. That's a just a good value for a good gaming mouse. It's definitely intended for more of a shooter crowd. There's the six buttons on the mouse. That's it. It's 58 grams, I believe. Lemme check. So this mouse is 61 grams and the larger one is 7 grams more at 68. The glossy one's a gram heavier, but like I said, I don't want glossy, so I'm gonna base this off of the matte one. They sent us a black one and a white one, and I will use both of these during the course of the review for the different kinds of glide pads that they include, which is pretty exciting. So in the box there's the mouse. We have some documentation. A letter from Shazim Mohammad, the CEO of Glorious. I'm really glad they took out the Master Race out of PC Glorious Gaming Race, for obvious reasons. Ooh, and includes a lotta stickers, which is pretty cool. Here's the bigger glide pads I was mentioning. I'm gonna take those out to save them, 'cause we're gonna try both. Ooh. It's like, Zeus-kinda dude holding a mouse. A little about GPCGR. More stuff. I love stuff. I hate when you open a box and it's just like, the thing. So this is the little quick start guide. Very cool. It shows you all the different RGB modes, which we will see later, I'll have a little dance party. But I don't wanna read that. I would way rather have someone read this stuff to me, just like our sponsor Audible does. With Audible you can listen to your favorite free audiobooks wherever you are with the free Audible app. Choose any audiobook to get started. Also, your first audiobook is free. Members also get one audiobook every month, plus an extra Editors' Extra listen as well. Enjoy thousands of audiobooks, podcasts, guided wellness programs and more, with no credits needed. Start your 30-day free trial through the link below. By the power of time travel, I'm gonna unbox the other one so we can compare. Speaking of time travel, our most recent episode of Carpool Critics, actually one episode ago, we talk about \"Tenet,\" which is a movie that may or may not have time traversal elements. (speaking backwards) (grunting) Okay, I'm not gonna go any further, 'cause it's probably all the same stuff. White and black, as you can see. It comes default with these glide pads that are patented to Glorious. They're very smooth. I've heard good things about them. But what I really like is that they actually include extra glide. This is kinda sweet, 'cause the benefit of wired mice is that they can be extremely light. They don't have to have wireless transmitters or batteries, and so generally, a good, light, corded mouse will be super light. This is 60, whereas a G Pro, which is maybe the best, is 80, or a Viper Ultimate's like 74. If you're dragging that around, sure, the mouse is light, but you're also dragging a cord around, and so that starts to add to the weight. This helps by making the actual mouse itself glide smoother, which kind of helps enhance the illusion of lightness. It's pretty easy. You take of the 3M backing. Man, this is the stuff I'm so bad at. As you can see, the blue does come off, so that's fine. I think it's meant to protect it, keep it as smooth as possible, 'cause once it's on you mousepad, there's not really that many chances for dinks or damages that would make it less smooth. Let's talk about the physical of the mouse. I'm gonna choose the white one, 'cause it's probably a little easier to see. It's a good little mouse, it's kind of like a 403 or a Basilisk shape. It's a right-handed mouse, so it curves so that your hand can kinda fit a little more comfortably, and that's actually what I prefer. I use a 403 at home. The G Pro's a better mouse, but the shape of the 403 I prefer. It's got the six buttons, so left, right mouse click; back; forward; it has the middle button, which I believe is a DPI indicator by default, but you can probably reset it in the software; and then a little DPI indicator on the bottom. I've heard a lotta people complain that the DPI indicator's on the bottom, for people who kind of switch sensitivities for sniping on the fly, 'cause you're not gonna take your eyes off the screen. But overall I like the look of it. I mean, I like honeycomb-shaped mice. They're kind of a pain to clean, but it's a good-looking overall mouse. I'm not a huge fan of putting the PC... The GPCGR mascot on the mouse, but it's pretty understated, so that's totally okay. There's little grooves in the mouse that help your fingers sit really well, which I actually find very comfortable. It does feel like the curvature on the back goes down a little bit, so it feels like I kinda want a little more presence in my palm, which the Model D does provide. Overall it's a comfy shape. It definitely feels like it's a palm-down, just clawing-the-mouse-a-little-bit shape, but really, mice are so much preference. Really, once you break down the inside of the mouse, there's not that much differences anymore. The differences come down to the Pixart 3360 sensor, which is considered a flawless sensor. It's a little less granular than the 3389 in that it can only do increments of 100 DPI for settings, but it goes up to 12,000, which is much higher than I hope you use. Man, do any of you actually use 12,000 DPI? If you do, please let me know. That's psycho. I use 800, like I normal person, I guess? What's normal? Who cares? But otherwise it's a flawless sensor. It's light. It feels good. The button switches are the Omron D2FC-F-7N (20M) (0F)s. I wrote that down. I obviously didn't memorize that. D2FC means it's a Chinese switch. The F means that it's the lighter actuation force, so if it's the Chinese ones it's the 60-gram; if it's the Japanese one it's the 75; versus 120 or 150. The 20-mil obviously means it's rated for 20-mil, and the 0F means they give zero (beep) about what you think. So as per usual, I'm gonna load up \"Rainbow 6.\" While that's loading up, I'm gonna load up the Model D software. So there's a lot of options. You can change what each button does. You can add macros, which I will not do. You can change the DPI settings. Yes, that's what I want. So you change the settings. You can go more granular if you want. It's of increments of 100, which is totally fine. There's all the different lighting modes. I don't know if it can do it on both at the same time. Right now we're on Glorious Mode, which is glorious, seamless breathing, so it's kind of just flashing through the colors. Just straight breathing on one color. Tail. Rave. Ooh. Yeah. That's fun. Wave. Yeah, it's okay. It's okay. And then off. Okay, it seems like it's control is the same DPI for both, which is great, 'cause I wanted to compare same mouse, different glide pads, see how that goes. And then we're gonna compare it to different mice and see how that goes. Oh yeah, this feels pretty good. I'm actually impressed. With the cable manage, I've taped it to the front so I get just the right about of slack. It's really light, it feels like I'm flying, especially with these extra glide pads. Let's switch to the non-glide pads, see if it's quite as smooth. Oh god. It's not that different. As soon as I'm not doing anything it doesn't feel that different. It's a little less smooth, but if you for some reason didn't have the glide pads, you're fine. I'd say it's not worth going out of your way to get them. But yeah, I actually really like the shape of this mouse. I'm kind of digging it. Oh, maybe I will go back to wired mice. This feels good. It feels fast, I can flick. I mean, I'm not accurate 'cause it's not what I'm used to and this is a different setup, but this mouse feels really good. I'm kind of surprised. I don't usually like wired mice. Usually I find that the cable gets in the way or I'm just like, eh, but this shape feels good, the buttons feel good. I do like honeycomb mice. Oh, I'm dead. Yeah. This is better than I expected. All right, now we're gonna play some \"Left 4 Dead 2.\" It's one of my favorite games of all time and I just wanna showcase it, remind you how great it is. Great, my teammates are awesome. This is great. I put it on easy so that I didn't have to work very hard. Oh. Oh yeah, here we go. Oh, buddy, here we go. Get outta here, donkey. Oh gosh. Oh, that was so easy. I'm so glad you guys could join me for the death of Shrek. Everybody press F in the chat. Oh, he's... He didn't make his face mean at all. I feel kinda bad now. So I wanna compare it to some other top-end mice that are much more expensive and see how it compares. All right, so the first comparison I'm gonna do is to the Viper Ultimate. It's the best wireless mouse that Razer makes. It's super light, 74 grams. This mouse has gotten very good reviews. I like the shape of it. Feels comfortable. More comfortable than the G Pro to me. It's an ambidextrous mouse, but the way it curves out I actually really enjoy. So let's see how it does. I like the feel of the matte plastic so far on the Model D Minus definitely better. This one feels a little cheaper. Yeah, I think this one's pretty good. Yeah, there's like a really textured rubber kind of feel on the side, and I think that it wouldn't bother me, but after coming off of, like I was holding a 403 and then the Model D Minus, it just doesn't feel as refined. Also, these side buttons are really small. That's a 403 and that's what I'm used to, and so going from this to this, that's fine, but this to this, that feels like I'm gonna miss some button clicks. Ugh. Not used to that recoil I guess. I'm blame the recoil. Actually, I'll blame the mouse. I thought I would like this mouse more. I've used it a couple times and I've liked it, but now that I'm actually looking at it with a critical eye, not a huge fan of the Viper Ultimate. All right, next we're gonna do the G Pro wireless. It's the gold standard. It's I think what every wireless mice wishes it could be. I use it at my desk. It's great. It's pretty expensive. I think it's like, what, 199, 159, 149 U.S.? But first I'm gonna play a little more with the D Minus, just to have a comparison. The D Minus feels not cheap for how good of a price it is. I'm impressed. The plastics feel good. The shape is good, it's ergonomic, it's comfy. The glide pads are awesome. Cable's light parachute cord. But let's go to the G Pro and see how that feels. Oh yeah, that's a good mouse. That's a real nice mouse. I don't love the shape. I find it doesn't it doesn't feel comfortable in my hand after long periods, but it's really good plastic, it's really light, it's everything I could hope for in a mouse. Buttons always feel good. I mean, wireless mice, we've done a video on if wireless mouse are as good as wired mice, and yes, it is. Feels great. G Pro's gold standard, remains gold standard. But at triple the price? Huh? Next up is the 403. This is the wired 403. I use the wireless one. But it's my homeboy. It feels very comfortable in my hand. It feels a lot heaver than I remember after handling all these super light mice. I do like the way that the palm comes a little bit higher. The plastic does feel very good. I've heard stories of it kind of wearing off. Like I know Edzel has one, and he gave it to his girlfriend 'cause all the plastic kinda started rubbing off. But again, this is a pretty gold standard mouse. Logitech makes very high-end products for a decent price. I do like the cable on the Model O actually better. It feels lighter, like it would snag less. On the 403 it's a little more textured and hard, and it would give me resistance. I feel like if the stars aligned poorly and this caught on something, this would give me a lot more trouble than the Model D Minus. So if you're going wired, I would actually recommend this or the D over it. Should you get a Model D Minus? If you like the shape and you like honeycomb mice, if you're into wired mice, absolutely. This is an awesome mouse. I am actually gonna take it home and take it for a longer spin. I'm super excited to play with this more. The glide pads make it so smooth. It feels so light. It's a great shape. The buttons feel good. Overall this is an excellent mouse, but mice are so much preference, so let me know in the comments. Is this the kinda mouse you like? Do you like ambidextrous mice? Do you like big mice? Do you like heavy mice? Are you one of those people that puts extra weights in their mouse? I mean, I used to do that with my G9x. Thank you so much for watching. If you wanna watch more ShortCircuit, there's plenty, but you can watch me in the previous video where I review the mouse with a fan it and get my thoughts. Or check me out on Carpool Critics, where I talk about movies with James and Riley and have a hella good time.",
    "transcript_keywords": [
        "mouse",
        "good",
        "feels",
        "mice",
        "Model",
        "feel",
        "Model D Minus",
        "kind",
        "feel good",
        "Minus",
        "glide pads",
        "light",
        "feels good",
        "buttons feel good",
        "DPI",
        "shape",
        "pads",
        "glide",
        "Glorious",
        "wired mice"
    ],
    "transcript_entity_values": [
        "3",
        "Carpool Critics",
        "Basilisk",
        "68",
        "Shazim Mohammad",
        "Razer",
        "Zeus",
        "the Master Race",
        "30-day",
        "60",
        "one",
        "U.S.",
        "Riley",
        "49.99",
        "Model D",
        "Glorious Mode",
        "the G Pro",
        "7 grams",
        "Shrek",
        "100",
        "Logitech",
        "159",
        "58 grams",
        "150",
        "149",
        "Japanese",
        "74 grams",
        "12,000",
        "20-mil",
        "Omron D2FC-F-7N",
        "75",
        "59",
        "a Viper Ultimate's",
        "GPCGR",
        "80",
        "thousands",
        "first",
        "Chinese",
        "the Viper Ultimate",
        "every month",
        "3360",
        "120",
        "F",
        "10",
        "199",
        "The G Pro's",
        "RGB",
        "3389",
        "G Pro's",
        "ShortCircuit",
        "six",
        "PC Glorious Gaming Race",
        "403",
        "60-gram",
        "Left 4 Dead 2",
        "61 grams",
        "Edzel",
        "James",
        "zero"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "CARDINAL",
        "NORP",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.05769407004117966,
        -0.0971829816699028,
        0.041983865201473236,
        -0.08829086273908615,
        0.052351921796798706,
        -0.02208496816456318,
        0.07342475652694702,
        0.018967626616358757,
        -0.06987575441598892,
        0.13162435591220856,
        0.02747284062206745,
        0.051205191761255264,
        -0.010072354227304459,
        -0.0010343848261982203,
        0.08380496501922607,
        0.02778499200940132,
        0.07149399071931839,
        0.009052653796970844,
        -0.011448449455201626,
        -0.02445106953382492,
        -0.008112719282507896,
        -0.0707848072052002,
        0.05257343873381615,
        0.008647562935948372,
        0.028993455693125725,
        -0.03991590812802315,
        0.050867464393377304,
        -0.00579731073230505,
        -0.03175462409853935,
        -0.05005935579538345,
        -0.07095558196306229,
        0.02405249886214733,
        -0.0009021672303788364,
        -0.012093608267605305,
        -0.01925806514918804,
        -0.14612115919589996,
        0.03908578306436539,
        -0.044462304562330246,
        -0.09646525233983994,
        -0.06896801292896271,
        -0.01440386101603508,
        -0.04238318279385567,
        0.011226307600736618,
        0.08743090182542801,
        -0.033542048186063766,
        -0.002686228835955262,
        0.02433735318481922,
        0.008496754802763462,
        0.005299166310578585,
        0.03256580978631973,
        0.039172109216451645,
        -0.08579953759908676,
        0.08270952850580215,
        -0.041712965816259384,
        -0.020179463550448418,
        0.07713058590888977,
        0.010610674507915974,
        -0.0453740656375885,
        0.05841529741883278,
        -0.013024112209677696,
        0.008297671563923359,
        -0.06447573006153107,
        -0.0773371234536171,
        0.008218125440180302,
        0.009906294755637646,
        -0.06533936411142349,
        -0.010835421271622181,
        -0.0013723954325541854,
        0.005374528933316469,
        -0.019842633977532387,
        -0.057169005274772644,
        -0.02897438406944275,
        0.0235879048705101,
        0.04359791427850723,
        -0.00455307774245739,
        -0.04806843400001526,
        0.0745668038725853,
        0.02691284380853176,
        0.08451153337955475,
        -0.03352925181388855,
        0.004253680352121592,
        0.014927208423614502,
        0.015755707398056984,
        -0.06459007412195206,
        0.06656476110219955,
        0.01804393343627453,
        0.004989446606487036,
        0.03322939574718475,
        0.030069731175899506,
        -0.1134132370352745,
        -0.004853869788348675,
        0.07136362791061401,
        -0.027387965470552444,
        0.011244363151490688,
        -0.00995158776640892,
        0.005337319802492857,
        0.07717226445674896,
        0.0250887218862772,
        0.030430683866143227,
        0.014261750504374504,
        0.019090425223112106,
        0.020728478208184242,
        0.035874269902706146,
        -0.050509192049503326,
        -0.019795287400484085,
        -0.0640900656580925,
        -0.054949209094047546,
        0.05327340215444565,
        -0.0360797643661499,
        -0.0047197770327329636,
        -0.04880685731768608,
        0.002259142929688096,
        -0.06613143533468246,
        0.0543174222111702,
        0.05631021782755852,
        0.02643512934446335,
        -0.06202857941389084,
        0.009365206584334373,
        0.17907966673374176,
        -0.0214210394769907,
        -0.004762953147292137,
        -0.02053855173289776,
        0.011899382807314396,
        -0.03178837150335312,
        0.012025432661175728,
        0.07604005187749863,
        -0.028068790212273598,
        5.806794788926263e-33,
        -0.007851710543036461,
        0.08584505319595337,
        -0.09408821910619736,
        -0.071283258497715,
        -0.07644502818584442,
        0.05703555420041084,
        0.05320344120264053,
        0.06038126349449158,
        -0.07779333740472794,
        0.029980316758155823,
        -0.12480830401182175,
        0.0056349546648561954,
        -0.08659699559211731,
        0.07061168551445007,
        0.0402163527905941,
        -0.05187111720442772,
        -0.008193074725568295,
        0.01724720373749733,
        0.013512058183550835,
        0.0053376806899905205,
        0.014465454034507275,
        0.08999078720808029,
        0.014558635652065277,
        0.02175244316458702,
        0.042493484914302826,
        0.017539039254188538,
        -0.083917036652565,
        -0.01302293036133051,
        0.051972221583127975,
        0.04050922766327858,
        -0.06265947967767715,
        -0.02142069861292839,
        -0.0044545745477080345,
        -0.008998062461614609,
        -0.0595833957195282,
        -0.0058725327253341675,
        -0.08469834178686142,
        -0.09185735136270523,
        0.024061571806669235,
        -0.03889842703938484,
        -0.019828466698527336,
        -0.019837751984596252,
        -0.08578532189130783,
        -0.1094001904129982,
        -0.02816600352525711,
        0.005544452928006649,
        -0.07855993509292603,
        -0.05861548334360123,
        0.020083164796233177,
        0.007033952511847019,
        -0.03844430297613144,
        0.027580641210079193,
        -0.012916973792016506,
        -0.023845449090003967,
        -0.013462378643453121,
        -0.07740391045808792,
        0.020635390654206276,
        0.026991164311766624,
        0.08200106769800186,
        0.046420253813266754,
        0.009677331894636154,
        0.020851006731390953,
        0.052528347820043564,
        -0.001458926242776215,
        0.012339051812887192,
        0.020354796200990677,
        0.08991154283285141,
        0.00894930399954319,
        -0.07684135437011719,
        -0.00789338443428278,
        0.014927923679351807,
        -0.038186393678188324,
        0.018090762197971344,
        -0.076485775411129,
        0.013377941213548183,
        -0.013289684429764748,
        -0.0811038613319397,
        0.02025717869400978,
        -0.04440588504076004,
        -0.014245247468352318,
        -0.002358830301091075,
        0.10047271847724915,
        -0.0574258491396904,
        0.09237343072891235,
        0.060234349220991135,
        -0.027422809973359108,
        -0.026270464062690735,
        -0.049135055392980576,
        -0.04630820453166962,
        -0.016225488856434822,
        -0.024821193888783455,
        0.034719038754701614,
        -0.06698773056268692,
        -0.01892259158194065,
        0.03118627704679966,
        -7.655506142065998e-33,
        -0.08819838613271713,
        0.06240374594926834,
        0.03103426657617092,
        0.08508585393428802,
        -0.06193023920059204,
        0.026025278493762016,
        0.03475893288850784,
        -0.03438468277454376,
        0.030528727918863297,
        -0.07365306466817856,
        0.0801122859120369,
        0.032666295766830444,
        -0.09107930958271027,
        0.04189836233854294,
        0.008782360702753067,
        -0.014310203492641449,
        -0.06054673716425896,
        -0.05690087750554085,
        0.08986953645944595,
        -0.0868847593665123,
        0.10177241265773773,
        0.005040155258029699,
        0.014148947782814503,
        0.03351178020238876,
        0.00849961582571268,
        -0.10492963343858719,
        0.09966927766799927,
        0.004342772997915745,
        0.031539902091026306,
        0.004918190650641918,
        0.02616741880774498,
        0.09487678110599518,
        0.0312604121863842,
        0.06752559542655945,
        0.13697290420532227,
        -0.016471032053232193,
        0.0682816281914711,
        0.03559095039963722,
        -0.0176746416836977,
        -0.0261393990367651,
        -0.02089562639594078,
        0.01520203985273838,
        0.0807562991976738,
        -0.03322817385196686,
        0.07297331839799881,
        -0.04305148497223854,
        -0.052112068980932236,
        -0.07010317593812943,
        0.07975319027900696,
        0.07616882026195526,
        0.00521538220345974,
        -0.052051424980163574,
        0.04675879329442978,
        -0.08998708426952362,
        -0.10203006118535995,
        -0.03519030287861824,
        -0.0032653193920850754,
        -0.0035433785524219275,
        -0.01490241289138794,
        -0.03963771462440491,
        -0.04653903841972351,
        0.006999432109296322,
        -0.06613573431968689,
        0.009426997974514961,
        0.017894035205245018,
        0.02179192192852497,
        0.03326025605201721,
        0.03362487256526947,
        0.0010637318482622504,
        -0.03435705974698067,
        -0.05255714803934097,
        -0.003062169998884201,
        0.03438116982579231,
        -0.07453175634145737,
        -0.022720253095030785,
        0.05541504546999931,
        0.0246207844465971,
        0.03751260042190552,
        0.02105911262333393,
        -0.02696741372346878,
        -0.02213296853005886,
        0.021360142156481743,
        0.11016486585140228,
        -0.018485181033611298,
        -0.037697602063417435,
        -0.02116425894200802,
        -0.01522455271333456,
        0.006234742701053619,
        -0.03193356841802597,
        0.004115683026611805,
        0.013115148060023785,
        -0.026137620210647583,
        -0.05734546482563019,
        0.05257917195558548,
        -0.006244724150747061,
        -5.101674815932711e-08,
        0.024100471287965775,
        0.061578553169965744,
        0.06169804930686951,
        -0.018599137663841248,
        0.12834811210632324,
        0.0008026807918213308,
        0.0074660805985331535,
        0.026613440364599228,
        -0.021769855171442032,
        0.06737007200717926,
        -0.0210051741451025,
        -0.00669062277302146,
        0.031723055988550186,
        0.058687012642621994,
        0.03967375308275223,
        0.06790367513895035,
        -0.0335690975189209,
        0.02649857848882675,
        -0.018642079085111618,
        0.01001375075429678,
        0.005970918573439121,
        0.07878857105970383,
        0.02403586357831955,
        -0.009341663680970669,
        -0.0029831116553395987,
        -0.03564641252160072,
        -0.039889413863420486,
        0.022819997742772102,
        0.06865870952606201,
        -0.04971465468406677,
        0.02136760577559471,
        0.013109707273542881,
        0.054613519459962845,
        0.0015163033967837691,
        -0.030434871092438698,
        -0.10143433511257172,
        -0.020415088161826134,
        0.038243357092142105,
        0.01879960484802723,
        -0.004481988493353128,
        -0.014745143242180347,
        -0.10848236829042435,
        -0.0486467145383358,
        -0.03606521710753441,
        -0.026357758790254593,
        -0.014657913707196712,
        -0.06553090363740921,
        -0.11080586910247803,
        -0.059410057961940765,
        0.004807375371456146,
        -0.06406161934137344,
        0.08262324333190918,
        0.030081069096922874,
        -0.07423531264066696,
        0.02045818604528904,
        0.03659588098526001,
        -0.053070444613695145,
        -0.024604497477412224,
        0.04896410182118416,
        -0.026343049481511116,
        0.021693827584385872,
        -0.10152880102396011,
        -0.007403394673019648,
        0.10478274524211884
    ]
}