{
    "id": "yDy_qEz2sAM",
    "title": "Re-shot on iPhone 11 Pro: Nightmare On Elm Street!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-10-31T19:53:03Z",
    "video_url": "https://www.youtube.com/watch?v=yDy_qEz2sAM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "nightmare on elm street",
        "shot on iphone",
        "iphone",
        "iphone 11 pro max",
        "iphone 11 pro"
    ],
    "views": 138222,
    "likes": 5303,
    "comments_count": 418,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and today, we are heading into a studio to witness something really awesome. So I'm sure many of you guy have seen \"Nightmare on Elm Street.\" Well they are recreating a scene from that film but shooting it on an iPhone. They have one of the original gaffers. I'm gonna be chatting with Roy Wagner, who was one of the original DP's on this film, and he's DP-ing this and shooting it on an iPhone. So it's gonna be really cool to see that perspective of, you were here on the original shoot and now you're here re-shooting it on an iPhone. It's just really incredible. So let's head inside and let's witness some movie magic. (trap music) Okay so here's the setup. Armando can you walk us through what the heck is happening here. - Okay so- - First of all what is this gimbal? - So this is the Moza AirCross, Moza Air 2. - Okay. - So normally gimbals, remember how you kinda, it has a little plate here and you load them this way. You can side mount this, which allows us to go as large as we need. So if you have like really big cameras, like it works really great. We outrigged this on a Kondor Blue Cage, which allows us to rig up other accessories. This set up here, so we have the small HD monitor, and this is also a transmitter, so that's why it has the antenna up above. So the way this is getting the video signal is through this little dongle. So Apple sells these little dongles that can connect an HDMI cable. - Yes. - We have this and now this is transmitting to the video village. - [Justine] So essentially you guys are gonna be sitting here. - Right, if you're the director you get something even cooler. - What do I get? - You get this. Director gets this monitor over here. - [Justine] No way. - [Armando] It has a receiver. So this is receiving an image from here and this is a Teradek small HD combination. So what I'll do just really quick, is I'll go around so you can take a look. - [Justine] Okay, I'm directing now. And this is the Filmic Pro app which I have been such a huge fan of for such a long time. - [Armando] But you know I think it would be really fun if we get you and Roy to do a little quick scene. - Okay! - Do you wanna do that? - Yes! - So let's go ahead and do that. So what you're gonna do is you're gonna run down this little hallway, and you're gonna bump into this little doll. Obviously the doll's not there. You're gonna kind of stop here for a minute. Get your bearings and then run off camera this way. So what you're gonna do is, you're gonna kinda run here and then there's a pretend doll here. - Okay. - You're gonna go like, kinda this, and then you're gonna run this way, and then you're gonna go off camera this way. - Oh, I shouldn't have worn heels! What was I thinking? I didn't know I'd be running for my life today. - [Director] We're gonna do a quick- - This is gonna be so cool. Oh, we're doing a run through. - [Armando] Roy you good? - Okay. - [Armando] Rolling! - [Justine] Tell me when. - [Cameraman] All right guys, this is BTS, we're rolling! - [Armando] Back a little more so you see that your shadow right here. Here we go and action! (trap music) Cool, got it! - [Armando] That was awesome! (laughing) - Should I scream? Is there a scream? We can add that in post. - Looks great. (upbeat music) - [Justine] Looks pretty cool. - [Armando] It looks cool. - So that was shot at 60? - That was shot at 60 frames per second. Should I Airdrop this first? Or do this- - No, you can do it alone, just pull out the steam. - This is so great. Oh my gosh. The best part about it is you can Airdrop the video, like I can have this on my phone right now. - [Armando] Set and three, two, one, action rehearsal. - Did I run too fast? - [Armando] No, I think you're good. - [Director] Cutting! - Nice. - So I should probably step back a little bit closer to the- Then she also did a fall there too. - Yeah that was great. All right, cool. - That was great. - This is nuts, this is so great. - Cool, cool, one more? - [Justine] And it's so silly. (dramatic music) - Throw a double back in that first point in. - [Director] Copy that. - [Armando] Pretty close huh? - It's pretty cool. - [Armando] Patricia Arquette. Armando, how is it going? How are the settings? What's going on? Like, what's happening? - Settings look good so far. We're kinda testing out different profiles. So that's a neat about the application is that you can shoot in natural dynamic flat and Log V2. However, because this is a newer iPhone, Filmic Pro did mention, that they're still working on the Log V2 profile. Technically it's not like done. - Yeah. - By the time people watch this video it's probably gonna be already live. - Is this the beta version of the app? - No, so we're trying to get a beta version. - I want to try the duel filming with the reversible cameras. - So we're trying and hopefully tomorrow, there will be somebody from Filmic Pro here that might give us the beta version of this. But yeah, no so far it's good. I think we're pretty happy. You've been great as a stand in, that's awesome. - Thank you this is so cool. - Yeah. - Ooh hoo, that's harsh, wanna say it again? (laughing) - Oh well, you know. - So we're here on set and I'm with Roy. Now you were the original DP on Nightmare on Elm street, and now you're here DP-ing it on an iPhone. Like what is this like for you to have just? - It's like so bizarre. - I've always been passionate about new technology. I've been in the business for 50 years, shot 70 mm, 35 mm, and digital. I shot the very first digital series. I've heard of people shooting with phones before, but I never thought that I would be shooting with a phone. And my partner said, \"Why don't we do this with an Apple iPhone?\" And I just got the new Apple iPhone and was blown away by the quality of the images. To the point where I wasn't carrying my still camera anymore. - Yeah. - So I said \"That'll be a challenge, that'll be interesting.\" - Last night, I watched the first half of the movie on my iPhone, which is so insane, that I watched it on the device that you guys are now recreating the film. And its interesting because the technology that you guys were using, was such that manual thing. And seeing what's happening now, what is that like for you to just see it all be? I guess its easier, but there's so many other challenges? - It's easier but, I'm trying to exactly replicate where their shadow falls. - Yeah. where exactly the light hit the wall. And so its not like doing it for the first time, because I can be completely wrong and I'm right, because it's the first time. But this time I have to exactly duplicate what we did before. And beside that, even when shooting film, we were shooting with the slowest film possible, there was no high speed films then. So we had to do what we're doing now, where the phone can be shot at low light levels, but you always want to work at the highest light level you can, so you get a prettier picture. - Yeah, lets go back to some of this original stuff. 'Cause this is the best thing. Like you've kept this for so - Well I keep it - long. - for everything I've done. - This is amazing. - For CSI, Beauty and the Beast. Here's the original script. - This is crazy, what was your favorite memory from just creating movies? - It's always about people. - Yeah. - I love the camaraderie of crew, because it's like the circus. - Yeah. - And of course ever scene is drawn out, so that we know how we're going to do it. The special effects people, detail how the shots will be done. And of course letters of how it has to be, done a very particular way. There's the Freddie snake. - Oh my gosh, I mean what else is in here? This is like an arsenal of just history. - If you wanted to make the movie again, (laughing) you can look at this and you would know how we did it. - I mean you could technically if you wanted to, you could shoot this and edit it on the iPhone. - Hm-mm. - Which is really fascinating. - That's exactly right. - And what's so exciting about that is, that, that means that all those aspiring filmmakers, like we all were at one time, can get their hands on a camera, much more quickly. - For sure. - And can go out and make their film. And not have to go through a studio or through a committee of executives, that tell them \"No you can't do it this way, you have to do it that way.\" - Which is what's great about YouTube, I mean I started a very long time ago. Like I was editing on two VHS players that my parents were thankfully nice enough to let me just use. So I've been editing for such a long time as well, just to even see that change. And just go from film to tape to digital - You get to follow your dreams. is amazing. I mean the thing is nothing, well we call it the democratization of film making, but it's a democratization of all knowledge. - So I think for maybe my audience, a lot of them are maybe inspiring cinematographers, or even like whatever it is that they're doing. A lot of them it is the younger audience. So what would you give to them, one pice of advice to just help in either cinematography or just life in general? - Don't let anybody steal your dream, especially yourself. Because I find nobody can steal your dream but you. - That's very true. - And just never give up. There is no right way to do anything. I always tell people, \"You know my book of enemies is all filled up, you're gonna have to be my friend.\" (chuckling) Just having a great attitude. I'm 72 years old, I feel like I did, when I was making this movie. - That's really cool. - It's a thrill to wake up every morning and to know that you get to do what you dreamed of doing all your life. - This is insane. This is just really cool. - It's gonna be fun. - This is so amazing. Thank you so much for sharing your story and your time with us. - Thank you very much. - And doing this project and sharing it with us. And just, wow this is amazing. - I'm looking forward to seeing your piece on YouTube. And I hope you'll look at mine. - I can't wait thank you. - Well hopefully we'll be able to encourage not just young people, but everybody to follow their dreams. - Yeah it's never to late to do something that you love, which is amazing. We're inspiring you guys to go out and do something cool. - I'm inspiring myself. (laughing) - I'm inspired. Now I need to go shoot a feature film on an iPhone. (giggling) - Exactly, exactly. - This is cool, thank you so much, appreciate it. (funk music) Well guys, thank you so much for watching this behind the scenes. And thanks so much for chatting with us. - Thank you. - If you guys wanna see the full recreation, I'll put a link in the description and you guys can go check it out. So thank you again. - Thank you. - Ah, this is amazing. Oh, and happy Halloween. - Happy Halloween. Boo! (funk music)",
    "transcript_keywords": [
        "cool",
        "iPhone",
        "Yeah",
        "guys",
        "great",
        "film",
        "time",
        "Filmic Pro",
        "Justine",
        "original",
        "run",
        "amazing",
        "shooting",
        "Justine and today",
        "people",
        "Roy",
        "Elm Street.",
        "kind",
        "shot",
        "Apple iPhone"
    ],
    "transcript_entity_values": [
        "Armando",
        "50 years",
        "second",
        "one",
        "Freddie",
        "Apple",
        "Justine",
        "Filmic Pro",
        "35 mm",
        "YouTube",
        "CSI",
        "Apple iPhone",
        "iPhone",
        "BTS",
        "Last night",
        "three",
        "Teradek",
        "Patricia Arquette",
        "VHS",
        "72 years old",
        "DP",
        "YouTube",
        "Roy",
        "Moza Air 2",
        "Nightmare on Elm Street",
        "Elm",
        "Halloween",
        "Boo",
        "Beauty and the Beast",
        "today",
        "two",
        "70 mm",
        "60",
        "the first half",
        "Roy Wagner",
        "Airdrop",
        "HDMI",
        "first",
        "tomorrow",
        "the Moza AirCross"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "FAC",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.041176844388246536,
        -0.06480228155851364,
        -0.013590619899332523,
        -0.09929946064949036,
        0.00048628414515405893,
        0.044667113572359085,
        0.031035041436553,
        -0.01959703117609024,
        -0.015259020030498505,
        0.051427148282527924,
        0.04311114177107811,
        0.050506964325904846,
        -0.0268247127532959,
        0.01221250370144844,
        -0.013992761261761189,
        0.03318091854453087,
        0.04156964272260666,
        0.0017804638482630253,
        -0.014240790158510208,
        0.054919350892305374,
        -0.014654453843832016,
        -0.057626936584711075,
        0.08619466423988342,
        0.02103758230805397,
        0.012229022569954395,
        0.05486537516117096,
        -0.03334425389766693,
        0.02457815408706665,
        -0.09869863092899323,
        -0.07569427788257599,
        -0.007745638955384493,
        -0.019471099600195885,
        0.035291045904159546,
        0.024088772013783455,
        0.03647537901997566,
        -0.07137300819158554,
        0.01398518867790699,
        0.0009267631103284657,
        0.013743327930569649,
        0.004838013555854559,
        -0.021273760125041008,
        0.010334690101444721,
        -0.006631553638726473,
        -0.020687608048319817,
        -0.049322884529829025,
        -0.07002612948417664,
        -0.01008668914437294,
        -0.05585377290844917,
        0.04226355999708176,
        0.04065414145588875,
        -0.04426148161292076,
        -0.020647641271352768,
        -0.0013081311481073499,
        0.0452691949903965,
        -0.06763573735952377,
        0.016712939366698265,
        -0.056493453681468964,
        0.00021101113816257566,
        0.10026028007268906,
        -0.06902052462100983,
        0.04165947064757347,
        8.689265087014064e-05,
        0.018374111503362656,
        0.05418168753385544,
        -0.032747913151979446,
        -0.04185657203197479,
        -0.04736023023724556,
        -0.016242103651165962,
        0.02550901472568512,
        0.0067714061588048935,
        -0.052480436861515045,
        0.08948507905006409,
        -0.014776180498301983,
        -0.03516491502523422,
        -0.002347121946513653,
        0.026016738265752792,
        0.019155623391270638,
        -0.06670346111059189,
        -0.08141902834177017,
        0.056041326373815536,
        0.07406722009181976,
        -0.04728499799966812,
        -0.06684944033622742,
        -0.015527399256825447,
        0.055678341537714005,
        0.005259678233414888,
        -0.016531161963939667,
        0.02808932214975357,
        -0.04093668609857559,
        -0.08932706713676453,
        -0.09945649653673172,
        0.007448744960129261,
        0.00972173921763897,
        -0.007125483360141516,
        0.012483816593885422,
        -0.044443655759096146,
        -0.011467650532722473,
        -0.06822433322668076,
        -0.04791824892163277,
        0.048531632870435715,
        0.04784512519836426,
        -0.13135966658592224,
        -0.005202207248657942,
        -0.07344059646129608,
        -0.021960686892271042,
        -0.05499866232275963,
        -0.05001108720898628,
        0.0028670174069702625,
        0.010810661129653454,
        0.04103980213403702,
        -0.03647736459970474,
        0.014568816870450974,
        -0.08808887749910355,
        -0.030524473637342453,
        -0.0012495772680267692,
        0.0801573395729065,
        -0.056494321674108505,
        0.07857311517000198,
        0.043545715510845184,
        -0.02863466739654541,
        -0.024215612560510635,
        -0.06301966309547424,
        -0.06834776699542999,
        0.028047068044543266,
        0.013823713175952435,
        0.034069474786520004,
        -0.057842325419187546,
        1.2227254199647393e-32,
        0.036135658621788025,
        0.05149581655859947,
        -0.02363721840083599,
        0.05803688243031502,
        0.00972064957022667,
        -0.05170046538114548,
        -0.03499323129653931,
        0.07694609463214874,
        0.015890371054410934,
        -0.004416494630277157,
        0.0194039735943079,
        0.020817361772060394,
        -0.04417476803064346,
        0.01568056456744671,
        0.012135586701333523,
        -0.020108383148908615,
        -0.011577479541301727,
        -0.03864051401615143,
        -0.018278170377016068,
        -0.002661018632352352,
        -0.022070003673434258,
        -0.0377286933362484,
        -0.024333566427230835,
        0.05812636762857437,
        0.03162726014852524,
        0.11245031654834747,
        0.0783209577202797,
        0.07037756592035294,
        0.0687960535287857,
        0.009650851599872112,
        -0.05804011970758438,
        -0.004233390558511019,
        -0.029665648937225342,
        -0.08970823138952255,
        0.010360627435147762,
        0.029239116236567497,
        0.005042649805545807,
        0.027104409411549568,
        -0.022557701915502548,
        -0.05223539471626282,
        -0.03484461084008217,
        0.03035852685570717,
        -0.09282022714614868,
        -0.049044594168663025,
        0.10878518968820572,
        0.039075855165719986,
        -0.007517479360103607,
        0.06938032805919647,
        -0.03964051231741905,
        0.002671672496944666,
        -0.007066789083182812,
        -0.0460515059530735,
        -0.04758797213435173,
        0.005035097245126963,
        -0.07281872630119324,
        -0.0707273781299591,
        -0.008576121181249619,
        0.04169851541519165,
        0.03894708305597305,
        0.06567567586898804,
        0.07822991907596588,
        -0.012404914014041424,
        -0.019791165366768837,
        0.0029798687901347876,
        -0.06857158243656158,
        0.07403049618005753,
        0.08901537209749222,
        -0.0120741231366992,
        0.02972320280969143,
        0.0766724944114685,
        -0.017032679170370102,
        -0.016610436141490936,
        0.05178840830922127,
        0.0316929891705513,
        0.044161874800920486,
        0.032455358654260635,
        -0.05938325077295303,
        -0.05802389606833458,
        0.021932262927293777,
        0.00664848368614912,
        -0.08556165546178818,
        0.07125815004110336,
        -0.009234021417796612,
        0.08399073779582977,
        0.012905222363770008,
        -0.10368449985980988,
        -0.032838087528944016,
        -0.05075313523411751,
        -0.024249756708741188,
        0.07661405950784683,
        -0.017790736630558968,
        0.044897958636283875,
        -0.08299154788255692,
        -1.638045250729192e-05,
        -0.028309082612395287,
        -1.262067452645235e-32,
        0.012582486495375633,
        -0.012873099185526371,
        -0.04565366730093956,
        -0.05796859413385391,
        0.00208311271853745,
        -0.015494642779231071,
        0.03515850007534027,
        0.12228939682245255,
        0.07772418856620789,
        -0.05077090486884117,
        0.01098228432238102,
        -0.057223062962293625,
        -0.11172232776880264,
        0.038211382925510406,
        -0.04448907449841499,
        -0.049904000014066696,
        -0.08693818002939224,
        -0.03928777575492859,
        0.03931361809372902,
        0.03237612172961235,
        0.10988989472389221,
        0.1044616550207138,
        0.11593806743621826,
        0.021511821076273918,
        0.02074875682592392,
        0.02357618696987629,
        0.032360661774873734,
        0.07173186540603638,
        0.0470704659819603,
        -0.01827746070921421,
        0.00646804366260767,
        -0.084669329226017,
        -0.06887112557888031,
        -0.01249716803431511,
        0.047035101801157,
        0.07296138256788254,
        -0.003358212299644947,
        -0.006752341985702515,
        0.018574070185422897,
        -0.05590864643454552,
        0.059666384011507034,
        -0.003377716988325119,
        0.008152298629283905,
        -0.022332051768898964,
        0.02615073323249817,
        -0.09917476773262024,
        -0.034132178872823715,
        0.04643125832080841,
        0.05332842841744423,
        0.06212155893445015,
        -0.054073698818683624,
        -0.0361541323363781,
        -0.05008512735366821,
        0.025653943419456482,
        -0.022859001532197,
        -0.01379042025655508,
        -0.02226419746875763,
        -0.05080422759056091,
        0.062131792306900024,
        0.07012566924095154,
        0.05669327452778816,
        0.03064679726958275,
        -0.0953628197312355,
        -0.09107683598995209,
        -0.016493091359734535,
        -0.026233170181512833,
        0.04951760545372963,
        0.014234335161745548,
        -0.0046989573165774345,
        0.055095408111810684,
        -0.029536070302128792,
        0.012556824833154678,
        0.02879023551940918,
        0.011057847179472446,
        0.006509779021143913,
        -0.00840058270841837,
        -0.1028575748205185,
        0.03456192836165428,
        0.06444481760263443,
        -0.037150897085666656,
        0.004245039075613022,
        -0.005551123060286045,
        0.004966770298779011,
        0.1134849488735199,
        0.1481531709432602,
        0.10938238352537155,
        0.08878838270902634,
        0.02045552060008049,
        0.011546353809535503,
        0.06759034842252731,
        0.023913946002721786,
        0.018620148301124573,
        0.07217607647180557,
        0.12026860564947128,
        -0.12000459432601929,
        -6.172577116103639e-08,
        -0.011140985414385796,
        0.06346148252487183,
        -0.009266402572393417,
        -0.023717572912573814,
        0.022786274552345276,
        -0.08410123735666275,
        -0.06415998935699463,
        0.002820102032274008,
        0.08111824840307236,
        -0.1035795584321022,
        0.0499916672706604,
        0.019539430737495422,
        -0.031451109796762466,
        0.14320993423461914,
        -0.012971232645213604,
        0.009569292888045311,
        -0.1095910519361496,
        0.08454465121030807,
        -0.012978557497262955,
        -0.04204224422574043,
        -0.05467769503593445,
        0.039663515985012054,
        0.02957107685506344,
        -0.019377481192350388,
        0.03250185400247574,
        -0.017625974491238594,
        -0.01754925027489662,
        -0.0372188538312912,
        0.038988154381513596,
        -0.034622255712747574,
        -0.06958316266536713,
        0.007207850459963083,
        -0.003550885012373328,
        -0.05377967283129692,
        -0.06931697577238083,
        -0.030514826998114586,
        -0.006374206393957138,
        -0.009529967792332172,
        0.02536093071103096,
        -0.037526339292526245,
        0.011148856952786446,
        -0.1094389408826828,
        -0.027042901143431664,
        -0.02778049185872078,
        -0.003616672707721591,
        -0.08695252239704132,
        0.03893248364329338,
        -0.08754204213619232,
        -0.026855608448386192,
        0.004689065273851156,
        -0.09360599517822266,
        -0.01673283986747265,
        0.006317701190710068,
        -0.03205939009785652,
        0.04905952140688896,
        -0.05473463609814644,
        0.03277791291475296,
        -0.0030557261779904366,
        -0.034923262894153595,
        0.009560826234519482,
        0.09824778139591217,
        -0.019535476341843605,
        -0.04809730499982834,
        0.04830686375498772
    ]
}