{
    "id": "ydzC7jb5C4s",
    "title": "Acer Predator Triton 700 Review - My FAVORITE Gaming Laptop!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-09-27T03:30:03Z",
    "video_url": "https://www.youtube.com/watch?v=ydzC7jb5C4s",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Acer",
        "predator",
        "triton",
        "700",
        "Asus GX501",
        "vs",
        "Razer",
        "Blade",
        "Razer Blade Pro",
        "XPS15",
        "Thinnest gaming laptop",
        "thin gaming laptop",
        "thin and light gaming laptop",
        "GTX 1080",
        "Maxq",
        "Max - Q",
        "Max Q",
        "gtx 1070",
        "gtx 1060"
    ],
    "views": 1390240,
    "likes": 27907,
    "comments_count": 1881,
    "description": "The Predator Triton 700 is the best gaming laptop from Acer if you want a thin and powerful gaming laptop. Personally, I like it more than the Asus GX501. Available Here:   Music Credits: Background: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2yrEjhV",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here And this is the Triton 700 from Acer and this was actually one of the very first laptops that was shown to the world with a whole thin and powerful but super quiet laptop designs, and this is actually my favorite laptop that Acer makes. So they also make that super powerful $9000 gaming laptop, and as impressive as that thing is, It's just not practical for most people. This thing is still very powerful, but it doesn't look like a super obnoxious gaming laptop. It's just a simple laptop, and the reason why they're able to make it like this, is from the whole Max-Q design approach, and if you remember some of my older videos that I've talked about it, Max-Q is this thing where manufacturers will focus on energy efficiency and make laptops that are like this. Thin, powerful, but really quiet. And with all the laptops with the GTX Max-Q 1080 This is my favorite one. I want to talk a little bit about the build. This thing has incredible build quality. It's got a full metal design, so metal top panel, metal bottom panel Metal keyboard deck, like this thing is built like a tank even though it's three quarters of an inch thick or not even, it's actually very difficult to twist. I'm also partial to its color. It's not black, it's kind of like this really dark aqua color and I think it looks amazing. The other thing is there's no red on this laptop at all There's no red power button or red logo or red exhaust fans like, None of that is red, it's a bit of blue and there's dark aqua color, it's straight up my alley! There are a good number of ports. There's two display outputs (DP + HDMI), Thunderbolt 3, Ethernet and 4 USB ports. If you'll notice, one of the USB ports is recessed and it actually comes with a cap you can kind of put in and out of it, and I'm not sure but I think it's for wireless gaming mice and keyboard so if you have one of those wireless mice with a required dongle, so not a Bluetooth connection but like a radio connection, you can leave it plugged in all the time and you don't have to worry about it getting knocked off or damaged or whatever, It's a small detail but I think it's really cool. If you want to, you can access the internals by removing some screws and then lifting the keyboard off There are two ribbon cables that are connected So if you want to remove it, you have to be super careful. There's a pair of NVMe drives in there, running in RAID 0 and there's 32 gigs of RAM so that's two sticks of 16. It seems unlikely but if you want to, you can upgrade all of that stuff inside. You can open up this laptop with one hand The hinge tension is pretty much perfect, and when you do You get to see one of the most unique keyboard decks you'll ever see in a laptop Starting up at the top, there's this glass panel and when the laptop is on you can see the fan spinning in here. The whole thing is a window. You can kind of peer inside and look at the heat pipes and the other thermal stuff, but the main purpose of this thing is it's actually a trackpad Which is kind of crazy. It's a smooth glass surface, there's no texture and tracking is good. It's interesting that a trackpad like this that uses a completely unconventional glass surface like this is still able to use Windows Precision drivers so tracking is super accurate without any kind of skipping issues Gestures also work perfectly on the surface. The button clicks are a little different Left-click is still just single click, right-click is a double tap Kind of like a MacBook, but it's the fact that there's no tactile response at all. You're basically tapping on a glass surface but it works accurately. The click-and-drag is a little weird. You have to double-click something to start dragging it around and again, it works well and it does accurately detect when you want to start clicking and dragging things around but it's so different from anything I've used before that it took me a couple days to get used to it. But the reality is you're gonna have a mouse connected this thing for most times if you're using it. The keyboard is comfortable. It's close to the edge like The whole keyboard is shifted down to give the internals some better cooling And when I first saw photos of this thing, I thought it would be weird to use because there's no wrist rest but it's actually very comfortable. It's a mechanical keyboard but the switches aren't your usual Cherry switch kind-of feel. They feel more like Micro switches Very short travel with a short click. If you're used to a regular mechanical keyboard like a regular desktop mech, you're not gonna be able to come over to this thing and just type regular speed So you gonna have to have a bit of a learning curve It's not that it's a bad keyboard, it's actually a great keyboard but it's just really different from a regular mechanical keyboard. You get fully customizable RGB lighting Individual key lighting with tons of colors to choose from and you can go as crazy as you want or you can just turn it all off. The fan up at the top also lights up into whatever color you want as well Performance on this laptop is really impressive. It's a Max-Q 1080 Kaby Lake i7, 32 gigs of RAM and because it's a Max-Q laptop This thing runs at around 40 decibels when you're playing games and even the most demanding or the most unoptimised games run really well on this thing. The Triton 700 also lets you overclock the GPU. You need to push the fans a little harder to keep it cooled properly, but in Turbo Mode The performance is surprisingly good. It actually comes close to a full fat GTX 1080 laptop Thermal performance is also really good. You get full control of the fans in the software. If you want to push this thing hard for like, a video edit, or if you're playing a game competitively You can, just crank up the fans and just let it rip. But if you want to play something a little more stealth, you can lower it back down and just keep it in Whisper Mode So I wanted to see how hot this laptop would get when I was playing this thing For a long time in Whisper Mode so the footage you're about to see Was this game running for about three hours in Overwatch and I just kept this thing with G-Sync on, with fans at 40 decibels Temperatures are a little hot. They never got worse than this but the frame rates don't dip too much. The speakers are positioned really well. The stereo separation is on point They project upwards, one on each side They're good speakers, they're not excellent. Decent clarity but the bass isn't as strong as I'd like. The screen is really nice. It's a 1080p 120Hz panel. Supports G-Sync And when you pair it up with the 1080, games run so smooth on this thing. The color gamut and brightness are good as well. Now I've said this before in other videos, but when you have a laptop like this with high-end components, you have to put a good quality screen like this in. A lot of laptops are still being made with good components Fast components but 60Hz screens and that just kills me. They've done it well, 120Hz panel, G-Sync, Max-Q 1080, it's a great combination. It's an IPS panel, you don't get the super fast response time of TN panels but with an IPS panel, you're getting better looking image quality and viewing angles are better as well. The battery life on this laptop is probably its weakest point It's a 54 watt-hour battery and I'm only getting around 2 hours of battery life with the screen at 250 nits. Now most people that are picking this up aren't gonna be using it for like extended gaming sessions on the road But if that's what you're looking for, it's not the best option... The Triton 700 is one of the best built laptops I've seen from Acer Full metal construction with excellent build quality and a nice design Pricing starts just under $3000 but it comes in fully loaded. You're getting a 120Hz G-Sync screen It's excellent for gaming with good enough color accuracy for content creation The mechanical keyboard is really clicky and it's comfortable to use but it doesn't use your normal desktop keyboard switches. You'll need to get used to these. The trackpad is built into the glass window with great tracking accuracy but clicking is a little bit weird Inside, the Kaby Lake i7 and the Max-Q 1080 deliver really impressive performance. The fans are quiet but you can overclock the GPU and adjust the fans to your preference. The RAM and the two NVMe drives are replaceable if you need but Acer loads this thing up with some really fast stuff out of the factory The battery life is shorter and clocks in at just over a couple of hours. Okay I think Acer did an amazing job on this thing. It's such a cool device. The design, that build, the performance, the trackpad, everything about it I really really like. Now it's not for everyone. It's super expensive that's also makes it like unachievable for most people including myself, like this is review unit I got to send it back, but of all the laptops I've seen in 2017 This is the one that's most impressive to me. I've seen other ones that are even more extravagant but it's not about that. It's about building something that's practical, that's viable as like an everyday machine and looks really good while it does it. Okay, hope you guys enjoyed this video! Thumbs if you liked it, subs if you loved it! See you guys next time!",
    "transcript_keywords": [
        "thing",
        "laptop",
        "keyboard",
        "good",
        "laptops",
        "fans",
        "mechanical keyboard",
        "super",
        "MaxQ",
        "panel",
        "Acer",
        "kind",
        "color",
        "gaming laptop",
        "powerful",
        "metal",
        "Performance",
        "red",
        "gaming",
        "super quiet laptop"
    ],
    "transcript_entity_values": [
        "around 2 hours",
        "Windows Precision",
        "Cherry",
        "4",
        "MacBook",
        "9000",
        "around 40 decibels",
        "G-Sync",
        "120Hz",
        "54 watt-hour",
        "GPU",
        "Micro",
        "Acer",
        "USB",
        "one",
        "1080p 120Hz",
        "3000",
        "Turbo Mode",
        "RGB",
        "16",
        "TN",
        "GTX",
        "Whisper Mode",
        "about three hours",
        "Overwatch",
        "two",
        "3",
        "GTX Max-Q 1080",
        "three quarters",
        "first",
        "Acer Full",
        "2017",
        "IPS",
        "Ethernet",
        "32",
        "Thumbs",
        "RAM",
        "a couple of hours",
        "Triton",
        "1080",
        "a couple days",
        "Max",
        "250",
        "60Hz",
        "40 decibels"
    ],
    "transcript_entity_types": [
        "TIME",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "FAC",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.09994881600141525,
        -0.004547198303043842,
        -0.054110441356897354,
        -0.006492750719189644,
        0.004358665551990271,
        0.0047720493748784065,
        -0.01293794997036457,
        -0.007955817505717278,
        -0.074398934841156,
        0.03596397116780281,
        -0.010392940603196621,
        -0.05963340401649475,
        -0.004312572069466114,
        -0.003324958262965083,
        0.024339478462934494,
        0.0032854180317372084,
        0.1671418696641922,
        -0.10010182112455368,
        0.03729625418782234,
        -0.04297478869557381,
        -0.03403385728597641,
        -0.0005565414321608841,
        -0.028043493628501892,
        -0.04136517271399498,
        -0.015048569068312645,
        0.03240576386451721,
        0.019847027957439423,
        -0.00573816429823637,
        -0.0823112279176712,
        -0.07422801852226257,
        0.043657731264829636,
        0.015121860429644585,
        -0.06867818534374237,
        0.04546409100294113,
        -0.02513532154262066,
        -0.10532353818416595,
        0.028611214831471443,
        -0.07490921765565872,
        0.035656291991472244,
        -0.07670098543167114,
        -0.04084305092692375,
        0.022828947752714157,
        0.03778352960944176,
        -0.013812912628054619,
        -0.0005277395830489695,
        -0.07102376967668533,
        -0.062421705573797226,
        -0.05034394562244415,
        0.030446205288171768,
        -0.05904603376984596,
        -0.009161761961877346,
        -0.036369889974594116,
        0.050886671990156174,
        -0.06784158945083618,
        -0.059369999915361404,
        0.05812429264187813,
        0.011788847856223583,
        -0.030485033988952637,
        -0.0008084282744675875,
        0.012387726455926895,
        0.13378605246543884,
        -0.07768486440181732,
        -0.018565481528639793,
        0.056901201605796814,
        -0.027218881994485855,
        -0.06577127426862717,
        0.04545624926686287,
        -0.10692785680294037,
        0.008889371529221535,
        0.026140758767724037,
        0.011304961517453194,
        0.03292207047343254,
        -0.008170107379555702,
        0.007963310927152634,
        0.058320917189121246,
        -0.017982646822929382,
        0.017067894339561462,
        -0.028228383511304855,
        -0.005472491029649973,
        0.045910246670246124,
        0.01840898022055626,
        -0.036893922835588455,
        0.03377523273229599,
        -0.05049894005060196,
        0.00596928596496582,
        -0.048920296132564545,
        -0.013246278278529644,
        -0.009011304005980492,
        -0.07498341798782349,
        -0.04655339941382408,
        0.011450813151896,
        0.04647599533200264,
        0.07160477340221405,
        0.0016793061513453722,
        -0.03239231929183006,
        -0.0038264007307589054,
        0.05690092593431473,
        -0.07699237018823624,
        -0.09465726464986801,
        0.02754269726574421,
        -0.01909778267145157,
        0.032932717353105545,
        0.09600280970335007,
        -0.021501878276467323,
        -0.012894668616354465,
        -0.025909654796123505,
        0.022884177044034004,
        0.08913218230009079,
        0.02867545187473297,
        -0.02101375348865986,
        -0.06208886578679085,
        0.03745613619685173,
        -0.012054243125021458,
        -0.0022451800759881735,
        -0.008090980350971222,
        0.07841610163450241,
        -0.01370945479720831,
        0.04815566912293434,
        0.12095041573047638,
        0.09850212931632996,
        0.05714190751314163,
        -0.04751782864332199,
        -0.024373579770326614,
        0.06681875884532928,
        0.06903640180826187,
        -0.0011178224813193083,
        -0.10234246402978897,
        2.8146964274600048e-33,
        0.02143571339547634,
        0.032814592123031616,
        -0.03153926134109497,
        -0.039719268679618835,
        0.022296465933322906,
        -0.05514535307884216,
        0.0004576412320602685,
        -0.0223852526396513,
        -0.020751964300870895,
        -0.03697802871465683,
        -0.04976368695497513,
        -0.021252574399113655,
        -0.07544250786304474,
        0.09555613249540329,
        0.01067490316927433,
        -0.08074401319026947,
        -0.07495950162410736,
        -0.010434596799314022,
        -0.03821056708693504,
        -0.006023175083100796,
        0.03979305922985077,
        0.02161586284637451,
        0.02636304311454296,
        0.02354361303150654,
        0.11900194734334946,
        0.033313386142253876,
        -0.03809749335050583,
        -0.013608338311314583,
        0.03401082754135132,
        0.025717996060848236,
        -0.059398211538791656,
        -0.07938484102487564,
        -0.010448925197124481,
        -0.06169464439153671,
        0.0055535719729959965,
        -0.01384079921990633,
        -0.057810068130493164,
        -0.04784511774778366,
        0.03907117620110512,
        -0.008623759262263775,
        -0.011076199822127819,
        0.08458609879016876,
        -0.08223710209131241,
        -0.04341663047671318,
        -0.046386878937482834,
        0.01970997452735901,
        0.013599087484180927,
        0.07552532106637955,
        -0.07132074981927872,
        0.00023553443315904588,
        -0.09565217047929764,
        0.07548654824495316,
        0.025283096358180046,
        0.05616060271859169,
        -0.06309204548597336,
        -0.023324772715568542,
        0.1107017993927002,
        0.0007974226027727127,
        0.08998943865299225,
        -0.026019975543022156,
        0.09788703173398972,
        0.01364030223339796,
        -0.02169225364923477,
        -0.006488031707704067,
        -0.03161853924393654,
        0.05057470500469208,
        0.08479808270931244,
        0.028240201994776726,
        -0.04214722290635109,
        0.036075398325920105,
        -0.016452934592962265,
        -0.030189869925379753,
        0.10328158736228943,
        -0.0779653936624527,
        0.07318863272666931,
        -0.04923057183623314,
        -0.03505995124578476,
        -0.08159847557544708,
        -0.049795396625995636,
        -0.08357954025268555,
        -0.025744272395968437,
        0.03895382955670357,
        0.0389818400144577,
        -0.017730332911014557,
        -0.08743949979543686,
        -0.011334721930325031,
        -0.015513797290623188,
        -0.054590050131082535,
        0.003340185387060046,
        0.018886806443333626,
        -0.028975550085306168,
        0.02292945608496666,
        0.0043344334699213505,
        0.007514886558055878,
        -0.005490281619131565,
        -3.263944103392382e-33,
        -0.01750084199011326,
        -0.07379213720560074,
        -0.04371718317270279,
        0.01925131119787693,
        -0.015551755204796791,
        0.059415243566036224,
        -0.04028885439038277,
        0.02855551801621914,
        -0.028764311224222183,
        -0.010497743263840675,
        0.037570465356111526,
        0.07459177076816559,
        0.0021839423570781946,
        -0.07602401077747345,
        0.03553943708539009,
        -0.005583465564996004,
        0.0031245683785527945,
        -0.010664007626473904,
        0.018618037924170494,
        -0.04487255960702896,
        0.09312216937541962,
        0.022755932062864304,
        -0.02857103757560253,
        -0.04110118746757507,
        0.0022660233080387115,
        -0.03487164527177811,
        -0.11376451700925827,
        0.00015881417493801564,
        0.04633341357111931,
        0.035994499921798706,
        -0.01699448935687542,
        -0.017705179750919342,
        0.052230000495910645,
        0.002319726161658764,
        0.09444174915552139,
        0.04022742062807083,
        0.060665298253297806,
        -0.01625462993979454,
        -0.03934299945831299,
        -0.004073831718415022,
        0.06294509023427963,
        0.06548105925321579,
        -0.012701439671218395,
        0.014727798290550709,
        0.0938514992594719,
        0.0010685197776183486,
        0.018868541345000267,
        -0.11518615484237671,
        -0.0365607813000679,
        -0.030045032501220703,
        0.004317241255193949,
        -0.03503769263625145,
        -0.002202485455200076,
        -0.00980512984097004,
        -0.03461781516671181,
        -0.042172741144895554,
        -0.020654192194342613,
        0.03379163518548012,
        0.06272531300783157,
        0.0038041218649595976,
        0.006986900232732296,
        0.01834971085190773,
        -0.09609635919332504,
        -0.015481824055314064,
        0.042840372771024704,
        0.03601443022489548,
        -0.006138449534773827,
        0.07635275274515152,
        0.042957406491041183,
        -0.00802245456725359,
        -0.12189807742834091,
        -0.023541880771517754,
        0.027254024520516396,
        0.04943513870239258,
        -0.05923186615109444,
        -0.02914769947528839,
        0.03633177652955055,
        -0.0780075192451477,
        -0.034451406449079514,
        -0.01728365570306778,
        0.009009268134832382,
        -0.02073582075536251,
        0.02016095072031021,
        -0.014843698590993881,
        0.06916109472513199,
        -0.004412591923028231,
        0.04326292499899864,
        0.05855098366737366,
        -0.09438777714967728,
        0.0007327705388888717,
        0.06277085095643997,
        0.0491609200835228,
        -0.042270392179489136,
        0.04138284549117088,
        -0.003388638375326991,
        -4.775869300033264e-08,
        0.03985906392335892,
        -0.040543608367443085,
        0.01754835620522499,
        0.09079045802354813,
        0.07240231335163116,
        -0.05129668116569519,
        0.10016309469938278,
        -0.03295862302184105,
        0.050911642611026764,
        -0.029954200610518456,
        0.060953106731176376,
        -0.09596501290798187,
        0.02664518915116787,
        0.05338294059038162,
        0.05259588733315468,
        0.08712328225374222,
        -0.08389044553041458,
        0.10746375471353531,
        0.015617969445884228,
        0.057302042841911316,
        0.013917014934122562,
        0.0027250447310507298,
        0.043407369405031204,
        -0.061749041080474854,
        0.04365064576268196,
        0.03698921948671341,
        -0.07113457471132278,
        0.04300227388739586,
        0.0560060553252697,
        -0.0018392305355519056,
        -0.113890640437603,
        0.020974913612008095,
        0.020028311759233475,
        -0.04766089469194412,
        0.01928645558655262,
        -0.016334308311343193,
        0.030841298401355743,
        0.06377328187227249,
        0.08216966688632965,
        0.04818688705563545,
        -0.016161547973752022,
        0.0024855954106897116,
        -0.11570826172828674,
        0.021088728681206703,
        0.03651785850524902,
        -0.00917412992566824,
        -0.01883840374648571,
        -0.1180800348520279,
        0.03465551510453224,
        0.07706093043088913,
        0.02508247271180153,
        0.026616767048835754,
        0.03607170283794403,
        0.011860089376568794,
        0.009771517477929592,
        -0.026030637323856354,
        -0.03636021167039871,
        0.11440456658601761,
        0.015486398711800575,
        -0.007494930177927017,
        0.10769283026456833,
        -0.02906828559935093,
        -0.005947580095380545,
        0.10686132311820984
    ]
}