{
    "id": "YE0U018Copw",
    "title": "The correcting feature of typewriters is not what I thought",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2022-08-02T16:19:33Z",
    "video_url": "https://www.youtube.com/watch?v=YE0U018Copw",
    "category": "Science & Technology",
    "tags": [],
    "views": 2508953,
    "likes": 135621,
    "comments_count": 7671,
    "description": "I was really taken aback when I learned how this works.  Links 'n' stuff The Engineer Guy's video explaining the Selectric mechnism (It also has way better high-speed footage!)    Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   Oh, and look at these wonderful patrons! Philipp Sa, Kenneth Perronne, Mark Lewin, Victor , Jared Fry, Nathan Bergey, Steve Davis, Keiran Hillcoat, David Lefton, Chris O'Dea, Tyler, Jason and Katie Corradino, Alex Gartrell, Spencer R, William O'Driscoll, Sam Ellis, Christian Bikle, Christian Czekay, Andrew Backer, Jonathan Tunnell, Forrest P, FrenchSword , Mike, David Green, Marie and Peter, Kevin Rogers, Ian Greig, Jaye Martindell, UbiquitousChris, Luke Hogan, Brian Alvarez, Kevin Marty, Bram , Paul Adamski, Anders Madsen, Josh Jones, Chrono , Pietro Gagliardi, Kornel , Becca Roughton, Romans Bajevs, Fernando Martinez, David Carpenter, Density, Joseph Shivak, Ben Douglass, Brentton Paulus, Nicholas Bellamy, Noah Kantrowitz, Lauren Nodonly, Paul Schermerhorn, Colleen Dunseath, Tashlin Familiy, Lellius Rose, andritolion, Adi , Christopher Berger, Nathaniel Kren, Simon J, Chris Dion, RICHARD CROWLEY, EmpiricalFox, Alex, Thomas Schenck, Clark Marx, Sierrajulietalpha, Rambling Nerd, James Cooper, , Joe Athman, Stewart Smith, Timothy Conard, Ron A Goldberg, Jon S., Mike Dean, Kyle Van Essen, Trevin Beattie, Joris Lankhorst, Dennis Hulsman, Ryan Gordon, Buddy DarDar, Steve Washington, Stainless, John F. Woods, Lianne Schroeder, Stuart Young, Sugarschild, Emerick Touilloux, Kate Bates, William Carpenter, Seren Ward, Tyler Dare, Steve Stuart, Axel Kingsley, Nuck, RangerMankin, Yuriy Taraday, Michael Kelly, Aaron Nichols, Paul Z, Anthony Castelli, Tony Drake, Zachariah Elliott, Jacob Jernigan, Isaac Oxendale, kyle, Ryan the Human, Sean King, Martin Wilson, Rad , Syswrek, Brian Roediger, Andrew Newton, Kas, S. C., Randall, Ian Washish, Neil Sly, Connor Crowley, the-alchemist , Neil Enns, Lettow , Brian Place, monoirre , Roland Roberts, Kurt Yun-Doyle, Jaap van Muijden, Anatoly Tishaninov, Dan Coster, Tyler Young, naota3k , James Hartnett, Laketri, Logan Koch, Patrick Neary, Andrew Larson, Trevor Powell, Zachary Boe, Dan Stark, Danny Griffin, Cale Sugg, Philip , Tristen Locklin, Spirit Bear, GigaDan , Simon , Rick Walker, Amir Omidi, Robert Gilbert, Christopher McKeen, Sophie Wagner, Marc Chametzky, Matt Nunes-Spraggs, Blythy, Cameron Duncan, Madellyn S, Javier Marinkovic, Dahip95, Five-Toed Sloth Bear, Kevin Copeland, ZeosPantera, Joseph Schmigel, Harald Dehner, LegoZEV",
    "description_links": [
        "https://www.youtube.com/watch?v=bRCNenhcvpw",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Yknow, sometimes, as I desperately look for a topic to cover relatively quickly after realizing the one Ive been working on needs to be delayed indefinitely thanks to a thing I just discovered and need to investigate further, I find myself pursuing the bowels of my storage area. My hope is that between bouts of getting mad at myself for letting it deteriorate into the state its become, Ill find a thing which gets me out of this jam and hammering out a script. Fittingly, I glanced at my collection of typewriters sitting on the bottom shelf (are you really surprised I have a collection of typewriters?) and I realized I think its time for a Technology Correction! See, Im just old enough for typewriters to have been lingering on in my childhood. Even as personal computers, mature word processing, and consumer printers made them seemingly irrelevant, they were still handy for certain things. Like, for instance, addressing an envelope. Do you really want to faff with Word 95, figure out how to get your crappy inkjet printer to accept an envelope, probably experience a multitude of paper jams because you didnt realize its gotta go sideways, only to finally have what looks like success at last... until you see that the text is sideways because you didnt do the page setup correctly, or do you just stick the envelope in a typewriter and have at it? Lots of people would much rather just do it the old fashioned way, especially for one-offs. Once you know your way around a typewriter, well you can see exactly where its about to slap a letter onto the envelope. Its a much more manual process, sure, but also way more straightforward. Of course, eventually the whole printing onto envelopes business would get better, and also people just dont really need to do that very often anymore. Plus, setting aside the decreasing need to mail stuff, uh handwriting is and was always an option. So the typewriter would eventually fade into obscurity. Although a few models are still being made, believe it or not. Anyway, before they all got tucked away into attics, typewriters gained a very forgiving feature. Take a look; make a mistake, and just like that - the mistake is gone. Now Im sure that to some of you watching, the idea of a young whippersnapper such as myself being astonished by the correcting feature of a typewriter is laughable. But see, its not that it can do it that I find interesting its that I was completely wrong about how this works. You might think, as I did, that this is covering up the ink with a white substance, like correction fluid also known as white-out. And, ok, some typewriters did do that. But this one works with colored paper, so thats obviously not whats happening. What its actually doing is undoing what it just did. See, typewriters went through a change around the middle of the last century which fundamentally altered how they put letters on the page. And it was that change that made this possible. Compare the text written by a typewriter before and after this change. On the left we have an old-fashioned typewriter, and on the right a newfangled one. The newer typewriter has a much crisper and more uniform appearance to the text it produces. As a matter of fact this looks like it could have come from a modern laser printer. The other typewriter produced a much more gritty text. It doesnt have crisp edges, theres a vague texture in the solid parts, and in general this looks old-fashioned. Nevermind the typeface, this looks like how I imagine a typewritten document to look whereas the other text looks like, well, a printout of a Word document done in courier. What changed between these two typewriters? The ribbon. OK, a great deal more than that changed but the difference in the ribbon is whats responsible for the dramatically different text, and the ability to make it disappear. Before we get into that, though, I should probably give you a brief overview of a typewriter. [THUNK] Here we have a basic portable, manual typewriter. This is what I always thought of when I thought typewriter, which makes sense as this design was more or less the standard for half a century, with countless typewriters from many manufacturers all functioning more or less identically to this one. Each one of the keys is connected to a metal arm called the typebar which has on its end a small metal casting with two reversed symbols protruding from its surface. Those symbols just so happen to match the ones on the keys. Collectively, these typebars are known as the basket. This weird thing with the hard rubber roller bit back here is called the carriage and it holds the paper on which you intend to typewrite. With paper in place, as a key is depressed the type bar leaves the basket and approaches the paper. As that happens, an ink-soaked ribbon is lifted upward so that it comes between the typebar and the paper. With sufficient force, the protruding symbol on the typebar presses through the ribbon and contacts the paper. That will transfer some of the ribbons ink to the paper in the shape of the protruding symbol, and the end result is that symbol appears on the page. Pretty striking. After that happens, the ribbon moves out of the way so you can see what youve just typed. The semi-soft surface of the rubber roller, which by the way is called the platen, helps the ink transfer happen more completely by allowing the typebar to press into the paper ever-so-slightly. You may have noticed, possibly because I told you, that every typebar has not one, but two symbols on it. For the letters of the alphabet, those are the lower- and uppercase version of each letter, and for the other keys its whatever two glyphs the manufacturer decided belong on that key. Selecting between them is accomplished with these; The shift keys. And pressing them shifts the location of the typebasket into the machine so that the top of each typebar is what will hit the ribbon and paper. This machine, like most, also features a shift lock which is simply a latch which holds down the typebasket. You release it by pressing either of the shift keys until its released. Because this thing is entirely manual and the typebasket is, yknow, metal and heavy this is a pretty clunky experience. This is just not easy to use. Heres a Technology Connection for you; ever wonder why the keys on a keyboard are so weirdly staggered? If youve never noticed it before, nearly every keyboard out there doesnt arrange the keys on a neat grid, and instead each successive row is shifted over, and even more weirdly, its a different amount from row to row. See, the row below the numbers is shifted over half the width of a key, with the second rows keys centered below the gaps in the first row. That kinda makes sense but the third row is only shifted over by half as much from the second. That is a relic of the typewriter that lives on! Since in a typewriter the keys are arranged in four rows, and every key acts upon a single typebar in a linear arrangement, every row of keys has to be shifted over a bit to keep the linkages between key and typebar from landing on top of one another. Typewriter manufacturers could have designed the keys with different attachment points to the linkages to get around that but that almost never happened, and the staggered-key arrangement became standardized. With so many people used to a keyboard with this staggering, it didnt make sense to mix it up. And even once they had become simple buttons on computer keyboards the staggering was retained to give typists an easier transition. And were still doing it because the only thing better than perfect is standardized! In typewriters with a typebasket, the carriage (and thus the paper) moves as you type. That's probably why its called the carriage. This allows a much more compact design since the machine only needs to be large enough to contain the typebasket and keyboard. And really its the only practical way to go about it since the keyboard and typebasket are part of the same bulky mechanism. So, a line of text is started with the carriage all the way... to the right, and each press of a key moves the carriage to the left one space in preparation for the next keystroke. The space bar does the same thing but without actually typing anything, allowing you to leave a gap between characters because thats how words work. Some typewriters, particularly those that write in languages that used accent or other diacritic marks, have some so-called dead keys which dont move the carriage when you press them. That allows you to, say, type an accented e by first hitting the accent mark, which would slap it down but not move the carriage, and then hitting the e key. That could have been accomplished with a backspace between two keystrokes, but when your language uses those marks a lot, dead keys are much more convenient. Anyway, as you keep on typing and approach the end of a line, the carriage will ring a little bell [adorable ding] to inform you that you have only about ten characters left before you hit the right hand margin, so either finish this word or get ready to hyphenate and start the next line. Starting the next line is accomplished by using this chrome bar, called the carriage return, which returns the carriage to the starting point. And thats customizable - these little tabs back here can be moved, and they define the margins of the page. The left tab defines where the carriage stops when you return it really handy for addressing envelopes! And the right tab triggers the little bell ten characters ahead of where it sits, warning you youre near the end, and then stops the carriage at that point and keeps you from typing. This key, labeled M-R, is the margin release key which allows you to override the end stop in case the word youre working on is just one or two characters too long and youre willing to break the margin for it. The margin-release key also allows you to go beyond the starting point if you hold it down while returning the carriage. Now, before this turns into a typewriter trivia tangent, which I suppose too late. Uh, lets just get back to the meat and potatoes of the ink and the ribbon. This typewriter, like many others, uses a simple ink-soaked cloth ribbon for making letters happen. Thats why the text it produces has that texture; youre seeing the weave of the ribbon come through. And since this is ordinary ink on ordinary paper, if you make a mistake you have few options. Special hard erasers for typewriters were available, and they would really just sand off the top surface of the paper and thus the ink from that spot. And of course once correction fluid hit the mainstream, there was that option, too. But with a change in the typewriters ribbon, we would get not only crisper, darker text, but wed get the ability to undo our mistakes without leaving a trace. This monster of a thing is an IBM Selectric III. Thats right, III. The Selectric series of typewriters is as iconic as it is fascinating. Instead of a basket of typebars, these typewriters use an interchangeable typing element, known informally as the typeball and even more informally as the golf ball. The typeball sits inside of a moving type head. In this typewriter the paper is stationary and the typeball moves along the papers length as you type. The entire mechanism is powered by an electric motor, and pressing a key causes an amazingly quick and yet somehow still precise Rotate, Pitch, Wham maneuver, with the exact character you selected slamming into the ribbon and making a mark upon your paper. It will forever be astounding to me that this machine manages to make all that happen in the blink of an eye, and with absolutely no perceptible variation between character landings. I mean, the text from the manual typewriter, which isnt doing anything near as complex as this, is not consistent at all, but this whacky ball thing manages to rotate and tilt into place with such consistency that fancy script fonts like this one work perfectly! Did I mention you could get different fonts for this thing? And it can do either 10 or 12 characters per inch! Now this video isnt about this typewriter. If you would like a better understanding of how this works, you should check out The Engineer Guys amazing and also way more concise than I could ever manage video on the subject. Ill put links in all the places. What I want you to notice is the ribbon. The typewriter has one, of course, but its nothing like the fabric ribbon weve been looking at. If I remove it... you can see (after I almost tore it) that its very very thin, and we can also see the letters that have been typed. Not great for sensitive locations; destroying these ribbon cartridges was often a matter of national security. Anyway, these polymer ribbons are what make the text so crisp compared to the cloth ribbons of ye olden times. But, yeah, theyre also not what allows the correcting feature. IBM introduced carbon ribbons in 1949. Or maybe 1937. Yeah it's not clear. Also I cant even tell for sure if those are polymer ribbons. Anyway, its not important, polymer film ribbons allowed for complete transfer of their pigment material to the paper. Theres undoubtedly some fascinating materials science that went into making the carbon stick to the paper which I am not even going to try to explain, but the end result was very dark, very crisp text on the page. The biggest disadvantage to this was that the ribbons were single-use, though being quite thin they lasted a long time. Oh also you can see everything that was written with that ribbon, which as I mentioned may not be desirable. This particular ribbon, though, is different. It works just the same as any polymer ribbon, but some even more fascinating materials science was done to it to make the pigment not quite so sticky. This is a correctable film ribbon, which first made an appearance in the Correcting Selectric II in 1973. It does a decently fine job sticking to paper, but its adhesion is just weak enough that with a bit of adhesive tape it can be lifted off. This white tape sitting near the ribbon is really just sticky tape, and when you press this key below the keyboard, the type head moves back one space and when you next press a key, it will lift the sticky tape into position instead of the ribbon. By smashing the same letter at the paper through the sticky tape, a very strong bond between the tape and the pigment is made. So, the pigment gets yanked right off the paper like nothing ever happened. At least mostly. It usually takes a few hits to completely remove a letter. Since this typewriter is purely mechanical, the correcting feature is fully manual. To undo a mistake, its best to hold down the correcting key and then hit the erroneous letters key a few times. Usually after the third strike, we have lift-off. The typewriter I showed you in the very beginning is a much newer, fully electronic typewriter. It uses a daisy wheel for its typing elements, a mechanically simpler arrangement than the IBM golf ball but which requires electronics to monitor its position as it spins and fire the striking solenoid at precisely the right time. Since it has those brains (and it uses them for other stuff, too, like spell-checking and line-by-line previewing if thats your jam) it knows the last letter it punched out, and so simply hitting the correct button performs an automatic backspace and three whacks with the correcting tape. In fact if you want you can have it correct an entire word. Now you might think that the ability to lift the words right off the page means the documents produced with these typewriters must have poor resiliency. But theyre actually quite durable. If I use the back of a pen, I cant rub these markings off. Theyre really on there. Using an X-acto knife blade I can scratch them off, but its not any easier than scratching the toner off of a modern laser-printed document. The typewriter can take its words back so effectively because its not just the adhesion of the correction tape that does the job, its the fact that in the typewriter the same typing element that left the mark in the first place also applies the correction tape to the paper. That means its being pressed *hard* into the offending letter and, crucially, nowhere else on the paper. Only the pigment is getting touched by the correction tape. Yes, if you put a piece of Scotch tape, use something to apply pressure, and lift it off youll end up with some of the text on the tape. But even then you dont get it all and youre likely to take some of the paper with you. I know I can get fascinated easily, but I think this is remarkable. I never imagined that a typewriter could play textual take backsies. That just seemed well outside of the realm of possibility! I didnt know that these letters aren't made with ink, so I thought the only possible cover-up was a cover-up. Now, as I said earlier there were correcting typewriters that typed in ink and did put a white powder atop mistakes. As a matter of fact, the Correcting Selectric typewriter could be used with a standard inked ribbon, and a non-adhesive, white correction tape would simply hide your mistakes. But of course that only worked with white paper, and I cant imagine that worked nearly as well as lifting the text off. Even if it did a fantastic job, you could always shine light through the paper and see that mistakes were made. Of course, if you were making carbon copies, well this wouldnt work. I mean, it would for the top one, but all the copies below would be royally messed up. Then again by the time this feature hit the market, photocopiers were common in the office so carbon copies werent too much of a thing anymore. And actually photocopiers were a way to get around noticeable error correction using white-out. Yeah you could see the blob of white goo on the original, but copies will hide that swimmingly. Anyway, I think thats it for now. It may not surprise you to learn that I wrote quite a lot more about typewriters before trimming this down. Like, for instance, how its actually kind of strange that this manual typewriter has a 1 and exclamation mark key. It was common practice for that key to just not exist! And a lowercase L would be typed for the numeral one, and an exclamation mark was better known as \"period backspace apostrophe.\" I was going into a really deep dive on this machine and others before realizing maybe I should cut to the chase. This was supposed to be quick after all. At least as quick as I can manage. But hey, if you all like this video, maybe Ill revisit the topic later on. Its genuinely surprising just how many of our modern word processing conventions can be found right here in mechanical form. typographically smooth jazz typewriters sitting on the bottom shelf. Are you really surprised *sigh* Oh, thats a live spider! I saw that this web was here ooh. Or, doyou just stick it in the env BBPPBP Dont really need to do that much ah haaaa Thats obviously not whats doing. This looks like this couldve been come [flailing] In typewriters with a typebasket, the carriage and thus the ahh! Oh.. Yeah, no thatshoulbe. Some typewriters... But its adhesion is just weak enough [hits typewriter with hand] that. Well that didnt work, did it? If you've never used a fully manual typewriter before, gosh is it not fun. The key travel is something like an entire inch - your fingers are powering the whacking, after all - so I cannot touch type with that thing at all. You didn't get to see an electric version of the same design - a motor does the whacking for you! If we cover this again I'll show you that fella. Much, MUCH easier to use. 'kay bye",
    "transcript_keywords": [
        "typewriter",
        "paper",
        "ribbon",
        "key",
        "keys",
        "carriage",
        "text",
        "manual typewriter",
        "tape",
        "thing",
        "ribbons",
        "Correcting Selectric typewriter",
        "typewriters ribbon",
        "correcting",
        "typebar",
        "word",
        "Correction",
        "correction tape",
        "ink",
        "make"
    ],
    "transcript_entity_values": [
        "1937",
        "third",
        "half",
        "over half",
        "1",
        "Rotate",
        "IBM",
        "two",
        "1949",
        "1973",
        "the first row",
        "ten",
        "Wham",
        "the third row",
        "Scotch",
        "half a century",
        "only about ten",
        "12",
        "a Technology Correction!",
        "four",
        "one",
        "first",
        "between two",
        "Selectric",
        "a Technology Connection",
        "10",
        "second",
        "95",
        "Selectric II",
        "three"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "LAW",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.10264640301465988,
        -0.09285037219524384,
        0.06718181818723679,
        -0.003544458420947194,
        -0.04737193509936333,
        -0.0029725944623351097,
        0.008136521093547344,
        0.0259736105799675,
        0.03698498383164406,
        -0.015453659929335117,
        -0.06322876363992691,
        0.06991306692361832,
        0.0009882058948278427,
        0.006866875570267439,
        -0.05594697222113609,
        -0.023904891684651375,
        -0.006400321610271931,
        -0.11978843808174133,
        -0.027834851294755936,
        0.02756132371723652,
        -0.02137317694723606,
        -0.0318588986992836,
        0.026675870642066002,
        -0.004620878957211971,
        0.04313569888472557,
        -0.05468720570206642,
        -0.066744863986969,
        -0.047272760421037674,
        0.050607744604349136,
        -0.02772464230656624,
        -0.10679933428764343,
        0.12701700627803802,
        -0.010484735481441021,
        0.025848805904388428,
        -0.0028037289157509804,
        0.0049310592003166676,
        0.009539248421788216,
        0.07819466292858124,
        -0.0485692098736763,
        -0.03481347858905792,
        -0.004686789121478796,
        -0.11051035672426224,
        0.031293198466300964,
        0.052851930260658264,
        0.03706423565745354,
        -0.042271532118320465,
        -0.014635434374213219,
        -0.042265385389328,
        -0.05150900408625603,
        0.009491076692938805,
        -0.0832771584391594,
        -0.029691535979509354,
        0.06264127790927887,
        -0.04315312206745148,
        -0.04262127727270126,
        -0.006829787045717239,
        0.022783370688557625,
        0.03895031288266182,
        -0.009786166250705719,
        -0.007569119334220886,
        0.022375857457518578,
        -0.011664608493447304,
        -0.09558088332414627,
        -0.01733577437698841,
        0.040465787053108215,
        0.07561078667640686,
        -0.028020329773426056,
        0.058704834431409836,
        -0.02522237040102482,
        -0.055697549134492874,
        -0.035609371960163116,
        0.016595998778939247,
        0.004364683758467436,
        0.042634017765522,
        0.1107616275548935,
        -0.0764702558517456,
        0.06825975328683853,
        -0.051170554012060165,
        0.05105172470211983,
        -0.06677019596099854,
        -0.007503983564674854,
        -0.01175161637365818,
        -0.03542923182249069,
        0.052339036017656326,
        0.007197313476353884,
        0.06071708723902702,
        -0.0003173264558427036,
        0.027845606207847595,
        0.019640915095806122,
        0.04329407960176468,
        -0.04055164381861687,
        -0.044827841222286224,
        0.10104173421859741,
        -0.05333763733506203,
        -0.07616695016622543,
        -0.00987078994512558,
        -0.012589883990585804,
        -0.012574606575071812,
        -0.033054374158382416,
        0.07568814605474472,
        -0.021926583722233772,
        0.04381871968507767,
        0.01299533061683178,
        -0.047566890716552734,
        -0.032276369631290436,
        -0.052886396646499634,
        0.02900753542780876,
        0.01257790345698595,
        0.07642985135316849,
        -0.048933230340480804,
        -0.017991896718740463,
        0.07210084050893784,
        -0.06561018526554108,
        -0.018761251121759415,
        -0.08674542605876923,
        -0.025923551991581917,
        -0.07667127996683121,
        0.03190143406391144,
        0.0985807478427887,
        0.018468031659722328,
        -0.03513447195291519,
        0.026313835754990578,
        -0.08689109236001968,
        -0.030544370412826538,
        0.060880523175001144,
        -0.0561947375535965,
        -0.0027221159543842077,
        8.817963525853697e-33,
        0.018621046096086502,
        0.13986577093601227,
        0.04053705558180809,
        0.06464605033397675,
        0.034159209579229355,
        0.046150874346494675,
        -0.10148296505212784,
        0.0053992969915270805,
        -0.10209581255912781,
        -0.06020797789096832,
        0.017405342310667038,
        -0.019345350563526154,
        -0.002848748117685318,
        0.06229359656572342,
        -0.00830572098493576,
        -0.057619087398052216,
        -0.056142859160900116,
        0.033269185572862625,
        -0.08509218692779541,
        0.00019261598936282098,
        0.028058772906661034,
        0.0545412041246891,
        0.03779628127813339,
        0.00601978600025177,
        -0.03021337278187275,
        -0.011227436363697052,
        -0.016435686498880386,
        0.05699038505554199,
        0.07756919413805008,
        0.023107344284653664,
        -0.06671524792909622,
        -0.009911125525832176,
        -0.01754683069884777,
        -0.06564810127019882,
        0.029751388356089592,
        0.013341299258172512,
        0.016303643584251404,
        -0.157149538397789,
        0.09143321961164474,
        0.05240703746676445,
        -0.0812201127409935,
        0.07869008928537369,
        -0.0027707626577466726,
        -0.02000175416469574,
        -0.0439828597009182,
        0.06026022136211395,
        0.056914594024419785,
        0.08199787139892578,
        -0.007712808437645435,
        0.0412573367357254,
        -0.046220507472753525,
        0.02925947494804859,
        0.030796706676483154,
        -0.019828882068395615,
        0.08195985853672028,
        -0.028058256953954697,
        0.019242217764258385,
        -0.0003651843289844692,
        0.06844524294137955,
        -0.019723720848560333,
        0.06741993874311447,
        0.09755192697048187,
        -0.025809619575738907,
        0.043776851147413254,
        -0.09325338155031204,
        0.05008070543408394,
        -0.0140612181276083,
        0.00405471958220005,
        0.09273210167884827,
        -0.021265773102641106,
        -0.01909777708351612,
        0.010086282156407833,
        -0.0815451443195343,
        -0.0052952272817492485,
        -0.01858997903764248,
        0.05134592950344086,
        -0.051076650619506836,
        -0.004548728000372648,
        0.06294924020767212,
        0.03131094574928284,
        -0.005222254898399115,
        0.012718215584754944,
        0.0028754700906574726,
        -0.027934860438108444,
        0.02464502863585949,
        -0.06938295066356659,
        -0.001741073909215629,
        -0.056853342801332474,
        0.05304756015539169,
        0.02349431812763214,
        -0.008406214416027069,
        -0.037537410855293274,
        0.023177385330200195,
        -0.024913350120186806,
        -0.04988304525613785,
        -7.431473816530563e-33,
        -0.07845249772071838,
        -0.0236715879291296,
        -0.05331773683428764,
        -0.0010512818116694689,
        0.011974107474088669,
        -0.047878872603178024,
        0.07708757370710373,
        -0.04017338156700134,
        0.10091212391853333,
        -0.013936753384768963,
        0.07624343037605286,
        0.03220237419009209,
        -0.0652376338839531,
        -0.0982823297381401,
        -0.060121964663267136,
        -0.07686440646648407,
        -0.046603236347436905,
        0.038282327353954315,
        0.04058469459414482,
        -0.06373109668493271,
        0.07596742361783981,
        -0.04037342593073845,
        -0.06275095790624619,
        0.13016735017299652,
        0.04918542876839638,
        0.04979108273983002,
        -0.028637392446398735,
        0.07180096954107285,
        -0.01531489472836256,
        -0.008103637024760246,
        -0.013014081865549088,
        -0.018257727846503258,
        -0.034048862755298615,
        0.038553912192583084,
        0.02480386383831501,
        0.03784005716443062,
        0.018480829894542694,
        0.09243703633546829,
        0.03433162346482277,
        -0.04387487471103668,
        0.06812132149934769,
        -0.03257252648472786,
        0.0002720134216360748,
        0.02307157777249813,
        -0.060863055288791656,
        0.02789584919810295,
        -0.07290532439947128,
        -0.048671968281269073,
        0.00053542444948107,
        0.04502197355031967,
        -0.006046593654900789,
        -0.0018900129944086075,
        0.03132801502943039,
        -0.07386491447687149,
        -0.05612830072641373,
        0.0030479233246296644,
        0.0752427875995636,
        -0.07027007639408112,
        -0.025582732632756233,
        0.05791091546416283,
        -0.03684330731630325,
        -0.014659498818218708,
        0.0968133881688118,
        0.015524557791650295,
        0.05975719913840294,
        -0.17732322216033936,
        0.046866487711668015,
        0.02340250089764595,
        -0.06283418834209442,
        -0.015577728860080242,
        -0.015374632552266121,
        -0.03377389535307884,
        0.028397683054208755,
        -0.06703345477581024,
        0.017634043470025063,
        -0.06281901895999908,
        0.05909379944205284,
        0.005139816086739302,
        -0.03638065978884697,
        -0.014180807396769524,
        -0.01577577367424965,
        0.0312334056943655,
        0.06754159927368164,
        0.035148054361343384,
        0.06128321960568428,
        0.11579542607069016,
        0.01032150350511074,
        0.051391247659921646,
        -0.029442869126796722,
        0.07857418805360794,
        -0.008561061695218086,
        0.046640943735837936,
        0.08585572987794876,
        0.03219843655824661,
        -0.01891045831143856,
        -8.050574962226165e-08,
        -0.0049363658763468266,
        -0.043944768607616425,
        -0.0503527894616127,
        -0.02275870367884636,
        -0.03588979318737984,
        -0.08198830485343933,
        0.00045834059710614383,
        -0.05693432688713074,
        -0.02013157680630684,
        -0.011964668519794941,
        -0.0048233927227556705,
        -0.043842703104019165,
        -0.020363951101899147,
        0.0022518618497997522,
        0.1486341655254364,
        0.025351131334900856,
        -0.0018543573096394539,
        -0.02144509181380272,
        -0.11860772967338562,
        -0.071071095764637,
        0.05145060271024704,
        -0.02229015715420246,
        -0.034331608563661575,
        0.016393061727285385,
        0.023708920925855637,
        0.06610964983701706,
        -0.0489836186170578,
        0.029518671333789825,
        -0.026717940345406532,
        0.010407349094748497,
        -0.06031748652458191,
        0.017406167462468147,
        -0.059502970427274704,
        0.01876073144376278,
        0.016145134344697,
        0.0009092667023651302,
        -0.0016045303782448173,
        0.025451945140957832,
        0.04461642727255821,
        0.07919854670763016,
        0.014710897579789162,
        0.03910815343260765,
        -0.00529647758230567,
        0.096402607858181,
        0.12239740043878555,
        0.004564465954899788,
        0.03438737988471985,
        0.011284596286714077,
        -0.003114172490313649,
        -0.034112438559532166,
        0.017772482708096504,
        0.020908180624246597,
        0.011793388053774834,
        0.016794463619589806,
        -0.005124931689351797,
        0.02599732205271721,
        0.0003976997104473412,
        0.03999665752053261,
        0.038880135864019394,
        -0.010387704707682133,
        0.07714738696813583,
        -0.025622261688113213,
        0.01905038394033909,
        -0.0029229705687612295
    ]
}