{
    "id": "yF1N0-XCKN4",
    "title": "Can cheap earbuds still deliver? - OnePlus Nord Buds 2",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-04-26T19:05:45Z",
    "video_url": "https://www.youtube.com/watch?v=yF1N0-XCKN4",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "oneplus",
        "nord",
        "buds",
        "earbuds",
        "tws",
        "headset",
        "mic",
        "cheap",
        "budget",
        "affordable",
        "music",
        "audio",
        "entry"
    ],
    "views": 200121,
    "likes": 6614,
    "comments_count": 197,
    "description": "Looking for your next tech upgrade? Check out Newegg at   James has tried a lot of higher end earbuds, but sometimes it's nice to go back to basics and see what you can get on a more limited budget. Luckily, OnePlus is here with their new OnePlus Nord Buds 2 that shed some of the features from their OnePlus Buds Pro 2 counterparts while hopefully maintaining enough to be a compelling product.  Check out the OnePlus Nord Buds 2:  Buy OnePlus Buds Pro 2:  Buy Bose QuietComfort Buds 2:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 AirPods are expensive 0:18 Unboxing 0:52 Build quality and design impressions 2:59 Audio quality impressions and Labs' results 6:00 Sponsor - Newegg 6:32 App walkthrough and EQ/Control options 10:09 Fit and battery life 11:18 Mic quality testing 12:20 ANC and overall thoughts 13:02 Outro",
    "description_links": [
        "https://lmg.gg/newegg",
        "https://lmg.gg/dgcVa",
        "https://geni.us/q68g",
        "https://geni.us/EjQ5",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Sure we all want AirPods, but can you afford them? These are just $60, and if you're gonna spend just $60 on some earbuds, it's nice to get 'em from a brand you recognize. These are from OnePlus. They are the Nord Buds 2. Nord is their kind of more budget entry level product line. They got Nord phones and Nord buds. Let's see what they're all about. Box opens from the bottom. That's a mistake. Ah, there they are. What else is in the box? So I'll open those in a bit. Crazy. You do still get the red cord even if you don't get the red box. These must be extra ear tips. No one opened it though. I get the pleasure. Hey, what's this? A crazy eyes emoji. I will say they picked a good one for me 'cause I'm crazy. Simple stuff. Now let's get to the case. Oh god, it's not easy to just swipe these away. Kind of like a paper peel on here. Ooh, it's not a terribly premium feeling case. I would say it's the lid particularly has a bit of a cheapness to it. But I do like this speckled, kind of birthday cake looking bottom, which is reminiscent of other products that are made partially with recycled materials. Like if you've seen shoes like that, which I think looks cool. USB-C port on the back for charging, as well as a button. That's gonna be your pairing button and I press it. There's a light on the front that's probably gonna light up. No? Okay, maybe I need to open it. There it is. The hinge feels decent. I've smacked worse. Really flat kind of design on the inside. The earbuds themselves also appear to have that the speckled recycled materials look. It almost just looks like you got a dirty earbud. And then is there, are there speckles in the actual glossy part of the bud here? It looks like not. That kind of looks like your bog standard, almost like has a ceramic look. And if I pull one of these puppies off, got your little grid there, your little, got your little lattice, typical speaker grill, trying to keep your ear wax out. No indicators for left and right. I just chuck 'em in there however they fit. I guess you get used to it. As far as the industrial design, I'm of two minds about it. On the one hand, you have this like mixed media with the recycled part and the non-recycled part which makes it look kind of tacked together and I dunno, it kind of diminishes the cohesion of the piece. But on the other hand, it does look quite minimal. I like the flatness of it. When it's in your ear and you can't see the glossy part, you know you can only see one half of it, and that one half has a cohesive design. So I think it probably looks pretty good like that? Pretty small. Now that I figured out which way they go, I will say that this, it feels like it has a pretty good seal and I'm getting a lot of passive isolation without the ANC being on at all. And they feel pretty comfortable for the first five seconds. You know, I haven't worn these for an hour and my odd shaped ears, particularly the left one, start hurting me. Ah, they feel like they're in there pretty good. Let's check out how they sound. Subjectively and objectively. Have a bunch of data from the lab about how these things measured, but I think it'd be weird to look at that without listening to them myself a little bit first. So I'm gonna do that now. Let's get these paired. I have a OnePlus phone with like 1% battery. Thanks Linus. Just joking. It's 35% 'cause it charges so fast. I'm in a Destiny's Child kind of way right now. Holy cow, the bass! (laughs) That's overcooked for sure. This song is all just acapella, nice women's voices, and then it's like bonk, bonk. And that's fine for R&B. But what happens when I go to like a metal song? \"Master of Puppets\" is good and fast. So the bass is kind of manifesting more as like a really thumpy kick drum and less of a big bassy boom kind of thing. Although that makes me want to listen to some Chili Peppers. You know, Flea slapping the bass? Yeah, in this track, the bass is really just like shooting, shooting at your eardrums. All right, I can predict what the graphs are gonna look like. Here they are! So first off, we have a basic frequency response graph and you can see that the bass is definitely pumped up. Can be great for bass heads, EDM fans maybe. I want a five frequency response curve. This is pretty much there when it comes to the mids and treble. It's pretty nice. This next bit of data I have applies to the different presets that come loaded into the app, which we'll look at at a second. The first one is a bass boost, which is as you can see, just more of the same. Then there's bold, which cranks up the treble just a little bit, and serenade which does that even harder. Then there's active noise canceling which these earphones do have. You can see the green line is with ANC on, red is with it off. And then the white is just if you didn't have the earphones at all. That's the noise you'll be hearing. And so the lower the line, the quieter it is. You can see though that the ANC actually does produce a noise floor. There's a little bit of a hiss. Whether or not it bothers you, it's up to you. Let's see if it bothers me. Oh, the Chili Peppers! (laughs) They're still going. They're like 55. So the ANC's on now and the music's playing and it doesn't really sound worse but I bet I can notice the hiss if I pause the music. I can't really notice it. I'm not like lying in bed right now, but. Oh wait, I can notice it now. I thought that was just my own head and blood. But no, there it is. With music playing, didn't notice it. So decent performance for 60 bucks especially in the mid and treble. And if you're into a lot of bass, then that could be great value for you. Now let's get into the other aspects that can make or break an earphone. The interface, the app, the buttons, the battery life. Right after this message from our sponsor, Newegg. Looking for the latest technology to upgrade your gaming rig, home office, or entertainment setup? Look no further than Newegg! As one of the largest online retailers of computer hardware, software, and electronics, Newegg has everything you need to take your digital life to the next level. They offer competitive prices, fast and reliable shipping, 30 day hassle-free returns, and excellent customer service to ensure you have the best shopping experience possible. So whether you're a tech enthusiast, a gamer, or you're just looking for the latest gadgets, Newegg is the go-to destination for all your tech needs. Check 'em out at lmg.gg/newegg. All right, I've got the HeyMelody app. Loaded up on my pixel phone 'cause the iPhone and the OnePlus were giving me problems, but it's here now. The scanning worked and I can see the buds. Got your battery indicators, your toggles for the noise canceling and transparency mode. Sound master EQ, which is gonna have our yep, bold, serenade, and bass EQ presets. Is there a custom? Yes there is. Let's check that out. One, two, three, four, five, six different knobs to mess with. Plus or minus six dB. Can we have multiple, like can I name it? Custom one, confirm. Call that custom two, confirm. There they are. Excellent. Bass wave dynamically boosts the bass to deliver deep bass with clarity and fidelity. I believe this is a more algorithmic type thing. Strong and weak. Let's try that out. All right, I'll put this on super weak, super strong. Oh yeah, it's, there's a little bit of latency before it pops in, but, holy, it's like bad levels of thumpy now. This must apply to a kind of a wide swath of bass frequencies because you can hear like not only like the kick drum for example, or the bass guitar getting jacked up, but also just a general feeling of fullness or emptiness when you put it down to weak. So I think it applies to at least a hundred hertz of bass, maybe even up to like 250. This BassWave thing is kind of weird. Let me read you what they say. \"It compensates for weak bass pitches and only slightly for strong bass.\" That makes me think that it almost brings bass to like a certain level or within a song, it's just bringing the bass up to like a ceiling so it's more consistently high. That would be weird. \"Which lets you enjoy top quality of voice calls, your favorite playlist, or it can be the volume adjuster for your go-to game.\" Why would they say that? It's bizarre. Another thing, just while we're on it is I took these out of my ears and the music continued to play. They don't have the auto pause. All right, let's get outta here. Let's check out the interface. I think there's a little feedback noise when you hit it. Yeah, there's a little tick. And there's a tick when you pause it too. You can't hear that second one very well because you know, music's playing when you press it. Oh, it just goes between transparency and noise cancellation, interesting. Oh, here it is. Earbud controls. Its own tab. Left and right. I can make... Dang it! They're not gonna give me as much customization as I want. On the single tap, I can make it do nothing or I can make it play/pause. On the double tap, I can make it do nothing or play/pause, previous, next, voice assistant, game mode. So I'm guessing that right now double tap is next on this earbud. There's no option to make it do volume, which is annoying. Interestingly, there's actually two types of touch and hold. There's your regular touch and hold which takes like three seconds and switches between the ANC and transparency. Oh this is weird. Oh sweet. They do it with like a checkbox thing. Yes, you can make it so it switches through all three of the ANC, transparency, and nothing. But the other interesting thing is there's a longer touch and hold, which is by default set to nothing, but you can set it to switch devices. That could be pretty cool. In my experience, those features where it's like you can pair your earphones to your laptop and your phone, it'll intelligently switch between them, has never, literally never ever worked for me. So it's cool that you can actually bind that to a button. I still wouldn't expect it to work. I give it a B plus, you can customize some things, but they don't give you total control, and there's no auto pause. As far as fit, they feel very in there. You could definitely work out with these things. You could head bang with these things. They're IP55 rated, which is better than normal. Your typical cheapo earphone is gonna give you IPX4. The X meaning that they didn't even rate the dust protection and the 4 meaning it's good for like splashes and sweat, but 55 is better. God, these just keep turning back on, go! Put 'em away, go! We'll put 'em away in this case which can give you 27 hours of battery life, purportedly. The buds themselves five hours. Now these figures are with ANC on and using the Kodak AAC. It also supports, you know, the regular Kodak, what's that called? Like SBC or something like that? That every Bluetooth, literally everything ever has. There's another figure they give you which is a little more nebulous to me. It is in 10 minutes of charging you can get five hours but they don't really specify what the five hours is. I think it means five hours of calls. The other thing is that they kind of implied that the fast charging not only applies to just fast charging the case, and then the case having to slowly charge the buds, but actually applies to both the case and the buds, which is super cool. If I'm reading that right, that's a cool feature. Next I wanna check out the mic quality during calls because they say they use two microphones and some AI algorithms to remove a bunch of noise. So I'm gonna go outside where it's windy and there's trains and crap. And let Jake Bellavance sit in this chair and show you the quality coming through. - What's up gamers? (laughs) The seat's hot. His butt should not be that warm. Hello? You're on speakerphone. - [James] Hey, is this short circuit? - Yeah, why don't you tell us the story? - [James] Well, I'm just standing out here in the parking lot. It's pretty windy, and there's various LMG employees walking around, including one Nick Light walking towards me now, he's waving with both hands. What a good looking guy. - [Nick] How's it going? - [James] He's trying to talk to me. I really hope you can't hear it. I'm running away now. I'm running! Okay, I'm gonna hang up. Bye. - That sounded okay. (laughs) - So how was it guys? - [Jake] That was fun. It sounds okay. (both Jake and James laughing) - As far as the quality of the ANC, I think it's okay. I did not find that there was a lot of pressure on my ears with the ANC. Now there's no tuning ability with it. Like you can find some other apps and I'm sure it's not as good as what the AirPods have these days, which is crazy. Like these probably aren't gonna help you very much with babies crying. So final thoughts. I think you could do worse than this for the price. I think you could do worse than this and pay more. There's a couple features that are missing, but overall, you're getting so much in these things these days that like five years ago wasn't possible. Like the quality, all the features, the ANC, all that for 60 bucks? Man, pretty good. I don't hate these. Thanks for watching guys. If you like this video, maybe check out another earphone unboxing we did for earphones that cost more. And then click on that affiliate link so I get more money. My pay doesn't work that way.",
    "transcript_keywords": [
        "bass",
        "ANC",
        "kind",
        "pretty",
        "pretty good",
        "good",
        "Nord Buds",
        "thing",
        "make",
        "Nord",
        "bit",
        "noise",
        "Buds",
        "Newegg",
        "things",
        "check",
        "case",
        "give",
        "pause",
        "hours"
    ],
    "transcript_entity_values": [
        "10 minutes",
        "AirPods",
        "HeyMelody",
        "Jake",
        "three",
        "an hour",
        "OnePlus",
        "chuck",
        "One",
        "4",
        "one",
        "SBC",
        "LMG",
        "Newegg",
        "EQ",
        "one half",
        "iPhone",
        "themselves five hours",
        "Master of Puppets",
        "60 bucks",
        "EDM",
        "like three seconds",
        "27 hours",
        "Jake Bellavance",
        "Nord",
        "ANC",
        "dB.",
        "second",
        "all three",
        "Flea",
        "the first five seconds",
        "30 day",
        "35%",
        "1%",
        "five years ago",
        "first",
        "these days",
        "Nick Light",
        "two",
        "the five hours",
        "55",
        "four",
        "EQ",
        "five hours",
        "James] Hey",
        "Kodak",
        "Linus",
        "250",
        "just $60",
        "six",
        "five",
        "2",
        "55",
        "James",
        "Bass",
        "at least a hundred"
    ],
    "transcript_entity_types": [
        "TIME",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "PERCENT",
        "PERCENT",
        "DATE",
        "ORDINAL",
        "DATE",
        "FAC",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.045935675501823425,
        -0.02318059280514717,
        0.027248313650488853,
        -0.06160533428192139,
        0.040883492678403854,
        0.015593447722494602,
        0.020305834710597992,
        0.05530969426035881,
        -0.05620592087507248,
        0.018350252881646156,
        -0.0213908813893795,
        0.03361031040549278,
        0.008343169465661049,
        -0.06037474051117897,
        0.08372411131858826,
        -0.013695173896849155,
        0.05167515203356743,
        -0.05383427441120148,
        -0.0381796769797802,
        -0.026933878660202026,
        -0.07637839764356613,
        -0.014686087146401405,
        0.028667008504271507,
        0.0019782742019742727,
        0.02918878011405468,
        -0.0732109546661377,
        -0.053942129015922546,
        -0.09717883914709091,
        -0.01652691885828972,
        -0.06338701397180557,
        0.050788622349500656,
        0.0769721120595932,
        0.03287661820650101,
        -0.04982028901576996,
        0.023752737790346146,
        -0.04611120745539665,
        0.044823016971349716,
        -0.025963762775063515,
        -0.09128807485103607,
        0.05675139278173447,
        0.04079296812415123,
        0.021833596751093864,
        -0.15987448394298553,
        0.013346320018172264,
        -0.049155790358781815,
        -0.02781381644308567,
        -0.0014665008056908846,
        0.03118165023624897,
        0.009264251217246056,
        0.0326077975332737,
        0.10644824802875519,
        -0.059417203068733215,
        0.06873027235269547,
        0.022649096325039864,
        -0.03302347660064697,
        0.005268092732876539,
        -0.10330187529325485,
        0.048036713153123856,
        -0.005765547975897789,
        0.013805159367620945,
        0.04957962408661842,
        -0.0845775157213211,
        0.014393763616681099,
        -0.02644721046090126,
        0.006786223500967026,
        0.0192570798099041,
        -0.022858595475554466,
        0.06162431463599205,
        -0.05391190946102142,
        0.0010392543626949191,
        -0.02012685127556324,
        0.008688816800713539,
        -0.00876322016119957,
        0.0628812238574028,
        0.07847481220960617,
        0.08118747919797897,
        0.06764775514602661,
        -0.028905626386404037,
        -0.002328123664483428,
        0.026916373521089554,
        -0.09413887560367584,
        -0.0702410563826561,
        -0.06822744756937027,
        -0.12509357929229736,
        0.009722674265503883,
        0.0001928777201101184,
        -0.02020030841231346,
        0.018648434430360794,
        -0.014065210707485676,
        -0.09612228721380234,
        0.018930207937955856,
        0.02053849771618843,
        0.039732273668050766,
        -0.01272437535226345,
        0.01377184595912695,
        0.01469030324369669,
        -0.024106711149215698,
        0.0034529701806604862,
        0.012904574163258076,
        0.006333712954074144,
        0.04915197193622589,
        0.048512112349271774,
        0.02537301927804947,
        -0.12812629342079163,
        -0.02949937805533409,
        -0.08513892441987991,
        -0.10787761956453323,
        -0.008041701279580593,
        0.08062150329351425,
        0.07605891674757004,
        -0.04579993709921837,
        -0.012944933027029037,
        0.010633221827447414,
        0.016028596088290215,
        -0.00621457863599062,
        0.013095607049763203,
        -0.08281543850898743,
        0.0432988703250885,
        0.10945487022399902,
        -0.11445946246385574,
        0.03908855840563774,
        -0.021667392924427986,
        0.03620602563023567,
        -0.008977126330137253,
        -0.08434850722551346,
        0.0013571901945397258,
        -0.11302470415830612,
        4.722652512210191e-33,
        -0.028517482802271843,
        0.039549365639686584,
        -0.10236287117004395,
        -0.013447037898004055,
        -0.05955379083752632,
        -0.010850485414266586,
        -0.025265343487262726,
        0.020429670810699463,
        -0.015195373445749283,
        0.03591303527355194,
        -0.14490729570388794,
        0.015166663564741611,
        -0.012749318033456802,
        0.028836937621235847,
        0.009297707118093967,
        -0.06752149760723114,
        -0.011527852155268192,
        0.024715811014175415,
        0.04287787154316902,
        0.041375696659088135,
        -0.006519149523228407,
        0.023081721737980843,
        -0.02306261844933033,
        0.03682919964194298,
        0.11399935185909271,
        -0.038779906928539276,
        0.052776038646698,
        -0.038539133965969086,
        0.08689627051353455,
        -0.004150887485593557,
        -0.08700842410326004,
        0.024908646941184998,
        0.05512228608131409,
        -0.010274081490933895,
        -0.0020916578359901905,
        0.012301303446292877,
        -0.05010750889778137,
        0.010473151691257954,
        -1.9603048713179305e-05,
        -0.09041274338960648,
        0.030870623886585236,
        0.029525507241487503,
        -0.034072838723659515,
        -0.03373583033680916,
        0.047061987221241,
        0.002037515863776207,
        -0.009425400756299496,
        -0.018435252830386162,
        0.04410243406891823,
        -0.0757516548037529,
        -0.06952552497386932,
        0.06603484600782394,
        -0.11604321002960205,
        0.03096606209874153,
        0.015297907404601574,
        -0.06665989756584167,
        0.002000502310693264,
        -0.01479474175721407,
        0.07468903809785843,
        0.011635971255600452,
        0.012866230681538582,
        0.046179406344890594,
        -0.01653357595205307,
        -0.051994673907756805,
        -0.06800882518291473,
        0.07061336189508438,
        0.04343913495540619,
        0.029791757464408875,
        -0.10819251090288162,
        -0.04122398421168327,
        0.018232673406600952,
        0.033204205334186554,
        -0.018326302990317345,
        -0.02799922786653042,
        0.031795766204595566,
        0.03961200639605522,
        -0.02961014024913311,
        0.046459902077913284,
        0.11311335116624832,
        -0.06974884122610092,
        -0.031068501994013786,
        0.055688079446554184,
        0.0020316909067332745,
        0.08835805207490921,
        0.1282823085784912,
        -0.027368979528546333,
        0.02449032850563526,
        -0.012063140980899334,
        -0.05440276116132736,
        0.013477012515068054,
        0.007346800994127989,
        0.05284050479531288,
        -0.09932064265012741,
        -0.011308462359011173,
        0.014368295669555664,
        -7.396945139343097e-33,
        -0.030862199142575264,
        0.00046319226385094225,
        -0.0007819548482075334,
        0.04278940334916115,
        0.0427902415394783,
        0.07487859576940536,
        0.05017438903450966,
        -0.019939562305808067,
        0.011545097455382347,
        -0.010392016731202602,
        -0.022681549191474915,
        0.010580773465335369,
        -0.0633615255355835,
        0.037596844136714935,
        -0.006880190223455429,
        -0.10488031804561615,
        0.031806718558073044,
        -0.006119781639426947,
        0.030130691826343536,
        -0.026615342125296593,
        0.03423994779586792,
        0.009149369783699512,
        0.006082457490265369,
        -0.007429349236190319,
        -0.13658376038074493,
        0.011838480830192566,
        0.033684879541397095,
        0.0031644466798752546,
        -0.05661546811461449,
        -0.009791761636734009,
        -0.03625233471393585,
        -0.010787772946059704,
        -0.08378317207098007,
        -0.04624881222844124,
        0.044491130858659744,
        -0.018306905403733253,
        0.006413605064153671,
        0.03221740201115608,
        -0.0062846350483596325,
        -0.05897071212530136,
        -0.009936501272022724,
        -0.018933823332190514,
        0.055248066782951355,
        -0.03798540681600571,
        0.034496694803237915,
        -0.06458179652690887,
        -0.0626552477478981,
        -0.009047156199812889,
        -0.0018220534548163414,
        0.043019238859415054,
        0.032509561628103256,
        0.03497850149869919,
        0.05392010882496834,
        -0.03410132974386215,
        -0.0741126537322998,
        -0.05955055356025696,
        0.004037517122924328,
        -0.021530190482735634,
        0.018649714067578316,
        -0.022280747070908546,
        -0.0007373650441877544,
        -0.004453526809811592,
        0.00882219523191452,
        0.008219756186008453,
        -0.03216950222849846,
        0.02407037653028965,
        0.05707969143986702,
        0.0073356591165065765,
        0.004284641705453396,
        0.01643800549209118,
        0.050296854227781296,
        -0.0301080122590065,
        -0.01949995942413807,
        -0.08494039624929428,
        -0.06401757895946503,
        0.04838852211833,
        -0.05078998580574989,
        -0.009177191182971,
        0.11620243638753891,
        -0.01868601143360138,
        -0.038685720413923264,
        0.06344427913427353,
        0.03945452347397804,
        0.028411749750375748,
        0.10101240873336792,
        -0.03418247029185295,
        0.028910400345921516,
        -0.040269944816827774,
        0.0004770749364979565,
        0.027707666158676147,
        -0.018637243658304214,
        0.025381986051797867,
        -0.03140038996934891,
        0.057599492371082306,
        0.03836898133158684,
        -5.384839951716458e-08,
        0.016409240663051605,
        0.04492966830730438,
        0.030958786606788635,
        -0.03101353533565998,
        0.05245840549468994,
        -0.08411867171525955,
        -0.021142736077308655,
        0.06516645103693008,
        -0.010074658319354057,
        0.024803800508379936,
        0.005639966111630201,
        -0.0033250562846660614,
        -0.0826687291264534,
        0.012175759300589561,
        0.009697905741631985,
        0.04221856966614723,
        -0.017715785652399063,
        0.07202558219432831,
        -0.010362445376813412,
        -0.10220267623662949,
        -0.008797730319201946,
        0.10728208720684052,
        0.043073322623968124,
        -0.02637604996562004,
        0.03608220815658569,
        -0.023579353466629982,
        0.05758308991789818,
        0.03864489495754242,
        0.10537052154541016,
        -0.028175970539450645,
        -0.040731705725193024,
        -0.0021141143515706062,
        -0.03522282466292381,
        -0.04021438583731651,
        0.05152780935168266,
        -0.1291412115097046,
        -0.09086921066045761,
        0.10831976681947708,
        -0.0030801105313003063,
        0.04506625980138779,
        -0.0575062558054924,
        -0.050906624644994736,
        0.012788507156074047,
        0.052138447761535645,
        0.037875350564718246,
        -0.060111161321401596,
        0.0389723964035511,
        -0.029515253379940987,
        -0.053494375199079514,
        0.04585188999772072,
        -0.03874565660953522,
        0.014128667302429676,
        0.013832790777087212,
        -0.04791015386581421,
        -0.04026975482702255,
        0.0017486230935901403,
        -0.0660938173532486,
        0.03883976861834526,
        -0.054646238684654236,
        0.046384409070014954,
        -0.06360629200935364,
        -0.14224684238433838,
        0.023376405239105225,
        0.13453176617622375
    ]
}