{
    "id": "YftvpUEJvUM",
    "title": "Ultimate ASUS Gaming PC!! RTX 3090",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-03-24T18:02:21Z",
    "video_url": "https://www.youtube.com/watch?v=YftvpUEJvUM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ASUS",
        "CUSTOM POC",
        "MODSBYBEN"
    ],
    "views": 218378,
    "likes": 9918,
    "comments_count": 790,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today is a very, very exciting day. We are about to unbox a brand new custom PC. This was built by Mods By Ben, who is an incredible PC designer but also an amazing photographer. And he merges those two passions together on his Instagram. You guys have to check it out. He partnered with ASUS to build this custom PC for me and I cannot wait to open it up. But before we do, we're gonna chat with Ben and talk about some of his inspiration behind this build. And also Chris from ASUS to tell us what's actually inside the PC. Guys, oh my gosh. Thank you so much for joining me in this-- the zoom call here (chuckles). - Good to be here . - Thanks for having us. - Hi, Chris. Hi, Ben. Okay, so Ben, do you want to do a quick little introduction of yourself so that my audience is a little more familiar with what you've been up to. I've been following you on Instagram for a while now. And honestly, your photography is so incredible. - Well, my name is Ben with Mods By Ben, and I'm actually a PC builder. I do custom PCs with ASUS so a lot of my stuff is it's more water-cooled. So it tends to be more extreme than just a normal PC build. - I work for ASUS, I'm a part of the social media team. And I do a variety of things. I do a lot of video work. Some instructional videos and long-form content. Just a little bit of everything here. - And we had actually met in 2011, you said, right? - We did. We were both entered into a charity PC building race through I believe it was Tiger Direct. It was really, really fun. - It was so fun, yeah. We had a PC building race and I was like, \"I don't think I'm going to beat any of these people here.\" I didn't come in last. So I appreciate your help. So thank you so much (chuckles). - Glad to help. - And now here we are coming full circle. 2021 and I'm getting a new PC build. And this is really exciting because I'd started streaming during the whole pandemic again. And streaming was great. But also, streaming on a PC and then also gaming on the PC like I was like, \"Man, this is not ideal.\" So the chat told me that I needed to get a second PC, so that I'm able to stream and game separately. So this is very exciting because now, Ben, you have been working on a new gaming PC for me. And this isn't just like some normal gaming PC that like I can just go and pull off the shelf somewhere. This is all custom. - Yes. Yeah, it's all custom. Well when we actually talked about it, one thing I did wanted to try cause there's a famous architect that I love so much. And the way he designs buildings, it's more of adding depth and creating like different shapes and kind of stacking them together. So basically, I took that kind of same concept with this PC build that I did for you. But I'm pretty excited. I'm excited like what your first impression is. - [Justine] I cannot wait. I mean, is this something that you've been doing for a while? Is this something that you always wanted to do? Like what's your main background? - I love creating stuff that just kind of out of this world. I'm more of a sculptor, modern sculptor. So basically, I gathered these parts together and kind of create something, an art piece. It's a sculpture, but you can also use it. Like you're gonna use it for gaming, so and streaming. - Wait, no. Obviously, I know I have a pretty tech savvy audience. They're gonna wanna know what is in this thing. So Chris, can you maybe walk us through some of the components and what we actually have inside of it? - Obviously, the motherboard is kind of the foundation for that. And so we've set you up with an ROG Maximus XII Formula Z490. And what's really cool about this is something that I think Ben probably appreciated while building it, is it's already set up for water cooling. It also is coming with an Intel i9 processor. So it's gonna be blazing fast for gaming, video, everything you need. The real crown jewel of this build though is you've got a tough gaming RTX 3090 in it which is the most highly sought after video card that's on the market currently. - Oh, my goodness. I'm so excited. I've been trying to get one and I had no luck at all. So this is so cool. Oh, my god! - This is gonna be an amazing, amazing build for you. I think we've also got 32 gigs of RAM, a one terabyte M.2 NVMe drive. So literally everything is just as fast as you can get it right now. And best of all, it looks amazing. Thanks to Ben's incredible work. - [Jusitne] I can't wait to see it. It's downstairs. I haven't opened it yet. So I'm just waiting patiently. - We've got one more special thing for you that I'm not sure you even know is on the way. - What's that? - And to take care of all of your gaming needs on PC, on console cause I know you play some console games. We've got a 43 inch 4K display. It's the world's first HTMI 2.1 display. And it's gonna do up to a 144 Hertz at 4K. And it is just a gorgeous, gorgeous display. - Okay, I have been stalking this since the announcement. So I am so excited like I can't even tell you. Oh my goodness (shocks). - Any day now it should be there. - Oh, man. I am so excited. Well guys, thank you so much, Chris. Ben, I cannot wait to see this thing. I'm just, I'm so excited. I can't wait. So thank you guys. So I'm so honored that ASUS partnered with Ben to create this custom PC for me. And not only are the insides of this PC incredibly powerful but this thing is actually a work of art. Like this isn't just your everyday PC that you can pull off of a shelf. This my friends is art. Let's open it up. (upbeat music) Oh my goodness. Holy molly, I can't wait. Look at this cool cable. Why is this so pretty? (upbeat music) Oh, my God. This is-- I cannot wait. It's so pretty (shocks). You guys are freaking just look at this thing. Like this is absolutely just feast your little papers on this. Ben, this is amazing. It's so beautiful. Hey there little RTX 39D, how you doing? All of this acrylic is all custom laser etched. Like this is, this is art. This is art. We also have a custom design keyboard as well. Well, it's all unboxed. Let's go set it up in my office. (upbeat music) PC is here. It has not been turned on yet. I'm about to clear off this desk and get the monitor all set up and finally power this thing up for the first time. So this is my office. I have my Mac side over here. So this is where I do most of my editing. And then over here, my PC side, this is where I game, do all of my zoom calls, stream. All of that happens over here. So I'm gonna have to really assess the size of this monitor because this is not a monitor. This is like a television and this is like a full size. I'm going to the theater. I'm in an IMAX theater now and I'm watching a feature film. (bleep) Oh, boy, look at this thing. Hold on a second. Can you see me? (Justine laughing) (bleep) I mean, it's gonna take up a pretty big portion of this desk. The first thing I'm gonna do is just clear everything out and start fresh. So clean. (upbeat music) We have everything set up. I downloaded some games. I've got \"Sea of Thieves\" running on the PC. I've got my PlayStation four hooked up. I also have my Xbox Series X hooked up. This is I'm in the game. The thing that I also love is this monitor also has speakers built into it. This is not a monitor. This is a TV. This monitor is so-- it's shocking. It really is breathtaking. Clothes crew, I'm gonna just play by myself. Look at my outfit though. Wow. This is beautiful. It's beautiful. It's beautiful. What's up, dude. Let's get it. Let's get a freaking voyage. Gosh. This looks amazing. I'm so-- I'm just like blown away. Like how incredible it looks. Oh, I've missed the ladder. I want to set sail just so I can see how cool the water looks. Like look at this water. It looks beautiful. Okay, so \"Sea of Thieves\" looks amazing. Now let's test out some \"Call of Duty\", shall we? I'm so-- I feel like I'm in the battlefield right now. Like honestly like (gun bangs) Oh, my god (chuckles). What the heck! (gun bangs) This is so beautiful. Oh, come on. That was a nice shot. (gun bangs) Are you hungry? Do you want to have a little dinner? (gun bangs) - Okay. Well, I didn't win. I did very poorly. But it's been a while since I played \"Free for All\". I must say... This is (gun bangs) shockingly beautiful. I just remembered when I was unboxing this that there was a remote control that came with this. So I've been playing \"Sackboy: A Big Adventure\" a ton on PlayStation. I absolutely love this game. It's a great game for families or just yourself. Oh, I have fallen. Come here. Get in there. This looks so freaking good. Have I said how incredible this looks yet? Well, thank you guys so much for watching. And a huge thank you to ASUS and Mods By Ben for making this entire project come to life. I'm so excited for my new setup. This is gonna be so much fun. And it's definitely taken not only my gaming setup but also my streaming setup to a whole another level. I'll put links in the description for everything that I talked about in this video. And be sure to go check out Mods By Ben. He is so incredible and so talented. And huge thank you again to Ben for creating this beautiful work of art. I'll see you guys in the next video. Bye. (upbeat music)",
    "transcript_keywords": [
        "Ben",
        "thing",
        "ASUS",
        "wait",
        "custom",
        "gaming",
        "guys",
        "beautiful",
        "Mods By Ben",
        "build",
        "excited",
        "Justine",
        "amazing",
        "Chris",
        "art",
        "incredible",
        "set",
        "monitor",
        "Mods",
        "Ben incredible work"
    ],
    "transcript_entity_values": [
        "Intel",
        "Xbox Series X",
        "second",
        "one",
        "IMAX",
        "Ben",
        "2021",
        "Justine",
        "Chris",
        "ASUS",
        "32",
        "so--",
        "3090",
        "Instagram",
        "Mac",
        "PlayStation",
        "a ton",
        "PlayStation four",
        "2011",
        "ASUS",
        "Sackboy",
        "144",
        "RAM",
        "Call of Duty",
        "today",
        "2.1",
        "Hertz",
        "two",
        "43 inch",
        "first",
        "Z490",
        "Free for All",
        "Tiger Direct"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "NORP",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT"
    ],
    "vector": [
        -0.024342186748981476,
        -0.07044291496276855,
        -0.0884212777018547,
        -0.0958804339170456,
        -0.015940997749567032,
        0.03602970391511917,
        0.05602998659014702,
        0.02054033987224102,
        -0.04135903716087341,
        0.0848914310336113,
        0.0076070851646363735,
        0.009310644119977951,
        -0.04308924823999405,
        -0.001811460591852665,
        0.0024978758301585913,
        0.046879105269908905,
        0.07639015465974808,
        -0.05941607430577278,
        0.005981255788356066,
        0.03476850688457489,
        -0.0038042129017412663,
        -0.08006615936756134,
        0.03143227472901344,
        -0.016743574291467667,
        0.01837744563817978,
        0.08605082333087921,
        0.03791658207774162,
        0.006928545422852039,
        -0.054970480501651764,
        -0.0694485753774643,
        0.0026883333921432495,
        0.01347019337117672,
        0.10503639280796051,
        0.01322594191879034,
        -0.005352528300136328,
        -0.057770077139139175,
        0.04616942256689072,
        -0.03747059404850006,
        -0.013759302906692028,
        -0.05615659058094025,
        -0.03761593997478485,
        -0.004634980112314224,
        -0.013313600793480873,
        0.012109913863241673,
        -0.07414066046476364,
        -0.10595493763685226,
        -0.02671661227941513,
        -0.029929976910352707,
        0.08373187482357025,
        0.07394828647375107,
        -0.0525955967605114,
        -0.009464964270591736,
        0.03848593682050705,
        0.008014753460884094,
        -0.1318582445383072,
        0.028114600107073784,
        -0.10837989300489426,
        0.0025627410504966974,
        0.0367317721247673,
        -0.08501482009887695,
        0.03500545769929886,
        -0.05280165746808052,
        0.014283466152846813,
        0.07864001393318176,
        -0.06120731309056282,
        -0.04084770381450653,
        0.007828991860151291,
        -0.012502714060246944,
        -0.0018885921454057097,
        0.016970327123999596,
        -0.09508588910102844,
        0.069270059466362,
        -0.02384972758591175,
        0.012916342355310917,
        0.011457330547273159,
        0.0877518281340599,
        0.0333329476416111,
        -0.0811198279261589,
        -0.00021981749159749597,
        0.05311834067106247,
        0.04724441096186638,
        -0.03239980712532997,
        -0.038948215544223785,
        -0.03554435074329376,
        0.023770956322550774,
        0.015930645167827606,
        0.018439965322613716,
        0.01439192146062851,
        0.008320887573063374,
        -0.06708450615406036,
        -0.09392601251602173,
        0.023295056074857712,
        0.03484803065657616,
        -0.015997210517525673,
        0.01794620044529438,
        -0.03893968462944031,
        0.028263742104172707,
        -0.07451830804347992,
        -0.03096361644566059,
        0.05563507601618767,
        0.011176868341863155,
        -0.05862140282988548,
        0.030077004805207253,
        0.0020429184660315514,
        -0.018048478290438652,
        -0.06716813892126083,
        -0.08830855041742325,
        0.017770379781723022,
        -0.009202857501804829,
        -0.021857650950551033,
        -0.08074401319026947,
        0.040549807250499725,
        -0.058479927480220795,
        -0.06069246307015419,
        0.041548777371644974,
        0.0982714369893074,
        -0.023903751745820045,
        0.05366641655564308,
        0.051219627261161804,
        -0.009298120625317097,
        -0.008171480149030685,
        -0.09529395401477814,
        -0.021335391327738762,
        0.07257302850484848,
        0.058680642396211624,
        0.06242166459560394,
        -0.09783606976270676,
        1.3107978648321607e-32,
        -0.045916903764009476,
        0.06458459794521332,
        0.0006354015204124153,
        0.013571689836680889,
        -0.020939772948622704,
        -0.02873038500547409,
        0.04087718576192856,
        0.047787491232156754,
        -0.02676863968372345,
        0.04183926805853844,
        -0.03935765475034714,
        0.048109691590070724,
        -0.02607172727584839,
        0.05555737391114235,
        0.062186405062675476,
        -0.07202395051717758,
        -0.00303287198767066,
        -0.000519148597959429,
        -0.039034828543663025,
        0.01048214640468359,
        0.019161993637681007,
        0.012874222360551357,
        0.0317947193980217,
        0.05408788472414017,
        0.08549720793962479,
        0.046965740621089935,
        0.014580963179469109,
        0.0392327718436718,
        0.07923124730587006,
        -0.0012961849570274353,
        -0.03447623923420906,
        -0.1069670096039772,
        -0.07433515787124634,
        -0.08403997123241425,
        -0.0021857002284377813,
        0.008316101506352425,
        -0.08140765130519867,
        -0.014280978590250015,
        -0.03818802908062935,
        -0.03143472224473953,
        -0.028304193168878555,
        0.029405048117041588,
        -0.09589391946792603,
        -0.0915580615401268,
        0.01207659486681223,
        -0.00337355793453753,
        0.028785215690732002,
        0.034701209515333176,
        -0.03242575004696846,
        0.00937375146895647,
        -0.06264659017324448,
        0.04217767342925072,
        -0.028642529621720314,
        0.0036194073036313057,
        -0.004849239252507687,
        -0.09730848670005798,
        -0.01261141337454319,
        0.0848914086818695,
        0.055963631719350815,
        0.10446801781654358,
        0.02674192376434803,
        -0.07502826303243637,
        -0.020732207223773003,
        -0.029251936823129654,
        -0.06958312541246414,
        0.06724711507558823,
        0.11295442283153534,
        -0.023991022258996964,
        0.006541255861520767,
        0.05818687751889229,
        0.010193266905844212,
        -0.0015595160657539964,
        0.05441458523273468,
        -0.004405012354254723,
        0.05947502329945564,
        0.08595374971628189,
        -0.0870891660451889,
        -0.0675138309597969,
        -0.029756581410765648,
        -0.045612312853336334,
        -0.13797175884246826,
        0.0851212739944458,
        -0.012008881196379662,
        0.11392580717802048,
        -0.009522713720798492,
        -0.052904773503541946,
        0.02743106335401535,
        -0.012798899784684181,
        -0.029777271673083305,
        0.009110676124691963,
        -0.03644474968314171,
        0.06114271283149719,
        -0.06728167831897736,
        -0.011953615583479404,
        -0.009904222562909126,
        -1.2086798053087484e-32,
        0.00039354406180791557,
        -0.006572375074028969,
        -0.019887594506144524,
        -0.014966863207519054,
        0.029889356344938278,
        -0.022757891565561295,
        0.06969457864761353,
        0.09839482605457306,
        0.051383890211582184,
        -0.09900595992803574,
        0.07041383534669876,
        -0.003690054640173912,
        -0.08540865778923035,
        0.03759884834289551,
        -0.013323485851287842,
        -0.04707776755094528,
        4.5983986638020724e-05,
        -0.04210607334971428,
        0.07307375222444534,
        -0.020595470443367958,
        0.08041206747293472,
        0.12973205745220184,
        0.07004816085100174,
        0.02042122557759285,
        -0.006184511352330446,
        0.0075331758707761765,
        0.03194897994399071,
        0.03775888681411743,
        0.03142911195755005,
        0.04312562569975853,
        0.021281026303768158,
        0.0007952937157824636,
        -0.004910891409963369,
        0.010427631437778473,
        0.08725763112306595,
        0.05657912790775299,
        0.05177278071641922,
        0.014536644332110882,
        -0.008192318491637707,
        -0.04209485650062561,
        0.08059138804674149,
        0.01347176544368267,
        -0.0009002663427963853,
        0.011212488636374474,
        0.054543185979127884,
        -0.08009877800941467,
        -0.06164923682808876,
        0.013409235514700413,
        -0.01084738690406084,
        -0.006442375015467405,
        -0.07005596905946732,
        -0.0791652500629425,
        0.019787834957242012,
        -0.013626308180391788,
        0.011763330549001694,
        -0.0480191744863987,
        -0.06064861640334129,
        -0.016693217679858208,
        0.046761833131313324,
        0.0010191700421273708,
        0.05640183016657829,
        -0.006294000893831253,
        -0.06755908578634262,
        -0.07868313789367676,
        0.01539871096611023,
        -0.06430809944868088,
        0.04282147437334061,
        0.0179300457239151,
        -0.037831492722034454,
        0.026825346052646637,
        -0.04583347961306572,
        0.038804277777671814,
        -0.020982803776860237,
        0.03252963721752167,
        0.024339715018868446,
        0.003554129507392645,
        -0.053953371942043304,
        0.010077119804918766,
        0.10643386095762253,
        -0.02612108550965786,
        -0.07259616255760193,
        -0.023662038147449493,
        0.024916622787714005,
        0.07236349582672119,
        0.09459530562162399,
        0.07389263063669205,
        0.05914224684238434,
        -0.045503001660108566,
        -7.451404235325754e-05,
        0.005082039628177881,
        0.04527205601334572,
        0.014308691956102848,
        0.03959380090236664,
        0.11493222415447235,
        -0.06918813288211823,
        -6.109513606133987e-08,
        0.03145761042833328,
        0.027408724650740623,
        -0.024181658402085304,
        -0.001385004143230617,
        0.024234632030129433,
        -0.08153755217790604,
        -0.022388072684407234,
        -0.03826519101858139,
        0.05119776353240013,
        -0.060658346861600876,
        0.07381211221218109,
        -0.045471902936697006,
        0.034417055547237396,
        0.08278614282608032,
        0.016131050884723663,
        0.005654916632920504,
        -0.10168362408876419,
        0.08922936022281647,
        -0.019590798765420914,
        -0.07982047647237778,
        -0.03102777898311615,
        0.0641360804438591,
        0.03489997610449791,
        -0.03848173841834068,
        0.08936934918165207,
        -0.011080630123615265,
        -0.015459349378943443,
        -0.04832073673605919,
        0.059193406254053116,
        0.025927351787686348,
        -0.060018617659807205,
        0.019975418224930763,
        0.035888560116291046,
        -0.03739797696471214,
        -0.02003428339958191,
        -0.04946259409189224,
        -0.010814552195370197,
        0.04120928421616554,
        0.05757841840386391,
        0.010099108330905437,
        -0.02378544583916664,
        -0.12298699468374252,
        -0.06199096515774727,
        -0.03336109220981598,
        -0.0003006068291142583,
        0.003979709930717945,
        -0.0013149790465831757,
        -0.07559969276189804,
        -0.024693844839930534,
        -0.05171886086463928,
        -0.05754406750202179,
        0.06418630480766296,
        0.016889527440071106,
        -0.03373230621218681,
        0.06374723464250565,
        -0.019492648541927338,
        0.0040323566645383835,
        0.07189660519361496,
        0.0013046255335211754,
        -0.018042998388409615,
        0.042547598481178284,
        0.015788674354553223,
        -0.08093208819627762,
        0.015077713876962662
    ]
}