{
    "id": "ygHTXNH4WLA",
    "title": "NEW Corvette E-RAY - First Drive!  (in the snow)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-01-17T14:02:00Z",
    "video_url": "https://www.youtube.com/watch?v=ygHTXNH4WLA",
    "category": "Howto & Style",
    "tags": [
        "Corvette E-Ray",
        "Corvette E-Ray 0-60",
        "Corvette E-Ray first drive",
        "Corvette E-ray review",
        "Electric corvette",
        "Electrified corvette",
        "EV",
        "tesla",
        "Elon musk",
        "Corvette",
        "Battery powered corvette",
        "awd corvette",
        "snow corvette",
        "c8 corvette eray",
        "2024 corvette",
        "2024 eray"
    ],
    "views": 545032,
    "likes": 25159,
    "comments_count": 1397,
    "description": "Today we get to check out the brand new Electrified Corvette E-Ray - with a powerful electric motor in the front and a massive V8 Engine in the back. Bringing the power of electric and the ferocity of recycled dinosaurs together  for the ultimate supercar. Not only increasing acceleration - but also this new 2024 Corvette E-Ray will be the first Corvette with all wheel drive; traction on all four tires. Pretty amazing! HUGE thanks to Corvette for letting us come check out the new Corvette E-Ray. This video is not sponsored. I paid for my own travel.   Check out Dans video here:    @WHATSINSIDEFAMILY     Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/KCvIGvvKw74",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Gas powered vehicles are faster at high speeds. Electric vehicles are faster off the line. But what if we had a vehicle that did both? Let's get started. [Intro] Corvette's here filming a commercial for this...well, for the launch of this vehicle. So there are some pretty sweet camera setups going around. Normally you don't see a Corvette on the snowy roads and mountains of Utah, but this Corvette is different. With traction on all four tires, thanks to the electric motor in the front and the gas powered V8 engine in the rear. This is the 2024 Electrified Corvette E-Ray. Since the front half of this Corvette is electric, it has the ability to be totally silent while it's creeping around under 45 miles an hour. With 160 horsepower in the front alone, with 125 pound feet of torque, under 45 miles it can be silent. Above that, the rear motor kicks on. Floor it! And when it's floored the V8 kicks in bringing the almost 500 horsepower and 500 pound feet of torque from the rear. Both the motor and the engine working together simultaneously. But of course, if you want the V8 working all the time it has that option, then the electric motor just goes into play for acceleration and stabilization all the way up to the top speed. And since it's a Corvette, you know that's fast. Today we're going to see how both systems work in harmony together, and I think we should start with that test drive. It's drive time! This is Ken. He's coming with us. -Yeah. -Let's go. -Alright! -Today's launch of the Corvette E-Ray marks the 70 year anniversary of the original Corvette debut in New York way back in 1953.The original C1 had a solid rear axle, and no Corvette until now has been an all-wheel drive. If you're puttering around town using just the front electric motor you'll get about 5 miles worth of extra range. The battery pack is not designed for commuting. It's designed for extra power and extra traction to fill in the small gaps where we might find the V8 to be lacking. -Alright, so ready? -Good. -So we're going to step into it. -Yeah. Oh yeah! [Laughing] As a bonus, a stealthy, silent exit prevents disturbing any residential neighbors you might like, while still being able to kick on the V8 at any point to disturb the neighbors you don't like. It's the best of both worlds. One of the perks of electrification is you know if you're accelerating onto the freeway the Corvette will naturally downshift. But with an electric motor in the front that can kick on during the downshift, you're accelerating while the vehicle is shifting. The electric motor is ready to go no matter what speed the Corvette is traveling. And it's not just about the extra juice while accelerating, since the gas motor in the rear and the electric motor and battery in the front are independent from each other we get very responsive traction control on all four tires, which translates to some pretty excellent dominance over the snow packed mountains roads of Utah. Traction is extremely important when you're literally driving on ice. With traction on all 4 tires, the only reason this thing can't go off-roading is because of the ground clearance. Here in the front we also have two cameras so they can sense the curb and avoid damage to the front air splitter. As well as back here we have an additional rear view camera that guy. This is the Seawolf Gray color and one of three new colors for 2024. -[Dan] Yeah, probably should bring that in, but I can't do that with my electric car! That is some power! It sounds loud, and I can feel it. -That's legit. If you want to watch Dan's video, I'll leave a link for him right here as well. Get his feedback on this electric/gas powered vehicle. -[Dan] And on my video, Zack's going to do the same thing. We're going to watch his hair go up. [Laughing] -That was mean, man. -[Dan] That was mean! -At first glance walking around the vehicle, I'll get to underneath the hood here in a second, we have the massive vents on the side for the radiator. But over here the first thing that caught my eye was the aluminum wheels and the giant carbon ceramic rotor that has all the stopping power for this vehicle. You might have noticed there's not a charging port. This is for the recycled dinosaurs going back to the motor and that's because all of the charging done for the 1.9 kilowatt hour battery is done through regen. The electric motor uses the weight of the vehicle as it's slowing down for stop signs or stop lights to put power back into the 1.9 kilowatt hour battery. This wasn't built to be an electric commuter, it's built to be the quickest Corvette they've ever made. Let's check out underneath the hood where the electric motor is sitting. You might think there's no extra space, but in fact there is a frunk. To unlatch the hood inside of this radiator grille area there's a button. The hood is popped. This is still a pre production unit, but we have space in here for a small suitcase, couple backpacks. The electric motor does not take up much room. Let's check out behind. TO get access to the V8 underneath the trunk space we can lift up the hood and that's where the majority of the power is at. We do have room here. This could probably fit some golf clubs in this container back here. These guys right here are the adjustable magnetic ride suspension which is standard on all of the Corvettes. The V8 in the trunk back here is not operating at 100% power all the time, just how we have the electric motor assisting at the initial stage of acceleration. When just driving around town there is active fuel management which allows four cylinders of the V8 to power the vehicle and only engage all 8 of the V8 when it's fully needed. The switch between 8 cylinders and 4 is perceptible to the driver and also happens on the freeway to help save gas. No one cares about saving gas....let's just say the new Corvette isn't qualifying for any EV tax credits. Another thing I thought was pretty cool are these vents right here that actually pass through to the other side letting the engine be air cooled from the rear. Let's check out the inside. Yeah! Woo! This thing feels like a fighter jet. Not sure if you can see it with the glare but we have hand stitched leather, Bose sound system, carbon fiber everywhere on the interior, and the 1.9 kilowatt hour battery is in this center console between the passenger and the driver. There are only two seats, two displays, with more carbon fiber on the steering wheel. We have the E-Ray right here with the Corvette logo in the center. Fancy stitching everywhere. Check out this door right here that looks amazing. I've been told that this 2024 Corvette E-Ray has a 0-60 of 2.5 on an unprepped surface, which makes it the fastest Corvette ever made, giving it a super quick off the line as well as a super high top speed. Kind of the best of both worlds in a sports car. We have cup holders, drive selections over here, another glove compartment in the center. And I'm not sure you can see it or not, but it's kind of crazy just having the engine right there behind my head through the rear window. This piece of glass doesn't go to the back of the car, it goes to the engine compartment which is right behind the driver's seat. And it looks like the roof can come off as well, but since we're in the middle of winter in Utah, we're going to leave the roof on for now. And there we have it the world's first Electrified Corvette. The perks of electric and the perks of gasoline combined into one vehicle. I think this is going to make some major waves in the supercar/sports car world, and they will be shipping this summer. If you have any questions go ahead and leave them down in the comments. Come hang out with me on Instagram. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "electric motor",
        "Corvette",
        "Electric",
        "motor",
        "Corvette ERay",
        "Electrified Corvette",
        "front electric motor",
        "vehicle",
        "front",
        "rear",
        "Electrified Corvette ERay",
        "back",
        "power",
        "Gas",
        "rear motor kicks",
        "Yeah",
        "traction",
        "extra",
        "battery",
        "Gas powered"
    ],
    "transcript_entity_values": [
        "this summer",
        "0-60",
        "the 1.9 kilowatt hour",
        "about 5 miles",
        "all four",
        "V8",
        "8",
        "2.5",
        "160",
        "Instagram",
        "four",
        "V8",
        "two",
        "100%",
        "45 miles",
        "three",
        "Bose",
        "the 1.9 kilowatt hour",
        "2024",
        "70 year anniversary",
        "500 pound feet",
        "half",
        "Corvettes",
        "Ken",
        "4",
        "regen",
        "New York",
        "EV",
        "the middle of winter",
        "125 pound feet",
        "45 miles an hour",
        "first",
        "second",
        "almost 500 horsepower",
        "Today",
        "Dan",
        "only two",
        "Zack",
        "One",
        "Corvette",
        "Utah",
        "one",
        "1953.The",
        "C1"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.10695488005876541,
        0.04457109794020653,
        -0.01683087833225727,
        -0.022762252017855644,
        0.03046945482492447,
        -0.021051812916994095,
        0.023429954424500465,
        0.061259571462869644,
        -0.08320654928684235,
        0.004439882934093475,
        0.021574512124061584,
        0.030455656349658966,
        -0.0050588310696184635,
        0.02338537387549877,
        -0.09249678254127502,
        0.05311905965209007,
        0.01869325339794159,
        -0.005598693620413542,
        0.0008023437694646418,
        0.06625625491142273,
        0.005534258671104908,
        -0.022649340331554413,
        0.04361683875322342,
        0.003192352131009102,
        -0.05294930934906006,
        0.03627694770693779,
        -0.005804445594549179,
        0.04934960976243019,
        -0.08041731268167496,
        -0.11367889493703842,
        0.03979751467704773,
        0.006429019384086132,
        -0.06906335055828094,
        0.024413740262389183,
        -0.007921836338937283,
        -0.034031692892313004,
        0.007490795571357012,
        -0.006246547214686871,
        -0.07433678209781647,
        -0.000943949562497437,
        -0.057767175137996674,
        -0.03799019008874893,
        0.025542736053466797,
        0.007285751402378082,
        0.00130503682885319,
        -0.03452311083674431,
        0.043600525707006454,
        -0.01428132876753807,
        0.057278700172901154,
        -0.06084820255637169,
        0.008668524213135242,
        -0.08631440997123718,
        0.005817854776978493,
        -0.08289775997400284,
        0.057021364569664,
        0.05122758820652962,
        -0.07293592393398285,
        -0.07355216145515442,
        -0.011491951532661915,
        -0.07356508821249008,
        0.12037555873394012,
        -0.017896609380841255,
        -0.026449600234627724,
        0.042253728955984116,
        0.030935918912291527,
        -0.039001479744911194,
        0.07182761281728745,
        -0.08293917775154114,
        -0.11072231829166412,
        0.0007693436346016824,
        -0.04949159920215607,
        0.006809525191783905,
        0.018274150788784027,
        0.01160756591707468,
        -0.026028621941804886,
        -0.007160514127463102,
        0.06656239926815033,
        0.04478802904486656,
        -0.011452320031821728,
        0.004539279732853174,
        -0.004466177895665169,
        0.005190844647586346,
        -0.01011690590530634,
        -0.05282311141490936,
        0.004655652679502964,
        0.03839888423681259,
        -0.024717459455132484,
        0.06332642585039139,
        0.04293645918369293,
        0.04219090938568115,
        -0.0023298331070691347,
        0.01698477752506733,
        -0.058515071868896484,
        -0.038219090551137924,
        -0.01929270476102829,
        -0.02193976379930973,
        -0.01934068650007248,
        -0.01299260649830103,
        -0.004950688686221838,
        0.025919118896126747,
        0.0663297027349472,
        0.0777607336640358,
        0.016363445669412613,
        -0.018328314647078514,
        -0.06993348896503448,
        -0.0003389475168660283,
        0.002236564178019762,
        0.10913002490997314,
        -0.03432879596948624,
        0.022519495338201523,
        0.012185392901301384,
        0.025344321504235268,
        -0.09714552015066147,
        -0.06833800673484802,
        -0.04441424459218979,
        0.01769496500492096,
        -0.09558551013469696,
        0.031240424141287804,
        0.044036801904439926,
        0.04487106204032898,
        -0.004912273958325386,
        0.032019682228565216,
        0.015388455241918564,
        0.10197088867425919,
        0.07187805324792862,
        -0.06835433840751648,
        -0.004782821051776409,
        3.231887270419504e-33,
        -0.01628969982266426,
        0.13717100024223328,
        -0.014050875790417194,
        0.034440476447343826,
        0.023002872243523598,
        0.08893261849880219,
        0.005323741585016251,
        0.11412916332483292,
        -0.07748265564441681,
        0.04508174583315849,
        -0.07997781783342361,
        0.062236443161964417,
        -0.014140293002128601,
        -0.03252396360039711,
        0.0031971100252121687,
        -0.0603177435696125,
        -0.1013692319393158,
        -0.05131091922521591,
        -0.10373567789793015,
        -0.026400741189718246,
        -0.0077067487873137,
        0.05510721355676651,
        0.01969427615404129,
        0.044654253870248795,
        0.05207188427448273,
        0.042382169514894485,
        -0.004473212640732527,
        -0.04967480152845383,
        0.09654189646244049,
        0.04181034490466118,
        -0.06909576058387756,
        0.009247347712516785,
        -0.034043628722429276,
        0.05112460255622864,
        -0.014146680943667889,
        -0.002119524870067835,
        -0.10347195714712143,
        -0.11120922863483429,
        -0.05420846492052078,
        0.028341732919216156,
        0.05465876683592796,
        0.0032254375983029604,
        -0.05311128869652748,
        -0.03779584541916847,
        -0.05900324508547783,
        0.0436679907143116,
        0.018750924617052078,
        0.049209121614694595,
        0.04373699426651001,
        -0.005057618487626314,
        0.03592153638601303,
        -0.024801576510071754,
        -0.06524831056594849,
        -0.049049027264118195,
        -0.07683771103620529,
        0.0379464291036129,
        -0.002343890257179737,
        -0.0028587395790964365,
        0.023926272988319397,
        -0.014423220418393612,
        0.0079854940995574,
        0.038113877177238464,
        -0.02730328030884266,
        -0.002543294569477439,
        -0.10550283640623093,
        0.016322962939739227,
        0.008566421456634998,
        0.06007903814315796,
        -0.05299193039536476,
        0.06693749874830246,
        -0.013879342004656792,
        -0.06256001442670822,
        0.026718351989984512,
        -0.05423741415143013,
        0.11062487214803696,
        0.028774667531251907,
        -0.1019621342420578,
        0.006951711140573025,
        0.011348403058946133,
        -0.0001161259860964492,
        -0.14309090375900269,
        -0.050531141459941864,
        0.04622459039092064,
        -0.059631235897541046,
        0.07605554908514023,
        -0.003964385017752647,
        -0.022595861926674843,
        0.02886485494673252,
        0.07305305451154709,
        0.02900044620037079,
        0.010154892690479755,
        -0.020690830424427986,
        -0.03349553793668747,
        -0.054046571254730225,
        0.017532315105199814,
        -5.7935252944154024e-33,
        0.044707443565130234,
        -0.01397116482257843,
        0.06292088329792023,
        0.008478699252009392,
        0.027444973587989807,
        0.01588589698076248,
        0.04201611503958702,
        0.04256674274802208,
        0.02954217605292797,
        -0.08601981401443481,
        0.04868166148662567,
        0.03155163675546646,
        -0.04819486290216446,
        -0.0031891576945781708,
        0.06529530137777328,
        -0.025496454909443855,
        -0.013871653936803341,
        -0.07324869185686111,
        0.029359178617596626,
        0.012040483765304089,
        0.07348436117172241,
        0.04776431992650032,
        0.0020154600497335196,
        0.02172737941145897,
        -0.042380236089229584,
        0.0001846358791226521,
        0.11914358288049698,
        -0.02205808088183403,
        0.09725962579250336,
        0.030143272131681442,
        -0.06012943014502525,
        -0.05400615930557251,
        0.0271256472915411,
        0.048583466559648514,
        -0.08458865433931351,
        0.12632577121257782,
        0.0003506751381792128,
        -0.006295821629464626,
        -0.07257899641990662,
        -0.03262665867805481,
        0.02482840046286583,
        0.022170238196849823,
        -0.02870122157037258,
        0.038767360150814056,
        -0.07818403840065002,
        -0.051901645958423615,
        0.00029028570861555636,
        0.04459846764802933,
        0.005724310874938965,
        0.02252909727394581,
        -0.002644521649926901,
        -0.019669031724333763,
        -0.010951098054647446,
        0.0409623347222805,
        -0.08406119048595428,
        -0.009895090945065022,
        0.04551095515489578,
        -0.04956185072660446,
        -0.004773014225065708,
        0.0668175145983696,
        0.02520759403705597,
        0.030614040791988373,
        -0.06705191731452942,
        -0.07587740570306778,
        -0.022350309416651726,
        -0.07613803446292877,
        0.024911969900131226,
        0.03016560710966587,
        -0.016419759020209312,
        -0.0049485107883811,
        0.0026363541837781668,
        -0.06502732634544373,
        -0.020596038550138474,
        -0.053090181201696396,
        -0.023272447288036346,
        -0.03271212801337242,
        0.07528792321681976,
        -0.03388986364006996,
        0.082349993288517,
        -0.06439156085252762,
        -0.029346216470003128,
        -0.025527630001306534,
        0.05407620221376419,
        0.10056964308023453,
        0.04957780987024307,
        0.006015927996486425,
        -0.009330922737717628,
        -0.04084804654121399,
        -0.036426447331905365,
        0.05567788705229759,
        0.03429388254880905,
        0.10420403629541397,
        0.012974957004189491,
        0.1063687801361084,
        -0.055302660912275314,
        -5.938664671134575e-08,
        0.016794882714748383,
        0.1331663280725479,
        -0.002838321030139923,
        -0.009458370506763458,
        0.10140891373157501,
        -0.07082486152648926,
        0.06098174676299095,
        0.06702515482902527,
        -0.07998691499233246,
        -0.03717822954058647,
        0.04906956106424332,
        0.022564155980944633,
        0.05873639136552811,
        0.035984497517347336,
        0.041329946368932724,
        0.028951220214366913,
        -0.05341580510139465,
        0.031197985634207726,
        -0.03659050539135933,
        -0.019520781934261322,
        -0.08703632652759552,
        -0.0371449738740921,
        0.022151630371809006,
        -0.01934279501438141,
        -0.05412011593580246,
        0.08005427569150925,
        -0.009149771183729172,
        -0.02395389974117279,
        0.11862535774707794,
        -0.019171537831425667,
        -0.10193102061748505,
        0.01231092493981123,
        0.009041136130690575,
        0.010534880682826042,
        -0.04447943717241287,
        -0.045784905552864075,
        -0.074409119784832,
        0.020287536084651947,
        0.0685199424624443,
        0.013034779578447342,
        0.010762078687548637,
        -0.030376547947525978,
        0.031110603362321854,
        0.025995124131441116,
        -0.043505746871232986,
        0.026019783690571785,
        -0.07438451796770096,
        -0.11249037832021713,
        -0.019618384540081024,
        0.01308676041662693,
        0.0041596489027142525,
        -0.006728844717144966,
        -0.057298362255096436,
        0.058842968195676804,
        0.013023278675973415,
        0.011244276538491249,
        0.0003650755970738828,
        -0.10433106869459152,
        -0.04050733894109726,
        0.008363778702914715,
        0.025661569088697433,
        -0.07216176390647888,
        0.01975301466882229,
        0.054318636655807495
    ]
}