{
    "id": "yHA2HbNtcG4",
    "title": "What is the Gold Play Button REALLY made of?!?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-12-03T14:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=yHA2HbNtcG4",
    "category": "Howto & Style",
    "tags": [
        "Gold Play Button award",
        "Is the Gold Play button real gold?",
        "Gold Play Button",
        "YouTube Award",
        "What is the Gold Play Button Really Made of",
        "how to get gold play button",
        "Electron Microscope",
        "JerryRigEverything",
        "Whats inside the gold play button",
        "Casey Neistat Gold Play button",
        "Gold Play Button Gold",
        "100k subs",
        "golden",
        "youtube awards",
        "1 million",
        "subscribers"
    ],
    "views": 9782921,
    "likes": 136918,
    "comments_count": 7552,
    "description": "The YouTube Gold Play Button is one of the most coveted awards a YouTuber can get.  Is it really made of gold? Is the Silver Play button really made out of silver? There is only one way to find out. Watch as we take the Gold and Silver play buttons from the YouTube channel WhatsInside, and stick them deep inside a $750,000 Electron Microscope that will give us the exact elemental make up of the Gold Play button.   This is the SAME play button that was cut in half by the Whatsinside YouTube channel:  And HERE on Casey Neistats Vlog:   The Gold Play Button is given to YouTubers who reach 1 Million subscribers.  The Silver Play Button is given to YouTubers who reach 100k subscribers. There is another award for the few  YouTubers who reach 10 Million subscribers... Let me know if you have one, and we can asses the elemental make up ;-)  The Video talks about several different scenarios, but the main point is that the Gold Play button DOES contain REAL GOLD!  Which is amazing.   This video was shot entirely with a Galaxy S7 Edge, and an iPhone 7 Plus. (The computer screen shots were the one filmed with an iPhone. It handled the monitor flicker better, but the audio on iPhone is crap.)  *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/TfL5ivT_NW0",
        "https://youtu.be/SIT8EhUkPxI",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "When I first got my Silver Play Button for passing 100,000 subscribers, my first thought was is this real silver? Is the Gold Play Button real gold? If only I knew someone who was willing to destroy their Play Buttons. [Dan] I can help you with that. [Intro] [Zack] So Dan is from the YouTube channel Whats Inside. And Dan, what in the world drove you to destroy your buttons? [Dan] It was a tough decision but thats what we do, we cut stuff open for our channel. So when we got the Silver Play Button we thought that would be a really funny thing if we cut it in half and then hung it back up and it actually signifies our channel pretty well. But then after we did that and we marched onto a million subscribers, I was a little nervous to do it but we took it on our trip around the world. So it was a fun trip and we cut it open in Casey Neistats office so it was worth it, but honestly it was a little sad cutting it in half. [Zack] Where did you take this again? [Dan] So we took this thing to China, Japan, Guam, Australia, Dubai, the Netherlands, Ireland, England, Paris, New York, Austin Texasjust with this button, like 11 pounds in my backpack the entire time. [Zack] Well I know one place this button hasnt been and thats inside of this electron microscope. What do you say we toss it in here and see what its actually made of. [Dan] Its funny cuz my things been cut in half so youd think that Id be okay with it, but just as long as it doesnt turn it purple or like blue or something Im good with it! [Zack] I cant promise anything, but lets do it! [Dan] Great. [Zack] So heres the back of the Play Button. This is the gold one and it looks like theres just a series of Phillips head screws all along the back and the back is made of wood. And then we got a wood panel right here and then a metal plate on the outside. This back panel comes off. [Dan] Thats it. Now youve got these 4 screws right there. But you want to takeoh theres even moresorry! There are more screws. [Zack] Well, we got a screwdriver, lets do it! [Dan] Okay lift it up and then hold onto the back so it doesnt fall out but because right now weve just got the glass on this side, but basically you just have to take this panel off. [Zack] Oh boy. [Dan] There you go. Now you got it. Hold the frame. Thats it. [Zack] Were getting closer. [Dan] Gold Button right there. Its super dirty. I dont think I even washed it before I put it back in. Look at all the fingerprints on it. [Zack] There it is. This thing is so heavy. Geez. [Dan] Look how dirty it is. [Zack] Looks like you cut it right along that screw line there. Alright so here, this is the electron microscopepart of this microscope. You can see the electron beams come out of that little silver thing right there. And then what tells us the makeup of the actual item inside is this part right here. And this is the energy dispersive x-ray spectrometry gizmo and that tells us what the Play Button is actually made up of. Lets put it in here. And we are good to go. Alright Dan, your Play Button is now inside of the machine. How do you feel? [Dan] Theres no turning back. This is legit here. Im a little nervous. [Zack] Inside of this machine theres a vacuum and it sucking all of the air out because an electron microscope cant work in normal air. There needs to be zero air for it to function. And this is a live feed of different cameras inside of the machine. So this is top down. You can see kind of the arrow of the Play Button there. This is a side profile. And this is a zoomed in shot of the Play Button itself. And then on this screen we have a readout of what actually the Play Button is made up of. So we have this nickel right here and we also have a little bit of gold. Theres a huge chunk of nickel and then we have the gold right below that at 15 percent and then we have the zinc and the copper. And the zinc and the copper is kind of making up like a brass alloy, but on the surface most of it is the nickel and the gold. You can see here that its evenly dispersed across the button. All of the nickel and the gold are mixed together. Were done testing the top part of it. We just barely pulled it out of the machine and Im a little bit surprised that its notI didnt see as much gold as I thought there would be because right hereshow them on the bottom there. [Dan] It says 24 karat gold plated if you can see it just right there. And 24 karat gold is known as pure gold, 100 percent gold or 99.9 percent gold. [Zack] So lets flip it over, well stick the back in there and see if its plated on the back. [Dan] The backs not as shiny. You can see it on there, its justI dont know, its just not as shiny. Check the front out. Its shiny, its glossy. The back just has these scratches on it and its flatso I think we might be onto something. Oh and look at this. You can see the shine comes around the edge right here but then its not on this partso [Zack] Interesting. Lets find out. So right now inside of the machine we have the back of the Gold Play Button here and this is the zoomed in portion of that button. And if we go over here to the graph of the composition we still see the nickel and here we have the gold. And its actually a larger percentage of gold on the back of the button than we saw on the front of the button which is very interesting. The machinewere getting like a lot of readings inside of it. Were getting nickel, were getting gold, were getting copper, were getting one other thing and were trying to decide like whether its just on the exterior or the interior. The only problem with that is that the button is too big for the machine. So theres no way to get a reading of this cross section inside of that thing. So Im going to try to shave a little bit of it off and see if we can get enough of a sample to make it work. So I just took a small fragment from that little screw hole there and were putting it on this tape right here so that it will go on the machine. That particular fragment is from the center of the Gold Play Button right here so well be able to see whats inside of the button instead of just on the surface. Theres that itty bitty sample inside of the big machine and we are ready to go. Heres the side profile of it and we got the beam coming down from the top, sample is here, this is the super zoomed in electron microscope image of it so you can see all of the detail. If we come over here to this monitor its got the center, so the inside of the Gold Play Button is copper and zinc and theres actually no gold on the inside so we know thats all part of the coating. The two most common elements on the surface of the Play Button, nickel and gold, are not inside of the button. So now were going to check and see what the Silver Button is made of. Inside of the machine it goes. So with the Silver Play Button inside of the machine you can see right here is the top down viewhere we have the side cross section, and this is the magnified image of the Play Button. And over here we have this reading which is actually 100 percent nickel on the surface of that Play Button. So it might be something a little bit different underneath the surface, but the surface is 100 percent nickel. So we zoomed in a little bit on a scratch on the Silver Play Button and if we look over here it actually has some copper inside of it as well. So if we jump down here the copper is 6.3 percent and the nickel is 93. So the nickel is definitely 100 percent the surface of the Silver Play Button, but it looks like its alloy underneath with a little bit of copper added to it. So I was a little bit surprised that there wasnt as much gold as I thought there was going to be. [Dan] I mean to YouTubes credit, 24 karat does rub off easily and we traveled to probably 6 different continents with it. So some of it could have rubbed off. [Zack] Thats true cuz it was in like your pocket and your backpack and everything like that. And also on the front of the button where its all smooth and glossy there was 15 percent gold and like 85 percent nickel. But on the back of the button where there was those ridges it was actually more gold. And I think thats because it wouldnt rub off as easily. [Dan] Probably. I mean we did do the part, which I liked, where we took off that small spec that shouldnt have been 24 karat gold plated. And you got to give YouTube credit because they could easily send these things out because the metal that they send looks like gold already, but they actually plated these Gold Play Buttons because we saw it on the front, the back and we didnt see it in the middle. So its on there. [Zack] Its real gold. The Gold Play Button is gold, which is cool. One other variable that we havent really thought about as well is that the electron microscope, when it looks at the surface of something its actually penetrating the surface just a little bit. So that also might be why theres some variance between the gold and the nickel on the Gold Play Button. So I think it would be really interesting to see actually how these things are made and what the process is for getting the gold on them. [Dan] Yeah. Can you imagine like going into a building where they make these things and you just have like a pile of like hundreds of Gold Buttons everywhere? [Zack] That would be so cool! [Dan] That would be pretty fun to see. [Zack] I would just grab one before I hit a million subscribers. [Dan] I would just try to find the Diamond Play Buttons and take that home so I could cut it open. [Zack] Well get it early. [Dan] And if you take a look back here, we have both the Gold Play Button and the Silver Play Button. Zack just stuffed the Silver Play Button here. He has no respect for it. In fact take a look at it. He put it in backwards! You see that?! Its a rewind button now! [Zack] Thats what happens. And speaking of the Silver Play Button, its not actually silver. And there was no silver inside of it. Which, you know, its fine. Its not plated in silver or anything. The exterior was pure nickel and the inside was a nickel copper blend. [Dan] We got this in May of 2016 before we took our trip around the world with it. And what Ive seen is that the buttons that are coming out now are a little bit different. So theyve changed the Gold Play Button a little so Zacks going to get it soon. You guys are helping him. He is on the way. Youve gained like 300,000 subscribers in the last couple of months. [Zack] Its been a lot. [Dan] Its going to come soon enough and as soon as you get yours I want to test that one out and see if its the same 24 karat plated gold. YouTubes probably watching this right now and theyre like uh oh, when we send Zack his lets put a little bit more gold on that one. [Zack] Im fine with that. Give me as much gold as you want! If you want to see how well traveled this Gold Play Button is and where some of the gold might have rubbed off, go ahead and click this video right here and it will take you to Dans channel where he actually cut it open with Casey Neistat. [Dan] It was a once in a lifetime experience. [Zack] Pretty cool. [Dan] It was great. And so Im excited, as soon as you get yours let us know if you want us to cut it open. [Zack] I think Im going to keep mine in the frame and Im going to keep it facing the right direction. [Dan] Alright if you change your mind [Zack] Well see. Okay, thanks a ton for watching. Ill see you around! [Dan] See you guys!",
    "transcript_keywords": [
        "Gold Play Button",
        "Silver Play Button",
        "Play Button",
        "Gold Play",
        "Button",
        "Play",
        "Gold",
        "Silver Play",
        "Play Button inside",
        "Play Button real",
        "Diamond Play Buttons",
        "Button real gold",
        "Silver",
        "Inside",
        "Buttons",
        "back",
        "Gold Button",
        "nickel",
        "Silver Button",
        "percent gold"
    ],
    "transcript_entity_values": [
        "this Gold Play Button",
        "99.9 percent",
        "Dan] Probably",
        "Japan",
        "China",
        "Gold Play Buttons",
        "Casey Neistats",
        "6",
        "Dans",
        "two",
        "100,000",
        "24 karat",
        "Australia",
        "Netherlands",
        "England",
        "the Play Button",
        "Casey Neistat",
        "6.3 percent",
        "15 percent",
        "bitty",
        "the last couple of months",
        "half",
        "Zack] Inside",
        "YouTubes",
        "million",
        "Phillips",
        "4",
        "Ireland",
        "zero",
        "100 percent",
        "their Play Buttons",
        "85 percent",
        "hundreds",
        "the Diamond Play Buttons",
        "Gold Buttons",
        "the Gold Play Button",
        "Dubai",
        "Dan]",
        "Zack] Interesting",
        "Dan] Great",
        "11 pounds",
        "Zacks",
        "first",
        "93",
        "300,000",
        "karat gold",
        "Dan] Gold Button",
        "Guam",
        "May of 2016",
        "the Silver Play Button",
        "Dan",
        "The Gold Play Button",
        "24",
        "Zack",
        "One",
        "Paris",
        "YouTube",
        "the Gold Play Button",
        "one",
        "Austin Texasjust",
        "New York"
    ],
    "transcript_entity_types": [
        "EVENT",
        "PERCENT",
        "PERSON",
        "GPE",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "GPE",
        "GPE",
        "GPE",
        "WORK_OF_ART",
        "PERSON",
        "PERCENT",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "EVENT",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "LAW",
        "CARDINAL",
        "PERSON",
        "GPE"
    ],
    "vector": [
        -0.13800166547298431,
        -0.07901987433433533,
        0.005111084785312414,
        0.01483688410371542,
        0.017552390694618225,
        0.01602773740887642,
        0.1440831571817398,
        0.021580496802926064,
        -0.015725554898381233,
        0.048707328736782074,
        -0.03043372370302677,
        0.0137881925329566,
        -0.024019727483391762,
        0.0303532462567091,
        -0.005814386997371912,
        -0.06127143278717995,
        0.07178940623998642,
        -0.07247177511453629,
        -0.05432158708572388,
        0.018611319363117218,
        0.10504753887653351,
        -0.07022971659898758,
        0.043173450976610184,
        -0.014955183491110802,
        -0.03695142641663551,
        0.08031550794839859,
        -0.06049687787890434,
        0.004331148695200682,
        -0.015527544543147087,
        -0.048685889691114426,
        0.017600659281015396,
        -0.004049669485539198,
        0.07096948474645615,
        -0.019972367212176323,
        -0.15175117552280426,
        -0.10260158032178879,
        -0.005501766223460436,
        0.0462786965072155,
        -0.041933394968509674,
        -0.02163131907582283,
        -0.023111265152692795,
        -0.0012566086370497942,
        0.013993175700306892,
        -0.028636330738663673,
        -0.010524781420826912,
        0.05386234074831009,
        0.004114331211894751,
        -0.07751992344856262,
        -0.017176035791635513,
        0.041439078748226166,
        -0.04918346926569939,
        -0.006318136118352413,
        0.018642926588654518,
        -0.05422984063625336,
        0.04192120209336281,
        0.003019108437001705,
        0.011945044621825218,
        -0.11234597116708755,
        0.06815055012702942,
        0.03508799150586128,
        0.05410425364971161,
        -0.05457649752497673,
        -0.015294132754206657,
        0.037205759435892105,
        0.055158209055662155,
        0.031632665544748306,
        0.031722988933324814,
        -0.056046441197395325,
        -0.028987128287553787,
        -0.0900728777050972,
        0.03229886665940285,
        0.0486820712685585,
        -0.07070323079824448,
        0.05609050765633583,
        0.021369770169258118,
        0.04058779031038284,
        0.04459434747695923,
        0.0015528337098658085,
        -0.0039761909283697605,
        0.06550916284322739,
        0.0846189334988594,
        -0.025754066184163094,
        -0.002566424198448658,
        0.009276560507714748,
        0.016314459964632988,
        0.0024408940225839615,
        0.07531535625457764,
        0.033245254307985306,
        -0.07601641863584518,
        -0.10934591293334961,
        -0.06333444267511368,
        0.08029109239578247,
        -0.06871446967124939,
        -0.030849866569042206,
        0.07332279533147812,
        0.016031332314014435,
        -0.05402102693915367,
        -0.07457168400287628,
        0.006945532280951738,
        0.033706460148096085,
        0.09028930962085724,
        0.03890771046280861,
        0.051486749202013016,
        -0.1173400953412056,
        0.07842498272657394,
        -0.03603421524167061,
        -0.08424875885248184,
        0.14572755992412567,
        -0.006248909514397383,
        0.0793682411313057,
        0.015511476434767246,
        -0.0011130388593301177,
        0.020679321140050888,
        -0.011748279444873333,
        -0.011366532184183598,
        -0.0024784961715340614,
        -0.03976334631443024,
        0.052714183926582336,
        0.010510745458304882,
        0.017291635274887085,
        0.10656102001667023,
        0.011441108770668507,
        -0.036076076328754425,
        0.0374063216149807,
        0.045380644500255585,
        -0.010474661365151405,
        0.0018315922934561968,
        2.381969222602481e-33,
        0.007692062295973301,
        0.011821410618722439,
        0.0006795579101890326,
        -0.046246591955423355,
        0.00789820495992899,
        0.04273700714111328,
        0.0348222441971302,
        0.07367603480815887,
        -0.0049006035551428795,
        0.04299619048833847,
        0.013945229351520538,
        -0.0034437677823007107,
        -0.03215952217578888,
        0.05835218355059624,
        0.004831202793866396,
        0.008796190842986107,
        -0.046845804899930954,
        -0.10561215877532959,
        -0.03545669466257095,
        -0.03416265547275543,
        0.0424099862575531,
        0.044722314924001694,
        0.03566771745681763,
        0.022986125200986862,
        -0.07839886844158173,
        0.07504652440547943,
        0.013107256963849068,
        -0.03385487198829651,
        -0.01654399372637272,
        -0.013402359560132027,
        -0.047854240983724594,
        -0.036519572138786316,
        -0.03609337657690048,
        -0.031015658751130104,
        0.01971198245882988,
        0.03676939010620117,
        -0.06554998457431793,
        -0.09108082205057144,
        0.015521536581218243,
        -0.026086755096912384,
        -0.018779227510094643,
        0.009126303717494011,
        -0.042583711445331573,
        0.07498489320278168,
        -0.07690182328224182,
        0.01837986707687378,
        -0.02885388769209385,
        0.00815277174115181,
        -0.01863960735499859,
        0.022583501413464546,
        0.010737311094999313,
        0.007855972275137901,
        0.04699810594320297,
        -0.00024148567172233015,
        -0.04301392659544945,
        0.058409374207258224,
        0.039077628403902054,
        -0.02475373074412346,
        0.009869884699583054,
        -0.01957591623067856,
        0.08392283320426941,
        -0.016169225797057152,
        -0.030531328171491623,
        0.13365164399147034,
        -0.09530992060899734,
        0.13232465088367462,
        0.009594451636075974,
        0.048464223742485046,
        0.015023545362055302,
        0.00407607015222311,
        0.033180128782987595,
        -0.03254769369959831,
        0.015378016978502274,
        -0.042896464467048645,
        -0.059398822486400604,
        -0.05653301626443863,
        -0.005488763563334942,
        -0.07103759795427322,
        0.08141381293535233,
        0.04877025634050369,
        -0.06490080058574677,
        0.0138008464127779,
        -0.01721116155385971,
        0.004296933300793171,
        -0.056922998279333115,
        -0.02661234512925148,
        -0.05039219558238983,
        -0.0868086889386177,
        0.031318582594394684,
        -0.05393238738179207,
        0.008301392197608948,
        -0.07920249551534653,
        -0.03243037313222885,
        -0.00581506360322237,
        -0.00047896921751089394,
        -3.2675907072738234e-33,
        -0.06316720694303513,
        -0.003849050961434841,
        0.014220401644706726,
        0.038582682609558105,
        0.03862004354596138,
        0.0006305042188614607,
        -0.022844472900032997,
        0.1082846075296402,
        0.013296659104526043,
        0.04605447128415108,
        0.03879900649189949,
        -0.014595000073313713,
        -0.028844961896538734,
        -0.0020548487082123756,
        -0.048695553094148636,
        0.04514797031879425,
        0.016615279018878937,
        0.0742359310388565,
        0.007811833638697863,
        -0.04344647005200386,
        0.012201374396681786,
        0.056463781744241714,
        0.03015473112463951,
        0.03999434784054756,
        0.01521221548318863,
        -0.028613384813070297,
        0.06528320163488388,
        0.0034670366439968348,
        0.08782497048377991,
        0.04037012159824371,
        0.05636315792798996,
        0.023228762671351433,
        -0.041780438274145126,
        -0.05204298719763756,
        -0.033976584672927856,
        -0.03901064395904541,
        0.0809766948223114,
        0.00566079281270504,
        -0.0751001238822937,
        -0.025471793487668037,
        0.013589825481176376,
        0.06703900545835495,
        -0.002911179093644023,
        0.017882101237773895,
        0.0677490234375,
        0.08391045033931732,
        -0.0030247492250055075,
        0.019931521266698837,
        -0.020376056432724,
        -0.006753663998097181,
        0.018542984500527382,
        -0.039864372462034225,
        -0.00023368009715341032,
        -0.003141034161671996,
        -0.08059247583150864,
        0.01701459474861622,
        -0.024147650226950645,
        0.024649603292346,
        0.006699434015899897,
        0.0322427898645401,
        0.06543790549039841,
        0.0332818441092968,
        0.020341558381915092,
        -0.009189119562506676,
        0.0021067389752715826,
        0.025080209597945213,
        0.07405463606119156,
        0.0773092657327652,
        -0.08171959966421127,
        -8.068513125181198e-05,
        0.02280334010720253,
        -0.008748725056648254,
        0.03677716851234436,
        -0.07060278952121735,
        0.06949243694543839,
        0.07342153042554855,
        -0.03483065962791443,
        -0.00035199959529563785,
        -0.05517322197556496,
        -0.05484021455049515,
        0.04249505326151848,
        0.006894388701766729,
        0.05254553630948067,
        -0.035256560891866684,
        0.010236804373562336,
        0.049328289926052094,
        0.046464480459690094,
        0.0223695058375597,
        -0.13770118355751038,
        0.0737118199467659,
        -0.054205238819122314,
        0.026621302589774132,
        -0.05497456341981888,
        0.029017146676778793,
        0.08337411284446716,
        -4.573201195512411e-08,
        0.025229420512914658,
        0.08414393663406372,
        -0.06153831630945206,
        -0.06635808944702148,
        -0.03311627730727196,
        0.013358508236706257,
        0.03606168553233147,
        0.008236552588641644,
        0.006005588453263044,
        -0.07526493817567825,
        0.022159647196531296,
        0.006197558715939522,
        -0.08847209066152573,
        0.03039713390171528,
        -0.06373421847820282,
        0.08258680254220963,
        -0.04408635199069977,
        0.026203257963061333,
        0.0022071327548474073,
        0.08469725400209427,
        0.039422206580638885,
        -0.024113014340400696,
        0.12905816733837128,
        -0.06933555006980896,
        -0.11117595434188843,
        -0.015730809420347214,
        -0.008185455575585365,
        0.046156588941812515,
        0.004529049154371023,
        -0.028970438987016678,
        -0.03301653638482094,
        -0.044348664581775665,
        -0.031357161700725555,
        -0.06162199005484581,
        0.0018754055490717292,
        -0.00155483721755445,
        -0.01855725608766079,
        -0.06295712292194366,
        0.02476133033633232,
        0.002172688255086541,
        -0.050896380096673965,
        -0.10789024084806442,
        -0.012130231596529484,
        0.02777475118637085,
        -0.018079468980431557,
        0.007346997037529945,
        -0.12072201073169708,
        -0.05234825983643532,
        0.02943674474954605,
        0.03506298363208771,
        -0.0597960501909256,
        0.008532119914889336,
        -0.08865749835968018,
        -0.09267156571149826,
        0.0505247488617897,
        -0.0182628370821476,
        0.0002994194801431149,
        -0.005358747206628323,
        0.012403931468725204,
        0.028685208410024643,
        0.08721505850553513,
        -0.12576572597026825,
        0.03244739770889282,
        0.09094458818435669
    ]
}