{
    "id": "YiQz0woFc4Y",
    "title": "Amiga Emulation on Raspberry Pi (Amibian) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-04-04T20:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=YiQz0woFc4Y",
    "category": "Science & Technology",
    "tags": [
        "Amiga Emulation on Raspberry Pi (Amibian) - Krazy Ken's Tech Misadventures",
        "Commodore Amiga",
        "Amiga",
        "Amibian",
        "AmigaOS",
        "Amiga Emulation",
        "Raspberry Pi",
        "Linux",
        "Workbench",
        "Amiga Workbench",
        "Kickstart ROMs",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Funny",
        "Computer",
        "Tech",
        "Comedy",
        "Humor"
    ],
    "views": 52078,
    "likes": 1002,
    "comments_count": 159,
    "description": "It's time for AmigaOS and Raspberry Pi to collide! Today, Krazy Ken attempts to emulate the Commodore Amiga via Amibiana Linux distro tailored for Amiga emulation on the Pi.  Support the show and get in the credits   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #97 - Amiga Emulation on Raspberry Pi (Amibian)  Pledge on PATREON now to get your name in the show credits and gain access to Krazy Ken's exclusive Discord server!*   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  *not all Patreon tiers qualify for all rewards  #KrazyKen",
    "description_links": [
        "http://patreon.com/krazyken",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://patreon.com/krazyken",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] This is going really great, I already plugged in the power upside down, okay. This Amiga could fit in my pocket. That's pretty bitchin'. - [Robotic Voice] Hello, I am Macintosh. - [Krazy Ken] That's (bleep) amazing. (sonar bleeping) (upbeat techno music) Hey guys, how you all doin'? Really, that's just great. You know, I'm doin' pretty great today, too, except I'm a little anxious about today's experiment. If you have not seen the previous Raspberry Pi episode I highly recommend you check that out. Here's the thing though, I'm a little anxious about it because I have very little experience with the Raspberry Pi. Literally the time I made that other episode was the first time I ever used one. So not much experience. And I already want to experiment with the thing and turn it into an Amiga Emulator. But hey, with the power of friendship we can make this happen. Here's the goal for today. I wanna take that Raspberry Pi Model 3 and turn it into an Amiga emulator. The goal with these tech video logs is to capture everything in the moment with very little preparation. However, I slightly broke that rule today. Before I started documenting, I did a little bit of research ahead of time just to make sure things were solid, and boy did I swear a lot. (laughing) Okay, so it seems pretty straightforward. I took notes, everything's great. The main issue I encountered was acquiring the ROMs legally. I am a bit of a straightedge, aside from the booze, so I like to get stuff legally. So I went to a website and it was perfectly fine. It was Amiga Forever. You could get ROMs from there for a low price. No big deal. However, I paid the money and the website downloaded a frickin' MSI file. (laughing) And I can't do anything with that. And even if I could it wouldn't be as fun. They have a user-friendly way to run the Amiga system on Windows, which we may look at later. But that's not as fun as emulating it on actual Raspberry Pi hardware. So that was kind of useless to me. However, they sent me another link with an ISO, and I was able to dive into it and get the ADF, Amiga Disk File, files. And the, supposedly these are the kickstart ROMs to actually get the system to function properly. So after a little bit of swearing and banging my head against every hard surface I could find, I think I got it down. I have the files in that folder. We have a full-size SD card adapter. Like that right there. Click it in. Now how much do you wanna bet when I insert the card the Mac isn't going to read it? I don't know if I'm the only one that has this problem, but anytime I put an SD card into a Mac I have to do it twice for it to work. All right, I inserted the card, and there. It actually worked. So I'm just gonna erase this. I'm not gonna give it a particular format right now. I'll put you back over here in the meantime. There you go, nice and cozy. All right and that's done. Okay, so now this is back to 15.89 gigs. All right, yes, update error, beautiful. All right so it's got the SD card auto-detected. Let's throw our disk image in there. So now we're gonna flash the SD card with Amibian. This will act as our emulation software. While that's imaging I have my flash drive, which everyone says looks like a PC destroyer or something like that. I swear that's not what it is, that's just how it looks. We'll get that mounted. I don't even know what's on this flash drive. Untitled. Oh yeah, those are bootcamp drivers. But basically I need a way to have the ROMs stored side-by-side with the SD card. So I need to be able to access the ROMs off of the USB drive while I'm booted off the SD card. So, let's just erase this. I'll just call it, STICK. Okay, that erase is complete. Get out of there. All right, hello STICK, how are you doin' today? I'm gonna take all of these files. I probably won't use them all, I'm just gonna drop 'em on there. This should contain ADF, again, Amiga Disk File. This should contain a bunch of workbench environments. It looks like we even have fonts. These are basically our virtual floppy disks. And then in our ROMs, once that's copied, those are the ROMs that simulate each different computer. So we have one for the Amiga A540 or whatever, and et cetera et cetera. We have now entered the crucial validation stage. About 5,000 items left to copy to STICK. And Flash Complete. We're still working on our STICK here. Let's zoom in on that STICK. Oh yeah, that looks pretty. While the STICK does its thang, let's just take out the SD card, remove the micro, and pop it back into our delicious Pi. Let's see, there we are. And just click it in there. And the transfer is complete. We'll eject the flash drive, and we're ejected. So now let's set up the Pi and the peripherals. Keyboard and mouse will just go into here. And our flash drive with the ROMs and the ADF files and all that good stuff will go right there. And our power supply. Uh, cable can't really reach. Okay, well, I'll plug that in later. And the HDMI, scoot this over here, it's actually a DVI masquerading as an HDMI, thanks to this beautiful conversion technology. We have a dongle and plug that in so we can see things on the screen. All right. Gucci, let's get power in there and boot it up. I really hope this works. Actually it was kind of a mini blessing in disguise that I couldn't get the power to plug in right away because there's no switch on here. It just would have started booting up before we could see anything. This way we can now witness everything together. All right, I'm gonna plug in power, hopefully it works. If it does work we should see like a splash screen and then a configuration screen. But again, that's just the extent of my mini research. I haven't done a lot. A lot of this is on the spot, as it should be. This is going really great. I already plugged in the power upside down. Okay, all right, we got a light. There you are. And I see things blinking. Oh, there's Amiban, I just saw that. Or Amibian, excuse me. And there's the configuration screen. So far, so fabulous. Okay, so config screen is good. Let's, can I press escape here to get outta that? Because I believe we need to do a few things in command line, and that clearly didn't work. I just pressed escape and I got a black screen. (laughing) Shit. F12. Ope, there we go. Yeah, okay, F12 is the config screen. I got that shortcut right. Quit. There we go. Beautiful ASCII art. All right, Amibian 1.4. So now I believe we need to do, again, I did take a few notes. I think we need to expand the file system on this card. So raspi-config? All right, that's exactly what I wanted. And I don't know what to do here. (laughing) Okay, I'm gonna have to hit up the Google machine quick. You know, I might be thinking of something different here. I maybe was looking at some older instructions because I have fewer menu options than the instructions I was lookin' at. So I'm starting to think we don't need this. So, all right, let's do that. Let's get out of there. Quit this. So I guess, yeah, I can skip that step. Hooray for preemptive research, I'm so excited. The thing I need to do is I need some kind of File Manager. So MC's the one I know of. Good. Look at all these question marks. Kinda reminds me of that guy who wore the question mark jacket in those commercials. I, uh, it's probably a very obscure reference. I don't even remember what the company was. So I'm just gonna get my bearings. Tab tab tab. Okay, so we got that. Silly me I was looking for a media folder, but I forgot I have to go up a level. There's our media. Okay, so, oh, USB. Mmmhmm. And it should be this device. That should be my STICK, right? Oh it is, shit! Okay, we're good. Spotlight. Yeah, see that's a hidden file the Mac will put on there. Okay so we got that side. Oops, and so now let's see, where am I goin' here? So I'm in the root there. No that can't be right. I'm looking for like a kickstart directory. Amiga files? There we go. Okay, kickstarts. We are now cooking with some sort of flammable material, maybe a petrol, gasoline maybe Aros, Aros? However that's pronounced. If I remember correctly that's a built-in like open source type of kickstart ROM? But I would like to use the kickstart ROMs I purchased from Amiga Forever. So I guess that could work. But anyway, let's see if this works here. Go to ROM. Okay, there are a shit-ton of ROMs here. Okay. Shit, should I just start with one? I don't even know which one I wanna start with. There's all these different models of the Amiga computer. I kinda wanna do something that runs an older OS. So it says OS here with a number. I'm guessing that's the version number, 1.1 or something. So we're goin' like really far back here. I mean, what the hell, let's just try one for shits and giggles and see if it works. So AmigaOS 130 ROM, I'm guessing again that's 1.3. So now down here number five. This is like our command bar. Five for copy, and I don't know how we move it. Or is it F5? Nope, F5 just moves my option down, that's weird. Okay, it's function F5 'cause I'm on a Mac keyboard. That would explain it. So even though we have numbers down here, cardinal numbers, they're referring to the function keys. Yep, that looks good. We're gonna copy from here to this kickstarts directory. There we go. Let's tab over. Now we need to get floppy images on here. But let's go back to floppys. Well that's easy to understand. Let's go back here, go back up a level to our floppy folder. And this is, or well the ADF folder. And, oh, idiot. Sorry, this is the actual directory right here. That's what I wanted. So I guess we could just copy all this stuff over. Can we do shift? Oh yeah, it highlights, oh, oh yeah, it highlights it in yellow. Okay. I see where they're goin' now. Let's just shift select all this shit. Actually some of these things look like hidden files by the macOS that we don't want. Yeah, those underscore ones? Yeah, I think that's something the macOS did. But no wait, wait, oh yeah, yeah, yeah, never mind, yeah, we probably don't want that shit. Let's just do these. These are the good boys. We like that. We'll do function F5. And go to OK to copy into here. There it goes, woo. That was speedy. That was like Sonic. Like gotta go fast. That was nice. So I have more ROMs I could experiment with later, but let's just start with the one. So we'll do F10 for quit and give it a good reboot. Bong. I miss the Mac startup sound, I'm sorry. I'm feeling the void in my heart. Okay, back at the config screen. I'm noticing something else here, too. The instructions I researched earlier showed a slightly older version of this. I think it was Amibian 1.3 and this is Amibian 1.4. I have this Quickstart button that I don't think the original writer of the instructions had. That's interesting. So I don't really know what Amiga I want to emulate. I copied that one particular ROM. I'm not sure which computer that ROM will work with. But I guess a little trial and error won't hurt. So let's assign that one kickstart ROM we copied over. You know, Demetri Martin is right, everyone does soft phaser shots when they're thinking. It's like chu chu chu chu chu chu. Yeah. It's not like pew pew pew pew pew. Okay, Amiga files I think we were under. Oop, I clicked too much. Kickstarts, amiga-os-1.3, again, I'm guessing that is what that means. So I'm just gonna give this a name. Oh what the (bleep) did I do? I don't know what I just did. I just hit save and I lost it. Okay. F10 is not summoning the config screen. Or is it F12? But I still can't summon it. Well, there's been a glitch in the matrix. We've (bleep) up. I'm gonna hard shut down. Just yank the power. I don't have a switch on here. Monitor going to sleep. Not for long, boy, your day is just begun. And so has mine. We're in this together. Okay, so I don't know if I just lost all those settings. I probably, yep I did, okay. So do I just hit Start then? Clearly not. Okay, we F-ed that up. So what's this? I double clicked it, got a black screen. And again, it will not let me go back to the config screen. Yeah, I may have to hit up the Google machine again and find something that's a little more up to date because what I'm looking at is for Amibian 1.3, not 1.4. Okay, so I don't know what's up. Every time I go to save a configuration, it just. Oh now it. Right, so now it saves. I don't know what was up, why last time I hit save it just went to a black screen. All right so I'm still tryin' to figure some of this out here. I don't know, maybe I'm just not using the right ROM file. However, since we're doing a little bit of trial and error we might as well just copy all the ROMs over. Ope, that's a move. Let's cancel that. I pressed F6, I want F5 for copy. Yep, and there was one that already exists. Let's override it. And yep. That makes sense to override. Good, okay. So now we have all the ROMs so we can stop messing around in Midnight Commander. We have all the ROMs and all the ADFs, so now it's just a matter of getting stuff to work from the configuration screen. So going back to Workbench, which I talked about earlier, let's try to run 1.3. And Workbench was like the operating environment, the little GUI that ran on top of the system. So DF0 and DF1 are the disk drives in this case. Hopefully we can actually get shit to load. Well, let's just try this, workbench 134. And then let's get the extras in there for 134. So now the all mighty save button. Will it (bleep) everything up? We'll just call this Ken and Save. And of course it brings me to a black screen. Why? Why does that keep happening? I don't know. I'm just gonna avoid that configuration screen. 'Cause that's just bein' a dick. Let's try that ADF again and this ADF. ROM, see we still need a ROM. Okay, 1.3, Start, do something. No. Come on. What am I doing wrong? Let's see if we can get the Workbench loaded, I guess. Holy shit. We got a white square, okay but we got a white square so that's a step further, I guess. I've never been so happy about a white square in my life. I think it's really just this ROM file issue I'm having. 'Cause like everything else seems to be configured just peachy. Oh there's probably should have read up there. There's some shortcuts up there. Well that's nice. So I can do three and, oh shit, cool. So uh, yeah, let's try Amiga 4000. We maybe need a hard disk. Oh shit. I didn't copy and hard disk, hard disk images. Where's our flash drive? There you are. Okay, let's see what's in the HDF folder. So we have a couple workbenches. Yeah, let's just copy them all. F5, doo doo doo doo doo. Okay, ope, I just moved them to the (bleep) wrong place. I wasn't even thinking. Delete three files, yes please. All right so we'll copy that. OK. All right so now those are in the HDD folder. Hopefully that's just fine. Oh peachy, okay. Let's do a reboot just to be safe. For the newer systems we need a hard disk image? I could be wrong. Maybe we could have booted off a floppy drive and I clearly don't know how this works. Right. Hard file, yeesh. Maybe that's what this is? I'm guessing, oh I'm guessing a lot right now. Amiga files. Okay, so hard drive, root blah blah blah blah blah, read writable, six megs. What WOrkbench did I load up? Was that 3.1? I think it was 3.1. 'Cause I don't know if I need 3.1 to match here. I don't know if it needs to be identical. And Start. Still nothing. And I'm a sad boy. Yeah, I can't figure this out for the life of me. So here's something interesting. If I do MC for Midnight Commander, you see we have the same files and everything we were looking at earlier, woops, but we had like these questions marks that were being used as the ASCII character to kinda draw our interface. But what I noticed was kind of interesting is if I just press four, to open Midnight Commander, it gives me a much cleaner look without all those weird question marks all over the place. I don't know why but that's what it did. I don't know, just an interesting tidbit. Might not really help us out much right now. I'll figure this out, though. We'll get there. Okay, ladies and gentlemen, I wanna try something here. Oh, that's dangerous. I think I missed a file. So let me go back to my media here. Go to my USB drive here, back to ROM. I didn't copy this little guy. I did a quick hit up on the Google machine. Apparently all these ROMs are encrypted, which makes sense because, well I'm guessing it has something to do with the reason that they're still copyrighted and they're sold through Cloanto's distribution sites. And I'm guessing you need this key file so these will actually run. So, let's try copying that over. See if that maybe fixes all this shit. Boop, okay. Now we have the key file inside all of that good stuff. So let's go back to the emulator. Go number three, hit enter. So we'll do an Amiga 500 once again. That's standard configuration 1.3 ROM. We'll load, I don't know if the frickin' disk images. Let's not even pay attention to the disk images right now. Let's just try to get the ROM working, right? Oh, hello, and now it automatically found the ROM with KS in the name. It automatically put that in there, KS for kickstart. And Start. Son of a bitch. Wow, wow, what the (bleep). Shit, it was working this whole time, I just didn't have the key file to decrypt the ROMs. Oh my gosh, I am an idiot. Let's celebrate by littering. No just kidding, that's an obscure reference. So I have the ROM. It's just the ROMs that are super protected. That's the issue. That was the little linchpin of this whole operation. So now let's do, go back to quickstart here. Let's go to DF0, floppys, and we'll do 134 for the workbench and then we'll do 134 extras and reset. Will this work? Maybe. It looked like it was loading pretty slow there because we're, oh, hey, shit, because we're emulating a very slow processor. Oh, my gosh. AmigaDOS, Workbench Screen. I've never used this stuff before. I will admit I've never used an Amiga before. Oh my gosh, it's loading shit. And this is probably how slow it really was. What are we emulating? Like a seven megahertz, 68k, something like that? It looks like it's still loading something. So let's see, we got a button and a button. Okay, that's good. Hey. We got a desktop. I still can't believe this whole thing didn't work because I didn't copy a frickin' file. I am an asshole, to myself. Wow, okay, Workbench release. We have 864,576 free memory, bytes, yes. A RAM DISK, Extras 1.3, and Workbench1.3. Let's open this boy up. The loading cursor is a little like sleeping icon. That's pretty awesome. Wow. The wire frame looks pretty nice. So we have like these little drawers, which I guess these are folders, and a Trashcan. Let's go to the System folder. Get the little loading icon again. DiskCopy, FastMemFirst with a cute little bunny jumping over a tortoise and then NoFastMem. No rabbits allowed in this area. And then we have MergeMem. Okay, this has to do with memory stuff, I would imagine. And we can press that to close. Sweet, and what do we have in our little extras floppy disk, huh? BasicDemos, Tools, Devs, Fonts. We got fonts boy. Oh and the drawer icon opens up when you open it, shit. That's pretty. That's a nice touch. I don't think we have any fonts in here though. Oh okay so. Oh. That's interesting. So these buttons will force the window to stay in the background or come into the foreground. Hey, I'm learning stuff. This is cool. All right, let's close that. Shit guys, we're running this on a Raspberry Pi. Like, we're not running this in some like Windows software to make it easy and user friendly, 'cause that's not how we do things around here most of the time. We're running this on a frickin' Raspberry Pi. This Amiga could fit in my pocket. That's pretty bitchin'. BasicDemos, okay. Let's see. We have Speech, LIST-ME, AboutBmaps, Demo, Screen, a lotta stuff, oh man. I love those long render times to refresh the screen and load all the items. It just oh it feels so 80s, even though I wasn't around in the 80s, I'm sure if I was that nostalgia of the slow render times or the slow load times I should maybe say, I bet that feels nice. Okay, now speech sounds fun. But if it involves sound we're at a bit of a loss. I have no speakers hooked up, but let's open it anyway. Oh, hello. Use Mouse to change control settings. Please type what you want me to say, followed Return or press Return to repeat the last message. Okay, you know I'm gonna find some headphones that we can just use as speakers. Oh that'll be fun. Okay, so, I have a headphone jack right there, okay. And we have Sennheiser headphones, beautiful. Let's do this. Pitch, range, voice. I don't know what that slider really does, but, yeah we'll keep the volume all the way up. Let's just have it say, this'll be great. Hello, I am Macintosh and Return. - [Robotic Voice] Hello, I am Macintosh. - [Krazy Ken] That's (bleep) amazing. Holy shit. (laughing) That kinda sounded like the original Mac, right there. Dude, this is the greatest day ever. It sure is great to get out of that bag. - [Robotic Voice] It sure is great to get out of that bag. - [Krazy Ken] Oh my gosh. Oh so, now if we, I guess go higher. - [Robotic Voice] It sure is great to get out of that bag. - [Krazy Ken] It's the Macintosh who is kind of going through puberty right now. - [Robotic Voice] It sure is great to get out of that bag. - [Krazy Ken] So now it's more monotonous. I'm not one to have an amazing piece of retro vintage computer technology say something inappropriate. Who am I kidding? Of course I am. I am going to enjoy this. - [Robotic Voice] (bleep) her right in the pussy. - [Krazy Ken] Oh that's beautiful. That's artistic, such beautiful poetry. Let's close out of there. Let's see what other BasicDemos we have. ScreenPrint, Library, Screen, looks like object edit, Picture. Let's just look at Picture. Hey, it drew like a, is it still a sphere if it's taller than it is wider, spheroid? Something like that? May wanna double check my geometry. Shit, we can drag this around, man. Refreshes right there. Little flickery, but hey, we're talking like 1985, we're cool. Or '87, I don't know. One of those years. I wonder, hmmm. I'm curious. What if we just did this? Nope hang on. I'm trying to see if I can like get it to stretch and fill the whole screen. If I can't, no yeah, no yeah, I can't do it from the monitor 'cause the monitor thinks this is running mostly native because it's running inside of Amibian. But I wonder if I, I'm curious about this. Let's do this and, there we go. That is what I'm talkin' about. It's a little stretched, but that's cool. But yeah, I don't see, 640 by 256. That doesn't look like 640 by 256. 640 by 256 would be like really wide. This is more like four by three. So, I don't know. Maybe I'm, maybe I missing something there. But let's turn that off. I like, I don't mind if it's a little more stretched out. It fills the screen now. This is beautiful. What's in our Library? Ew, SetSoftStyle, eight, one, different like font variations or something? Ok, Ok, Ok, Ok, it's like talking to your mother on the phone. Ok, ok, ok, ok, ok, ok, ok, ok, ok, ok. Yeah, okay, Library, that's what that is. Now I know the Amiga Forever package I purchased does have a lot of games as well, but I haven't found a way to extract those disk images from the package. I was able to extract the ROMs, I was able to extract the Workbench environment floppys and stuff like that but I don't see a way to extract the games. So I may have to figure that out later. But at least we're this far. Oh look at that redrawing. That's so cool. I'm fascinated by screens redrawing themselves. I don't know what it is. Maybe it's just nostalgia. You can shrink this baby down. I don't know, it doesn't let me type in it. I don't know if it's not picking up the keyboard or what. But the other speech demo was picking up the keyboard. So yeah, we can't really minimize this or even drag it off the edge of the screen. As you can see the wire screen just kinda sticks there. But we can do this. We can do this. (laughing) And now it kinda just sits back there. That's an interesting approach. I haven't seen an OS that does that. Oh hello, we have other things here. I don't even know what a, oh hang on, ball, I think I know what this is. Or maybe not. The icons have no default tool. Oh it's a bmap, bitmap, is that short for bitmap? Let's look at the about. Bmap files to call system library functions. Oh, the BasicDemos directory contains execs. Still scrolling. I took my hand off the arrow key, but I think I sent too many. Ope, we beeped a lot. (beeping) And it's flashing. Yeah I sent too many down commands. I guess I pressed the button for too long. Let's close out of there before we kill the poor system. OK, yeah, I feel ya. Screen, what lies in here. After this I do wanna see if I can get a different version of the software running. Oh hello, oh. A little bit of a seizure warning here, but yes we have lines. Oh dear, how do I close this. Oh you gotta do that and then it should bring me back to the Workbench. There we go. All right, so let's go back to the config screen and let's just restart. Beeboop. And we're back in action. Let's do maybe an Amiga 4000 configuration this time. It looks like it already found the ROM automatically, pretty frickin awesome. And let's see, so for our CPU we're using a 68030 now with a floating point processor it looks like. And we're at fastest, whatever clock speed that actually is. Start. Let's see what we get. Wait, did I load in. Oh, wait, hang on (laughing). I'm an idiot. Gonna pull the power 'cause I couldn't get back to the config screen for some reason. So I loaded that configuration. It found the ROM but I don't think it found the hard disk image. I think we need to load up Workbench3. 'Cause the 4000 was a newer computer. I guess add hard file, maybe? I don't really know. Let's try that. So now we have that in there. Double check the ROM. It's got the ROM, and Start. All right, we got a screen, that's a good start. All right, we're in the Workbench. Copyright '85 to '93. So a couple differences. Graphically it looks a little different. It looks like we still have that stack or background button, whatever that's technically called. But it looks like we also have a little resize button in addition to that. And the scrolling arrows are grouped together. They're not on the top and the bottom. I think that's a think next step also did. And here we go. Ram Disk, what's even in the Ram Disk. Yeah, I figured it was 100% full. Okay, so now we're in here, in the Workbench route. Utilities, System, Devs, Expansion, Storage, Tools. What's in Tools? Commodities. Calculator. I need to do some calculations. All right what is five plus. Oh, it puts a decimal in there, interesting. Five plus five. I've heard rumors that it's 10, but I don't believe it. (beep) it is 10, wow. Man, not everything is fake news nowadays. All right, so let's see if I do this, okay, it kinda like does a window shade thing, and if I do that it stacks it in the background, which I now don't know how to get back to. I guess I did it somehow. Oh no it's still back there. So do I press it again and it comes forward? Yes, awesome. And windows shade right there. Cool, and then that closes it. We got that. Let's see, there's my soft phaser beams again. You know, that's an interesting thing. You can keep scrolling and the scroll bar just gets smaller. Okay. Commodities, what's in here. Some things. Let's see if we have any extras we can load into this boy. I don't know if we have any floppy images for that. I don't know if I'm gonna be able to, oh hang on, there it goes, hey it mounted. And we have a little stopwatch waiting cursor now as opposed to the sleepy thing. Prefs, oh this is interesting. So let me go to, oh, I never really thought about it, but when I click in a window it doesn't overlap the window in front of it until I click that button. That's interesting. Was that because of like a legal issue, like a copyright issue or a patent issue with the GUI that the Macintosh had? 'Cause I think, didn't, didn't Windows have a problem with that. 'Cause the first version of Windows just had tiling stuff. Stuff didn't actually overlay, but I don't know if that was a legal issue. I just think that was bad development. Oh man, I really need to research that. But yeah, the windows won't overlap until you actually click the button to put 'em in the foreground. So it's like is it a technical limitation or was it like a legal limitation? And it's like, oh, you can't click on the window to bring it to the foreground. That's a thing that Macintosh does. You can't do that blah blah blah. Oh but a workaround. You can click a button to make the window come to the foreground. Loophole. Is that how that worked? I'm gonna have to look that up. I'm sure some of you will comment about that. That is really fascinating to me, though. That is really cool. I'm gonna close all this stuff and kinda start clean here. Let's go back to here. Prefs. I wanna see if we can change stuff, change some settings. Pattern. Oh. So we can like change our colors. Oh. Use. Oh hey we set a pattern in the background, all right. This is success. Let's do this one, yeah. Yeah, here we go. Overscan. Oh yeah, actually, I wanna change that, too. Now that I'm thinking about it. Boop, don't correct. There we go. Now we're using all of the pixels on the screen. Palette. Oh shit. Active Window Title Bars. Let's go, let's go green and use. There we go, now we got a green system. Look at that. A lot of the icons like had accent colors that changed. Let's go maybe with a purple. Oh that's a little harsh on the eye. What did, oh no, I changed the wrong thing. That was dumb. Background, I meant, let's keep that back at like the gray. And let's change the Active Window Title Bars and apparently other accent colors, we'll change that to purple. There we go. That looks pretty bad. (laughing) But we're talking the 90s, it's fine. Let's go back to a somewhat more bearable color. Just like a desaturated blue. No I changed, why do I change the wrong shit all the time? IconEdit, what? Look at that. You can edit pixel by pixel to change icons. That's pretty cool. So looks like a developer tool of sorts. Quit, Save then Quit, Cancel. Huh, interesting save panel. Could I mount the really old Workbench extras? Let's see, oh yeah. It even has a little different icon there. Got a Trashcan. And it looks like it even has the old folder icon. It's like it preserves that. Oh that's interesting. So if I go to BasicDemos can I actually run this stuff? Well, let's find out. Let's go to is that Speech demo in here? 'Cause that was cool. Speech, that looks like it right there. I heard a beep. Oh file not found. Shit. Oh no, I borked it. Everything is broken. All right, cool, cool, well let's reset. Let's just go back to the beginning. Oh that's not what I meant. I reset the emulation. I wanna actually like restart the Pi. Okay. What else we got going on here? We did Workbench3 and Workbench1, let's load Workbench2. Hard drive, Add Hardfile, boom, boom, boom, Start. Ewww, wait, yeah, this configuration we chose probably is not compatible with, it might not be compatible with Workbench2. Kickstart ROM three, 1200, revision 39, 512k, let's see if I can add Workbench2 and get it to start up. We got a screen, that's a good start. There we go, Workbench2. Which looks pretty much the same as Workbench3, it looks like. So let's see what's in the System folder. Oh yeah, NoFastMem, FixFonts, Format, Shell, yeah the poor bunny rabbit. No bunnies allowed, none here. And that goes for you Score Bunny, although you do look pretty nice on an Apple IIe. (techno music) - Not bad. - Not too shabby. What's in Utilities? Oh yes, the clock. You gotta show the clock. Oh and again, I did it again. I forgot to set, that there. But yeah, you gotta show the clock, man. Now this icon looks like he's swearing. Okay, so this looks like it's like that Speech program but a little more primitive. It doesn't have a slider or anything. But we can type stuff. I am Krazy Ken. And we'll use our Sennheisers and have a listen. - [Robotic Voice] Hello I am Krazy Ken. - [Krazy Ken] That is amazing how it synthesized that. And what's really interesting is it looks like it translated it here but with different characters. I'm not sure why. It's probably because of the code or some shit. HEH4LOW, interesting, I am kraz, yeah, hmmm. That just must be like how the synthesizer reads speech. All right, you know, I wanna go back to that Workbench1 system, and I wanna mess with the Speech program one more time. I wanna have it say something kinda fun. All right, let's just do a restart and we're loading. And here comes the Workbench. Super duper, pumpkin scooper. And open up the Speech demo. Greetings, Professor Falken. Yes. - [Robotic Voice] Greetings, Professor Falken. - [Krazy Ken] Yeah, definitely doesn't sound like Johsua. We would need to change that a little bit. Like, I don't know what the voice slider really does or the tune slider. - [Robotic Voice] Greetings, Professor Falken. - [Krazy Ken] Okay, well that sounded like an animatronic is coming down the hallway to kill me, but hey, you know, I didn't need to sleep tonight anyway. I wanna go to preferences. I just wanna customize this a bit. I do like this default blue, though. Shit, can we change the pointer? I'm gonna, what? Hang on, let's do that. Can we change this? I can go for some serial. Preferences 34.66. That's insane, dude. Oh shit, and I can make it yellow or let's do like a, let's make it purple. Hell yeah. Whoa, and then it brings me to a bunch of other things. So I hit okay and I say Use. And then okay, yeah, it's purple. We got purple ladies and gentlemen. Let's go back to the preferences utility. So like this, this like blue accent color. We could make this. Oh it changes, and like, oh my gosh, it changes in real time. Shit, look at that. Look at that guys. That's pretty swanky. I shouldn't have said swanky. That makes me feel weird. Yeah we can go all white, that makes sense. Could be go like dark. Oh yeah, oh shit. Like dark mode with a little bit of blue in there. And then that actually works, that works well with the yellow. I'm cool with that. Oh yeah, this is my ideal system right here. I got the perfect color, I got my clock so I always know what time it is and other Utilities that I forgot to look at earlier, like this beautiful calculator. Look at that. Dark mode calculator, eat your heart out macOS Mojave. (laughing) And again, we're doin' all of this in my pocket. This thing could run in my pocket. And it would keep my thigh warm, too. It is a little warm. So it's a thigh warmer and Amiga system, two of the best things put together. In the not-too-distant future, what I do wanna do is I want to experiment with more of the Amiga Forever content inside of their all in one player package. That's probably something I'll just run on a Windows PC because that's their built-in like super simple solution to emulate the Amiga. However, I may do more stuff on my Pi later as well, and I'm open to your suggestions. So thank you guys very much for sticking along with me. This was a lot of fun. I can't wait to do more with the Amiga. Catch the crazy and pass it on. (upbeat techno music)",
    "transcript_keywords": [
        "yeah",
        "Amiga",
        "ROM",
        "ROMs",
        "screen",
        "Amiga Disk File",
        "back",
        "Shit",
        "workbench",
        "Amiga files",
        "file",
        "Amiga Forever",
        "Disk",
        "start",
        "stuff",
        "ROM file",
        "files",
        "config screen",
        "pretty",
        "system"
    ],
    "transcript_entity_values": [
        "Screen",
        "Ram Disk",
        "MC's",
        "256",
        "Speech",
        "34.66",
        "Hardfile",
        "number three",
        "two",
        "Amiban",
        "F12",
        "Mojave",
        "640",
        "tonight",
        "Johsua",
        "ROM",
        "Raspberry Pi",
        "3.1",
        "the 80s",
        "Demetri Martin",
        "jack",
        "four",
        "one",
        "six megs",
        "Robotic Voice] Greetings",
        "Raspberry Pi",
        "Amiga",
        "the Raspberry Pi",
        "macOS",
        "Amiga Forever",
        "KS",
        "Bmap",
        "F10",
        "Sennheisers",
        "134",
        "F5",
        "the Active Window Title Bars",
        "Workbench",
        "39",
        "Workbench Screen",
        "Robotic Voice",
        "Flash Complete",
        "GUI",
        "Apple",
        "F6",
        "chu chu chu chu chu chu",
        "Amiga Disk File",
        "4000",
        "Mac",
        "Workbench",
        "FixFonts",
        "Kickstarts",
        "1.1",
        "100%",
        "Google",
        "number five",
        "Library",
        "first",
        "F-ed",
        "1.3",
        "About 5,000",
        "Cloanto",
        "ScreenPrint",
        "Amiga Forever",
        "512k",
        "ADF",
        "Falken",
        "three",
        "Shell",
        "USB",
        "Speech",
        "Amiga",
        "DVI",
        "'85 to '93",
        "eight",
        "Boop",
        "Amibian",
        "this Ken",
        "Sonic",
        "ISO",
        "Gucci",
        "WOrkbench",
        "Trashcan",
        "500",
        "today",
        "Krazy Ken",
        "Five",
        "CPU",
        "Quickstart",
        "a Raspberry Pi",
        "Windows",
        "Sennheiser",
        "10",
        "Prefs",
        "HDF",
        "F10",
        "Aros",
        "STICK",
        "amiga-os-1.3",
        "Amiga",
        "ASCII",
        "Utilities",
        "seven megahertz",
        "864,576",
        "Devs, Expansion, Storage, Tools",
        "Midnight",
        "System",
        "Mac",
        "Ope",
        "Macintosh",
        "1.3",
        "1.4",
        "15.89",
        "SD",
        "more like four",
        "1200",
        "1985",
        "One",
        "Mmmhmm",
        "Raspberry Pi Model 3",
        "five",
        "BasicDemos",
        "'87",
        "Pi"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "NORP",
        "NORP",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.1204657331109047,
        -0.03695991635322571,
        -0.009968742728233337,
        -0.15519796311855316,
        -0.036276768893003464,
        0.0670173317193985,
        0.054381173104047775,
        -0.003229203401133418,
        -0.031058339402079582,
        0.03595829755067825,
        0.026743656024336815,
        -0.004259373527020216,
        0.04901020601391792,
        -0.06195148080587387,
        -0.0048244548961520195,
        0.017681807279586792,
        0.10593713819980621,
        -0.015232688747346401,
        0.00520006287842989,
        -0.02075089141726494,
        0.005802208092063665,
        -0.10669122636318207,
        0.010224003344774246,
        -0.01576036587357521,
        -0.022393744438886642,
        0.019394416362047195,
        0.013407700695097446,
        0.09353022277355194,
        -0.025412317365407944,
        -0.04761744290590286,
        -0.004407951608300209,
        0.017636070027947426,
        0.00974989403039217,
        -0.016958024352788925,
        0.020602276548743248,
        -0.034904081374406815,
        0.00984192918986082,
        -0.04738323763012886,
        -0.08965858072042465,
        0.01610442064702511,
        0.011903838254511356,
        0.018856516107916832,
        -0.05379846319556236,
        0.05975160375237465,
        0.004703762475401163,
        -0.05908193811774254,
        0.04017379879951477,
        -0.10397560894489288,
        0.010672184638679028,
        -0.07393166422843933,
        -0.010458123870193958,
        -0.019635245203971863,
        0.1142052412033081,
        0.024112584069371223,
        -0.012484723702073097,
        -0.020160123705863953,
        -0.0495540052652359,
        0.050665270537137985,
        0.07693172991275787,
        -0.028775280341506004,
        -0.04885289445519447,
        -0.02484741248190403,
        -0.036264512687921524,
        0.01940523274242878,
        0.0037457910366356373,
        0.010612333193421364,
        0.039468683302402496,
        0.05937551334500313,
        0.00019935892487410456,
        -0.08569658547639847,
        -0.05191391706466675,
        -0.05561763048171997,
        -0.0027581248432397842,
        0.06489523500204086,
        -0.06707437336444855,
        -0.013012242503464222,
        -0.01756337285041809,
        -0.0526856854557991,
        -0.028599154204130173,
        -0.0535951592028141,
        0.014298150315880775,
        -0.024933990091085434,
        -0.10847390443086624,
        -0.05661294236779213,
        0.06858157366514206,
        0.036600567400455475,
        -0.036228373646736145,
        0.0004020173801109195,
        0.008333006873726845,
        0.011628808453679085,
        0.022472577169537544,
        0.07658025622367859,
        0.10249730944633484,
        -0.03827310726046562,
        0.02688833512365818,
        0.019722022116184235,
        0.003476720303297043,
        -0.028240777552127838,
        -0.0754769816994667,
        0.07126329094171524,
        0.0261284951120615,
        0.08179546147584915,
        -0.028992200270295143,
        -0.06009203568100929,
        -0.036919064819812775,
        -0.07483770698308945,
        0.007279723417013884,
        0.07968775182962418,
        -0.016037888824939728,
        0.034426771104335785,
        -0.08799926936626434,
        0.019407475367188454,
        -0.015396784991025925,
        0.03321044519543648,
        0.04635972902178764,
        0.06423389911651611,
        -0.04390905424952507,
        0.053196508437395096,
        0.05353548005223274,
        -0.047092027962207794,
        0.027224181219935417,
        -0.04917158931493759,
        -0.014981002546846867,
        0.0507160983979702,
        0.020410165190696716,
        0.007857504300773144,
        -0.020684173330664635,
        8.472857486235474e-33,
        0.03604407235980034,
        0.10470056533813477,
        -0.036905236542224884,
        -0.0351594053208828,
        -0.02908981405198574,
        -0.011432093568146229,
        -0.052236203104257584,
        0.10672333091497421,
        -0.11190216988325119,
        -0.014837912283837795,
        -0.009235239587724209,
        0.025759169831871986,
        -0.057838283479213715,
        -0.03929437696933746,
        -0.02109476365149021,
        -0.06064709648489952,
        -0.1051207110285759,
        0.020023468881845474,
        0.06762342154979706,
        0.051671888679265976,
        0.0305998083204031,
        0.01403113268315792,
        0.03306454047560692,
        -0.013080304488539696,
        -0.07958350330591202,
        -0.06729283928871155,
        -0.0711524561047554,
        -0.04396859183907509,
        0.07879485934972763,
        0.039786286652088165,
        -0.10230480134487152,
        0.01443561539053917,
        0.055534880608320236,
        -0.031261492520570755,
        -0.06437472999095917,
        -0.11981882154941559,
        -0.08635163307189941,
        -0.06993652135133743,
        -0.012023541145026684,
        0.020562704652547836,
        -0.02216576784849167,
        -0.032656360417604446,
        -0.04536140710115433,
        0.00271677877753973,
        -0.03732391074299812,
        0.001782991224899888,
        0.13041888177394867,
        0.031366460025310516,
        0.07844874262809753,
        0.03082447312772274,
        -0.025321101769804955,
        -0.03699342906475067,
        0.004088314715772867,
        -0.047027233988046646,
        -0.009722204878926277,
        -0.008636292070150375,
        0.01797228865325451,
        -0.0161718912422657,
        0.06462488323450089,
        -0.014413397759199142,
        0.04974468797445297,
        0.022607076913118362,
        0.04023313522338867,
        -0.05371930077672005,
        -0.05997059866786003,
        -0.057579513639211655,
        -0.008867503143846989,
        0.05030187591910362,
        -0.010239217430353165,
        0.05033130943775177,
        -0.01526536326855421,
        -0.024102386087179184,
        0.031682830303907394,
        -0.03865346685051918,
        0.1127571165561676,
        0.007201779633760452,
        -0.12024544924497604,
        0.009965031407773495,
        -0.05224965885281563,
        0.013804455287754536,
        -0.045510176569223404,
        -0.01504035759717226,
        -0.07632502913475037,
        0.08605782687664032,
        0.08871469646692276,
        0.06129956617951393,
        0.09590155631303787,
        0.05309624969959259,
        -0.02449764870107174,
        0.011124245822429657,
        0.047141559422016144,
        -0.10116735100746155,
        0.007588639855384827,
        0.014049083925783634,
        0.02796226181089878,
        -8.184792309990903e-33,
        0.055382248014211655,
        -0.0023785685189068317,
        -0.04501733556389809,
        -0.027911480516195297,
        0.06958194077014923,
        -0.0376155711710453,
        0.03877757489681244,
        0.0022456501610577106,
        0.019646642729640007,
        -0.03340579569339752,
        0.058498565107584,
        -0.019176101312041283,
        -0.015812337398529053,
        -0.06889200210571289,
        0.009288199245929718,
        -0.04936733469367027,
        -0.07072857022285461,
        -0.009005331434309483,
        0.05756072700023651,
        -0.06747989356517792,
        -0.003416013903915882,
        -0.051727697253227234,
        0.02332877181470394,
        0.043955013155937195,
        0.05056561529636383,
        0.07049020379781723,
        0.0552019439637661,
        0.07576938718557358,
        0.04524722322821617,
        0.05321341007947922,
        0.016272086650133133,
        -0.0007722845766693354,
        -0.10060098767280579,
        0.03785710036754608,
        -0.025229817256331444,
        0.07031024247407913,
        0.07878172397613525,
        0.032494448125362396,
        -0.0915357917547226,
        -0.09559344500303268,
        0.03151339665055275,
        0.045158300548791885,
        -0.12594641745090485,
        0.016382742673158646,
        -0.007451456040143967,
        -0.03020302578806877,
        -0.06240062415599823,
        0.031941939145326614,
        0.023819269612431526,
        -0.09293708950281143,
        0.01606564223766327,
        0.05454856529831886,
        0.0007542604580521584,
        -0.02367836982011795,
        -0.01681702397763729,
        -0.01216126699000597,
        -0.014947548508644104,
        0.10339368134737015,
        0.005506524350494146,
        0.028422264382243156,
        -0.03996896371245384,
        -0.03409910574555397,
        -0.03770670294761658,
        -0.016407832503318787,
        0.0006719966768287122,
        -0.03463609144091606,
        0.07149501144886017,
        0.1328512728214264,
        -0.026383016258478165,
        0.052992966026067734,
        0.01880704239010811,
        -0.00017428546561859548,
        0.08742734789848328,
        -0.09348178654909134,
        0.018688391894102097,
        0.02334771305322647,
        -0.001928631216287613,
        -0.014938730746507645,
        -0.02637133188545704,
        0.0046330890618264675,
        -0.0786820575594902,
        0.014929634518921375,
        0.029071198776364326,
        0.057738013565540314,
        -0.02525155059993267,
        0.03944672271609306,
        0.00147182063665241,
        0.024935780093073845,
        0.021351592615246773,
        0.0017008234281092882,
        0.029359325766563416,
        -0.047773830592632294,
        0.009853381663560867,
        0.1470821052789688,
        0.020423121750354767,
        -5.7304696099436114e-08,
        0.039114490151405334,
        0.028874019160866737,
        0.02699286676943302,
        0.009715038351714611,
        0.06963706761598587,
        -0.04641709476709366,
        -0.012431429699063301,
        -0.008208531886339188,
        0.03397689759731293,
        -0.05709231272339821,
        0.054029736667871475,
        -0.0893455445766449,
        0.03298870101571083,
        0.056967489421367645,
        0.051282402127981186,
        0.026642922312021255,
        -0.006416245363652706,
        0.09901099652051926,
        -0.014101077802479267,
        -0.043079279363155365,
        -0.02295750193297863,
        -0.048958320170640945,
        0.029130922630429268,
        -0.05992048606276512,
        -0.030638042837381363,
        0.09393823891878128,
        -0.003790152259171009,
        -0.010324840433895588,
        0.020748578011989594,
        -0.00814602430909872,
        -0.026094941422343254,
        -0.08845430612564087,
        0.011841114610433578,
        -0.0408121682703495,
        0.06571253389120102,
        -0.057129912078380585,
        -0.07931281626224518,
        -0.015596586279571056,
        0.02542230114340782,
        -0.043392363935709,
        -0.022037994116544724,
        -0.12713998556137085,
        -0.048147521913051605,
        0.013757085427641869,
        0.06166432052850723,
        0.06254009902477264,
        -0.02277444303035736,
        -0.01188580971211195,
        0.022170279175043106,
        0.00809814315289259,
        0.0739632397890091,
        -0.02405828982591629,
        -0.0035992490593343973,
        0.035425204783678055,
        0.09403043240308762,
        -0.041407033801078796,
        -0.03943319246172905,
        -0.029575159773230553,
        0.053686678409576416,
        0.02854631468653679,
        0.05490056425333023,
        0.0041532921604812145,
        0.015999777242541313,
        0.021541886031627655
    ]
}