{
    "id": "yk_u9fbkoKM",
    "title": "How far can the CYBERTRUCK tow 11,000lbs in Freezing Weather?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-01-19T15:33:00Z",
    "video_url": "https://www.youtube.com/watch?v=yk_u9fbkoKM",
    "category": "Howto & Style",
    "tags": [
        "Cybertruck",
        "Rivian",
        "Ford Lightning",
        "Electric truck",
        "Electric truck towing",
        "can an electric truck tow",
        "cybertruck review",
        "cyber truck",
        "tesla",
        "tesla truck",
        "Cybertruck driving",
        "cybertruck towing"
    ],
    "views": 4364202,
    "likes": 90822,
    "comments_count": 9466,
    "description": "Today we have the brand new Tesla Cybertruck, and we'll be doing the hardest thing an EV Truck can do - Tow 11,000lbs in below freezing weather. How much can the Cybertruck tow? How far can the Cybertruck tow? Well today we find out the answer to both of those questions.  Tesla usually gives out some pretty nice perks when ordering through a referral code:   This is a Dual Motor All Wheel Drive CyberTruck. The Vehicle was charged up to 100% the night before this test. (The Cybertruck Probably reached 100% around 2am in the morning, and then sat in my garage for about 6 hours or so while still plugged in, before coming out of the garage and being connected to the trailer.   Watch the Rivian Towing video HERE:  Watch the Ford Lighting towing HERE:  Watch my 600 mile road trip with @WHATSINSIDEFAMILY HERE:    And HUGE thanks to @OurCyberLife for letting us borrow his Cybertruck.",
    "description_links": [
        "https://ts.la/zack10701",
        "https://youtu.be/U8zDGN2Fdt4?si=V9O2EubPFyn4SVzW",
        "https://youtu.be/76l6lJhrgbc?si=NojC5JAcReN8jpuC",
        "https://youtu.be/clUvjo3xfzQ?si=sB0ZOTsFwcgWTrXi"
    ],
    "transcript": "So there are three things I want to know. First, how far can we go with a Tesla Cybertruck while towing its maxed out capacity of 11,000 pounds in freezing cold weather? The second thing is, how does it handle towing with steer by wire? And how does it handle reversing a trailer with steer by wire? If you remember, all four of these tires can turn, both the front and the rear, so you have a tighter turning radius. And the front steering wheel is not connected to the underneath the hood. It should be a very interesting experience. The Cybertruck isn't mine. It's on loan from a very brave real owner, but he knows what our plans are and he's okay with it. I performed this very same test with my own Rivian R1T in the same freezing weather situation about a year ago, and we got exactly 100 miles with off-road tires. I also towed this same homemade electric Humvee with a Ford Lightning and got about 130 miles with street tires in the summer, both of which probably gave it a slight advantage. And today we have a dual motor all-wheel drive Cybertruck with off-road tires, which gives us an estimated range of 318 miles with the full battery at 100%, which I did charge it up last night. It has been sitting for a few hours in my garage this morning, plugged in but not charging. Let me know what your estimates for this cold weather range test are down in the comments, and at the end of the video we'll see who's closest. I've been daily driving trucks for about 20 years now, so tests like this are super fun. Should be able to crawl right up this thing. Easy. Sick. That's not going anywhere. This setup looks sweet. Keep in mind that while this is a very fun test, it's not all fun and games. Even though we aren't exceeding any vehicle specifications by towing 11,000 pounds, towing a trailer that's heavier than the vehicle is an extremely dangerous situation. There are a lot of strange laws of physics working simultaneously that we have to be aware of, so we're making sure we're balancing the load on the trailer, making sure there's not too much load on the tongue of the truck. And of course I will be driving extremely cautiously, since I'm not the only person on the road, which is something we sometimes forget here in the USA. The thing that stood out to me when I got into the Cybertruck for the very first time were how heavy the doors were. Turns out that while having the same towing capacity as the Rivian, the Cybertruck actually weighs less even though it's bulletproof. Tesla has accomplished some pretty mind blowing things. Looks like we have lost a little bit of range just sitting here putting the trailer on in the cold weather. We're already at 308 miles. And that should recalculate very quick once it realizes how much weight is attached to the hitch. The Cybertruck also has trailer brake gain, which is nice. So the trailer will actually do some braking and slow down the vehicle, which is an absolute requirement when the trailer weighs more than the truck does. Before we leave though, I'm going to show you what the steer by wire does. I'm going to go here into drive. And if I want to turn left, I just crank the wheel like halfway and I'm all the way left or all the way right. And it's so strong that you can shake the truck just by moving the steering wheel. It took a whole lot of getting used to when I first started driving, but it is actually kind of cool. Oh, so crazy. Let's get going. So we've gone a total of 4 miles and the range has dropped about 9 miles. So that's about on what I would expect. I'm surprised it hasn't recalculated in towing mode all by itself because both the Lightning and the Rivian calculate and drop the range by like half as it's like weighing the trailer and seeing how much energy is being used. But the power is definitely there like every other electric vehicle. This thing tows like a champ. One way you can tell that this isn't totally fleshed out yet is that in towing mode, there's just a car behind us. There's no animation of a trailer or anything. It's just a car just riding our bumper even though we're in towing mode. It's super weird. My Humvee does not look like that. Just like my two other towing trips during this ride, we're going to stay at right around 65, 70 miles an hour. One because that's a normal freeway speed and two because that's all the tires are rated for on the trailer. And we're keeping this as safe as possible. First impressions though is driving pretty dang smooth. I can feel little vibrations through the steering wheel. So I guess the steer by wire also has some feedback for it. But when you're on the freeway, the steer by wire isn't as drastic as it is when you're at a standstill or when you're driving like below 30 miles an hour. So there's not... I can turn the steering wheel just a tiny bit and have only just a tiny bit of steering going through the front tires. The front windshield is massive, but both the A and B pillars are pretty large and view obstructing on either side. But that's kind of how it has to be when the truck looks like a Dorito. The first place we're going to go is a recycling center with a scale so we can see exactly how much to the pound is on the back of this Cybertruck. We have the rear wheels off of the scale. So only thing on the scale right now is the trailer and the Humvee, the EV Humvee. And we have the weight right here at 10,400 pounds, which means with the 1,000 pounds of tongue weight we are at 11,000 just slightly over. But all within margin of error of course. With the other two electric vehicles we tried the 0 to 60's we're going to do the same thing with the Tri-Motor Cybertruck. In three, two, one, go.20, 30, 40, 50, 60.12.4.Say that's nuts. So both the Lightning and the Rivian both have 0 to 60's of 12 seconds while towing. So it's crazy that the Cybertruck, Tri-Motor right, this isn't the beast, has the exact same acceleration while towing 11,000 pounds. Very interesting that all three trucks have the same acceleration. I thought for sure that the Cybertruck would be faster. Now we're going back to just driving like normal human beings. I've driven electric trucks for quite a while and one thing I noticed while I was driving with Dan all the way up here from LA before we started doing the towing test is that this Cybertruck sounds far different than the other two. We have the electric whine but there's also, listen, there's almost like wheel noise but it's not wheel noise. It only happens when we're accelerating and decelerating. It's like a kind of a deep hum. I don't know if you can hear it or not. I'm not sure what it is but the Cybertruck has a different noise beyond just the electrical sound of the motor winding up and another thing so the towing graph is super wonky check this out. So right now it thinks, go ahead and swivel around, it thinks that there's a semi truck. That's wild. It doesn't have a towing animation or a towing trailer like the Rivian does. It just has a semi truck mounted behind us if you want to know where Model 3s come from. After going 25 miles and towing 11,000 pounds, I do wish there was more information on the towing screen. What it gives us right now is like the trailer brake gain and a trailer brake boost but it doesn't really tell us how much power we're using. Like even the Model X has a little graph like a power consumption graph up in the top corner and that's the minivan of Teslas. The car next to us is filming us. The only information it really gives us, well first of all there's no information above the steering wheel. The only information it gives us is the speed. There's a little line a few pixels wide of the power expenditure and then the regen that turns green if we start slowing down. And don't get me wrong, the regen is really cool because we're taking the slowing down of the trailer, like the weight of it, and putting that energy back into the battery instead of using up our brakes. So it's super efficient, it's super cool, but a two pixel wide line leaves much to be desired. But that's just Cyber Jerry's opinion. What about Rivian Jerry? Rivian Jerry here, indeed we do have a dashboard and a front power graph. But also Rivian added a mind-blowing amount of information to their center screen where we can see elevation, individual motor and battery pack temperatures, estimated trailer weight, and even a compass. Rivian has vastly improved the towing situation since our previous test. Lightning Jerry here, even the Ford Lightning has power distribution and temperature graphs. At this point in time, the Tesla Cybertruck appears to be keeping towing information minimal. Back to you Rivian Jerry. I agree Lightning Jerry. Cyber Jerry, what else do you have for us? That was a little weird, but to be fair, Tesla does have all of the data they need to make some killer towing animations and data screens just like Rivian did. Tesla could do an over the air update at any point and fix all of these software glitches and just make epic animations. So I'm not too worried about it right now. But it is interesting seeing how it looks with these first few Cybertrucks released. that subscribe button. Hit It is free and I will keep you updated if and when Tesla updates those animations. So we pulled into a gas station mostly because it's saying that we have 167 miles of range left, which is definitely not true because our supercharger is about 46 miles away and I bet we arrive there with 10 or 15 percent. And it's the UI for towing that's a little bit off. The UI for regular driving is like actually pretty awesome. I just wish there was more information like a graph for how much power we're using or a better estimate of how many miles we're going to have left when we finally arrive. Looks like our average energy is about 1,172 watts hours per mile. We officially have 50% battery left. And one thing that I'm not used to yet, or one thing I mean I just don't like it. It's hard to say you don't like something about a truck that's so unique because it's something that you probably might get used to down the road. But the rear view mirror I'm not a huge fan of. One, it feels like plastic. Two, it does not work with the tunnel cover down. One interesting thing though is that I can operate the tunnel cover while the truck is running. The tunnel cover while locking the bed is also for aerodynamics because aerodynamics is a huge deal with electric vehicles needing to be so efficient. That's why there's the aero covers on the tires. There's so many little tweaks done to make this truck more aerodynamic so that there's less drag as we're driving down the road. Like even the windshield wiper, the giant monowiper is positioned vertically so that it's not catching air in the horizontal placement at the bottom of the windshield. However, with the Hummer on the back, aerodynamics is the least of our issues. So I'm going to open up the tunnel cover and we'll see if the rear view mirror, what that looks like looking out the back tiny window. And I'm going to say as bad as the rear view mirror on the screen is, it's better than the rear view mirror in real life. If the mirror feels like one of those, you know, one dollar plastic mirrors you give a little kid, like a, what is it, a funhouse mirror, it's so tiny and so kind of distorted on the edges. I'm just going to leave the tunnel cover closed. In the top left, it's saying we have 120 miles of range left, but in the navigation window it says we'll arrive at the supercharger with 10% battery left, which is a little nerve wracking. And it's interesting that the navigation is doing a better range calculation than the actual battery percentage up here in the top. So driving through Utah, we have two options. One, we can stop at the Provo Supercharger here in probably like 10 miles or so, or we're going up to the Draper Supercharger because the navigation is saying we're going to arrive with 8%. So we're trusting it to see if we can get to the Draper Supercharger, which is much faster. I have my doubts though. 95 miles range and it says 7% when we finally get there. That percentage is dropping fast though. I'm dropping my speed down to 60 miles an hour though, which is a little bit slower than everyone else on the freeway. But if we're going to make it, I have to go a little bit slower. Air resistance and rolling resistance are massive. And so the slower we go, the more efficient we are at 60 miles an hour. Here's what we have to do to make it. 78 miles of range. And then the navigation says we have 23 miles left, but we're going to arrive with 5% nerve wracking from there. We have 10 miles left to go and 11% of our battery. 10%. Oh boy. Dropping our speed down to 55 or 50 miles an hour because it is cutting it so close. I wish, I mean the range estimates are so important when you're towing stuff or just driving an electric vehicle anyway. This is something that Tesla's really got to get ironed out quick if someone's going to be towing with these trucks. 10% battery, 2% when we arrive, 9.7 miles left to go. This is incredibly stressful. Not to mention there is a massive hill at the point of the mountain is what we call it here in Utah. There's a massive hill between us and the Charger. And going uphill while towing 11,000 pounds, man, we are maxing this thing out. The hill doesn't look that bad from here so I think we're going to be okay. 6.8 miles left. Luckily there's a semi truck in front of us that has its flashers on so we're just going to sit back here and enjoy what is it called? The draft? The drift? Drafting. Drafting. We're just going to draft off of this guy. It is nice as we're going down the point of the mountain though we get some of our regen back with that little tiny green line. Rolling up to the Tesla Super Chargers and Draper, it looks like pretty much all of them are full and none of them have the ability to charge a truck with a trailer attached to it. So we are going to have to drop the trailer. And since the charging port is on the driver's side rear tire, we'll have to back it into a stall to plug it in. so right there 2% left and if we come over here so we went a total of 90 miles, 108 kilowatt hours used. Average energy is 1,193 watt hours per mile. I don't know what we were nervous about. If we ended up dying we could have just taken the Humvee off and then towed the Cybertruck with the Humvee. Problem solved, maybe. It's interesting that the quad steering remains engaged as we're backing up the trailer or even driving a trailer at all. I almost assumed that they would disengage the rear tires from turning just because of the extra stress and strain on the suspension system, but here we are with the quad steering still fully active while reversing and driving with an 11,000 pound trailer. It's basically the same as backing up a regular trailer, just more responsive. And the turns happen faster so you just turn the steering wheel less. One place Tesla beats everyone else is in their charging network, but luckily they're letting other companies like Ford and Rivian join in and use their chargers. We are charging at 215 kilowatts, getting 551 miles per hour. We're at 20% but in 40 minutes we will be at 80%. Which is more than enough to get us home. One thing that I thought would help the Cybertruck's towing range is the 800 volt battery pack. I figured higher voltage would make the power more efficient. Those 800 volts might be better for charging speed and not necessarily for towing efficiency. However, filling up my tank with electricity last night to 100% only cost me 13 bucks, which is nice. So officially we got 90 miles of range while towing 11,000 pounds. Not quite as good as Rivian and not quite as good as the Ford Lightning, but still incredibly fun. It is a bummer that we had to drop the trailer, but I imagine, you know, most people aren't using EVs for towing in the first place. And Tesla is putting pull through chargers in some locations, so I imagine we'll see more of them. The Cybertruck was a blast to drive and it is an incredible vehicle. But the more I drive it, the more I like my Rivian. I'm still going to put it through some more tests so make sure you hit that subscribe button. And thanks a ton for watching. I'll see you around. Oh my gosh, Jerry! Holy shit!",
    "transcript_keywords": [
        "towing",
        "miles",
        "Cybertruck",
        "trailer",
        "Rivian",
        "Rivian Jerry",
        "Tesla Cybertruck",
        "Tesla",
        "Cybertruck towing range",
        "thing",
        "driving",
        "left",
        "range",
        "miles left",
        "Jerry",
        "truck",
        "Lightning",
        "steering wheel",
        "Ford Lightning",
        "Lightning Jerry"
    ],
    "transcript_entity_values": [
        "the summer",
        "50 miles",
        "8%",
        "10 miles",
        "two",
        "LA",
        "the Tesla Super Chargers",
        "Rivian R1",
        "a few hours",
        "this morning",
        "the Provo Supercharger",
        "the Draper Supercharger",
        "13 bucks",
        "11,000",
        "25 miles",
        "95 miles",
        "90 miles",
        "Draper",
        "first",
        "800 volt",
        "Ford",
        "1,000 pounds",
        "2%",
        "UI",
        "9.7 miles",
        "1,193 watt hours",
        "60 miles an hour",
        "800 volts",
        "30 miles an hour",
        "40",
        "12 seconds",
        "Cybertrucks",
        "50",
        "Humvee",
        "Hummer",
        "about a year ago",
        "Humvee",
        "about 9 miles",
        "Jerry",
        "11,000 pounds",
        "108 kilowatt hours",
        "about 1,172 watts hours per mile",
        "167 miles",
        "55",
        "10 or 15 percent",
        "7%",
        "daily",
        "100 miles",
        "318 miles",
        "Tesla",
        "the Draper Supercharger",
        "First",
        "about 130 miles",
        "50%",
        "10,400 pounds",
        "Utah",
        "Model",
        "one",
        "about 20 years",
        "30",
        "0",
        "Rivian Jerry",
        "about 46 miles",
        "80%",
        "four",
        "60.12.4.Say",
        "100%",
        "three",
        "20%",
        "one dollar",
        "308 miles",
        "Two",
        "120 miles",
        "Tri-Motor",
        "the Tri-Motor Cybertruck",
        "11%",
        "11,000 pound",
        "78 miles",
        "Cybertruck",
        "USA",
        "second",
        "One",
        "5%",
        "551 miles per hour",
        "Rivian",
        "6.8 miles",
        "4 miles",
        "10%",
        "70 miles an hour",
        "215 kilowatts",
        "23 miles",
        "Humvee",
        "like half",
        "like 10 miles",
        "40 minutes",
        "Dorito",
        "last night",
        "Tesla Cybertruck",
        "today",
        "Dan",
        "around 65"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "NORP",
        "TIME",
        "TIME",
        "FAC",
        "FAC",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "FAC",
        "PERSON",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.01636861450970173,
        0.015081850811839104,
        -0.008619370870292187,
        0.054812874644994736,
        0.0035611307248473167,
        -0.025442983955144882,
        -0.024409182369709015,
        0.14478786289691925,
        -0.06808175146579742,
        0.0040653180330991745,
        0.03813472017645836,
        -0.02206912264227867,
        0.09394630044698715,
        0.02538128010928631,
        -0.04043567180633545,
        0.016135193407535553,
        0.08468778431415558,
        -0.10866834223270416,
        -0.12152099609375,
        0.07514709234237671,
        0.13256604969501495,
        -0.021072404459118843,
        0.014064307324588299,
        -0.030755436047911644,
        0.03956098109483719,
        0.015403322875499725,
        -0.017676176503300667,
        0.009748779237270355,
        -0.1130811795592308,
        -0.0066650076769292355,
        -0.12305590510368347,
        0.01165828201919794,
        -0.09433688223361969,
        -0.06188154220581055,
        0.06661901623010635,
        0.010413087904453278,
        -0.004457126371562481,
        0.0024034655652940273,
        0.0034071190748363733,
        -0.07913058251142502,
        0.042131174355745316,
        -0.08695278316736221,
        0.017492864280939102,
        -0.01807241141796112,
        0.04682125896215439,
        0.034403495490550995,
        0.022976070642471313,
        0.012103315442800522,
        0.03840281814336777,
        -0.055277734994888306,
        -0.0118503887206316,
        0.019250575453042984,
        0.06758412718772888,
        0.08460640907287598,
        -0.04543377459049225,
        -0.0008800504147075117,
        0.019779473543167114,
        -0.0572347454726696,
        0.025011440739035606,
        0.0626903623342514,
        -0.0039374749176204205,
        -0.03672181814908981,
        0.01143243070691824,
        -0.01755012944340706,
        0.08873418718576431,
        -0.07521050423383713,
        -0.017047036439180374,
        0.002529243705794215,
        -0.04272031411528587,
        0.07286909967660904,
        0.026813894510269165,
        0.014258491806685925,
        -0.03628949075937271,
        -0.023168740794062614,
        0.026084206998348236,
        -0.020556339994072914,
        0.039122555404901505,
        0.018617384135723114,
        -0.013332760892808437,
        0.016377657651901245,
        0.01839340291917324,
        -0.011010946705937386,
        0.019695382565259933,
        -0.03170211985707283,
        -0.07463929057121277,
        0.04114493355154991,
        0.015073270536959171,
        0.09995315968990326,
        -0.017994824796915054,
        0.09337591379880905,
        0.015970759093761444,
        -0.04177220165729523,
        -0.03509495407342911,
        4.8134283133549616e-05,
        -0.05710215866565704,
        0.09297192096710205,
        -0.04498329386115074,
        -0.031328387558460236,
        -0.017484623938798904,
        -0.04596279188990593,
        0.11057096719741821,
        -0.012101491913199425,
        -0.0028526741079986095,
        -0.03687521442770958,
        0.022748300805687904,
        -0.019892074167728424,
        -0.0302638690918684,
        0.015133743174374104,
        0.05808660760521889,
        0.0007510213181376457,
        0.04539328068494797,
        -0.04656169191002846,
        -0.024897737428545952,
        0.02510218881070614,
        -0.04440900310873985,
        0.0021041673608124256,
        -0.08736889809370041,
        0.06522921472787857,
        0.06056499108672142,
        0.006452572997659445,
        0.046877745538949966,
        0.03816676512360573,
        0.10994679480791092,
        0.06071708723902702,
        0.0793917328119278,
        0.006571630481630564,
        -0.028088195249438286,
        4.312344372345748e-33,
        0.012152199633419514,
        0.022192267701029778,
        -0.0005839568329975009,
        -0.015297561883926392,
        0.0006423376617021859,
        -0.005972929298877716,
        -0.0572408102452755,
        0.13623493909835815,
        0.0069095660001039505,
        0.027400517836213112,
        -0.0150406239554286,
        -0.0046856701374053955,
        0.03559678792953491,
        -0.03747139126062393,
        -0.10093570500612259,
        -0.052184876054525375,
        -0.05051906779408455,
        -0.07811474800109863,
        -0.03918962925672531,
        -0.005621208343654871,
        0.05783791467547417,
        -0.033731646835803986,
        0.08321662992238998,
        0.06541139632463455,
        0.022822173312306404,
        -0.08809337019920349,
        0.01144889835268259,
        0.04541589692234993,
        0.02166656218469143,
        0.027389416471123695,
        -0.06998250633478165,
        0.006152427289634943,
        -0.014267017133533955,
        0.0010981280356645584,
        0.08056230843067169,
        -0.0334525890648365,
        0.013197807595133781,
        -0.006368571892380714,
        -0.0809495821595192,
        -0.02619074285030365,
        0.009101067669689655,
        -0.034865546971559525,
        -0.06633637100458145,
        -0.059638310223817825,
        -0.030879493802785873,
        -0.008111855015158653,
        0.05255620926618576,
        -0.07130251079797745,
        -0.06703272461891174,
        0.004438953474164009,
        -0.0370333306491375,
        0.006204171106219292,
        0.0064005241729319096,
        0.016546854749321938,
        -0.04676437750458717,
        0.06799954175949097,
        0.04530848562717438,
        -0.004469267558306456,
        0.046879835426807404,
        0.057479437440633774,
        -0.04378070682287216,
        0.027738308534026146,
        0.0479334257543087,
        -0.11586292833089828,
        -0.07572934776544571,
        0.018339311704039574,
        -0.02697250433266163,
        0.04895652458071709,
        -0.09572494029998779,
        0.008841997012495995,
        0.0559200644493103,
        -0.04535265639424324,
        0.06663867086172104,
        -0.02606632187962532,
        0.05545428395271301,
        -0.012676951475441456,
        -0.02172188274562359,
        0.0013242370914667845,
        -0.029362281784415245,
        -0.012652137316763401,
        -0.06776895374059677,
        0.08032197505235672,
        0.039199817925691605,
        -0.000751965562812984,
        0.04076472297310829,
        -0.03735901415348053,
        -0.06090976297855377,
        0.018787814304232597,
        -0.02886543795466423,
        -0.0011264263885095716,
        0.001536505063995719,
        -0.004156481474637985,
        -0.07713165879249573,
        -0.06317593902349472,
        0.05639740824699402,
        -5.8836012224670065e-33,
        0.021726315841078758,
        0.02766427956521511,
        0.02684173732995987,
        0.026704177260398865,
        0.0692514032125473,
        -0.0038449729327112436,
        -0.016320837661623955,
        0.04157184809446335,
        0.037386808544397354,
        -0.004594489000737667,
        -0.07059630006551743,
        0.03018691949546337,
        -0.06739611178636551,
        0.026856189593672752,
        0.08609846234321594,
        -0.011022068560123444,
        -0.011657536029815674,
        -0.05334044247865677,
        -0.008011792786419392,
        0.041689883917570114,
        0.02047356404364109,
        0.0009732008911669254,
        -0.039916783571243286,
        0.06310193985700607,
        0.021771829575300217,
        0.058928340673446655,
        -0.05492197722196579,
        0.06011123210191727,
        0.0213225819170475,
        -0.01729433983564377,
        -0.00431914022192359,
        -0.07639636099338531,
        -0.0020907639991492033,
        0.042070306837558746,
        -0.040616076439619064,
        0.04036847874522209,
        0.002165283774957061,
        0.047347426414489746,
        0.0239567831158638,
        -0.01369283813983202,
        0.11556307971477509,
        -0.03069535829126835,
        -0.016448525711894035,
        -0.0391218401491642,
        0.03424584120512009,
        -0.07267183065414429,
        -0.08200886845588684,
        -0.07185583561658859,
        0.0752754658460617,
        0.10541393607854843,
        0.06554319709539413,
        0.023887239396572113,
        -0.07675033062696457,
        0.08125237375497818,
        -0.009685570374131203,
        -0.12069059163331985,
        0.07409745454788208,
        0.04131661355495453,
        -0.04568174481391907,
        0.006251868791878223,
        0.005269484594464302,
        -0.02334556169807911,
        -0.01132991723716259,
        0.020519249141216278,
        -0.01870083250105381,
        -0.06485889852046967,
        0.0014802457299083471,
        -0.03194286674261093,
        -0.036341603845357895,
        -0.0005523809813894331,
        -0.0471695214509964,
        0.011582007631659508,
        -0.019832056015729904,
        -0.08899064362049103,
        -0.027304966002702713,
        0.03777817264199257,
        -0.01039560791105032,
        -0.041507381945848465,
        0.03270280361175537,
        -0.07392384856939316,
        0.007365086115896702,
        -0.008933139964938164,
        0.0407918244600296,
        0.041039466857910156,
        0.06654810905456543,
        0.0202084518969059,
        0.033127203583717346,
        -0.001107705058529973,
        0.02565700374543667,
        0.03982489928603172,
        0.050262127071619034,
        -0.023678723722696304,
        -0.025241905823349953,
        0.05461202189326286,
        -0.059091806411743164,
        -4.781224660632688e-08,
        -0.010640846565365791,
        0.04569166153669357,
        0.003902239492163062,
        0.03179539740085602,
        0.10360674560070038,
        0.04000261053442955,
        0.03857257962226868,
        0.030684253200888634,
        -0.03354733809828758,
        0.017092473804950714,
        0.050994813442230225,
        -0.020072564482688904,
        -0.028945067897439003,
        0.009304770268499851,
        -0.07141360640525818,
        -0.0634024441242218,
        -0.032077983021736145,
        -0.02815921977162361,
        -0.010838116519153118,
        -0.04433814808726311,
        0.012419987469911575,
        -0.045219309628009796,
        -0.13760967552661896,
        0.037345871329307556,
        0.02832481451332569,
        0.0017703811172395945,
        0.005004864186048508,
        0.04002037271857262,
        0.04633225128054619,
        -0.07387518137693405,
        -0.15189746022224426,
        -0.034046415239572525,
        -0.1265726238489151,
        -0.03441334143280983,
        -0.012459589168429375,
        -0.0763000100851059,
        -0.029445208609104156,
        -0.006252617109566927,
        0.03990207239985466,
        0.11272348463535309,
        0.03658087179064751,
        -0.002160914707928896,
        0.0076222806237638,
        -0.026529299095273018,
        0.007598130963742733,
        -0.00311059202067554,
        -0.17016634345054626,
        -0.046715401113033295,
        0.02297401614487171,
        0.06488753110170364,
        -0.04903906211256981,
        -0.0011558509431779385,
        -0.024894606322050095,
        0.1628573089838028,
        0.04749253764748573,
        -0.008610418066382408,
        -0.0027484833262860775,
        -0.010578836314380169,
        -0.09325003623962402,
        0.07345820963382721,
        -0.04947782680392265,
        -0.05695762112736702,
        -0.04696586728096008,
        0.04116176813840866
    ]
}