{
    "id": "yKTzek8EZ4E",
    "title": "Flipper Zero next level",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-11-04T15:00:43Z",
    "video_url": "https://www.youtube.com/watch?v=yKTzek8EZ4E",
    "category": "People & Blogs",
    "tags": [
        "flipper zero",
        "flipperzero",
        "flipper zero car",
        "flipper car",
        "flipper zero cars",
        "car hacking",
        "car signal",
        "lock hack",
        "lock hacking",
        "bicycle",
        "bluetooth",
        "nfc",
        "rfid",
        "flipper",
        "hack",
        "hacking",
        "infrared",
        "radio",
        "gpio",
        "tesla",
        "gate opening",
        "key",
        "key fob",
        "key card",
        "credit card",
        "credit card nfc",
        "prank",
        "pranking",
        "infared",
        "honda",
        "honda cve",
        "honda car unlock",
        "honda flipper zero",
        "flipper zero door",
        "door chime flipper zero",
        "flipper zero door chime",
        "flipper zero locks",
        "flipper zero lock"
    ],
    "views": 707071,
    "likes": 14532,
    "comments_count": 633,
    "description": "The Flipper Zero can capture and replay all kinds of signals. Let's put it to the test :)  Can you use the Flipper Zero to unlock cars? What about bicycle locks? Door bells? Well... let's find out!  // Discount // Get a 5% discount using my affiliate link :  and/or use code DAVIDBOMBAL  // Menu // 00:00 - Intro 00:25 - Disclaimer 00:33 - In this video 01:08 - Unlocking Cars 02:13 - Rolling Codes and Vehicle types 02:28 - Discussion with Occupy The Web 04:12 - Reading and Sending Key Fobs 06:22 - Doorbell Example 06:54 - Other Vehicle Brands 07:44 - Unlocking Bike Locks 11:44 - Unlocking Doorbells 13:23 - Hacking Alarm Systems 14:30 - Conclusion 16:06 - Outro  // Previous videos // Flipper Zero Episode 1:  Mr Robot Car Hacking:   // Great resources // Awesome Flipper:  Bad USB:   // CVE-2022-27254 // NIST:  Mitre:  The Register:   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube Main Channel:   YouTube Tech Channel:  YouTube Clips Channel:  YouTube Shorts Channel:  Apple Podcast:  Spotify Podcast:   // MY STUFF //   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  flipper zero flipper flipperzero hack hacking car hacking sub 1 ghz door bell  car cars honda cve alarm system rfid nfc bluetooth infrared radio gpio  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.   #flipperzero #hack #hacking",
    "description_links": [
        "https://lab401.com/r?id=42cm8b",
        "https://youtu.be/VF3xlAm_tdo",
        "https://youtu.be/5LvqU3-iINk",
        "https://github.com/djsime1/awesome-flipperzero",
        "https://github.com/nocomp/Flipper_Zero_Badusb_hack5_payloads",
        "https://nvd.nist.gov/vuln/detail/CVE-2022-27254",
        "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-27254",
        "https://www.theregister.com/2022/03/25/honda_civic_hack/",
        "https://discord.gg/davidbombal",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://youtube.com/channel/UCZTIRrENWr_rjVoA7BcUE_A",
        "https://www.youtube.com/channel/UCbY5wGxQgIiAeMdNkW5wM6Q",
        "https://www.youtube.com/channel/UCEyCubIF0e8MYi1jkgVepKg",
        "https://davidbombal.wiki/applepodcast",
        "https://open.spotify.com/show/3f6k6gERfuriI96efWWLQQ",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- [David] Let's see how powerful this Flipper Zero is and what it can do and make you aware of the vulnerabilities with technologies that we use every day. (rock music plays) Only do this type of thing on products that you own or have permission to test on. In this case, I own all of these devices so that's why I'm testing them. In this video, I'm continuing my series talking about the features and functionality of the Flipper Zero. In a previous video, which I've linked below I showed you how to clone key fobs using RFID. In this video, I want to take it a step further. I want to show you how I can crack locks using the Flipper Zero. So in other words, capture signals and replay them to unlock various types of locks, show you how to capture signals from doorbells and replay them. But probably the one that most people are interested in is how I can capture signals from key fobs and then replay those signals. (R&B music plays) Now there's a well known CVE relating to Honda vehicles. This CVE 2022 27254 allows hackers to remotely start and unlock Honda Civics with, in this example, The Register is saying $300. You could actually do it with a Flipper Zero. You don't have to. In this article from The Register, they talk about how the researchers were able to capture the unencrypted RF signals and then do things such as open doors, close doors, and remotely start the vehicle. In this example, they were using a HackRF One. So in other words, one of these devices. There are many types of devices out there that can be used to capture signals and replay them. This is one of the most popular and well known devices. The same kind of thing can be done with a Flipper Zero. What you can do is use it to capture the signals. So in this demonstration, the doors are unlocked, but once the signals are captured, they can be transmitted to the vehicle and the car can be opened up. This doesn't work with all vehicle types. A lot of modern vehicles use rolling codes. So just by capturing a signal doesn't mean that you can replay it. (R&B music plays) In a previous video, which I've linked below I had a whole discussion with Occupy The Web where we discussed if it's possible to do this type of thing as was demonstrated in the Mr. Robot TV series. - [Speaker] What they did in the show, they're sitting on a, like a porch step, and a woman is leaving her minivan on the street and she locks it with her key fob remotely. There's a number of different strategies for being able to unlock this vehicle. One of them that they may have done, it works in some cases, is you can simply jam that signal. So somebody goes ahead and pushes the key fob to lock the door. I can jam it and by jamming it, the signals never received by the vehicle and the car never locks. The weakness of that strategy is that people often will listen that little beep that says the car's locked but some people don't. Some people just carelessly push the button and keep going. But now we can pick up these signals and transmit signals with very inexpensive receiver transmitter and then use the computer to be able to manipulate those signals. Now, one of the things that's important to note is that whenever you work in radio signals, any device that is using a part of the radio spectrum has to be, be registered with the FCC. So if you have a question about what frequency the device is using, all you have to do is look at the back of the device and it'll have an FCC number on it. Look it up. It'll tell you exactly what frequency it's operating at. - Often what you're gonna have to do is block the signals with the rolling code somehow. So block the signal, so that you can capture it and then send it to the vehicle to unlock the car as an example. Okay, but in this example, I'll take a remote and what I'll do is plug in the Flipper Zero. You don't have to have the Flipper Zero plugged in. I'm only doing it for demonstration purposes so that you can see what I'm doing. So I'll go to the menu and in this case I'll go to Sub-Gigahertz and the first thing I'll do is go to Frequency Analyzer. This will allow me to analyze the signals. So what I'll do is I'll press the unlock signal on the remote. Here's that again. So you can see it's in the frequency range, 433 megahertz. I'll lock the vehicle. And there you go. The vehicle is locked. Now to capture the signals, this won't work in my demonstration but researchers have got it working with Honda vehicles. Here's another example of that. (R&B music plays) I'll go to Read RAW and what I'll do now is press the unlock button but you'll notice nothing's happening because I'm using the wrong signal range. One of the things you may have to do is go to Frequency and adjust the frequency to a range that's very close to the frequency that you captured originally with the frequency analyzer. You may also have to play around with the modulation until you get the right frequency and modulation. So now that I've done that I'm going to press record and I'm gonna unlock the vehicle. And notice you can see some spikes where I'm locking or unlocking the car. So you probably don't want to record that many but you could save that as an example as let's say car. And just specify the car that you're going to save the signal as. So as an example, save and you can just press send to send it to the vehicle. Now, if it was a Honda that was open to this type of attack the door would be unlocked as an example. So a tip here is whenever you are doing this type of thing go to Frequency Analyzer to analyze the signals that were captured. So as an example, if I capture this doorbell these are not currently plugged in, but just to show you the signal, you can see that this is 4 33 8 79. When you go to the Read RAW option as an example config you're gonna wanna make sure that you're using the right range. So 433.92 in this case. And then when I press record, notice I get a nice clear signal. You want to get as obviously as large a signal as you can and that you just need to work out based on the frequency and the modulation. Now, if you're driving another brand of vehicle hopefully it's not open to the same kind of attack but there are other vehicles out there that have similar kind of problems where a replay attack can be used to attack the vehicle. - [Speaker] And I've got it centered on 315, the 315 megahertz. The reason I have it centered there is because that's where the key fobs that the car manufacturers make that's where they operate in the US and Japan. In Europe, I think they use 4, 433.9, but I'm in the US. I'm using a US Japanese key fob (laughs) so it's gonna be probably in the 315 megahertz range. - So now let's look at some of these locks and doorbells and I'll show you how to capture the signals here and replay them. (R&B music plays) I would be very careful using bike locks such as this one that support a remote button to unlock the bike lock. This is one of two bike locks that I've bought from Amazon. Here's another example. I'll test both of them in this video with the Flipper Zero and see how good they actually are. In this example, this lock is unlocked. I'll lock it by pressing the lock button on the key. Very loud. So I must warn you it's quite loud, but that's now locked. If I move it, it's gonna set off an alarm but at the moment it's locked. So I can't unlock this. If I press the unlock button I'll be able to unlock the lock. So what I'll do with the Flipper Zero is go to Sub-Gigahertz. This allows me once again to capture all kinds of signals. Car signals and so forth. I'll go to Frequency Analyzer to make sure that I can get the right signal and I'll press unlock on this button and you can see that the frequency is 433.859. That's really important because otherwise I don't know what frequency to capture. I'll go to Read RAW, and at the top here you can see that the signal is 433. So that's the right signal range. I'm gonna press record and I'll press the button. And I'll press stop. So I've now captured that signal and I'll save that. Let's call it B10 and I'll save that. I don't have to save that. I could simply send it. So as an example, I'll send it and notice the bike lock accepted the signal. So what I'll do is, again, it's unlocked. I'll lock it using the remote. That's now locked. I cannot unlock the bike lock at the moment. - [Man] Oh, he's stealing! He's stealing. - You'll notice the alarm went off there because it moved, but what I'll do is send the signal and notice now I can simply unlock this bike lock and if I was a bad person, I could steal your bike. - With great power comes great responsibility. - So I'd be very careful trusting locks such as these on my bicycle. It's too easy to grab the signal from a remote like this and just replay it. In their documentation here, they talk about how great this is. It supports 256 kinds of passwords. A four digit code can be used here and all kinds of things but honestly with a Flipper Zero if you can capture the signal, you can simply unlock it. Okay, so that was the first bike lock, not great. Okay, here's another one. So this is a motorbike bicycle anti-theft alarm but let's see how good it is. This thing, I'll warn you, makes a lot of noise but what I'll do for the moment is lock it. And then I'll unlock it. Terrible amount of noise. So I'll be deaf by the end of this. Hopefully not. Okay, so once again, go to Frequency Analyzer and if I press the unlock button I can see it's 433 megahertz, go to Read RAW. It's set to 433 at the moment, so that's great. If someone did press the unlock button and I was recording that signal, I've now captured it. So what I'll do is save that as let's say bike two. Okay, so again, you're going to want to use a better name than that, but that's fine for this example. So what I'll do here is lock it. If you move it and just be careful of the noise. (alarm sounds) What I'll do is send the unlock signal. So hopefully that's not gonna go off and notice it doesn't, even though I'm moving it. I was able to unlock that alarm with the Flipper Zero. That's always the big if in any kind of real world application. You're going to need to be able to capture the signal from the remote as an example, and capture that on your Flipper Zero, and then be able to send it. You may like those kind of locks. I personally would be careful using them. (R&B music plays) Okay, in this example, I've got a door chime. So something that you'd have at your home as an example. Again, on the Flipper Zero, we can capture those signals. So I'll go to Sub-Gigahertz and I'll go to Frequency Analyzer. You don't have to use the Frequency Analyzer if you know what range to use. (doorbell rings) This just shows us the range of signal used. In the UK as an example, we often have to use a range in the 800s rather than 433. But what I'll do in this example is I'll go to Read RAW and I'll record. (doorbell rings) And I'll stop that and let's send that. (doorbell rings) And you'll notice as soon as I press send. (doorbell rings) That rings. So you could drive your neighbor crazy if you went to their door as an example and I'm not recommending that you do this and you press this button, capture the signal and then you walk away and constantly, you know ring the doorbell. Not a good idea, but that is a weakness as an example in doorbells like this. Here's another one and same thing, really. - [Narrator] One frequency analyzer later. - Record. (doorbell rings) I've saved that, so I won't touch the button. I'll just press it on the Flipper Zero. (doorbell rings) And again, you can see (doorbell rings) that's working. Simple as that to capture signals from a door chime. They don't have rolling codes so very easy to capture it and resend it. (R&B music plays) Okay, here's another device. This is an alarm system. Once again, all I'm gonna do is go to Sub-Gigahertz and I'll go to Frequency Analyzer. And as an example, I'll press the unlock button. You can see this is in the frequency range 868.309. So it's a different frequency range to the default on the Flipper Zero. So when I go to Read RAW, I'm gonna go to config and this I'm gonna have to change up to 868. And then again, I might have to play around with the modulation to get the right modulation. But if I press record, notice there's the signal from the alarm system and that would allow me to turn off the alarm. Now, in my tests of this, this is also using a rolling code. So you can't just simply replay it. What you'd have to do is block the signal and somehow capture it and then replay it to unlock the alarm system. But if you've managed to do that, you could simply press send to send the code to unlock the alarm. But in my tests, this didn't work. Okay, I hope you learned something. I hope you are enjoying these videos that I'm creating about the Flipper Zero. I've had a lot of comments on some of the videos saying that it's not that powerful but hopefully I'm showing you some of the other features available with the Flipper Zero. One of the comments were it's too obvious to have a orange device such as this but notice that's just a cover on the Flipper Zero. This is a nice little device that can fit into your pocket, but it's not the only device out there that can capture signals and replay them. As mentioned, one of the devices that's been really popular over the years is a HackRF One. So there are other devices out there and if you wanna learn more details about car hacking have a look at my video below where I interview Occupy The Web and we go through a lot of this in a lot, a lot more detail. I just wanna show you some of the possibilities with the Flipper Zero. Now let me know if there are any other options you're interested in learning about. I haven't covered everything. I still wanna cover GPIO, and I wanna show you how to hack wifi networks using the Flipper Zero. I haven't shown you iButton but here's some B-roll showing you an example of that. (R&B music plays) I've also not shown you two-factor authentication. I'll show you that in a separate video. Let me know if there are any other applications or questions that you have about this device and I'll try and answer them. Now, if you enjoyed this video, as always, please like it. Please consider subscribing to my YouTube channel and clicking on the bell to get notifications. I'm David Bombal and I wanna wish you all the very best. (rock music plays)",
    "transcript_keywords": [
        "Flipper",
        "Frequency Analyzer",
        "signal",
        "signals",
        "frequency",
        "unlock",
        "capture",
        "capture signals",
        "Read RAW",
        "press",
        "lock",
        "vehicle",
        "Analyzer",
        "button",
        "locks",
        "send",
        "unlock button",
        "replay",
        "range",
        "car"
    ],
    "transcript_entity_values": [
        "first",
        "CVE",
        "Honda",
        "UK",
        "RFID",
        "Register",
        "Frequency Analyzer",
        "868.309",
        "433.9",
        "433",
        "the years",
        "868",
        "FCC",
        "Amazon",
        "One",
        "two",
        "4",
        "256",
        "315 megahertz",
        "a Flipper Zero",
        "Europe",
        "Frequency",
        "Sub-Gigahertz",
        "GPIO",
        "Occupy The Web",
        "YouTube",
        "433.859",
        "Japanese",
        "Japan",
        "four digit",
        "800s",
        "R&B",
        "this Flipper Zero",
        "one",
        "Robot",
        "iButton",
        "433 megahertz",
        "315",
        "Flipper Zero",
        "300",
        "David Bombal",
        "US",
        "4 33 8 79",
        "433.92",
        "the Flipper Zero"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "LOC",
        "ORG",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "NORP",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "GPE",
        "TIME",
        "CARDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.07670417428016663,
        -0.0321606807410717,
        -0.022762136533856392,
        -0.06348184496164322,
        0.00022108286793809384,
        0.03899698331952095,
        0.017652185633778572,
        0.016125695779919624,
        0.020728111267089844,
        0.010823412798345089,
        0.07531457394361496,
        0.0583910197019577,
        0.009280696511268616,
        -0.02414291352033615,
        0.02045188657939434,
        0.019496582448482513,
        0.03660351783037186,
        -0.005366358440369368,
        -0.026943013072013855,
        0.0561884306371212,
        0.020959816873073578,
        -0.0910966545343399,
        0.025696629658341408,
        -0.054420940577983856,
        -0.09977233409881592,
        0.007835162803530693,
        -0.03956432268023491,
        0.04012005403637886,
        -0.06456330418586731,
        -0.03322315961122513,
        0.016345731914043427,
        0.08853256702423096,
        0.05070620775222778,
        -0.035838861018419266,
        -0.010013609193265438,
        -0.05586062744259834,
        0.04040851816534996,
        0.019513173028826714,
        -0.07547595351934433,
        0.011121696792542934,
        -0.05192778259515762,
        -0.07609231770038605,
        -0.05632447823882103,
        -0.011901208199560642,
        0.0279280636459589,
        0.039938364177942276,
        -0.010619733482599258,
        -0.020533597096800804,
        -0.0006160280317999423,
        -0.09290041774511337,
        0.03119632415473461,
        0.1114572137594223,
        0.037586454302072525,
        0.003421167377382517,
        -0.0900522768497467,
        -0.0017089280299842358,
        -0.02247168868780136,
        0.015205061994493008,
        0.02608952671289444,
        0.05006660521030426,
        0.051021844148635864,
        0.012347972020506859,
        -0.03448646515607834,
        0.018701428547501564,
        0.008355879224836826,
        0.06402237713336945,
        -0.12102486193180084,
        -0.028580984100699425,
        0.044725969433784485,
        0.020971303805708885,
        -0.03259977325797081,
        -0.09076289087533951,
        0.024337073788046837,
        0.025101250037550926,
        -0.011533141136169434,
        -0.023129737004637718,
        0.0051878211088478565,
        -0.004058235790580511,
        -0.05796165019273758,
        -0.03884640336036682,
        -0.03000740148127079,
        -0.130721315741539,
        -0.012553746812045574,
        -0.029428713023662567,
        0.06156711280345917,
        0.08286992460489273,
        0.05274181813001633,
        0.060939133167266846,
        -0.002648832742124796,
        0.044609714299440384,
        -0.11428563296794891,
        -0.011497899889945984,
        0.03172484040260315,
        -0.053109344094991684,
        -0.025087347254157066,
        -0.03267301246523857,
        0.00944195594638586,
        -0.045845840126276016,
        -0.061714813113212585,
        0.05413583666086197,
        0.02928195521235466,
        -0.03324732929468155,
        -0.006522440817207098,
        -0.048814550042152405,
        0.026688259094953537,
        -0.0053565483540296555,
        0.018870076164603233,
        0.059820517897605896,
        0.03365473821759224,
        0.00878129992634058,
        0.04473607987165451,
        0.04463672265410423,
        0.10884079337120056,
        -0.06475293636322021,
        -0.0502818264067173,
        -0.02230212651193142,
        -0.0776158794760704,
        0.08379962295293808,
        0.09721244126558304,
        0.07729780673980713,
        0.06722099334001541,
        -0.07279817014932632,
        0.015038733370602131,
        -0.010014928877353668,
        0.04300049692392349,
        -0.013324481435120106,
        -0.02188364416360855,
        6.030485853757975e-33,
        -0.0347062386572361,
        0.0985720157623291,
        -0.053875986486673355,
        -0.018780607730150223,
        0.020800702273845673,
        0.03102934919297695,
        -0.011337170377373695,
        0.08567821234464645,
        -0.028773408383131027,
        0.064192995429039,
        0.02691666968166828,
        -0.003676524618640542,
        0.009764964692294598,
        -0.017210954800248146,
        0.018147625029087067,
        0.08701997250318527,
        -0.0466025210916996,
        -0.01918655075132847,
        -0.0035181844141334295,
        -0.10854996740818024,
        0.038941338658332825,
        -0.03582814708352089,
        0.03117320127785206,
        0.05070197954773903,
        0.10328251123428345,
        -0.0064394306391477585,
        -0.00016030138067435473,
        -0.09494467824697495,
        0.12985320389270782,
        0.02773774228990078,
        -0.07769591361284256,
        0.029518859460949898,
        0.04998201131820679,
        0.00718396482989192,
        0.025481384247541428,
        0.08159284293651581,
        -0.039241693913936615,
        -0.12100464105606079,
        -0.09271347522735596,
        -0.039656832814216614,
        -0.0037380594294518232,
        -0.10072767734527588,
        -0.06992524117231369,
        -0.06583491712808609,
        -0.03313823416829109,
        -0.02808712050318718,
        0.06827816367149353,
        0.019897187128663063,
        -0.013847989961504936,
        0.020837172865867615,
        -0.030293188989162445,
        -0.010219811461865902,
        -0.06790036708116531,
        -0.0033190797548741102,
        -0.07172700762748718,
        -0.057039838284254074,
        -0.01635485142469406,
        -0.01857803761959076,
        -0.012560194358229637,
        0.007368864957243204,
        0.0145790446549654,
        0.05651778727769852,
        0.013674059882760048,
        -0.09763574600219727,
        -0.0715121328830719,
        0.016475414857268333,
        0.02242462895810604,
        -0.06821861118078232,
        -0.006419994402676821,
        0.020243002101778984,
        -0.029422467574477196,
        0.041525255888700485,
        -0.0196186825633049,
        -0.01828508824110031,
        0.011195745319128036,
        0.10230077803134918,
        0.04941733926534653,
        0.04079524800181389,
        0.0437440425157547,
        0.015429268591105938,
        0.09269346296787262,
        -0.038803838193416595,
        0.0013233836507424712,
        0.026051154360175133,
        0.03675052151083946,
        0.004368145484477282,
        0.0070882816798985004,
        -0.049552761018276215,
        -0.04161062836647034,
        0.03497602418065071,
        2.6100540708284825e-05,
        -0.03388477861881256,
        -0.020529260858893394,
        0.047953858971595764,
        -0.0009297485812567174,
        -5.093046741392463e-33,
        -0.030213532969355583,
        -0.04319426789879799,
        -0.014578101225197315,
        0.0734192430973053,
        0.02675440162420273,
        0.07460536062717438,
        -0.031335122883319855,
        -0.011486885137856007,
        -0.029229555279016495,
        -0.02426481805741787,
        -0.022018590942025185,
        0.03360356017947197,
        0.0702410563826561,
        0.005449172109365463,
        0.07138919085264206,
        -0.098213329911232,
        0.0223438311368227,
        0.0007040280033834279,
        -0.05659849941730499,
        0.08505084365606308,
        0.00741615192964673,
        0.09337685257196426,
        -0.08750835061073303,
        0.03616112470626831,
        0.027525439858436584,
        0.061299510300159454,
        0.011866862885653973,
        0.11755295097827911,
        0.07987042516469955,
        -0.010884081944823265,
        -0.025604231283068657,
        0.0021472277585417032,
        0.006692853756248951,
        0.011151911690831184,
        0.007961466908454895,
        0.0009851086651906371,
        0.011256585828959942,
        0.04905977100133896,
        -0.024823050945997238,
        -0.031155722215771675,
        0.03825493901968002,
        -0.01146995835006237,
        -0.03822333365678787,
        0.016770679503679276,
        -0.04621820151805878,
        -0.09252619743347168,
        -0.022759968414902687,
        0.02310355193912983,
        0.008256670087575912,
        0.008155491203069687,
        0.016489911824464798,
        0.00952081847935915,
        -0.0460519902408123,
        -0.03334472328424454,
        -0.03965454176068306,
        0.11037907749414444,
        0.05395699664950371,
        -0.030630337074398994,
        0.02048446610569954,
        -0.007147789932787418,
        0.02964142896234989,
        -0.00979628600180149,
        0.06765630841255188,
        -0.0006987290107645094,
        0.022508548572659492,
        -0.05343412607908249,
        0.02973277121782303,
        0.03154727816581726,
        -0.05376890301704407,
        -0.07184461504220963,
        0.0697549358010292,
        0.03605428338050842,
        0.045745834708213806,
        -0.07707320153713226,
        0.011063127778470516,
        0.0227061714977026,
        -0.05404422804713249,
        -0.03596465289592743,
        -0.06526034325361252,
        -0.06602407991886139,
        -0.03818826749920845,
        -0.03713061660528183,
        0.06838931888341904,
        0.09815508872270584,
        0.03151654824614525,
        0.09645432233810425,
        -0.015028256922960281,
        0.02286497689783573,
        0.01945965178310871,
        0.01021338626742363,
        -0.03162026032805443,
        0.0779535323381424,
        -0.004794772248715162,
        0.09190009534358978,
        -0.011467421427369118,
        -5.767120114796853e-08,
        0.012776259332895279,
        0.01685827039182186,
        0.032010599970817566,
        -0.012459554709494114,
        0.03808632865548134,
        0.06855570524930954,
        0.019592272117733955,
        -0.05789322778582573,
        -0.09200570732355118,
        0.03268037363886833,
        0.07059890031814575,
        0.019563693553209305,
        -0.12243164330720901,
        -0.013447917997837067,
        0.016504773870110512,
        0.07836420089006424,
        -0.02333962544798851,
        -0.01968252658843994,
        -0.04510089382529259,
        0.02477787435054779,
        0.05188038945198059,
        0.012641253881156445,
        0.031161215156316757,
        -0.0006031514494679868,
        -0.0035460088402032852,
        -0.04545610025525093,
        -0.013652163557708263,
        0.05191522836685181,
        0.047071848064661026,
        -0.10027319192886353,
        -0.05667242035269737,
        -0.03438156843185425,
        0.09046337753534317,
        0.022999610751867294,
        -0.050142768770456314,
        -0.02942155860364437,
        -0.08007734268903732,
        0.02181672304868698,
        -0.005293054971843958,
        -0.017095433548092842,
        0.1102181002497673,
        -0.0761738196015358,
        -0.10217583924531937,
        0.061911772936582565,
        -0.11928349733352661,
        -0.025827160105109215,
        -0.00604721624404192,
        -0.14519457519054413,
        -0.03884909301996231,
        0.025937335565686226,
        -0.027792897075414658,
        -0.03211013972759247,
        -0.0372420959174633,
        0.08614443987607956,
        0.08166651427745819,
        0.09033203125,
        0.0162107702344656,
        -0.07672443240880966,
        -0.01706748828291893,
        0.11038234084844589,
        0.00016211564070545137,
        0.02384842187166214,
        -0.03482603654265404,
        0.004614823032170534
    ]
}