{
    "id": "Ym9dOW6TnkA",
    "title": "What are you going to do in 2022? Tops 5 skills to get!",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-01-10T15:00:31Z",
    "video_url": "https://www.youtube.com/watch?v=Ym9dOW6TnkA",
    "category": "Science & Technology",
    "tags": [
        "linux",
        "python",
        "golang",
        "rust",
        "go",
        "ubuntu",
        "kalilinux",
        "aws",
        "azure",
        "gcp",
        "cybersecurity",
        "log4j",
        "hacking",
        "ethical hacking",
        "vmware",
        "docker",
        "kubernetes",
        "cyber security",
        "ml",
        "ai",
        "machine learning",
        "devops",
        "study 2022",
        "blockchain",
        "nft",
        "web3",
        "cyber security analyst",
        "jobs",
        "2022 top skills",
        "top tech skills 2022"
    ],
    "views": 294454,
    "likes": 15036,
    "comments_count": 745,
    "description": "Get these skills in 2022! Or at least get started.  Do you agree?  // MENU // 0:00  Introduction - ride waves 1:25  You cannot change the past, but use the 1% rule 2:30  First skill to learn 4:14  Second skill to learn 4:40  Path 1 5:13  Path 2 5:36  Path 3 and 4 6:05  Path 5 6:30  Path 6 and 7 7:00  Career advice 7:25  Skill 1  7:42  Skill 2 8:13  Skill 3 8:49  Skill 4 9:20  Skill 5 10:00  Skill 6 11:00  Rome was not built in one day  // BOOKS // Atomic habits:   // SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MY STUFF // Monitor:  More stuff:   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  linux python golang rust aws azure gcp cloud networking ccna ccnp ccie api apis vmware docker kubernetes blockchain nft bitcoin  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #linux #python #hacking",
    "description_links": [
        "https://amzn.to/3F8SESw",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://amzn.to/3yyF74Y",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- When you start out, it can often be confusing, you don't know where to go. Let me just tell you that your career is not gonna be hopefully just a year long. It's gonna be a long time, and you can go on different tangents, you can take different paths, but just look at the trends, look at the big trends and where technology is going, and try and ride waves. I highly recommend, and I've done this many times, I believe in riding waves. Look at the big technologies that are changing the world. I remember going back and I'm really, really old, but going back, I remember how Cisco revolutionized the telephony world with voice over IP. Why would you pay huge amounts of money to talk to people around the world, if you can just use Zoom or WhatsApp? Voice today has changed. So I rode that wave for a long time. There were other technologies that changed the world like OpenFlow or Network Automation. Cybersecurity has been around for a long time. It's really hot enough, but I remember teaching Cisco Security courses many, many years ago. Just look at the waves, and then decide what you wanna jump on. Look at what's interesting to you. And what you think is gonna give you the most return on your time, because we all have limited time. We all have limited resources. So look at the waves, and jump on the waves, and decide which path to go. (bright upbeat music) In this video, I'm gonna discuss five top skills that I think you should look at to getting in 2022. But before we even start, I wanna remind you that Rome wasn't built in a day. You can't change what happened yesterday. You can only change what happens today, and what happens in the future. And no one expects you to try and learn all of the stuff like that. It takes time to learn technologies. My advice is, spend some time every day, learning something new. Try and learn something new every day, and you'll be amazed how quickly you pick up information, and how quickly your skills develop, and how quickly you can change where you're at at the moment. So if you're not happy with your skills today, if you're not happy at your current job, if possible, spend time every day on learning something new. Decide where you wanna go, and then spend time every day reaching those goals. You've gotta decide what you wanna do. So in this video, I'm gonna give you some parts which I think can really help you, sort of some direction where the industry is going. And then I wanna give you some skills that I think can really change your life. Now I've been talking about this stuff for a long time. I've been saying for a long time that you need to learn some of these skills. So the first skill that I think you need to learn in 2022, if you haven't already is Python. Now I say Python, because that's a very easy language to pick up. If you're in networking, it's a very easy language to learn. Python is used very heavily in networking. If you're in cybersecurity, a lot of scripts and a lot of code is available on GitHub that you can leverage if you understand Python. So you don't have to reinvent the wheel. But let me tell you, if you learn a programming language, it changes your paradigm. It changes your way of thinking. Rather than just being a consumer of an application, you can create your own destiny if you like. You can create your own code that does what you want it to do. So you might grab a bit of code off GitHub from one developer, some code off another developer, and then you might stitch that together to do something that you want it to do. Seriously, I am so happy that I learned to code years ago before I got into networking in a big way. I used to do coding. So coding or development can really, really help you. Now, I'm not saying that you have to become a developer if you wanna get into cybersecurity, I'm not saying that you have to become a developer if you wanna be a networking engineer, but you need to have an appreciation or understanding of coding. So I strongly recommend that you learn a programming language. Now Python is the easy one to pick up. There are other languages that are really, really good, and that are gaining traction in the industry today. Have a look at GoLang or Go, have a look at Rust: two very, very good languages to look at. But if you're not sure where to start, I would suggest you start with Python, and then you can decide which language you prefer. Go has a lot of advantages over Python. It gives you concurrency, a whole bunch of other advantages that you won't get in Python. But the moral of the story is start learning a programming language. Python is a great one to start with. Now, another cool skill that you need is Linux. I've said this once again, many, many, many times: you need to learn Linux. Doesn't matter if you wanna get into the cloud. It doesn't matter if you wanna get into cybersecurity. It doesn't matter if you wanna be a network engineer. It doesn't matter if you wanna get into data science, you need to learn Linux. And this is a good time to talk about some of the paths or the destinations that I think will be fantastic to get into in 2022, if you're not doing it already. As an example, become a programmer. There are lots and lots of jobs for programmers. Python is a great language to learn as a starting point if you wanna become a developer. How often do you make phone calls with your phone, versus how often do you use applications on your phone to do things? Check the weather, play a game, do something. We are using applications more and more and more. Most of us these days will chat rather than talk on a phone. So application development is not gonna go away. It's just gonna become more and more popular. If you wanna become a coder, that's a great career path. Another one that's become very popular in recent times is cybersecurity. There have been so many well-known hacks. Think about SolarWinds, Log4j. There have been a lot of problems with code. If you wanna get into cybersecurity, that is a fantastic path to get into. So one of the hot trends or very in demand skills at the moment is cybersecurity. So that is a fantastic path in 2022. Now the world runs on networks, as I said. Networking is not gonna go away, but a big change has been the cloud. More and more network engineers are taking their skills and using it in the cloud. So today, we don't just have servers on premise, so in our company data centers. We also have it in the cloud. So you need to learn cloud skills. Learn AWS, if you're not sure, that's a good place to start, or Azure or Google Cloud, but I would start with AWS if you're not sure. Another fantastic place that's sort of really hot at the moment is AI or machine learning or data science. There's a huge demand for machine learning, data science, and AI. This is something that I suggest that you look at in 2022. A lot of this stuff has been bubbling up in the industry, becoming more and more important: AI for hacking, AI for protecting of networks, AI for managing networks better, et cetera, et cetera. Two more that I think are really important are DevOps and IoT. These are paths to look at. If you're not sure where to go, look at some of these parts, but my advice would be number one, try and do what you love. Try and find a niche, or a part of this that you enjoy. Perhaps you don't like programming. Perhaps you prefer networking. Perhaps you like cybersecurity or hacking, perhaps you don't. Try and find your niche or your special place in tech. There are so many opportunities today. So number one, try and do what you love. And number two, remember your career is not just gonna be one year or two years in length. Your career is probably gonna spend many, many years. As you grow in your career, your direction will change. You may decide to go into management. You may decide to go into pre-sales. You may decide that you prefer staying technical. Just be aware that your career can change over time, and that's fine. So again, first skill that I suggest that you get is programming. Understand a programming language and change your mindset. Don't just be a consumer of applications. Create your own applications, that gives you a huge amount of power. It's really, really important today to understand a programming language. This runs on a basis of Linux. You need to learn Linux if you're really serious about your career. So spend some time everyday learning Linux. Download Kali or Kali Linux if you prefer from the internet, put it in a virtual machine, learn to hack using Kali, or just run Ubuntu in a virtual machine. Make sure that you understand how to use Linux, or very popular today, Raspberry PI. Get a Raspberry PI, run Linux on it. See if you can build a network, see if you can build a server or something using Linux, great idea today to learn Linux, and I've said this for many, many years. Now, the world, as I mentioned, runs on networking. You need to have an understanding of networking. Doesn't matter which path you wanna go, but you may focus on being a network engineer. Your focus could be networking, but your focus may not be, your focus may be programming. Then you just need to have an understanding or an appreciation of networking. But if you don't understand what an IP address is, if you don't understand what a port number is, if you don't understand what routing is, you don't understand what switching is, it's gonna put you at a serious disadvantage. So go and get Network+ or CCNA. Get an understanding of networking. At least give yourself a good foundation in networking. Cloud, as I mentioned is really, really important. So go and have a look at the AWS certs or Azure certs as a start, or GCP. There's good and bad of each, but if you not sure, AWS is probably the one that I would choose because AWS has been around the longest. They are the biggest cloud provider. So if you're not sure, I would recommend AWS, start there. Good place to start, learn about the cloud. Now I see that as base skills, those are basic skills. Another one would be virtualization, understand virtual machines. So as an example, you need to understand virtualization if you download a virtual machine from the Kali website, and wanna run that on your laptop. So as an example, maybe I wanna run Kali on my Mac, or I wanna run Kali as a virtual machine on my Windows computer. You need to understand type 1, type 2 hypervisors. VMware have been around for many, many years. ESXi has been around for a long time. Understand type 1, type 2 hypervisors, but things have changed in recent times. We've got Docker and Kubernetes. Those are great technologies to learn about, so don't just stop at virtual machines. Think about containers, think about Docker, think about Kubernetes. Virtualization is a core skill that you need to know in today's world. Something that's trending and becoming very popular is blockchain. Have an understanding of blockchains. There are many applications for the blockchain, and I'm not talking about Bitcoin. I'm not trying to talk about Web3 or NFTs and stuff like that. There's a lot of debate about that stuff. At least educate yourself and have an understanding of how blockchains can help companies. How can we use a distributed blockchain to make sure that people and companies are accountable? How do we keep a record of what's been happening? So I would recommend, if you wanna look at hot new stuff, have a look at blockchain, have a look at some of these new trending things. Machine learning, AI, blockchain: new stuff to concentrate on. Traditional core skills: learn a programming language like Python, learn Linux, learn virtualization, learn networking. That's sort of your base knowledge, and then you can jump into specific areas. For instance, you might wanna get into hacking or cybersecurity, you might wanna get into AI, you might wanna get into some of these other areas. Now again, just remember, Rome was not built in a day. No one's telling you that you need to learn this immediately. No one's telling you that you need to learn this tomorrow. It takes time to learn this stuff, but try and learn something new every day. Try and increase your knowledge every day. Rather than spending an extra hour watching television, why not take that hour, and spend some time learning something. Go and watch YouTube videos that educate you, rather than just entertain you. Watch training material. There's so much free content out there. We have a problem today where there's too much information often. So what I'm trying to give you is sort of a guideline of stuff to look at. Go and look at the free training available from many companies. There's a lot of free and great content out there. NetworkChuck is an example: has fantastic content if you wanna get started in specific areas, go and have a look at his Docker video, go and have a look at his Linux videos, where he teaches you the basics of Linux. There is a fantastic high quality content out there. Jeremy's It Labs has a free CCNA course. You can have a look at my courses on Udemy, pay $10 for a course. There is a lot of free or low cost content out there. The biggest problem today is typically your time to try and learn the stuff, and to decide where to go. So I've given you sort of some paths, and some skills to concentrate on. Again, no one's expecting you to learn this immediately or by tomorrow. Now let me know what you think. Did I miss something? Do you agree with sort of the skills that I have mentioned here? A lot of this stuff I've been saying multiple times. Foundational skills like programming and Linux, I think are just becoming more and more important. But did I miss something? Do you see any new trends that you think are really important? Do you agree with me? Maybe you don't, put in the comments below. Let me know what you think. As always, I'm David Bombal, and I wanna wish you all the very best in 2022. (bright upbeat music)",
    "transcript_keywords": [
        "learn",
        "learn Linux",
        "Linux",
        "time",
        "Python",
        "skills",
        "long time",
        "networking",
        "understand",
        "today",
        "start",
        "language",
        "stuff",
        "programming language",
        "programming",
        "lot",
        "cloud",
        "decide",
        "Kali",
        "AWS"
    ],
    "transcript_entity_values": [
        "first",
        "GoLang or Go",
        "these days",
        "Linux",
        "one year or",
        "many years ago",
        "Cisco",
        "Kubernetes",
        "five",
        "two",
        "an extra hour",
        "AWS",
        "Rome",
        "GCP",
        "tomorrow",
        "2",
        "Network Automation",
        "2022",
        "today",
        "Google Cloud",
        "this tomorrow",
        "Log4j",
        "IP",
        "Python",
        "Kali",
        "Linux",
        "Mac",
        "AI",
        "Docker",
        "NetworkChuck",
        "10",
        "one",
        "years ago",
        "Linux",
        "VMware",
        "GitHub",
        "Cisco Security",
        "Udemy",
        "Cybersecurity",
        "SolarWinds",
        "Two",
        "CCNA",
        "Kubernetes",
        "Kali Linux",
        "a day",
        "Bitcoin",
        "Windows",
        "1",
        "Azure",
        "Download Kali",
        "Raspberry PI",
        "YouTube",
        "yesterday",
        "that hour",
        "number two",
        "DevOps",
        "Jeremy",
        "David Bombal",
        "two years",
        "WhatsApp"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "TIME",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.032891470938920975,
        -0.03461310639977455,
        0.04557251185178757,
        -0.030895331874489784,
        -0.021197276189923286,
        -0.0055162603966891766,
        -0.04038792476058006,
        0.01128151174634695,
        -0.12687113881111145,
        0.009468073956668377,
        -0.0102995028719306,
        -0.05259709432721138,
        0.010536774061620235,
        0.03901264816522598,
        -0.006898623425513506,
        -0.0014065405121073127,
        -0.0463862344622612,
        -0.006410706788301468,
        -0.007652914617210627,
        -0.12342578172683716,
        0.04069511964917183,
        0.00590479327365756,
        0.03325939178466797,
        -0.034366313368082047,
        -0.01464026141911745,
        0.07555151730775833,
        -0.020824169740080833,
        0.01776871643960476,
        0.007617422379553318,
        -0.0316055491566658,
        0.017160076647996902,
        0.15618811547756195,
        -0.051805559545755386,
        -0.023017462342977524,
        -0.038091450929641724,
        0.017476042732596397,
        0.005342436488717794,
        -0.028944557532668114,
        0.06601007282733917,
        -0.0362931564450264,
        -0.005862073507159948,
        -0.0486738458275795,
        -0.03410566225647926,
        0.03733089938759804,
        0.03264693543314934,
        -0.026987774297595024,
        0.0022864127531647682,
        -0.03900023549795151,
        0.01784507930278778,
        0.059103671461343765,
        -0.06963639706373215,
        -0.05571204796433449,
        0.05686914175748825,
        -0.060598209500312805,
        -0.024433817714452744,
        0.05013301223516464,
        -0.03710281103849411,
        0.03531579300761223,
        0.03511464595794678,
        -0.08826116472482681,
        0.009958016686141491,
        -0.06517396122217178,
        -0.08875363320112228,
        0.01609990932047367,
        -0.048562999814748764,
        0.005460142623633146,
        -0.09905216097831726,
        0.09789818525314331,
        -0.004270364064723253,
        0.0011985307792201638,
        -0.018164334818720818,
        -0.04721604660153389,
        0.022840486839413643,
        0.03420829772949219,
        0.07724369317293167,
        0.029414935037493706,
        0.028562283143401146,
        -0.0293008740991354,
        -0.0379207618534565,
        -0.0736427903175354,
        0.010813544504344463,
        -0.0835966020822525,
        0.0030867448076605797,
        -0.028184162452816963,
        -0.040577638894319534,
        0.014261757023632526,
        0.012902170419692993,
        0.009358052164316177,
        0.05648723989725113,
        0.0061493623070418835,
        0.014379933476448059,
        -0.0131570715457201,
        0.027275418862700462,
        0.0393441766500473,
        -0.011516022495925426,
        0.08708712458610535,
        -0.04249309003353119,
        -0.02274658903479576,
        -0.02808796614408493,
        0.05453772470355034,
        -0.019814420491456985,
        0.0026490180753171444,
        0.00965465884655714,
        -0.022608431056141853,
        -0.05092478170990944,
        -0.002974516712129116,
        0.045429859310388565,
        0.06809040158987045,
        0.03311758488416672,
        0.0001934949541464448,
        -0.03397977724671364,
        0.03937700018286705,
        -0.04192330315709114,
        -0.029288074001669884,
        0.08545397222042084,
        0.06121139973402023,
        -0.03258417919278145,
        0.09467454999685287,
        0.06846170872449875,
        0.04768401384353638,
        0.03294225037097931,
        0.07474486529827118,
        -0.011368903331458569,
        -0.0024338201619684696,
        -0.008937088772654533,
        -0.06555977463722229,
        -0.05725512653589249,
        1.3674431743567605e-32,
        0.06292686611413956,
        0.07497040182352066,
        -0.04390813037753105,
        0.10637222975492477,
        0.04505051672458649,
        -0.03796625882387161,
        0.016919748857617378,
        0.024651404470205307,
        -0.027438132092356682,
        -0.0043607368133962154,
        -0.011150546371936798,
        0.0006872120429761708,
        -0.07186371088027954,
        0.0013981182128190994,
        0.09501677751541138,
        -0.033012405037879944,
        -0.016688289120793343,
        -0.0426979586482048,
        0.02004357799887657,
        -0.009218153543770313,
        0.04802875965833664,
        -0.02229701168835163,
        0.02658519707620144,
        -0.05061839148402214,
        0.03824383392930031,
        0.011599177494645119,
        0.06017288938164711,
        -0.057946451008319855,
        0.07072396576404572,
        0.02954016625881195,
        -0.028162477537989616,
        0.0033633592538535595,
        -0.10055820643901825,
        -0.018491502851247787,
        0.043692391365766525,
        0.05151323601603508,
        -0.024563070386648178,
        -0.06324756890535355,
        0.020795835182070732,
        0.02443382889032364,
        -0.04629864543676376,
        0.060040999203920364,
        -0.013535616919398308,
        -0.04007593169808388,
        0.007963908836245537,
        -0.042366668581962585,
        0.17832690477371216,
        0.021598948165774345,
        0.014065041206777096,
        0.08589879423379898,
        -0.0938723161816597,
        -0.05223339423537254,
        0.02180454321205616,
        -0.11413556337356567,
        0.032458242028951645,
        -0.044696372002363205,
        0.0355554074048996,
        0.03693893551826477,
        -0.08017866313457489,
        0.03506368398666382,
        0.04744930937886238,
        0.06715040653944016,
        -0.010302082635462284,
        0.046940866857767105,
        -0.06417807936668396,
        0.07123404741287231,
        -0.04546882212162018,
        0.013859753496944904,
        0.09760265797376633,
        -0.0019138803472742438,
        -0.0495990626513958,
        0.01118784211575985,
        0.030199045315384865,
        0.015551463700830936,
        0.03777572140097618,
        0.024621255695819855,
        0.04748255014419556,
        -0.13972310721874237,
        0.0056128655560314655,
        0.03352456912398338,
        -0.0006536918808706105,
        0.0431525744497776,
        -0.0314704105257988,
        -0.033393003046512604,
        0.06628245115280151,
        -0.013980736024677753,
        0.09433429688215256,
        -0.06134786084294319,
        0.019706275314092636,
        0.0024549912195652723,
        0.020692527294158936,
        -0.09691872447729111,
        0.07153060287237167,
        0.061955101788043976,
        -0.07735062390565872,
        -1.2983283676954317e-32,
        0.008848538622260094,
        0.02449292317032814,
        0.029541291296482086,
        0.026852641254663467,
        0.09111183881759644,
        -0.006986045278608799,
        0.051416024565696716,
        0.017831530421972275,
        0.08384677767753601,
        -0.002285073511302471,
        -0.0011603782186284661,
        0.036308977752923965,
        0.03651149198412895,
        -0.01225375384092331,
        -0.038636740297079086,
        -0.09139274805784225,
        -0.03685104101896286,
        0.009582598693668842,
        -0.04139378294348717,
        -0.00657951133325696,
        0.041714273393154144,
        0.02599320560693741,
        -0.14977417886257172,
        0.028599733486771584,
        -0.022593198344111443,
        0.035583313554525375,
        0.04045739397406578,
        0.018382657319307327,
        -0.02046794444322586,
        0.0198442954570055,
        -0.029982585459947586,
        -0.015322850085794926,
        -0.012313062325119972,
        -0.017343325540423393,
        -0.01369332056492567,
        0.018188253045082092,
        0.006877366453409195,
        -0.00031617519562132657,
        -0.04645995423197746,
        0.05677470192313194,
        0.038672108203172684,
        -0.015185353346168995,
        -0.044692784547805786,
        -0.008575583808124065,
        -0.0617026761174202,
        0.00031056420993991196,
        0.0015500778099521995,
        0.031930383294820786,
        -0.063057079911232,
        -0.028808025643229485,
        0.07576825469732285,
        0.005815614014863968,
        -0.006474893074482679,
        -0.030599288642406464,
        0.08388066291809082,
        -0.0015783252893015742,
        0.10726674646139145,
        -0.03439139202237129,
        0.025547944009304047,
        -0.004712319001555443,
        0.011134134605526924,
        0.0195053331553936,
        -0.0046196128241717815,
        0.0182974673807621,
        0.01797543652355671,
        -0.10837334394454956,
        -0.07635217159986496,
        0.13396668434143066,
        -0.1330055445432663,
        0.012569314800202847,
        -0.05273966118693352,
        0.035831063985824585,
        -0.08918066322803497,
        -0.12506835162639618,
        -0.06423760205507278,
        -0.04793144017457962,
        -0.0019910705741494894,
        -0.03420936316251755,
        -0.010021206922829151,
        -0.04572901502251625,
        -0.10535368323326111,
        0.011657067574560642,
        -0.07044591754674911,
        0.07245679944753647,
        0.03979554772377014,
        0.09001607447862625,
        0.018036317080259323,
        0.01187227014452219,
        0.07866935431957245,
        -0.036271754652261734,
        0.0020769285038113594,
        0.029571590945124626,
        0.013423715718090534,
        0.012264109216630459,
        -0.04189973697066307,
        -7.005962032735624e-08,
        -0.05959104374051094,
        0.014833812601864338,
        -0.004251258913427591,
        0.06553017348051071,
        0.04770693928003311,
        0.048370543867349625,
        -0.05242646485567093,
        0.052361976355314255,
        0.04362960159778595,
        0.03990960493683815,
        -0.010912144556641579,
        0.01531132124364376,
        0.041183385998010635,
        -0.03519263118505478,
        0.06780405342578888,
        0.06070404872298241,
        0.015780925750732422,
        0.015143763273954391,
        -0.05388740450143814,
        -0.060642607510089874,
        0.0820750817656517,
        -0.06497535854578018,
        -0.0187932550907135,
        -0.01569445990025997,
        -0.05843992531299591,
        -0.06050480529665947,
        -0.01952276937663555,
        0.05045055225491524,
        -0.009750505909323692,
        -0.006074307486414909,
        -0.054594267159700394,
        -0.09970321506261826,
        -0.025439079850912094,
        -0.10147015750408173,
        0.029764611274003983,
        -0.04506552964448929,
        -0.059493932873010635,
        -0.03788759931921959,
        -0.053629856556653976,
        0.048887550830841064,
        -0.032396212220191956,
        0.0033513109665364027,
        0.04826091229915619,
        0.10871370881795883,
        -0.027028532698750496,
        -0.06409823149442673,
        -0.022377409040927887,
        -0.04225042834877968,
        0.0021154724527150393,
        -0.10547108203172684,
        -0.030642036348581314,
        -0.051352694630622864,
        -0.015457131899893284,
        -0.03855200111865997,
        0.09801094979047775,
        0.1241416484117508,
        -0.03655333071947098,
        0.0011681515024974942,
        -0.0784156396985054,
        0.060452140867710114,
        0.04591704159975052,
        -0.021088888868689537,
        -0.12354863435029984,
        0.02022661454975605
    ]
}