{
    "id": "YnO3jYeiHuI",
    "title": "Sony fixed this FATAL flaw! - Xperia 1 V",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-06-11T19:45:40Z",
    "video_url": "https://www.youtube.com/watch?v=YnO3jYeiHuI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "sony",
        "xperia",
        "phone",
        "mobile",
        "camera",
        "alpha",
        "mirrorless",
        "optical",
        "EIS",
        "OIS",
        "PDAF",
        "cool",
        "flagship",
        "expensive",
        "overheat",
        "Xperia 1 V",
        "labs",
        "testing"
    ],
    "views": 243917,
    "likes": 8612,
    "comments_count": 980,
    "description": "Switch up your camera set up! Check out the SwitchPod at   Sony's new Xperia 1 V looks like a decent flagship offering with killer cameras, a slick design, and solid performance, but with past overheating issues and a price tag that could scare buyers away, does Bell think people should give this phone a chance or is this another big miss for the Xperia lineup?  Buy a Sony Xperia 1 V:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Sony has always been so close 0:34 A very short unboxing 0:47 Design impressions 3:37 Sponsor - SwitchPod 4:05 Fingerprint scanner test and more specs 5:56 Display and speaker impressions 6:59 Labs' display testing results 7:44 Camera impressions 13:26 Labs' gaming performance and battery test results 15:21 Pricing and overall thoughts 16:32 Outro",
    "description_links": [
        "https://lmg.gg/SwitchPod",
        "https://lmg.gg/vc1h0",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I have a complicated history with Sony phones. On paper they look great. 4K display, amazing cameras with a dedicated shutter button, headphone jack, expandable storage, what else could you need? Well, when I worked at Bell selling phones for a few years, every Sony phone we got would have trouble with overheating, and even last year when Brandon covered the 1 IV, when he went to take pictures and videos, it started overheating. I'm hoping that Sony's new 1 V won't have this issue because again it's looking pretty great on paper. As we can see here, not much in the box. Just a phone, no manual, no sim popper, and it's made out of paper, I'm assuming, 'cause it feels like egg carton. Maybe it's made of egg. I don't know what egg carton's made of. Right off the bat, you get to see the 6.5 inch, 21 by 9 4K display. I gotta say I actually really like this aspect ratio. It feels really solid in the hand. You can still reach the other side. I don't have giant hands and I can still reach this pretty easily. Obviously, going to the top is a bit of a reach and you have to be kind of dynamic with how you're gripping it, but I think it's a really nice aspect ratio, again, for watching content. I know there's a lot coming out that is in this new 21 by 9 aspect ratio, including YouTubers or you know Netflix and stuff like that. Going around the sides of the phone, we got nothing on the left. I really like the feel of the side rails here. It's like, textured. And you see the nice looking antenna lines on there as well. Up to the top we have a headphone jack. Great to see they're still keeping it, bucking the trend of phones are too small to have them. We all know it's a lie and Sony's proven it. And then we have our mic hole here. On the right side of the phone we have a volume rocker and power button fingerprint scanner combo, as well as the two stage dedicated shutter button. So you can hold it halfway to focus your photos and press all the way down to take a photo. On the bottom we have more antenna lines. We have a USBC 3.2, so that'll be display port as well as, you know, fast data transfers, which is great for getting media off your phone. And the easy access sim tray and SD card slot. That is right, SD card slot, in 2020, current year. Amazing. On the back we have our tasteful Sony logo and Xperia, so you don't forget what phone you have, as well as the NFC logo so that you remember your phone can tap other things. We also have our cameras on the back so it's a triple camera set up with our main 48 megapixel wide camera, our ultra wide 12 megapixel camera, and this year is our telephoto camera, which does optical zoom, which is pretty interesting. So it's actually gonna move the glass to get your zoom from 3.5 to 5.2, which for people who know camera lenses, is about 85 millimeters to 125 millimeters. And what's great about optical zoom is they're not gonna lose quality with like digital zoom, which is where you're just taking a photo and pretty much just zooming in and cropping it. You're gonna keep all those precious pixels that you've been, you know, yearning for in your photos. The back is also made with Gorilla Glass Victus while the front is made of Victus 2. And I don't think I mentioned it, but the sidebars are made of aluminum. So this is a pretty dense phone. It didn't feel heavy at only 187 grams, so nothing super crazy, and it doesn't feel too unbalanced especially with how tall this phone is. And finally, inside this glass sandwich is a 5,000 milliamp hour battery. Again, the standard from what we've been seeing over the last few flagships. But with the new Snapdragon 8 Gen 2 that's powering this, we'll hopefully see some longevity in the battery that, you know, we weren't really able to get with some past Sony phones, but we had Labs check all that out and we'll talk about that later. I think the only thing left us to turn it on but not before I tell you about our sponsor SwitchPod. Are you a video creator looking to upgrade your on the go or vlogging setup? Look no further than SwitchPod. Compatible with any camera from a phone to a DSLR, this handheld tripod was designed by passionate video creators like us just trying to make their lives a little easier. Lightweight, compact, and nearly indestructible. Experience the freedom of quickly switching between handheld and tripod mode in seconds. Use the two threads on the legs to add accessories of your choice and turn the SwitchPod into a full-blown video rig. Head to the link below to check out SwitchPod today. Alright, let's try the fingerprint scanner, see if it's any good as I've seen some bad ones in my day. Lets you right in. Takes a little bit to open up. I think it's just kind of that animation that's coming up that it wants to be fancy, but I do like that you can just put your finger on it and it wakes up. It's, again, something pretty standard but it's nice to have. So like I said earlier, this is a 4K display and it does HDR, it's OLED, it's 120 hertz. I'm actually gonna turn it on 120 hertz mode now as it's definitely not at that. You won't be able to tell but for me, man, 120 hertz, it is a bit of a game changer. Going back to low refresh rate screens is rough but you do save quite a bit of battery keeping it at the 60 that phones normally are. So depending on your usage it might be smart to stay that way. Though this is 120 hertz screen, one thing that was a bit disappointing is that it is only a 240 hertz touch sampling rate. So what that means is that when you're actually touching the phone, that's how frequently it's updated to see where your finger is. And that's actually quite a bit below what other phones offer. Like the ROG Phone 7 has a touch sampling rate 720 hertz. So again, it's gonna know where your finger is pretty much at all times. For the average person will you notice? Probably not, but if you're somebody who's using this for a lot of gaming, it's like having a 240 hertz screen instead of 120. Yeah, it probably does make a difference, but if you're really, really into it, it does make that little bit of a difference. I mentioned earlier this has the Snapdragon 8 Gen 2, but what I didn't mention is the storage and RAM. So for RAM we have 12 gigs and for storage it has 256, which is great to have as a kind of base level. Again you can throw an SD card in there and get another terabyte if you really want to, but having 256 will probably be enough for most users. Again, I feel like the people who are getting this will be people who are, you know, taking a lot of photo and video so maybe that's why they started with kind of a higher base level. But just make sure if you're going to be taking a lot and putting SD card in there, don't just get the cheapest one, get something a bit better. But otherwise what we really wanna see is how good this display is. So let's throw on \"Crab Rave,\" check out the colors, check out the speakers and just, I don't know, hang out and have a good time. I'm down. (game music blasting) (fingers snapping) (game music blasting) It sounds pretty good. It does distort a little bit at the loudest volume. You can start to hear the, I think it's the earpiece speaker crisping up a little bit, which sounds not fantastic. But I have to say the screen does look very good. Like, this 4K display is sharp. I'll turn down the brightness so it's easier for you to see the trees, especially, like, in these shots. Looks really, really, really good. You may not especially notice 'cause it's on a smaller screen, but as somebody who's been you know doing a lot of unboxings on these more budget phones, it is pretty clear that there is a difference with this 4K display. If you don't trust my opinion that the screen looks good, I did actually send it over to our display tester over at Labs. So I had Labs test both the 1 V and last year's 1 IV to see what the differences were. And both phones come with a standard and creator mode. The standard mode uses the full gamut of the display, which makes colors very vibrant and pop. But it comes at the risk of color accuracy as most content on the web is made for SRGB, which doesn't use a wide color gamut. The creator mode, however, properly clamps the color gamut of the phone to the color space of the content. So it only uses wide gamut colors if the content calls for it. Just to note that all of these were done in SDR not HDR as we don't currently have a way of testing HDR content. Sony's actually claiming on their website that the phone has professional level color reproduction and it seems like they're telling the truth. So with respectable grayscale tracking and Delta E of 1.03, this can definitely be used for critical monitoring. Let's check out the cameras again. This is what you're buying the phone for, at least most likely. You might be using it as a outside display for your Sony camera 'cause you can actually mount this on top and it becomes a little external monitor but more than likely you just like taking pictures on your phone and it's really nice that you have this dedicated shutter button 'cause when you hold it down, it takes you right into the camera. And that doesn't happen if you just press it, you do have to hold it down so you're not gonna get accidental camera launches or at least you're less likely to. And taking a look at the UI here. It is as complicated as you want it to be. So this is the basic mode, what the average person will probably use if you just liked this aspect ratio on the rest of the phone. But you can also go into auto mode which gives you more options of what you want the camera to do. Program auto shutter speed, priority, manual exposure, and memory recall, which gives you, again, all of the manual options that they pretty much see in a Sony camera, which is great to see. Let's take some pictures. Alright for just testing out the the lenses quickly here, we can see the main camera and everything looks very sharp. Again, this is gonna be bidding down that 48 megapixel photo to a 12 megapixel photo which is more easily shareable and, you know, not as hard on the storage. And things look really good. The dynamic range, you don't lose the blackness of Sven's shirt versus the darkness of that dark blue wall behind him or the black garbage pail beside that, even though the lights are quite bright. As we go into the 3.5 zoom, there is a little bit of blurry, you can tell my hands must have been a little bit shaky but things still look quite good. And then the 5.2, again, a little bit blurry 'cause I have shaky Red Bull hands, but not bad at all. One really nice thing is that the main camera and the zoom camera both have optical image stabilization though the ultra wide does not. But all three cameras do have face detection auto focus. You're gonna get that quick zoom and in the settings you can actually choose whether it can do face and eye tracking or, you know, just tap, just use the face auto tracking. Look into my eyes. All right, let's take a look at some of the pictures I took outside to test, you know, the contrast units, the exposure as Labs also took a look and found that a lot of photos just on this default mode without changing any settings are a little bit overexposed. And I gotta say the color looks really, really good. One thing that I did notice when going to take a lot of these pictures, is that the preview photo it shows you, not great. A lot of the time I was like this photo is gonna look bad, it's gonna look blurry, it's gonna look way blown out. But when it actually takes a photo, and I don't know if it's just taking a real photo and showing it to you then or if it's using AI or machine learning to change the photo to make it look better, but it looks really good. Even with challenging closeup photos, you can kind of see the bit of fall off you're getting from the focus, to, again, some more challenging photos with dynamic range where you're getting a lot of dark darks and very, very bright brights. I do think in this photo in particular, the motorcycle does get a little bit lost in the darkness but it's nothing too bad. I also tried out all the different zoom levels on Riley as he was getting ready for \"TechLinked,\" and again the colors look pretty good and the zoom, this is actually at the maximum zoom using digital and it still looks really good. You can really see his excitement to see me. I also tried turning on the bokeh mode to see how it does with defining edges and creating a lifelike portrait photo. And I used our handsome model, Dennis the Pig. This is just the standard bokeh mode and it looks pretty good, I gotta say. Not too much depth of field and still looks pretty realistic from what I expect with a real lens. But then I tried cranking up the bokeh mode to see what it looks like. And, again, it looks very punchy, it's definitely more contrasty and you'd probably wanna brighten up the image, but it looks good. You can definitely see where it struggled a bit to find the lines of where to blur along his ear here but just for too little marks, that effect you're getting is strong. To give it a harder subject, I also tried with a tree and I have to say, it also looks okay. Definitely struggles to define the edge on this, you know, kind of rugged plant where there's a lot of edges and everything like that, but it doesn't look awful when you actually zoom out. To test out the mics, I went and bothered Riley again on \"TechLinked\" set. Let's see how it sounds. - What are you filming? What is that, an iPhone? - I'm just testing on the Sony Xperia 1 V. - [Jessica] Whoa, is it a nice experience? (Riley laughs) - Uh, that didn't really sound good. Riley and the other side of the camera sounded okay, maybe a little bit sharp for some reason, but the front facing camera where I was, sounds actively bad. I have a bit of a challenging voice with just how deep my voice is for these microphones to pick up, but that sounds really bad. So your mileage may vary, but if you're going to be using this as a vlogging setup or something like that, invest in an external mic. For selfies, looks pretty good. It's a 12 megapixel camera, like the zoom and ultra wide. Colors look good, quality looks good. Turned off the skin sharpening and everything looks pretty realistic there. Skin is flawless. And for the bokeh mode, again, it did okay. I feel like the strong effect here looks pretty surreal. It looks like I've gone in and edited this myself. So I might wanna, you know, turn it down a little bit. But around the fingers everything looks pretty sharp other than tiny little marks that you won't see unless you punch in. And, again, with my hair there are tiny little misses but nothing crazy. Let's see if taking a selfie video sounds better than taking a front facing video though. So this is definitely electronic image stabilization. I could tell because once I went to take a video it punched in the image very close. So again, if you don't have super long arms, be aware you're gonna need a self selfie stick if people still use those. But how do I sound? How does it look? It's keeping me in focus and exposed. That's cool. So I could do up to 4K 30 on that front cam. My quality was okay, definitely better than it sounded when I was on the other side of that main microphone that I was trying to use. But I would not say fantastic. There's been some pretty good microphones on some of these phones, but I wouldn't say this is one of the best. Maybe this can all be saved with gaming. By the way, I thought it was really funny, but on Sony's website for this phone under performance, they have somebody gripping the phone like this to play. I don't know what it is, but I'm clearly not enough of a gamer because this is intense. I couldn't imagine doing that. Like other flagships running the Snapdragon 8 Gen 2, this is a great performer. In \"Call of Duty Mobile\" and \"Unhappy Raccoon,\" we see a solid 60 FPS, and \"Genshin Impact\" gets almost there with 59 to 47 FPS. And though it doesn't get a perfect 60 FPS at \"Dolphin Emulator\" or \"Genshin Impact,\" it does perform quite well. And when compared to last year's model, the 1 IV, it does perform quite a bit better than \"Genshin Impact.\" What is really great about this is the battery life. So it's another Snapdragon 8 Gen 2 that just sips on battery. In the battery longevity test where we give it the best possible scenario of, you know, being on wifi, streaming video with low brightness, it was able to achieve a battery life of 23 hours. And that battery life is especially great when compared to the Pixel 7 Pro, which only got about 14 and a quarter hours. That's an extra like eight hours. That's like most of \"Lord of the Rings.\" That's crazy. Then of course we did the battery stress test, which is giving it the worst possible scenario. Full GPU, full CPU usage, max brightness, everything like that. And in the stress test it was able to get about 2.17 hours, which is okay. Last year's model was able to get 2.2 hours and Pixel 7 Pro was able to get 3.2. So if you're somebody who does a lot of commuting and you know likes to play \"Unhappy Raccoon\" with full max brightness while blasting music, it might not last super long, but, I mean, how often does that happen where you don't also have a plug nearby? And of course how good to figure out brightness? So we tested the maximum SDR brightness and we were able to get 605 nits, which is pretty darn good. It's not especially higher than the other flagships we have available to us, but pretty darn good. I gotta say, overall I'm pretty impressed. I like the design with the ribbed edges and kind of textured, grippy dot back. And it comes in a sweet khaki green as well, which is definitely one I would go for. It's got IP65 as well as 68, so it's gonna do well in the rain, whether you're getting hit by jet streams or if you submerge it in water. And I wasn't able to get it to overheat, even when taking pictures and videos outside. So what's the price? Well at 1,400 US dollars, it's pretty darn expensive. I think that if you're somebody who uses Sony cameras already and maybe would use this as an external display or you're somebody who really wants to get the most versatility out of their phone camera, this could be the phone for you. But if you are not somebody who's super into cameras or taking pictures on their phone, it's a bit of a tough sell 'cause there's a lot of competition at $1,400. Myself, I would probably go for a Samsung, Google or Apple because I'm not a huge fan of the skin that Sony puts over Android with its kind of bubble design, but I don't think this is a bad choice for people who wanna take their photo game to the next level and upgrade their phone. What do you think? This phone's releasing in late July. Tell us what you think down below. Get subscribed. Like this video. And if you wanna watch more, why don't you check out my coverage of the Samsung Unpacked event where we took the S23, S23 Plus, and S23 Ultra. It's probably the closest thing gonna get competing with this phone and I liked the Ultra a lot. Because I'm a furry and I'm proud. Editor, don't take that outta context.",
    "transcript_keywords": [
        "phone",
        "bit",
        "good",
        "pretty",
        "Sony",
        "camera",
        "pretty good",
        "phones",
        "photo",
        "Sony phones",
        "lot",
        "mode",
        "zoom",
        "great",
        "Sony camera",
        "display",
        "taking",
        "video",
        "cameras",
        "battery"
    ],
    "transcript_entity_values": [
        "last year",
        "4",
        "8",
        "Riley",
        "Victus 2",
        "Lord of the Rings",
        "Google",
        "this year",
        "Bell",
        "5.2",
        "my day",
        "Last year's",
        "seconds",
        "Dennis",
        "2020",
        "Samsung",
        "a few years",
        "6.5 inch",
        "Netflix",
        "YouTubers",
        "SDR",
        "only 187 grams",
        "1.03",
        "about 2.17 hours",
        "today",
        "current year",
        "FPS",
        "3.2",
        "Snapdragon 8",
        "68",
        "1,400",
        "59",
        "9",
        "max",
        "240 hertz",
        "256",
        "Sony",
        "two",
        "GPU",
        "SD",
        "CPU",
        "23 hours",
        "48 megapixel",
        "UI",
        "the Pixel 7 Pro",
        "Crab Rave",
        "about 14 and a quarter hours",
        "last year's",
        "about 85 millimeters to 125 millimeters",
        "RAM",
        "one",
        "iPhone",
        "12 megapixel",
        "DSLR",
        "TechLinked",
        "120 hertz",
        "Unhappy Raccoon",
        "Brandon",
        "3.5",
        "Ultra",
        "Call of Duty Mobile",
        "NFC",
        "120",
        "Android",
        "Genshin Impact",
        "late July",
        "Sven",
        "12",
        "Pixel 7 Pro",
        "jack",
        "Red Bull",
        "Xperia",
        "SRGB",
        "Apple",
        "Dolphin",
        "USBC",
        "Delta E",
        "605",
        "three",
        "One",
        "2.2 hours",
        "60",
        "720 hertz",
        "240",
        "Labs",
        "1,400 US dollars",
        "AI",
        "21",
        "1",
        "TechLinked",
        "Jessica",
        "Gen 2",
        "120 hertz mode"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "LAW",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "NORP",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.07994388788938522,
        0.0019937974866479635,
        0.10153543204069138,
        -0.06389036029577255,
        0.041352931410074234,
        0.041013434529304504,
        0.017970779910683632,
        0.058284200727939606,
        -0.01891098916530609,
        0.0376039482653141,
        0.07598097622394562,
        0.014204117469489574,
        0.024840330705046654,
        -0.03640064224600792,
        0.06390812247991562,
        -0.009477410465478897,
        0.05844410881400108,
        -0.07845310866832733,
        -0.08344116806983948,
        0.09148178994655609,
        -0.02462334744632244,
        -0.08418337255716324,
        0.01021976862102747,
        0.010266730561852455,
        -0.012191019020974636,
        0.03158983588218689,
        -0.02343272976577282,
        -0.016847800463438034,
        -0.03710929676890373,
        -0.02367287315428257,
        -0.057119905948638916,
        0.0743066668510437,
        0.015882495790719986,
        0.05290062353014946,
        0.03494573384523392,
        -0.09335248172283173,
        -0.007540952879935503,
        -0.07969804853200912,
        -0.035622548311948776,
        0.05700276792049408,
        -0.012082351371645927,
        -0.03789115697145462,
        -0.07572752237319946,
        0.06825023144483566,
        0.008933252654969692,
        -0.003805940505117178,
        0.08684440702199936,
        0.012774471193552017,
        0.0021501583978533745,
        0.009263459593057632,
        -0.003423162968829274,
        0.034930065274238586,
        0.11547571420669556,
        -0.03714509680867195,
        -0.10378901660442352,
        0.05205193907022476,
        -0.07147367298603058,
        -0.007525270339101553,
        0.028050769120454788,
        0.03351234272122383,
        0.08566755056381226,
        -0.027037592604756355,
        -0.03660712018609047,
        0.05477430671453476,
        0.005955613683909178,
        0.004007840063422918,
        -0.06023596599698067,
        0.021953022107481956,
        -0.024661235511302948,
        0.04990909993648529,
        0.0779237300157547,
        0.04571283236145973,
        0.013900014571845531,
        0.09087444841861725,
        -0.03435724601149559,
        0.034071631729602814,
        0.10232062637805939,
        -0.13433365523815155,
        -0.025783121585845947,
        -0.014151681214571,
        0.024827398359775543,
        -0.111846424639225,
        -0.13130499422550201,
        -0.026393285021185875,
        0.07763398438692093,
        0.015656696632504463,
        0.03519846871495247,
        0.008493908680975437,
        -0.06192455440759659,
        -0.040591757744550705,
        -0.02411215752363205,
        0.025158638134598732,
        0.05459735542535782,
        -0.0010149053996428847,
        -0.07987047731876373,
        0.006749947089701891,
        -0.001018822891637683,
        -0.05739899352192879,
        -0.04819144681096077,
        0.064534492790699,
        0.0031942836940288544,
        0.07714308798313141,
        0.042992718517780304,
        0.059061478823423386,
        -0.013269564136862755,
        -0.08061232417821884,
        0.022696603089571,
        0.04250456765294075,
        0.005544370971620083,
        0.0026693069376051426,
        -0.07582653313875198,
        0.0047165099531412125,
        -0.028503278270363808,
        -0.016840649768710136,
        -0.08641014248132706,
        0.046542394906282425,
        -0.042534664273262024,
        0.05403902009129524,
        0.10387160629034042,
        -0.0759698674082756,
        0.04898448660969734,
        -0.0647985190153122,
        -0.07061388343572617,
        0.05584895238280296,
        -0.03215108439326286,
        -0.02539708837866783,
        -0.03345668315887451,
        2.2912967311678346e-33,
        -0.07440582662820816,
        0.06448406726121902,
        -0.048033107072114944,
        -0.07272785902023315,
        0.03799304738640785,
        0.04443266615271568,
        0.026303449645638466,
        0.0539909265935421,
        -0.10740665346384048,
        0.002680197125300765,
        -0.03453812375664711,
        -0.03365914523601532,
        -0.04901570826768875,
        0.029163053259253502,
        0.010228211991488934,
        -0.014035070315003395,
        -0.0011321526253595948,
        0.021628525108098984,
        0.031326040625572205,
        -0.03791775554418564,
        0.024751434102654457,
        -0.04615573585033417,
        -0.02202291041612625,
        -0.03883973881602287,
        -0.009085520170629025,
        0.051731910556554794,
        0.07250601798295975,
        -0.03261091187596321,
        0.04142332822084427,
        0.013933025300502777,
        -0.0894220620393753,
        0.0649971067905426,
        0.061015479266643524,
        -0.006831763777881861,
        -0.04284696653485298,
        0.021886495873332024,
        -0.052328675985336304,
        -0.05378444492816925,
        0.03049791418015957,
        -0.019514966756105423,
        -0.07159778475761414,
        0.05961989611387253,
        -0.10580476373434067,
        -0.06601761281490326,
        -0.0016929438570514321,
        0.039667222648859024,
        -0.03896549716591835,
        0.016879519447684288,
        -0.0279858335852623,
        -0.040580496191978455,
        0.0037970750126987696,
        0.027728745713829994,
        -0.06038983538746834,
        0.012546639889478683,
        -0.026044074445962906,
        -0.11402764171361923,
        0.010157868266105652,
        -0.02239459939301014,
        0.04982803016901016,
        -0.015297368168830872,
        0.08600934594869614,
        0.00727740628644824,
        0.006888672709465027,
        0.005939566530287266,
        -0.029408715665340424,
        0.09441764652729034,
        -0.03450135886669159,
        -0.06775861233472824,
        -0.05300929769873619,
        -1.92473380593583e-05,
        -0.002256972948089242,
        0.01780814491212368,
        0.01255235355347395,
        -0.04283003509044647,
        0.01102455984801054,
        0.05083629488945007,
        -0.08730582147836685,
        -0.053649015724658966,
        0.047213658690452576,
        0.004484431352466345,
        -0.018653959035873413,
        -0.007874974049627781,
        0.09884720295667648,
        0.0015724049881100655,
        0.00695409718900919,
        -0.009168076328933239,
        0.03718360885977745,
        -0.0579809732735157,
        -0.0572403222322464,
        0.08466027677059174,
        0.022891422733664513,
        0.012691953219473362,
        -0.028105853125452995,
        0.023277942091226578,
        -0.02952464297413826,
        -2.8890324861540985e-33,
        -0.028906939551234245,
        0.005114661995321512,
        -0.011112061329185963,
        -0.05005481466650963,
        -0.019634293392300606,
        -0.039244264364242554,
        -0.05030817538499832,
        0.05251626670360565,
        0.041677508503198624,
        0.006658488418906927,
        -0.021181555464863777,
        0.0001992440811591223,
        -0.09977515041828156,
        -0.03930499777197838,
        -0.019733449444174767,
        -0.06108060106635094,
        0.10989448428153992,
        -0.09194790571928024,
        0.0180240198969841,
        -0.005655789747834206,
        0.07361789792776108,
        0.07597865164279938,
        -0.04699511080980301,
        0.10613714903593063,
        -0.06296852231025696,
        0.015171581879258156,
        0.06509812921285629,
        0.05187264084815979,
        -0.005378102418035269,
        -0.08513051271438599,
        -0.030575916171073914,
        -0.05468103289604187,
        0.02268243581056595,
        -0.04281531274318695,
        0.063459113240242,
        0.08735566586256027,
        0.005439517088234425,
        0.05064256116747856,
        0.06902734190225601,
        0.039339154958724976,
        0.026272905990481377,
        -0.06138374283909798,
        -0.03972690552473068,
        -0.015957651659846306,
        0.040390655398368835,
        -0.06837598979473114,
        0.04809671640396118,
        -0.026271656155586243,
        0.048235934227705,
        0.010959818959236145,
        -0.0026445977855473757,
        -0.04176612198352814,
        -0.008710317313671112,
        0.054440394043922424,
        0.004644856322556734,
        0.032411493360996246,
        -0.04593901336193085,
        -0.03613670542836189,
        0.01645263098180294,
        -0.06796644628047943,
        0.07706374675035477,
        0.04042379558086395,
        -0.038954153656959534,
        -0.018733195960521698,
        0.028855374082922935,
        -0.026642341166734695,
        0.052481334656476974,
        0.02185201086103916,
        0.026349451392889023,
        0.016732582822442055,
        -0.014750870876014233,
        0.013225269503891468,
        -0.0006641964428126812,
        -0.07180584967136383,
        0.04381232336163521,
        0.03672671690583229,
        -0.09900855273008347,
        0.016071384772658348,
        0.049310360103845596,
        -0.01098968181759119,
        -0.055759869515895844,
        -0.004428168758749962,
        0.014810538850724697,
        0.017947552725672722,
        0.09643843024969101,
        -0.015074814669787884,
        0.004623178858309984,
        -0.0290717501193285,
        -0.07327811419963837,
        0.019092151895165443,
        -0.06214163452386856,
        2.610922274470795e-05,
        0.03840656206011772,
        0.07714743912220001,
        -0.014770680107176304,
        -5.189368579294751e-08,
        0.03738732263445854,
        -0.04178405925631523,
        -0.0012936715502291918,
        0.030766043812036514,
        0.04431630298495293,
        -0.07271163165569305,
        -0.029407445341348648,
        -0.002634623786434531,
        0.11194097250699997,
        0.012197498232126236,
        -0.012021961621940136,
        -0.037294652312994,
        -0.04522594064474106,
        0.02134777419269085,
        -0.04036146402359009,
        0.03597697615623474,
        -0.07151563465595245,
        0.03539365902543068,
        -0.04797114059329033,
        0.03913477435708046,
        -0.012132072821259499,
        0.1001618355512619,
        0.02543923631310463,
        -0.06841515004634857,
        0.0015713496832177043,
        0.0026313671842217445,
        -0.06764208525419235,
        0.03375617414712906,
        0.124225914478302,
        -0.04817202687263489,
        -0.07818359136581421,
        -0.010112819261848927,
        0.06490718573331833,
        0.007921614684164524,
        0.025985807180404663,
        -0.04067855328321457,
        -0.05209058150649071,
        0.057547446340322495,
        0.04225696623325348,
        -0.03837410733103752,
        0.06401068717241287,
        -0.02356969751417637,
        -0.07378100603818893,
        0.07273191213607788,
        0.09424972534179688,
        -0.03345223143696785,
        -0.0021102179307490587,
        -0.07503703981637955,
        -0.00969594344496727,
        -0.046152953058481216,
        -0.04244120046496391,
        -0.013129997998476028,
        -0.0242169089615345,
        0.033493757247924805,
        0.052415091544389725,
        -0.022490426898002625,
        0.02637152560055256,
        0.06989637762308121,
        -0.012241224758327007,
        0.09467010200023651,
        0.024642134085297585,
        -0.12212654948234558,
        -0.08325513452291489,
        0.12258057296276093
    ]
}