{
    "id": "yOVrnymvb60",
    "title": "Inside the All Digital Xbox One",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-04-16T21:11:22Z",
    "video_url": "https://www.youtube.com/watch?v=yOVrnymvb60",
    "category": "Science & Technology",
    "tags": [
        "xbox one",
        "xbox one s all digital",
        "xbox one all digital edition",
        "xbox one s all digital edition",
        "xbox one digital",
        "all digital xbox",
        "xbox",
        "xbox one s",
        "xbox one sad",
        "all digital edition",
        "disc less xbox",
        "microsoft",
        "game console",
        "console",
        "gaming",
        "unboxing",
        "tech",
        "xbox 2019",
        "this is",
        "austin evans"
    ],
    "views": 1263593,
    "likes": 29413,
    "comments_count": 4402,
    "description": "The Xbox One S All Digital Edition is the first discless Xbox. The (currently) cheaper Xbox One S on Amazon:  Our teardown of the original Xbox One S:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/battlefieldxbox",
        "https://www.youtube.com/watch?v=Bd5cRYKRln8",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. It's always an exciting day when our friends at Microsoft drop off a brand new console and this, well this is a a technically all new console. This is the Xbox One S All Digital version. Sadly they didn't go with my title of the Xbox 1D but as you can see here, this Xbox has exactly zero disc drives of any kind. It's actually all over the box, I mean, they've got it, disc-free gaming, they have a little icon here. I mean, even when you go to open it up there's a piece of tape saying disc-free game play, aka please don't buy this and return it to the store when you realize that you can't put your discs in it. Now without a disc drive you cannot do any physical games on the Xbox One S. You are going to need to rely on downloading them which to be fair I think a lot of people do these days. I know ever since the Xbox One and the PS4 came out, I pretty much entirely switched over to buying them digitally. Now there was the PSP Go, what, ten years ago now? Which was a similar concept but that was a little bit too far ahead of it's time. I think these days a lot more people are interested in the idea of just downloading your games. It's much easier to move across different platforms and especially a lot of the games these days on Xbox also do work on the Windows PC side of things as long as you don't mind dealing with the, uh, I don't want to say games for Windows. The Microsoft Store? What do they call it? And I actually will mention that even though this obviously looks very, very similar to the One S, it is not replacing it in the line. You will continue to be able to buy the One S, the One X, and you will also have the One S Digital Edition. All Digital Edition. Well, the very first thing I can notice, Its lighter which I guess makes sense that there's not an Ultra HD blu-ray player inside. And here is the console itself. Now it looks very similar, except it [Laughing] It looks so weird. Like, it's just, it's the exact same thing. In fact, let me actually grab a One S. I mean, if you put these two side by side it is completely identical looking. So I mean all of the vents are the same on the side, you've got the same top vent, I mean there's really no difference in any way except that they just changed out that piece of plastic here. Now one perk to buying the all digital version is that you actually get some pretty decent included games. So there's a copy of Forza Horizon 3, we have Sea of Thieves and we also have Minecraft. Now this is all great, but the One S All Digital Edition does not exist in a vacuum because it is being sold alongside the One S, it has to compete with that. So the real problem here is price. The all digital edition costs 250 dollars MSRP which sounds good considering that that is 50 dollars less than the standard version of the One S. However, it does not take much searching to find a lot of One S's well below that on Amazon. For example, there's one that is 220, even 230 with a game that's presold like Battlefield 1 included. That, that's a little bit of a problem. By the way, if you want these game codes, feel free to go for it, although you better be fast. If you can buy a One S for the same price or cheaper than the all digital version, then do it. I mean it's literally the exact same thing except it has an ultra HD blu-ray drive. Now there's a lot of people I think which will be very happy to use the all digital version, right? I mean, if you're not using discs, if you're not watching blu-rays and stuff then there really is no advantage to having that extra 50 dollar disc drive included. But the price is really where it comes down, right? I mean, if you don't get this at a cheaper price than the One S, it is a completely ridiculous thing to ever purchase. So if you're buying an Xbox One today, these are your three options. So starting out with a 250 dollar price tag is the Xbox One S All Digital. Now just like with the One S, which comes in at 300 dollars, it does support 4k video even though the gaming side of things is definitely a little more on the 1080p side of the resolution, but besides the blu-ray drive which is of course missing on the all digital version, these are completely identical. Ports, power, performance, all that kind of stuff. Now, if you step up over to the Xbox One X, it also does have the ultra HD blu-ray drive, 4k support and all that kind of thing, but the main difference here is that this is a much more powerful console. One X is able to play most games at a very easy 4k and especially with games such as Red Dead Redemption, when you put these consoles side by side, the One X looks so, so much better. But, then again it's like double the price, so. So from what I've been told, the internals of the all digital version are essentially the same as the One S, mostly to keep costs down. But that doesn't mean that I don't want to actually see this for myself. Now you may recall a video we did when the One S first came out where we took a little peek on the inside. Now, I'm assuming it should be a pretty similar experience. Oh wow, its so imbalanced. Wow! Like all of the weight is definitely here, like this That's got to be hollow. So after removing our warranty's void sticker and working out this little plastic piece on bottom, we should be able to get it out. There we go. The same part that I got like freaked out about last time. There we go. So after moving a bunch of screws, I think the case should just come away now. Hey Okay, alright. So that's enough pieces of Xbox for one day. Well I guess, here's the first difference. There's obviously a new metal piece here to cover up where the disc drive used to be. Something tells me Microsoft, they didn't want you to be looking at this. Like, no, no, no. We're, uh, we're not hiding anything here. Alright, now with that, yep, okay. Well that [Laughing] I wonder where the disc drive used to be? [Laughing] Just a little bracket here and that's literally it. So we still see the same one terabyte hard drive from before. You have the internal power supply as well as the fan. But where there used to be a disc drive, no disc drive. So we have fan number one, power supply number three, hard drive number four, and disc drive number two. Um, yeah. So to be fair I don't really want to be that mean on Microsoft. There not trying to hide what they're doing here at all. This is a One S that they removed the disc drive for, and they've essentially passed that savings on to you. Now sure, would I have liked to have seen a different form factor? I mean, with this kind of empty space they could have very easily made this something, you know, even if you just rotate the hard drive, I mean, it would've been at least a little bit smaller. But realistically, I mean, what they're doing here is not trying to make the smallest Xbox they can. What they're trying to do is make the cheapest one possible. When you consider that by removing that Ultra HD blu-ray drive and you're losing 50 dollars from the price, that kind of adds up, I mean, they're pretty much just passing it right on to you. Interesting, so there is an additional SATA port here on the board, which makes sense because they didn't change it. I wonder if you could install your own blu-ray drive? I mean, theoretically, I would think it would work. Oh, you could try to install another hard drive. I mean, there's definitely room for it. You would have to come up with your own mount but, theoretically, I mean, with that SATA port. But, do you know what, do you think this is actually gonna recognize a second internal hard drive? I don't think it will. Okay, so actually I don't think a second hard drive will work. So you do have the SATA cable and you have the power, but it's a proprietary pent out which means that not only can you not use another One S cable, you'd essentially have to make your own. Now the software, nothing seems to be all that different but I'm curious, can I actually install the blue-ray player? Oh I can actually do it. It says its qued up. What happens if we open up the blue-ray player? Oh Okay, alright. Well you know, its worth the shot right? Like I said before, you should expect the exact same level of performance from the One S as you get on the all digital edition. That means that most games are going running between 720 and 1080. Its not going to look as nice as the One S but you do get the same advantages of being able to play like 4k netflix and what not. Or and you also can die in Compet, that's still possible. [Laughing] The Xbox One as all digital version is an interesting console. There's a big part of me that wishes that this was a least a little bit of a different form factor that they took advantage of the lack of disc space to kind of shrink it. But I understand what they were going for in here. This is not a slim version of the console, this is not a replacement for the One S. This is very simply a cheaper version of the Xbox One that already have. If this is the same kind of price that the xbox one has and it lands up being 200 dollars or less, I think its a really compelling deal. However if its 250 dollars and the One S is cheaper than that, yeah good luck with that.",
    "transcript_keywords": [
        "Xbox",
        "Digital version",
        "drive",
        "Digital",
        "disc drive",
        "Digital Edition",
        "hard drive",
        "bluray drive",
        "version",
        "disc",
        "games",
        "side",
        "price",
        "Austin",
        "Edition",
        "kind",
        "bluray",
        "dollars",
        "console",
        "Microsoft"
    ],
    "transcript_entity_values": [
        "ten years ago",
        "three",
        "250 dollars",
        "Digital",
        "one day",
        "220",
        "first",
        "1080",
        "50 dollars",
        "Minecraft",
        "Amazon",
        "Compet",
        "number four",
        "SATA",
        "Austin",
        "Ultra HD blu-ray",
        "Red Dead Redemption",
        "250 dollar",
        "the One S. However",
        "two",
        "PS4",
        "Xbox One",
        "Windows",
        "50 dollar",
        "Forza Horizon 3",
        "Xbox",
        "these days",
        "one",
        "second",
        "Xbox One X",
        "230",
        "Battlefield 1",
        "an exciting day",
        "netflix",
        "Microsoft",
        "200 dollars",
        "between 720",
        "xbox",
        "Ports",
        "SATA",
        "zero",
        "4k",
        "The Microsoft Store",
        "One",
        "today",
        "300 dollars",
        "250 dollars MSRP"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY"
    ],
    "vector": [
        0.0337807722389698,
        -0.06593005359172821,
        0.03594932705163956,
        -0.059121761471033096,
        0.04433189705014229,
        -0.011943151243031025,
        -0.0034237441141158342,
        0.0011495031649246812,
        0.09669095277786255,
        0.1135169044137001,
        -0.04219896346330643,
        0.07504682242870331,
        0.07134813815355301,
        -0.03407065570354462,
        -0.030304301530122757,
        -0.030512772500514984,
        -0.0015905811451375484,
        -0.06677671521902084,
        -0.0008489342872053385,
        0.019619369879364967,
        0.0007342817261815071,
        0.03307336941361427,
        0.002813813742250204,
        0.020749248564243317,
        -0.05999331921339035,
        -0.05593403801321983,
        -0.0471712164580822,
        -0.046793822199106216,
        -0.004186959937214851,
        -0.028815532103180885,
        0.015652170404791832,
        0.022597849369049072,
        -0.009404332377016544,
        0.06669632345438004,
        0.0673370212316513,
        -0.12034876644611359,
        0.11493735760450363,
        0.06280815601348877,
        -0.09600548446178436,
        -0.02267729863524437,
        0.02373005822300911,
        0.018470894545316696,
        0.024008184671401978,
        0.0028607335407286882,
        0.0029978728853166103,
        0.024724392220377922,
        -0.056138765066862106,
        0.013622669503092766,
        0.006800817791372538,
        0.03864634409546852,
        0.057421255856752396,
        -0.029849188402295113,
        0.0558793805539608,
        0.040775250643491745,
        0.03102174773812294,
        0.029477396979928017,
        0.0028156207408756018,
        0.07643993943929672,
        -0.08168555796146393,
        0.02409912645816803,
        -0.016311652958393097,
        -0.13804101943969727,
        0.056536849588155746,
        -0.0255212914198637,
        0.03281622752547264,
        -0.009003601968288422,
        0.014904654584825039,
        -0.025963159278035164,
        -0.03977629914879799,
        -0.029869789257645607,
        -0.07249289005994797,
        -0.027361348271369934,
        0.012460751459002495,
        0.07927611470222473,
        0.010021213442087173,
        -0.05342987924814224,
        0.03537504002451897,
        -0.004025771748274565,
        0.04845475032925606,
        0.05853690579533577,
        -0.0485289990901947,
        0.00013447926903609186,
        -0.004073364194482565,
        -0.0471201054751873,
        -0.07570730149745941,
        0.09321457147598267,
        0.01403436902910471,
        0.015192944556474686,
        0.06493043154478073,
        -0.0306189376860857,
        0.0055089895613491535,
        0.0023209708742797375,
        0.09445469081401825,
        0.0581180602312088,
        -0.0669395700097084,
        -0.05725474655628204,
        0.04937185347080231,
        0.003685295581817627,
        -0.035385385155677795,
        -0.0185942891985178,
        -0.028018152341246605,
        0.026618916541337967,
        0.04376014322042465,
        -0.014399923384189606,
        -0.06472405791282654,
        -0.08694633096456528,
        0.006675723008811474,
        0.010488376952707767,
        -0.063428595662117,
        -0.017951861023902893,
        0.0031419266015291214,
        -0.029405737295746803,
        -0.03870344161987305,
        0.03757660463452339,
        -0.002149682492017746,
        -0.024754760786890984,
        0.004112712107598782,
        0.03540213033556938,
        -0.005250413436442614,
        -0.0755334347486496,
        0.036346811801195145,
        -0.09429390728473663,
        0.033982157707214355,
        -0.02052532136440277,
        0.011699579656124115,
        -0.08681434392929077,
        0.07410941272974014,
        2.277062229263346e-33,
        0.02360949106514454,
        0.04605939984321594,
        -0.0019665153231471777,
        -0.056888967752456665,
        -0.04112902283668518,
        -0.030830634757876396,
        0.0559142641723156,
        0.10264688730239868,
        0.014804365113377571,
        0.04378493130207062,
        0.00833897478878498,
        0.08406886458396912,
        -0.0825437530875206,
        0.03301384672522545,
        0.04075399041175842,
        0.029647693037986755,
        0.02354704961180687,
        -0.01963852345943451,
        0.010031422600150108,
        -0.04827011004090309,
        -0.02546405978500843,
        0.08943751454353333,
        -0.004101973958313465,
        -0.07667828351259232,
        -0.005502340383827686,
        -0.045589692890644073,
        -0.04263763502240181,
        -0.06968121230602264,
        0.040035080164670944,
        0.017233354970812798,
        -0.15938442945480347,
        0.0036428188905119896,
        -0.018788831308484077,
        -0.052775174379348755,
        0.0846128985285759,
        0.03424110263586044,
        -0.06374580413103104,
        0.029000286012887955,
        -0.019438225775957108,
        0.04379497095942497,
        -0.024184565991163254,
        -0.09309423714876175,
        -0.0037470406387001276,
        -0.06683368235826492,
        -0.0024140544701367617,
        0.0063530378974974155,
        0.025524413213133812,
        -0.0007798475562594831,
        -0.0350821316242218,
        0.10140429437160492,
        -0.007209219969809055,
        0.09289456158876419,
        -0.026210961863398552,
        -0.01640276238322258,
        -0.02695441246032715,
        -0.01894325390458107,
        0.03142432123422623,
        -0.0557132251560688,
        0.0010009086690843105,
        -0.010014831088483334,
        0.012823257595300674,
        -0.09916064143180847,
        0.026558473706245422,
        -0.04284108057618141,
        -0.07097949832677841,
        0.05228898301720619,
        0.025620633736252785,
        -0.08354019373655319,
        0.025026077404618263,
        -0.029874371364712715,
        -0.004632950760424137,
        0.029832858592271805,
        -0.06796444207429886,
        -0.06475479900836945,
        0.11736506968736649,
        0.0024150258395820856,
        0.00508433673530817,
        -0.00208663335070014,
        0.029707046225667,
        0.03408975154161453,
        -0.03206070140004158,
        -0.014076018705964088,
        -0.10583828389644623,
        0.10348185896873474,
        -0.011980547569692135,
        0.1145891472697258,
        0.05856713280081749,
        0.0608997642993927,
        0.007011858280748129,
        -0.13217958807945251,
        -0.052904438227415085,
        -0.026503080502152443,
        -0.010775168426334858,
        0.02167472057044506,
        0.11469053477048874,
        -2.3327378661511128e-33,
        -0.06979993730783463,
        -0.08139561116695404,
        -0.00699460506439209,
        -0.026435261592268944,
        -0.029346898198127747,
        0.02434549480676651,
        -0.030071750283241272,
        0.07084252685308456,
        0.037179313600063324,
        -0.02756997011601925,
        -0.02607562020421028,
        0.0015542198671028018,
        -0.10850664973258972,
        0.046866025775671005,
        -0.06385825574398041,
        -0.0007962871459312737,
        -0.024313045665621758,
        -0.016173597425222397,
        0.04583980515599251,
        0.031003069132566452,
        -0.002054021693766117,
        0.011608841829001904,
        -0.023520678281784058,
        0.023878835141658783,
        -0.030706295743584633,
        0.02835749089717865,
        0.042505938559770584,
        0.06480006128549576,
        0.062439728528261185,
        0.03511837497353554,
        0.00678987568244338,
        0.055144745856523514,
        0.07445678114891052,
        -0.031846676021814346,
        -0.028586817905306816,
        -0.00641511520370841,
        0.024759802967309952,
        -0.0644783154129982,
        -0.015041453763842583,
        0.005245213862508535,
        -0.04042021185159683,
        -0.015717487782239914,
        -0.013525009155273438,
        -0.018359825015068054,
        0.011080645024776459,
        -0.008661450818181038,
        0.02688855677843094,
        -0.009269858710467815,
        0.06966140121221542,
        0.06712248176336288,
        -0.004558522254228592,
        0.0906536877155304,
        0.05986829102039337,
        -0.007492264732718468,
        0.019012611359357834,
        -0.059522949159145355,
        -0.036640189588069916,
        0.08959027379751205,
        -0.019404789432883263,
        0.021938728168606758,
        -0.01569329760968685,
        0.0824417844414711,
        -0.06789368391036987,
        0.05123298615217209,
        -0.0193050317466259,
        -0.03444182500243187,
        0.1730634719133377,
        0.025131016969680786,
        -0.06701237708330154,
        0.021819308400154114,
        -0.02818799763917923,
        0.02341163158416748,
        0.012427011504769325,
        -0.15175852179527283,
        0.03310919553041458,
        -0.052502140402793884,
        -0.12051397562026978,
        -0.03696144372224808,
        0.02118653804063797,
        -0.006014399696141481,
        -0.05697280541062355,
        0.026000402867794037,
        0.029124274849891663,
        0.03740151971578598,
        0.08636884391307831,
        -0.06569308787584305,
        0.09657131880521774,
        -0.04925331845879555,
        -0.0763978436589241,
        -0.010218339040875435,
        0.01886453852057457,
        0.03832206875085831,
        -0.09045475721359253,
        0.0769459679722786,
        0.002695521805435419,
        -5.246386791668556e-08,
        0.05096486583352089,
        -0.008047087118029594,
        0.016921598464250565,
        -0.001236388343386352,
        0.030549030750989914,
        -0.01762472093105316,
        -0.02389947511255741,
        0.08650130033493042,
        -0.019568823277950287,
        -0.034185316413640976,
        0.04560474678874016,
        5.1016009820159525e-05,
        -0.06095701828598976,
        -0.002790910191833973,
        0.038531381636857986,
        0.1073186919093132,
        -0.07672880589962006,
        -0.013601532205939293,
        -0.035916827619075775,
        0.045107148587703705,
        0.009658792987465858,
        -0.008378284983336926,
        0.048884641379117966,
        -0.15999796986579895,
        0.055075813084840775,
        -0.0005706659867428243,
        -0.04883166402578354,
        -0.02563563920557499,
        0.07381004095077515,
        0.0046544806100428104,
        -0.004656651522964239,
        -0.008942954242229462,
        0.06593674421310425,
        0.02892560325562954,
        0.03135111927986145,
        -0.03797919303178787,
        0.04979369789361954,
        0.08998345583677292,
        0.003657485591247678,
        -0.03535237908363342,
        -0.008782542310655117,
        -0.035654716193675995,
        -0.06260967254638672,
        0.005145294591784477,
        -0.0002661421603988856,
        0.02236044965684414,
        -0.06267856061458588,
        -0.042722102254629135,
        -0.06212401017546654,
        0.03257272019982338,
        -0.02317761443555355,
        0.026804961264133453,
        -0.0014533710200339556,
        0.010376924648880959,
        0.014237434603273869,
        0.002537423511967063,
        0.04187893494963646,
        0.04305525869131088,
        0.009472246281802654,
        0.13347885012626648,
        0.024014953523874283,
        -0.03599059581756592,
        0.012083562090992928,
        0.045318927615880966
    ]
}