{
    "id": "YpXsZaI8idc",
    "title": "I WANT to like it... - ChopValue Revive XL",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-04-08T19:31:39Z",
    "video_url": "https://www.youtube.com/watch?v=YpXsZaI8idc",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "desk",
        "chopsticks",
        "sustainability",
        "renewable",
        "recycle",
        "restaurant",
        "gaming",
        "wfh",
        "office"
    ],
    "views": 324386,
    "likes": 11228,
    "comments_count": 700,
    "description": "Get 69% off any of XSplits video tools. Use code LINUS at   Gaming desk are great, but lots of the time they're booooring... until now! ChopValue is here with their Revive XL gaming sit/stand desk that's made with recycled chopsticks from local restaurants. Is this Colton's new favourite desk or wood he rather stick to something more traditional?  Check out ChopValue and their products here:  ChopValue reached out to us after watching the video and provided a 20% off code for our viewers, just use code \"LINUS20\" at checkout and the discount should apply!  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Sick drum solo 0:31 Unboxing and assembly 3:50 Colton's strugglin' 5:32 Sponsor - XSplit 6:07 Now that's a lotta damage 6:41 Calibration and testing lift strength 8:12 Linus shares his thoughts (and breaks the desk?) 9:45 Cable tray installation and accessories 11:12 Overall thoughts 11:43 Outro",
    "description_links": [
        "https://lmg.gg/XSplit",
        "https://lmg.gg/CuDc6",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- [Bell] Cut! (chopsticks drum) - We're back with another desk building video, this time we're looking at the ChopValue Revive XL which is a desk made from, you guessed it, chopsticks. (chopstick cracks) Oh. (snorts) - [Bell] Oh no. - Hopefully the desk is built from better chopsticks than this. (grunts) You know, I always kind of wondered what happened when I recycled my chopsticks and now I know. Apparently, ChopValue has recycled over 90 million chopsticks and they work with over 1,500 partners, so that's pretty cool. I like sustainability. Whoa, signatures? \"Thank you for giving thousands \"of chopsticks a second life.\" Oh that's really cool. I will say already with the unboxing experience that I appreciate that they haven't added in a bunch of like useless plastics. I mean, it'd be kind of weird if they did that based on what they're trying to do, but I'm glad that they didn't. So (grunts) got a little packet here. It says, \"the world's most sustainable gaming desk\". Apparently ChopValue's been around since 2016, I believe and I know they have a partnership with Fnatic. I've been told that this is a special version that they did for us, whoa, this is sick. There's my chopstick from Edo Sushi in Chilliwack, British Columbia. (cardboard crunches) Whoa. You gotta do the... (knocks) You gotta do the sound test with your desk, you know? That sounds hardy, that sounds sustainable. They actually did some custom engraving on this. They got the Short Circuit logo, number zero-zero-seven, triple-O seven, out of a thousand. Apparently this desk is made out of 9,500 chopsticks. I really like the aesthetic so far, sustainability aside. I like the look of the desk, with kind of the natural chopstick look. Move this over to the side here and get cracking on the rest of this stuff. Well... (laughs) Lots of pictures, which I like, it's a little daunting when I first look at it, but that's okay. (box scrapes) Holy crap, that's heavy. These are not made out of chopsticks, believe it or not. Should I be assembling this on top of the desk face? Probably not, but here we are. Oh perfect, they have everything sectioned out, clearly labeled which is really nice. I poked a hole in one of these. We need 12 A-screws, we only have nine. The bag was punctured. We checked the box and we're unable to find the three missing screws that we have so we're gonna have to just get a little bit creative here. This is gonna be really difficult to build with nine screws. I wonder what they ate with the chopsticks? Yo, a peel? Get ready. (plastic tears) Can we celebrate step three being complete? Woo, let's go, only seven more steps. Do you know why I do these desk videos and the chair videos? It's good exercise, you know, I'm building. I'm building things to improve the world, to have people sit more and be productive at their desk. Guys what are those feet made out of? Feels like plastic. \"Attach rubber pad and install the tabletop.\" Okay, what rubber pad? Apparently these are supposed to go on the bottom of this. I just have to use the Allen key to like poke the rubber gasket here to fit through it. Kind of a pain in the butt, but I also understand why they would want this if it's directly connected to the wood. I just wish the rubber gaskets went in a little bit easier instead of me having to use the Allen key to like bend them to get in the inserts, but that's okay. Would I recommend you have two people to build this? Maybe, it might be easier. For these next set of screws we are gonna need our handy-dandy LTT store screwdriver. So six screws on either side. This is good. Step seven, \"connect all cables to the control box.\" Peel! (plastic rips) Much less graceful peel, oh my god. Worst peel of the year, confirmed? Am I missing something, no, there's no way. So just skips over installing the control box. \"Connect all cables to control box.\" That's cool, how do I connect the control box to the table? The picture's also wrong. But then this says M2s on the other side. Okay, so this is just wrong, straight up, but that's okay. It's not, it's a very small thing, it's just I don't wanna do this wrong, you know? What screw do I use for this? Where does this screw into? I don't see any pilot holes anywhere, am I blind? I've got two screws that I thought were extra screws both different sizes, right? It's going in! - [Bell] Oh, nice. - Imagine if it cracked the whole thing. ChopValue, I'm so sorry for defacing your desk but you left me no choice. I don't know if this is gonna work. We might need a Command strip. Now I'm even more confused. Does this clip into something? But there's no... What? This is where I put a disclaimer, do not try this at home. I don't know if that's even gonna stay, brother. One last problem that I see, which is this cable doesn't reach to the control box, this cable doesn't reach to the control box. They only gave me one extension. Holy (squeak) boys. (laughs) Okay, I'm even more angry than I was. - [Bell] Why? - I found it, it mounts right here! It slides in obviously. Unfortunately, it just didn't say that, so I didn't know. And the way it's wired makes no sense, it doesn't match. I'm so mad at this. It's time to flip this thing over. Help, time to flip this desk, right after we tell you about our sponsor. (laughs) - How are we gonna flip it? - XSplit! XSplit is a cutting edge software company that provides advanced broadcasting and video production tools for creators, gamers, and businesses. XSplit offers a range of products, like Broadcaster and VCam. Broadcaster allows users to capture, produce, and stream high quality video content to popular platforms such as Twitch and YouTube. VCam allows users to remove, replace, or blur their webcam background during a video call, livestream, or recording, creating a more professional-looking and distraction-free video. Check out XSplit today at lmg.gg/xsplit and use code LINUS for 69 percent off your subscription. Nice! First thing we immediately noticed once we did the sponsor read here and flipped this thing over is how badly this got scratched. Makes sense because we were... We? I was trampling all over it while we were building it but that kinda sucks 'cause I got scratched it (squeak). So, sorry about that. The rest of the desk face is pretty good, a little bit of schmutz from the floor. A few little scratches actually, if you could come check this out, I definitely scratched it right where they did the engraving. It's supposed to be harder than maple but not harder than my weight on the hard floor. Well, we just plugged this thing in, we're gonna try controlling it with the EFFYDESK controller that we've got here and up we go. Oh, uh-oh. Oh no! (laughs) \"Before plugging in the table make sure there is no object \"above or beneath the desk within it's range of movement, \"as it may result in physical damage.\" I hope that doesn't mean me when I laid on the desk briefly there. \"Please press the down button and hold \"for 10 to 15 seconds until the table stutters and beeps.\" One moment, please. It's quiet, which is nice. A lot quieter than the desk that I have at home. You can change the controller to read centimeters to inches, which is really nice. \"If 'hot' appears on the display, \"please unplug and re-plug and let it cool off \"for a couple minutes before proceeding.\" I have to worry about my desk getting hot? You've got four slots for memory, it's very simple, you just get to your adjusted height, click M, and then pick on whatever profile that you want. You can adjust it, you know, adjust it down or up or whatever, and then I click on it again once and then it'll adjust up, back up, to that height. ChopValue's website says the weight limit for the desk is 165 pounds, I am exactly 163 pounds. Let's go! Am I going up? Let's go, to the moon! So all of the components, while the instructions are really annoying, all the components felt very premium. I will say I'm a little disappointed in the tabletop but again, I don't know, they didn't say it was supposed to be the most durable thing but they said more durable than maple. I don't know how durable maple is but it got scratched up by the floor. If you're building one of these desks I suggest laying down a cloth to protect it and then just try to limit the amount of work that you're doing on top of it so that it doesn't scratch. How much do you think a desk like this would cost? How much would you pay for something like this, without knowing a ton about it? - I don't know, like a grand? - Like a grand? Okay, how much is this desk? - 1,300 US. - Can't you get these legs in 150, 200 bucks these days? - Well, we could probably check that. We could probably confirm that. - Yeah, you can get these little legs for like 300 Canadian dollars. And I think for my butcher block top, I paid like 100 bucks. It looks really cool, I like the look. Harder than maple is just another way of saying that you covered it in glue, though. Like, 'cause chopsticks are not made of maple. - I started this video by breaking a chopstick. Some chopsticks over there for demonstration. - Yeah, but you could break a maple chopstick too. So that's not really impressive, I mean, most people could, I don't know if you could break those chopsticks. - [Crew] Oh! - Calling me weak, c'mon. - I don't know, you've seen the Q2 sales figures yet? - Oh, unbelievable! This video is filled with bangers. - It's cool. - It's a good cause, it looks cool. - Yeah, it looks really cool. - Right? - I want to like it, there, how about that? - (laughs) I want to like it. There's your title. - [Andrew] Okay, I'm gonna cut. - Whoa, okay, hold on, we got issues. It's hot, I broke it, I blame Linus. Linus comes in, he breaks everything. So what the instructions said was to let it cool down. I'm glad that it says this rather than like setting people's houses on fire like whatever was reported at the Secretlab desk. (laughs) I appreciate it. Along with the desk, we've got a few accessories, which are extra on top of the price of paying for the desk itself. We've got ChopValue coasters, we've got ChopValue accessories. And then I do still need to put on the cable tray. The cable tray is included with the desk, so let's start with that. It's a little baggy here. Is this just more screws? Why would they, why? I mean this is cute but all the other ones came in a plastic bag and then this one... That's what those two pilot holes were for, brother! It makes more sense now. Time to dig into the accessories that ChopValue sent to us. Oh, ChopValue coasters. Per coaster is 75 recycled chopsticks. Each coaster set is 22 US dollars. Only thing I don't like about them is they do not stick at all, I wish there was some sort of feet. I don't know how they'd be able to make that sustainably with chopsticks, but it just slides everywhere. Headset stand, this is pretty cool. Nice and sturdy, 87 recycled chopsticks. My guess is that this would cost 30 US dollars, 29.99. 38 US dollars, okay. I actually am taking that. Is this a wrist rest? This is like Christmas. I actually didn't know what all the accessories were before filming this video. Oh, wrist rest, 287 chopsticks. Again, I wish there were feet. I can already tell this is gonna slide around like mad. (metal clangs) (wood clanks) Overall, I really love what ChopValue is trying to do. It's obvious that they care a lot about sustainability and they put a lot of work into creating these desktops. If you go to chopvalue.com, you can actually watch a video, it goes over kind of their whole process. And for this desk that we have here, it was actually manufactured and packed locally here in Vancouver, Canada, so that's really cool. I love the accessories. Like Linus said, I really want to love this desk. The price point a little high for me but again, if you care about sustainability, it's something that you're interested in, you should definitely check it out, link below. Thank you very much for watching. If you wanna check out some of the other videos that I've done on desks, you can check out the Secretlab Magnus Pro that me and Dennis did. It was kind of a chaotic video but cool desk, really cool gamer desk. Or any of my chair videos.",
    "transcript_keywords": [
        "desk",
        "chopsticks",
        "cool",
        "video",
        "ChopValue",
        "control box",
        "thing",
        "screws",
        "kind",
        "box",
        "chopstick",
        "control",
        "nice",
        "maple",
        "Check",
        "made",
        "videos",
        "ChopValue Revive",
        "building",
        "desk building video"
    ],
    "transcript_entity_values": [
        "163 pounds",
        "seven",
        "30 US dollars",
        "Yo",
        "three",
        "a ton",
        "M2s",
        "One",
        "one",
        "British Columbia",
        "US",
        "287",
        "Broadcaster and VCam",
        "1,500",
        "webcam",
        "22 US dollars",
        "the year",
        "165 pounds",
        "38 US dollars",
        "Fnatic",
        "Vancouver",
        "90 million",
        "the Short Circuit",
        "nine",
        "second",
        "150",
        "ChopValue",
        "LTT",
        "ChopValue",
        "EFFYDESK",
        "Dennis",
        "75",
        "Allen",
        "9,500",
        "10 to 15 seconds",
        "Q2",
        "100 bucks",
        "thousands",
        "first",
        "these days",
        "two",
        "29.99",
        "Canada",
        "ChopValue Revive XL",
        "Peel",
        "four",
        "300 Canadian dollars",
        "87",
        "a thousand",
        "only seven",
        "69 percent",
        "schmutz",
        "the Secretlab Magnus Pro",
        "200 bucks",
        "a couple minutes",
        "Twitch",
        "12",
        "Linus",
        "Chilliwack",
        "six",
        "2016",
        "YouTube",
        "LINUS",
        "First",
        "Secretlab",
        "Christmas",
        "today",
        "Edo Sushi"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "FAC",
        "MONEY",
        "DATE",
        "QUANTITY",
        "MONEY",
        "GPE",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "MONEY",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.06014535203576088,
        -0.02424609661102295,
        -0.0097261443734169,
        -0.11311538517475128,
        0.02456345222890377,
        0.08065807819366455,
        0.019041504710912704,
        0.015467696823179722,
        0.013493552803993225,
        0.01924985647201538,
        0.020615486428141594,
        0.03370682895183563,
        -0.00841422751545906,
        -0.06364261358976364,
        0.019793422892689705,
        -0.05472378060221672,
        0.07983701676130295,
        -0.03278275206685066,
        -0.06641346961259842,
        0.03494293615221977,
        0.051672741770744324,
        -0.08984990417957306,
        -0.04624331369996071,
        -0.0005179469590075314,
        0.05050574243068695,
        -0.01014137826859951,
        -0.009226317517459393,
        0.01660001277923584,
        0.0993586853146553,
        -0.032730963081121445,
        0.071749746799469,
        0.0683666244149208,
        0.030151333659887314,
        -0.012960853055119514,
        0.04172452539205551,
        -0.02667798474431038,
        -0.056578293442726135,
        -0.07449895888566971,
        -0.08589590340852737,
        -0.014269945211708546,
        -0.052565645426511765,
        -0.06313125044107437,
        -0.018055999651551247,
        -0.01271654199808836,
        0.04146646708250046,
        -0.04561177268624306,
        -0.00570139242336154,
        -0.04818879812955856,
        0.044949814677238464,
        0.08143900334835052,
        0.05776013061404228,
        -0.03848119080066681,
        0.04661620035767555,
        -0.05382448062300682,
        -0.05598217248916626,
        0.03421642258763313,
        -0.05963488295674324,
        -0.07703416049480438,
        0.0169210322201252,
        -0.05101604387164116,
        0.03678806126117706,
        -0.05259251222014427,
        0.016495468094944954,
        0.09665975719690323,
        -0.0666760727763176,
        0.027700940147042274,
        -0.08773606270551682,
        0.0401664599776268,
        -0.09116081893444061,
        -0.00808298122137785,
        -0.017173919826745987,
        0.0063022724352777,
        0.04652002826333046,
        0.08576647937297821,
        0.0010459799086675048,
        -0.021753309294581413,
        0.036531511694192886,
        -0.11831660568714142,
        0.016483888030052185,
        -0.0003307698934804648,
        -0.0005763815133832395,
        -0.04002358391880989,
        -0.04425409436225891,
        0.038346003741025925,
        0.0037912053521722555,
        0.0015290933661162853,
        0.035039838403463364,
        0.029024172574281693,
        0.008733320981264114,
        -0.028922034427523613,
        0.02089116722345352,
        0.08620262145996094,
        0.0722677931189537,
        0.03032752498984337,
        -0.1274915337562561,
        0.01575532555580139,
        -0.015354044735431671,
        -0.015073473565280437,
        -0.04578210413455963,
        0.09324176609516144,
        -0.05478361248970032,
        0.07681360840797424,
        0.03878527879714966,
        -0.07787702977657318,
        -0.05471985414624214,
        -0.07468616962432861,
        -0.00855640135705471,
        0.060392897576093674,
        0.025480972602963448,
        -0.033826686441898346,
        -0.0948057547211647,
        0.028974318876862526,
        -0.05796167999505997,
        -0.005156658589839935,
        -0.08657193928956985,
        0.05091666430234909,
        0.022492732852697372,
        -0.08107361942529678,
        0.04935898259282112,
        -0.11309540271759033,
        0.05662224814295769,
        0.022528748959302902,
        -0.0002418015501461923,
        0.01907869055867195,
        -0.02679271437227726,
        -0.012385317124426365,
        0.03528517484664917,
        4.3157815912959496e-33,
        -0.09717828035354614,
        0.029478266835212708,
        -0.09406439960002899,
        -0.06922727078199387,
        0.09240347146987915,
        -0.042344532907009125,
        0.018274812027812004,
        0.0710522010922432,
        -0.03230028599500656,
        0.09336113929748535,
        0.01664894074201584,
        0.004930152557790279,
        -0.03707939386367798,
        0.05890797823667526,
        0.03803706169128418,
        -0.0804816335439682,
        0.009201283566653728,
        0.018097033724188805,
        -0.04563358053565025,
        -0.014513140544295311,
        -0.042395059019327164,
        -0.01798177883028984,
        0.043482404202222824,
        0.025509502738714218,
        -0.004216828849166632,
        0.002629369730129838,
        0.001661133486777544,
        -0.004604376386851072,
        0.08120767772197723,
        0.02897420898079872,
        -0.03213539719581604,
        -0.014929288066923618,
        0.0015848971670493484,
        -0.05983328819274902,
        -0.05305992439389229,
        0.037024639546871185,
        -0.09936314821243286,
        -0.0753483772277832,
        0.03628280386328697,
        0.030765654519200325,
        -0.05191604420542717,
        0.05804559215903282,
        -0.05172188952565193,
        -0.07392530888319016,
        -0.002434541704133153,
        -0.011648887768387794,
        0.08117169141769409,
        0.01007094606757164,
        0.0768173485994339,
        -0.017212452366948128,
        -0.007256385404616594,
        0.06104206666350365,
        -0.011121787130832672,
        -0.005700457841157913,
        -0.0929415374994278,
        -0.1028260886669159,
        0.02039506658911705,
        0.007839661091566086,
        0.047207191586494446,
        -0.024771252647042274,
        0.006292115431278944,
        0.012163572013378143,
        0.011155704036355019,
        -0.03309423848986626,
        -0.08928405493497849,
        0.07636795938014984,
        0.031924355775117874,
        -0.031159106642007828,
        -0.052619874477386475,
        -0.06925938278436661,
        -0.02105714939534664,
        0.005489671137183905,
        -0.0024494733661413193,
        -0.04877680540084839,
        0.02134130522608757,
        0.009436757303774357,
        -0.05594070255756378,
        0.03772234544157982,
        0.051785048097372055,
        -0.07953964173793793,
        0.061878737062215805,
        -0.011281096376478672,
        0.0036504254676401615,
        0.0345555916428566,
        0.053405873477458954,
        0.016354680061340332,
        0.046907808631658554,
        -0.03645571693778038,
        -0.02538878284394741,
        0.009128469973802567,
        -0.1041860580444336,
        -0.05821521580219269,
        0.023672275245189667,
        0.007316991221159697,
        0.01738525554537773,
        -5.7910170833443353e-33,
        0.003902135184034705,
        0.009391368366777897,
        -0.08305472880601883,
        0.095488540828228,
        0.04896879568696022,
        0.063365638256073,
        -0.009223058819770813,
        -0.0280363317579031,
        0.03013608418405056,
        -0.047188255935907364,
        -0.020919853821396828,
        0.07083352655172348,
        -0.08609236776828766,
        0.008010397665202618,
        0.02248060144484043,
        -0.0584358274936676,
        0.029110711067914963,
        0.006812464911490679,
        -0.06876266747713089,
        -0.04805300012230873,
        0.09131500869989395,
        0.078926220536232,
        -0.04192770645022392,
        0.01581534743309021,
        0.007408265955746174,
        0.064776711165905,
        0.013760332018136978,
        0.0365646593272686,
        -0.04657396301627159,
        0.04863697290420532,
        -0.10199686139822006,
        -0.05956659093499184,
        -0.004357485566288233,
        -0.002385710598900914,
        0.06493344157934189,
        -0.05132365599274635,
        0.04378196969628334,
        0.039047349244356155,
        -0.042540233582258224,
        0.01587688736617565,
        0.005375012755393982,
        -0.03580000251531601,
        -0.02987452782690525,
        0.07622412592172623,
        0.02053561806678772,
        -0.068068727850914,
        -0.07699703425168991,
        -0.04852021858096123,
        0.05969150364398956,
        0.04095301777124405,
        -0.08765702694654465,
        0.0330231674015522,
        0.03988298773765564,
        0.03763611242175102,
        -0.05948730185627937,
        0.0547722652554512,
        -0.034346818923950195,
        -0.04362141340970993,
        0.014030175283551216,
        -0.03188805654644966,
        -0.06505759060382843,
        0.02935761772096157,
        -0.017952935770154,
        0.01930149830877781,
        0.1304863840341568,
        -0.008325657807290554,
        0.022529087960720062,
        0.008810149505734444,
        -0.08058488368988037,
        -0.031851135194301605,
        -0.02189669758081436,
        0.015346832573413849,
        -0.02485079877078533,
        -0.10089720040559769,
        -0.07045280188322067,
        0.029321763664484024,
        0.08560092002153397,
        -0.03355098143219948,
        0.037747181951999664,
        0.0018389099277555943,
        -0.03675524890422821,
        -0.008750657550990582,
        0.07059361040592194,
        -0.013405738398432732,
        -0.0022441952023655176,
        -0.0024109394289553165,
        -0.03292883560061455,
        -0.003831029636785388,
        -0.0650186762213707,
        0.012990202754735947,
        -0.06758540123701096,
        0.04678245633840561,
        0.0729433000087738,
        -0.0010381655301898718,
        0.013564961962401867,
        -6.061792845457603e-08,
        -0.04953669011592865,
        0.04914332926273346,
        -0.006855867337435484,
        0.029738089069724083,
        0.01782425120472908,
        -0.05819346010684967,
        -0.06008453667163849,
        -0.0440799817442894,
        -0.0073004597797989845,
        -0.06661480665206909,
        0.11138895153999329,
        -0.027894901111721992,
        -0.07474314421415329,
        0.012141005136072636,
        -0.013858294114470482,
        -0.014981544576585293,
        -0.05024165287613869,
        0.08801696449518204,
        -0.06977185606956482,
        0.035360176116228104,
        0.007874777540564537,
        0.06325183808803558,
        0.11650488525629044,
        -0.038356952369213104,
        -0.015306826680898666,
        -0.0024873928632587194,
        0.03231363371014595,
        0.09474122524261475,
        0.10454783588647842,
        -0.006558823864907026,
        -0.05543089658021927,
        0.052536770701408386,
        0.10139571130275726,
        0.013754763640463352,
        0.07180163264274597,
        -0.06302090734243393,
        -0.06588929146528244,
        0.05741794779896736,
        0.03940989822149277,
        0.06665749102830887,
        -0.001475991797633469,
        -0.06435989588499069,
        -0.06488021463155746,
        -0.009426814503967762,
        0.058165766298770905,
        0.02760235406458378,
        0.01813003234565258,
        -0.08755464106798172,
        0.021905027329921722,
        0.003981912042945623,
        -0.034485213458538055,
        -0.05173042044043541,
        -0.04432027041912079,
        0.07614895701408386,
        0.0309024378657341,
        -0.028752129524946213,
        -0.02728007733821869,
        0.035501834005117416,
        0.05171715468168259,
        0.053661566227674484,
        0.0205491054803133,
        -0.05631621554493904,
        -0.049480460584163666,
        0.07902142405509949
    ]
}