{
    "id": "yQHGQgWSM5s",
    "title": "Stealth Shelf Kit - Build your own Concealment Shelf - EASY!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-10-16T09:20:31Z",
    "video_url": "https://www.youtube.com/watch?v=yQHGQgWSM5s",
    "category": "Howto & Style",
    "tags": [
        "Stealth Shelf",
        "Hidden shelf",
        "how to hid things",
        "how to hide stuff",
        "hidden bookshelf",
        "passageway",
        "hidden furniture",
        "floating shelf",
        "installation",
        "how to install floating shelf",
        "concielment shelf"
    ],
    "views": 210106,
    "likes": 3954,
    "comments_count": 300,
    "description": "HERE is the Stealth Shelf KickStarter! Check it out!!:  Here is the concrete screw Anchors I was talking about:  And the extra magnets:  (You can use these to make more 'Keys'.) Here is a stud finder:   This is one of the coolest pieces of furniture that ive seen in a long time. The fact that you get to build it yourself just makes it so much cooler! I've always been a fan of hidden staircases, or secret passageways built into homes.  This concealment shelf allows you to hide things in plain sight! Hide Anything!  In this video I show how to take one of the 'Stealth Shelf' Kits from The King of Random, and assemble it into a working concealment shelf. Let me know if you have any questions!   To mount the shelf on a wall in the USA. Make sure you find 2 studs, 16 inches a part, and screw the back wall of the shelf into each stud.  You should probably use 2 or 2.5 inch screws. I go over this information at 8:16 in the video.   To mount the shelf into concrete or brick, You'll need a Lead Screw Anchor.  Screws wont go into concrete, but if you set an anchor first... (Which means, drilling out a hole the same size as the anchor into the concrete, and then pushing the anchor into the hole) then the anchor can grab and hold the screw and shelf in place.   Check out Grants YouTube channel HERE:   If you don't want to buy a kit, and you have some power tools laying around, try building it yourself with the original 'Stealth Shelf' from scratch video:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://kck.st/2ecdVyC",
        "http://amzn.to/2eiwQIa",
        "http://amzn.to/2ebvUGf",
        "http://amzn.to/2dFNLEE",
        "https://www.youtube.com/channel/UC1zZE_kJ8rQHgLTVfobLi_g",
        "https://youtu.be/1yvZbX_0lPw",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "This, my friends, is the stealth shelf. It looks like a normal shelf from the outside, but when this skull is placed in just the right position, the bottom will come out revealing whatever you have hidden on the inside. When I first saw the stealth shelf on the King of Randoms YouTube channel, I knew I had to have one and I knew my subscribers would get a kick out of it as well. So I messaged him and I asked him if I could show how it works, how its made, the construction and how to mount it to a wall on my channel. Lucky for us he had an extra kit for me to assemble and hes about to have a whole lot more kits for everyone to assemble with his Kick Starter. So if you want a stealth shelf of your very own, finish watching this video to see how its made and mounted to a wall, and then check out the link in the video description to get a stealth shelf of your very own. The Kick Starter ends this week though, so dont waste too much time. Lets get started. So heres my stealth shelf kit. The package of the Kick Starter kit might look a bit different, but all the construction will be the same as what I show you here in this video. First make sure you have all the parts. The kit starts off with the base of the shelf; it has the two circles drilled into the top. And then the three crown molding pieces that make up the side. Then the middle section with its two side pieces. And the large top rectangle with its three thin trim pieces. A package of screws...the hingesthe chainsand the magnetic lock which Ill show you in a bit. Lets start with the core of the shelf. This is whats going to hold all of the shelf weight so its pretty important. Im going to use the four large screws that go through the back board into each of the little arms. Pay attention to how the arms are oriented. The diagonal cut on each arm is facing down and there is a little bit of space on that back board under each arm. Im going to show this whole project only using hand tools, but if you have a drill it will speed things up considerably. Either way, this project doesnt take very long, all the hard work is already done for you. Now that my core is done, lets set that off to the side and start with my top shelf piece. This is the largest wood rectangle in your kit. Each of these thin little decorative trim pieces will go around the edge of the board to hide the compartment door below it and to hide the layers of the top board itself. So I use a dab of wood glue and spread it thin all along where the trim is going to touch. Spreading the wood glue thin helps it get tacky faster and it wont ooze out when you put the trim in place. If you are going to stain your finished shelf, oozing wood glue would not look good with stain on it. So be careful not to get glue on any visible exterior wood. I line up my trim with the top layer of wood just below the flat surface of the shelf and then I use a super small finish nail to pin it in place also included with the kit. If you notice the decorative trim is not flat, so in order to sink the nail into the surface of the trim youll need a nail setter. If you dont have one of those you can use a longer screw or nail to get that head into the surface of the wood. The side pieces of trim go on the exact same way. Just make sure to line up each of the 45 degree precut angles with each other to make nice corners. Set the top on a soft rag or towel to not damage the trim as you are working on the opposite end. The nice thing about this kit is that everything is already precut. Alright, now that our core and our top piece is done, were going to assemble the base. Lining up these huge angles can be tricky. Im going to use the same wood gluing technique as before. Before I line up the trim pieces with the bottom board corners, Im going to poke a small hole where my nail is going to sit. This will keep the nail from sliding out of place when I hammer it down. You receive quite a lot of little finish nails in this kit so feel free to add a few here and spread them out along the rest of the project trim as you need them. Adding the side pieces to the bottom crown molding gets a little trickier. The most important part is that corner, or seam, where the two pieces of molding meet. I want them to line up perfectly. I add one small nail to the bottom corner of the board and then I tacked the top corner of the trim with another nail after they are perfectly lined up. This holds them in place as I add a third little nail to the far bottom corner after pulling it down just a tiny bit so that its parallel with the bottom of the base. Lets watch this other side and it will make a little more sense. I add wood glue to all sides just like usual and then get that bottom corner next to the seam nailed first. Then Ill nail that top corner of the molding to get it to line up perfectly. Now this crown molding was just a tiny bit off with that angle cut. But since Ive already lined up that corner seam perfectly and nailed it into place, it can flex a little bit before I nail it to the base of the shelf and the seam will still be perfect because it was nailed first. Inside of your kit there is a small angle of wood. This is part of the latch. I decided that the strongest place for this latch to be is in the center of the shelf. Add a little bit of wood glue to the bottom and then nailed the little sliver into the crown molding with the small finish nails; one on the top and one on the backside, making sure that the nails arent going to poke through the shelf into the front before I nail them in place. If you have any extra small finish nails, feel free to spread them around the rest of the trim so everything is held securely in place. And before I add any hardware Im going to add the color. One nice thing about building your own shelf is that you get to pick the color. You can stain it or paint it however you want. I chose a dark stain. I apply a thin coat of stain with a rag and while its still wet I wipe off the excess liquid so it leaves an even coloring across all of the wood. It helped to dribble a little bit of extra stain into the fine details of the crown molding since the rag wouldnt reach it directly and then I can wipe off the excess still. No matter what you decide to use regular paint or stain, make sure that you start in a non-visible area like the inside or the bottom so that any early mistakes will be hidden from view. Now that the stain or paint is dry we can add the hardware. These are called mortise full overlay cup hinges. In this kit all of the hard leg work is already done. The hole in the base is drilled out and the screw locations on that center core piece that we already assembled are pre-marked as well. You should expand the hinge first though. Just loosen up that top screw and slide the middle part up. It is a small adjustment bit it will give you a bit more room to play with. Tighten that top screw back down to finalize the adjustment. The bottom screw on this hinge is used to adjust how close the bottom drawer sits to the wall. Ill show you that in a second. Loosely screw the hinges into the pre-marked holes on the center core but dont tighten them all the way down just yet. We need to get the screws lined up in the bottom part of the hinges first. Then when all the screws are lined up, tighten each screw all the way. Its time to attach the top shelf. I propped up the center core with my pliers so that the core is level. Then I took the larger nails and hammer that top board into the center core, making sure to sink a few nails into the core arms as well for security. And it works. The shelf opens and closes without the bottom board touching the table. This is important because if it touches the table during the opening process, it will also touch and damage your wall when its hung up. The nice thing about these hinges is that you can adjust the bottom screw, so if it touches the table or you just want a bit more space, screw in that bottom screw a bit and it will lift that bottom edge of your shelf away from the wall giving it more room to move. Now for the magic. This is a little plastic lip that goes with the locking mechanism. This lip gets installed flush with that little piece of extra wood that we nailed in earlier. Make sure that the top of this latch, the little piece of wood, and the top of the molding are all flat with each other. Here is the magnetic lock when any strong magnet gets close, it unlocks itself, even through the thick top board of this shelf. Lining this magnetic lock with that little plastic lip is pretty easy. I use the toothpaste trick from Grants video. I applied toothpaste to the top of the little plastic bit and when the shelf is shut, a dap of toothpaste gets left on the top board letting us know generally where the lock needs to sit. I marked the screw holes of the lock and then set my two screws in place. It doesnt need to be super exact at this point because the lock can be slid up or down along the screws. So if it doesnt connect with the plastic the first time, adjust it again until the whole latch is making contact with its little plastic counterpart. Then when the magnet is placed on top, it will unlock allowing you full access to your hidden goodies inside. Now this last bag contains the chains. I use my screwdriver to pilot a little hole into the arms of the core and then stick the screw into the circular washer and then through the chain. And then repeated the process on the other end of the chain, making sure that both chains had the same tension on either side. So mounting a shelf is going to be a new puzzle all by itself. In most North American homes we have something called drywall which is the outside of the wall. If you screw a shelf into drywall, the shelf cant hold much weight. This is what happened when my roommate put these floating shelves in and this one ripped out of the wall. So with my floating shelf, since its going to have stuff inside of it, we want to find something called a stud. The studs happen every 16 inches inside of this drywall. You can take a stud finder and place it on a wall to tell you where the studs are at, or you can just knock on the wallwait till you hit something solid and you found a stud. So if youre going to be hanging your shelf on concrete or brick, youre going to need something like this. This is called a lead anchor. You drill a hole in the concrete or the brick, set the lead anchor, and then your screws will go through the shelf and into the anchor. Supposedly these anchors hold about 50 pounds so as long as you have one anchor on either side of the shelf you should be good to go. So these holes are drilled exactly 16 inches apart and so they should be able to hit two studs right there on that wall. The holes drilled into the back of the shelf make it easier to find the studs. I set one screw into place and then used the level to make sure that the shelf isnt sitting crooked before putting in the rest of the screws. Remember, measure twice, cut once. Double check all of your measurement and stud locations before hanging a shelf. Alright so we have the shelf installed. Ive taken a skull and put in some magnets on the bottom of them. They are the Rare Earth magnets that you can get on Amazon for pretty cheap. And so when I line this skull up with the little lock, it will latch and unlatch. So we can close it up. Its locked. Looks like a normal shelf. Then when I take the skullunlock itit will drop back down. Now Grant, the King of Random, is using his shelf to hid weapons, passports or even money. But my own research has concluded that this shelf is perfect for hiding 60 Oreosor 200 strands of licoriceor even 3,481 Skittles. [The sound of epic deliciousness] If you want one of these kits for yourself I will link the Kick Starter in the video description of this video. If you enjoyed watching this project and want to see a bunch of other creative projects by the King of Random, head on over to his YouTube channel. Thanks for watching. Hope to see you around! So theres the shelf. Just barely finished the Skittle sceneluckily we didnt get too many on the carpet. My little makeshift funnel worked out pretty well.",
    "transcript_keywords": [
        "shelf",
        "top",
        "Kick Starter",
        "bottom",
        "stealth shelf",
        "screw",
        "wood",
        "nail",
        "trim",
        "bit",
        "Kick Starter kit",
        "top shelf piece",
        "kit",
        "place",
        "screws",
        "top shelf",
        "top board",
        "bottom screw",
        "board",
        "core"
    ],
    "transcript_entity_values": [
        "about 50 pounds",
        "Rare Earth",
        "Skittles",
        "four",
        "this week",
        "two",
        "three",
        "45 degree",
        "the King of Random",
        "16 inches",
        "Amazon",
        "3,481",
        "60",
        "first",
        "second",
        "Skittle",
        "Grant",
        "the Kick Starter",
        "First",
        "third",
        "One",
        "Randoms YouTube",
        "YouTube",
        "the King of Random",
        "one",
        "North American"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "NORP",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "NORP"
    ],
    "vector": [
        -0.06409886479377747,
        0.03247998282313347,
        -0.024556422606110573,
        -0.033836472779512405,
        0.00017535276128910482,
        -0.0006362026324495673,
        -0.016017459332942963,
        0.01917090453207493,
        -0.02604581229388714,
        0.0031321721617132425,
        0.044019874185323715,
        -0.023234013468027115,
        0.1140005961060524,
        -0.03747003898024559,
        -0.02264685370028019,
        0.013950875960290432,
        -0.010406283661723137,
        0.06162388622760773,
        0.009767960757017136,
        0.04516736790537834,
        -0.030361834913492203,
        -0.06673295795917511,
        -0.022305257618427277,
        -0.0104179996997118,
        -0.04059896990656853,
        -0.03119334951043129,
        0.016553087159991264,
        -0.06559083610773087,
        -0.04455732926726341,
        -0.04005683958530426,
        0.09184307605028152,
        -0.10190697014331818,
        -0.00918626133352518,
        0.011929485015571117,
        -0.007544946391135454,
        -0.017252834513783455,
        0.11002115905284882,
        0.02211860381066799,
        0.0019251422490924597,
        -0.03693675249814987,
        -0.10098760575056076,
        -0.00530369533225894,
        0.010139601305127144,
        0.05077715963125229,
        0.012120146304368973,
        0.01041568722575903,
        0.06684346497058868,
        -0.008311135694384575,
        0.03268779441714287,
        -0.058422502130270004,
        -0.04839938506484032,
        0.012581218965351582,
        -0.014569411054253578,
        0.02494104765355587,
        -0.06876136362552643,
        0.07061976939439774,
        0.04605018347501755,
        -0.04097869247198105,
        -0.019113797694444656,
        0.015104937367141247,
        0.07052615284919739,
        -0.00867095123976469,
        0.0447419211268425,
        -0.013402883894741535,
        0.011548582464456558,
        0.06003790348768234,
        -0.024181997403502464,
        -0.013401788659393787,
        0.09178496897220612,
        0.03639857843518257,
        0.020352978259325027,
        -0.024847107008099556,
        -0.02070491574704647,
        0.006215626373887062,
        0.03606630116701126,
        0.07114557176828384,
        -0.028242141008377075,
        -0.06561753153800964,
        0.030168084427714348,
        -0.06072971224784851,
        -0.03161134943366051,
        0.02706141397356987,
        -0.029799971729516983,
        0.011186924763023853,
        0.0005254842108115554,
        -0.006009045522660017,
        -0.02856280840933323,
        -0.009973094798624516,
        -0.048778701573610306,
        0.012215935625135899,
        0.03311183303594589,
        -0.03823374956846237,
        -0.045645736157894135,
        -0.0003180095227435231,
        0.0032992311753332615,
        -0.04783226177096367,
        0.040194250643253326,
        -0.03631920367479324,
        -0.06243526190519333,
        0.026569372043013573,
        -0.013649934902787209,
        0.01342071034014225,
        0.09400924295186996,
        -0.027165329083800316,
        -0.05550142750144005,
        0.014366719871759415,
        -0.044303007423877716,
        -0.04182204604148865,
        -0.0441117063164711,
        0.0371987409889698,
        -0.007597059477120638,
        -0.05051977559924126,
        -0.037273965775966644,
        -0.02326318807899952,
        -0.0674409344792366,
        0.016244379803538322,
        0.061119578778743744,
        0.00597175769507885,
        0.040113940834999084,
        -0.007501325104385614,
        0.10421431064605713,
        0.09272123128175735,
        0.044260021299123764,
        -0.0018804139690473676,
        -0.00018189528782386333,
        -0.0010488744592294097,
        -0.05887679010629654,
        1.0035767408110933e-33,
        0.010403051041066647,
        0.051369696855545044,
        -0.12586170434951782,
        0.03716030344367027,
        0.057014100253582,
        -0.08085933327674866,
        0.12284901738166809,
        0.08800758421421051,
        -0.06390441209077835,
        0.08691500872373581,
        0.04536088556051254,
        -0.0498470738530159,
        -0.04284834489226341,
        0.05765628069639206,
        0.01496791373938322,
        -0.04742433503270149,
        0.05642843618988991,
        -0.001170097035355866,
        0.06558617949485779,
        -0.0601176917552948,
        -0.008923613466322422,
        -0.04302576556801796,
        0.03504081070423126,
        0.020289922133088112,
        0.08122821897268295,
        0.018904780969023705,
        0.0486861877143383,
        -0.0031685002613812685,
        -0.06810108572244644,
        0.01881972886621952,
        -0.04742055758833885,
        0.017508361488580704,
        -0.004757547751069069,
        0.01292408537119627,
        0.05058101937174797,
        -0.04248185083270073,
        -0.05979776382446289,
        -0.06813031435012817,
        0.04628147929906845,
        -0.03716035187244415,
        0.04361960291862488,
        -0.02566872164607048,
        0.03381999209523201,
        -0.05254831537604332,
        0.016560612246394157,
        0.0744035467505455,
        0.04799395799636841,
        0.014092432335019112,
        0.023924624547362328,
        -0.00395472627133131,
        0.031871505081653595,
        0.02073832042515278,
        -0.11327233165502548,
        -0.010345706716179848,
        -0.020115597173571587,
        -0.10061610490083694,
        -0.05467202514410019,
        -0.06212446466088295,
        0.05097368732094765,
        -0.0035556962247937918,
        -0.02951374091207981,
        0.12242379039525986,
        0.07042787224054337,
        0.08143914490938187,
        -0.11219377815723419,
        -0.06981005519628525,
        -0.08988587558269501,
        -0.014199711382389069,
        0.05309591442346573,
        -0.0005642520263791084,
        -0.005285520106554031,
        0.03482045978307724,
        0.0283844955265522,
        -0.01168432179838419,
        -0.01663236692547798,
        0.012164155021309853,
        -0.06712449342012405,
        -0.007709168363362551,
        0.06764890253543854,
        -0.1369442641735077,
        0.02540065161883831,
        0.05693494901061058,
        0.012968811206519604,
        0.041688211262226105,
        -0.05192864313721657,
        -0.009013243019580841,
        0.09549887478351593,
        -0.025611504912376404,
        -0.03520984575152397,
        -0.052582643926143646,
        -0.00915369763970375,
        -0.10433246195316315,
        -0.03016614355146885,
        -0.009233186952769756,
        -0.011919219046831131,
        -3.49722058997108e-33,
        0.08514926582574844,
        -0.036189399659633636,
        0.031512875109910965,
        -0.03790109604597092,
        -0.01890808902680874,
        0.03399436175823212,
        -0.045174866914749146,
        -0.0689864382147789,
        -0.015942154452204704,
        0.06728330999612808,
        -0.02983519807457924,
        0.05134667083621025,
        0.03475698083639145,
        -0.04651518538594246,
        0.03057147189974785,
        0.014619831927120686,
        0.09399238973855972,
        0.03182286024093628,
        -0.03490860387682915,
        0.03459605202078819,
        0.037863440811634064,
        -0.03490784764289856,
        -0.1687946915626526,
        0.04857763275504112,
        0.048047397285699844,
        -0.018082736060023308,
        0.0616411492228508,
        -0.04373428225517273,
        -0.005849939770996571,
        0.04479818791151047,
        -0.09170050919055939,
        0.048649318516254425,
        0.01965142972767353,
        -0.025590624660253525,
        -0.023913592100143433,
        -0.05247357487678528,
        -0.008397509343922138,
        -0.0210623349994421,
        0.014659881591796875,
        -0.14557528495788574,
        -0.010360727086663246,
        0.055351193994283676,
        -0.010312587954103947,
        -0.053635016083717346,
        -0.07778426259756088,
        0.016119401901960373,
        0.04473763331770897,
        0.0662088617682457,
        -0.03337288275361061,
        0.007727788761258125,
        0.044330794364213943,
        0.013239297084510326,
        -0.026684673503041267,
        -0.10662142187356949,
        -0.05044728145003319,
        0.016440624371170998,
        -0.012866675853729248,
        -0.0012385095469653606,
        0.0941549614071846,
        0.0746501013636589,
        -0.003914790228009224,
        -0.03152843192219734,
        0.007116290740668774,
        -0.0022941839415580034,
        -0.010525548830628395,
        -0.04862406849861145,
        0.004287695977836847,
        0.0010659054387360811,
        -0.0777769684791565,
        -0.01356298103928566,
        0.10590965300798416,
        0.04354415088891983,
        0.11091228574514389,
        0.0115931686013937,
        0.0452798455953598,
        -0.00975301954895258,
        0.08101651817560196,
        -0.0474255196750164,
        -0.03665145859122276,
        0.03738630190491676,
        0.060349900275468826,
        -0.11784929782152176,
        0.004329478368163109,
        -0.03002280183136463,
        0.04906256124377251,
        0.0010048169642686844,
        -0.04138153791427612,
        0.08227609843015671,
        -0.06419561058282852,
        -0.0034329253248870373,
        -0.021404966711997986,
        0.04315831512212753,
        -0.04052261635661125,
        -0.02917706035077572,
        0.115972138941288,
        -5.3715016434807694e-08,
        0.011022889986634254,
        0.01159343309700489,
        -0.03867803141474724,
        -0.04548341780900955,
        -0.09158342331647873,
        -0.02091418392956257,
        0.015517226420342922,
        -0.027122389525175095,
        0.003042062744498253,
        -0.13730773329734802,
        0.10087226331233978,
        -0.06045807898044586,
        -0.057609234005212784,
        0.1107039675116539,
        -0.04706288129091263,
        0.044346824288368225,
        -0.0979195311665535,
        0.06019071489572525,
        -0.05343014746904373,
        0.021039586514234543,
        -0.024858104065060616,
        0.01640412025153637,
        0.006594678852707148,
        -0.05723784118890762,
        0.008820561692118645,
        0.022404450923204422,
        -0.04530620202422142,
        -0.004675927106291056,
        0.14806446433067322,
        0.05763920769095421,
        0.021093258634209633,
        -0.05734032392501831,
        0.03182756528258324,
        0.028812866657972336,
        0.044679153710603714,
        0.05023033916950226,
        -0.01311887800693512,
        -0.0022686102893203497,
        -0.03904321417212486,
        0.05417626351118088,
        0.01569824106991291,
        -0.10229235887527466,
        -0.06266717612743378,
        0.0231968741863966,
        -0.00861655455082655,
        0.006439519114792347,
        -0.07744534313678741,
        0.06473956257104874,
        -0.0627879723906517,
        0.05272096022963524,
        0.024792108684778214,
        -0.024518774822354317,
        0.02213483676314354,
        -0.011868130415678024,
        0.05174190178513527,
        0.08150385320186615,
        0.04460389167070389,
        -0.004924265202134848,
        -0.04461312294006348,
        0.025022372603416443,
        0.05830086022615433,
        -0.01744932495057583,
        -0.047655727714300156,
        0.05044109374284744
    ]
}