{
    "id": "yr2bpY1n4EM",
    "title": "This looks GREAT, but sounds... - Edifier QD35",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-12-16T21:31:21Z",
    "video_url": "https://www.youtube.com/watch?v=yr2bpY1n4EM",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "edifier",
        "speaker",
        "transparent",
        "translucent",
        "cool",
        "bluetooth",
        "pc",
        "retro"
    ],
    "views": 292215,
    "likes": 10875,
    "comments_count": 574,
    "description": "Purchase a Paperlike Pro Bundle at:   Transparent tech -- so hot right now. With a window into Edifier's new QD35 speaker, Dan's hoping to see big speakers, colourful lights, and... worms? Will Edifier delight, or is it all just a facade? Only one way to find out!  Buy an Edifier QD35:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Dan's weird desires 0:24 Included accessories 1:11 Ports, buttons, and design impressions  3:30 Sponsor - Paperlike 4:07 Thoughts on the RGB and displays 4:42 App walkthrough 6:20 Listening impressions 7:51 Weird design choice (kinda) 8:19 More listening 9:26 Teardown 10:30 Pricing, competition, overall thoughts 11:56 Outro",
    "description_links": [
        "https://paperlike.com/shortcircuit",
        "https://geni.us/a4c3ctP",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Honestly, I've always wanted to see my internal organs. It would be, like, really sick to have, like, a little transparent panel right here. I don't know if I'm full of worms or not. This is the Edifier QD35, and it has a really nice transparent panel on it, and I don't know if it's made of lice or made of worms. I kind of want to find out. Let's see. Ooh. Let's see what else we got in here. Oh, accessories box thing, too. We got a power cable. QD35 is a Bluetooth speaker, but it's one that needs to be plugged in all the time. It doesn't have an internal battery, so we'll get that in in a minute. Looks like we've got a little aux cord, which is always nice to see in current year. We also have a USB A to A, as this does support USB audio. Looks like we've got a little quick start guide as well, which is kind of nice. Nothing on the backside. Manual, which we will immediately disregard. And stickers. I haven't seen stickers in a long time. That's gonna hurt to remove later. And a cleaning cloth, too, because I immediately see Piano Gloss Black, which is extremely disappointing, but whatever. All right, here's our little thing. Comes in upside down, already covered in dust. I love it. Ooh, seems like we got a gloss black one. Wow, this actually looks a lot more interesting than I thought it was going to. On the back, it looks like we've got our bass reflex ports, a little power switch, power input, aux cord, and a USB A for audio input. On the side here, it looks like we've got another USB A and a USB C. And if I remember correctly, these are actually used to charge up to two devices simultaneously, which is kind of cool. Speakers are a little bit smaller than I expected. Need to see exposed speakers on the front. We've got a three inch and a one inch, and it's about 40 watts. I like that they've used RMS as opposed to PMP, so we know that this thing is much more 40 watts than other things of this class. Main driver is about 25 watts. This side, we've got some physical knobs and things, which is also really nice to see. I kind of hate the touch sensitive stuff. It's kind of nice to just grab these and push buttons. Nice little clicky power button there. The volume knob here seems to have some nice little detents in it too. Then we have a light effect control because this guy is full of RGB. It's not Razer, right? Okay, good. Feels quite hefty. Size is reasonable. It's immediately covered in loads of fingerprints, which is not too bad. Obviously, this isn't a portable speaker. I was expecting a handle or something on it, but yeah, this is just a plug-in only, which is a little bit weird. I thought from some of the pictures I saw that I would find the branding on it a little bit cringe, but it's not as overstated as I thought it would be. It's done in a gray color rather than a bright white, which kind of says to me that it's... It doesn't catch the light as much as I think a bright white would. It's still weird. Charges at 35 watts, which is the most important thing to put on the entire side of the speaker. I also thought that the tubes on the front would be a little bit more exciting. Also on the marketing material, they were showing off the bass reflex ports coming from like the top, which is weird. So I don't quite understand how that's gonna work. I'd have to do some surgery. I wanna know what worms are in here. I guess all that's left to do is check out the RGB. But before that, we have to talk about our sponsor, worms. I mean, Paperlike. Thanks to Paperlike for sponsoring this video. The Paperlike Pro Bundle has all the gear you need to maximize productivity with your iPad. It includes an iPad screen protector that brings the joy and precision of high quality paper to the iPad, helping you achieve better handwriting while maintaining stunning screen clarity. You'll also receive a set of their pencil grips that are designed specifically for the Apple Pencil. Choose from the Maximum Comfort Grip for long writing sessions, or the Maximum Precision Grip for better stroke precision and accuracy. And to top it all off, you'll be able to keep your screen clean with the Paperlike All-in-One Cleaning Kit. Learn more about the Paperlike Pro Bundle at the link below. I've got the power plugged in now. The cord sticks out really far from the back. Not the most attractive thing I've ever seen, but at least the cord is really long, which is kind of nice. Let's push the button and see what happens. Did anything happen? Oh, look at that. It's got some pretty cool lighting effects in that. Wow, okay. So we've got what looks like reactive strips all along the side and around the base of the speakers. That's neat. So we've got a display down here on the left, and we've got a little clock there too. Yeah, it looks like the clock seems to be flickering on the camera a bit. If I shake the speaker, I can actually see that in real life. So it seems to be a pretty low refresh rate display. We also have an app because it's current year. We've got the Edifier Connect app. It's a new one for me. I haven't seen this one before. So let's see if we can pair with it. That was pretty simple. All right, let's see. We've got Bluetooth. Ooh, it'll play soothing sounds. The sounds I play at home are just incoherent screaming. Yeah, let's come back to that later. We've got music. We have game. That makes sense, maybe. We have movie, and we have do-it-yourself. There's also a scroll thing. Ooh. Okay, so we've got lighting adjustment. That's kind of neat. Oh, it's on white right now. We can do green or any other color. Let's have a few different settings for what we can do with the light. Shooting star. Oh, that looks neat. So the dial on the side seems to adjust the brightness. And then if we push it in, it should change the pattern. You can see it updating on the app live, which is kind of cool. What does the more button do? Oh, it's got a light library. It's nice that it shows you kind of what they do. Spiral? Water drop? That sounds kind of cool. Oh, it has to download it. That's cool. It'd be kind of neat if they had a designer for this, but this is fine too. It has less discrete LEDs than I think I would be happy with. It's not very smooth, but like, are you buying this for the LED stuff for like the fake tubes on the front that are done in silver plastic that I can see the molding lines on? Who knows? You can add your own sound effects, which is kind of cool. Does it add a widget? Widget. Add a widget. You can add a control widget to your homepage. It's nice that iPhone includes this now. That's neat. Might as well play Crab Rave in Deezer because this does support lossless audio codecs. LDAC, I believe it's called. I guess I should listen to a Crab Rave. Was that on 14? Got a little bit of crackling and distortion at about 14, which is some sort of percentage divided by 16. We are getting a lot of air movement through the back here. It's not super loud at maximum volume. I expected a little bit more. The sound profile's weird. It's like missing a weird scoop, right, between the bass and the mid. All it kind of, well, it doesn't have a bass driver. All it really has is this little three inch and a one inch. The sound field is really weird. It's kind of like right here is the sweet spot almost, but it's also kind of out here. I don't know, it sounds really weird. I'm trying to find the frequency band where it's missing things. I think it's around 500 hertz. It makes it sound kind of weird and tinny and middy, and that might be kind of the end of the speaker's range for this size. I don't know too much about the quality of speakers and the sounds they're able to reproduce. Obviously, they're nice and bassy. They're moving a lot of air, which is great, but I don't really know. Okay, well, that's one thing that I just noticed about it. The cone of the, well, the reflex thing of the speaker extends over the edge of the retaining ring, so I dropped it on its face, and it really did not like that. I guess you're not supposed to hurt it at all. It is not for speakers on duty. Yeah, but I mean, you knock it over. Let's have a listen to some Soul Wax remixes. It sounds really good backwards. Like, the bass is really punchy, like, back here, and then you turn it around, and it sounds like ass. That's hilarious. I don't know if that's a reflection thing, but you would think that, you know, it's supposed to be a computer speaker. You put it on your desk, and then go over here, and, you know, it's not maybe at ear level where you would be doing monitoring. It's just, it's, it's not, it's not, it's not good. It sounds like a Bluetooth speaker. I think there's a giant hole. Like, the bass is punchy. If you're weird or off-axis, or like, having it up on the corner makes the bass a lot better. Having it on the table here isn't. I don't think it's necessarily anything to do with the table here. If anything, the table would probably help as this is resonant. It crackles at maximum volume. It crackles at, like, 13, 14. The tweeter seems to have some maybe hiss in it, and I don't know if it's full of worms. Oh, there we go. Oh, yeah, all right. Sure. It's all plastic in here, I guess. I think it's attached from the backside, too. I don't know if we're gonna be able to actually get into this too much. Oh, yeah, I didn't talk about the feet. The feet are pretty nice. They're really sticky rubber, which is kind of cool. Let's have a look at that. Oh, it comes with, like, tissue paper. That's cool. Oh, wow, that's kind of, uh... Oh, God, it does not! That's fine, that's fine, it's fine. Everything's fine. That's a big driver. Like, that has a lot of throw to it, which is kind of nice. Somebody has farted in the speaker. That's rude, I'm sorry, guys. There you go, there's your tubes. You see the tubes? Yeah, they come in through the center. They don't come out the top, obviously, but the front is definitely fake. It seems to be made of some pretty nice plastic, honestly. Build quality is absolutely fine. This speaker retails for 200 US bucks, and I think you can get it on sale now for about 150. The problem is that the kind of price bracket for this market is really, really competitive, around the $200 mark. I did an unboxing of a Sony Bluetooth speaker that was about 350 bucks, and I think it's on sale now for about 200, but that kind of doesn't mean anything. And that performed way outside of its price class. This one, I think, underperforms for its price class. The build construction seems pretty good. The front polycarbonate, whatever this is, plexiglass, is reasonably strong. I mean, it gets covered in fingerprints. The speakers are okay. The aesthetics are probably where you're gonna be paying that money. It doesn't have a battery. It can charge your phone. You can't do a stereo pair, so you only have one of these. Might be better if it was a stereo pair. If you're into the aesthetics, I think it would be cool. The problem is that the RGB and everything looks nice at a distance, but being up close, I can see the imperfections in the molding of the silver backplate. Now, shiny plastics are pretty difficult to do, but I can see where some of the plastic has flowed. It looks like cheap plastic. Disappointing, but I mean, it is a $200 speaker, which sounds maybe more like a $40 speaker. Sorry, it's just, it's okay. It didn't even have worms in it. Thanks for watching. If you wanna have a look at an actually good Bluetooth speaker, check out this unboxing that I did for the Sony one, and don't forget to subscribe, please, for worms. Worms, worms, worms, worms.",
    "transcript_keywords": [
        "kind",
        "nice",
        "speaker",
        "Bluetooth speaker",
        "worms",
        "sounds",
        "thing",
        "kind of cool",
        "cool",
        "weird",
        "Speakers",
        "USB",
        "Paperlike Pro Bundle",
        "Paperlike",
        "bit",
        "Bluetooth",
        "yeah",
        "kind of nice",
        "bass",
        "pretty"
    ],
    "transcript_entity_values": [
        "Crab Rave",
        "current year",
        "iPad",
        "the Maximum Precision Grip",
        "Paperlike",
        "Connect",
        "$200 mark",
        "Razer",
        "One",
        "35 watts",
        "200 US bucks",
        "the Edifier",
        "about 25 watts",
        "one",
        "The Paperlike Pro Bundle",
        "USB",
        "14",
        "about 200",
        "iPhone",
        "14",
        "a Crab Rave",
        "13",
        "40",
        "about 40 watts",
        "up to two",
        "three inch",
        "about 14",
        "the Apple Pencil",
        "Sony",
        "the Maximum Comfort Grip",
        "16",
        "PMP",
        "Deezer",
        "Soul Wax",
        "200",
        "RGB",
        "LDAC",
        "Piano Gloss Black",
        "the Paperlike Pro Bundle",
        "about 150",
        "about 350 bucks"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "MONEY"
    ],
    "vector": [
        -0.09329475462436676,
        0.014876826666295528,
        0.05188557133078575,
        -0.06028154119849205,
        0.11335323005914688,
        0.034024693071842194,
        0.05699119344353676,
        -0.07511480897665024,
        -0.007579633500427008,
        0.009425966069102287,
        0.017481274902820587,
        -0.03748657554388046,
        0.020652590319514275,
        -0.05446932464838028,
        0.028261877596378326,
        -0.04612584039568901,
        0.05300641432404518,
        -0.0037324163131415844,
        -0.06070491299033165,
        -0.06982755661010742,
        -0.006515161134302616,
        -0.03355405479669571,
        -0.023491133004426956,
        -0.03750896081328392,
        0.02223094180226326,
        -0.03366386890411377,
        -0.03551207110285759,
        0.02086666226387024,
        0.03612184897065163,
        -0.11705824732780457,
        0.09714019298553467,
        0.04915228113532066,
        0.02697073295712471,
        -0.028507785871624947,
        0.009566103108227253,
        0.002145567908883095,
        -0.04511728137731552,
        -0.0867646187543869,
        -0.04977111518383026,
        -0.017674285918474197,
        0.028753479942679405,
        -0.059927280992269516,
        -0.06456640362739563,
        0.05138947442173958,
        -0.019404863938689232,
        -0.04306745156645775,
        -0.07338253408670425,
        0.003626120975241065,
        -0.07755783200263977,
        -0.04970471188426018,
        0.02218218892812729,
        -0.08295991271734238,
        0.007679183967411518,
        0.043032001703977585,
        -0.06781351566314697,
        -0.004698329605162144,
        -0.0237928107380867,
        -0.025987518951296806,
        -0.003592490218579769,
        -0.024688314646482468,
        0.05584083870053291,
        -0.04288994520902634,
        -0.03191759064793587,
        0.05475849285721779,
        -0.0029897107742726803,
        0.023826077580451965,
        -0.06036374717950821,
        0.12760145962238312,
        -0.03420247882604599,
        -0.020536135882139206,
        0.035924237221479416,
        0.010639822110533714,
        0.05218793824315071,
        0.08460907638072968,
        0.12491725385189056,
        -0.07684710621833801,
        0.0480073019862175,
        -0.054165925830602646,
        -0.041556693613529205,
        -0.020818278193473816,
        0.007982098497450352,
        -0.008924519643187523,
        -0.020718097686767578,
        -0.028150349855422974,
        0.03520377725362778,
        -0.022533735260367393,
        -0.015419049188494682,
        -0.014233123511075974,
        -0.05665066838264465,
        -0.04378826916217804,
        -0.0710659921169281,
        -0.03637837991118431,
        0.0011291105765849352,
        0.02154071256518364,
        -0.03330392390489578,
        -0.03609159216284752,
        -0.04165907949209213,
        -0.076820507645607,
        -0.003444303758442402,
        0.08827570825815201,
        -0.052940163761377335,
        0.05425766855478287,
        0.0004907617694698274,
        -0.08416720479726791,
        -0.09866396337747574,
        -0.10301205515861511,
        -0.02386055327951908,
        0.1141328513622284,
        0.05195854604244232,
        -0.002025910187512636,
        -0.09497781097888947,
        0.014366860501468182,
        -0.06816697865724564,
        -0.027480535209178925,
        -0.017111435532569885,
        -0.024705998599529266,
        -0.026707250624895096,
        0.006919213104993105,
        0.09596434980630875,
        -0.07461033761501312,
        0.03909832611680031,
        0.0390925258398056,
        -0.011018560267984867,
        0.03628084063529968,
        -0.032304130494594574,
        0.03581293672323227,
        -0.08192402124404907,
        -1.4875891111560626e-33,
        0.04690070077776909,
        0.05181651934981346,
        -0.10253799706697464,
        -0.002925558015704155,
        0.11972339451313019,
        0.06258248537778854,
        -0.015942072495818138,
        0.029132172465324402,
        -0.0938926637172699,
        -0.007059852592647076,
        -0.052240367978811264,
        0.038497306406497955,
        -0.03608597815036774,
        0.11569445580244064,
        0.0032724749762564898,
        -0.07875668257474899,
        -0.03333256393671036,
        0.06738200783729553,
        -0.03500870615243912,
        -0.062076956033706665,
        -0.08795317262411118,
        -0.03154177591204643,
        -0.03540213033556938,
        -0.0031786183826625347,
        0.0977318286895752,
        -0.022163089364767075,
        -0.0015328964218497276,
        0.009383353404700756,
        0.050035204738378525,
        0.022507844492793083,
        -0.08502369374036789,
        -0.004930747207254171,
        0.048028185963630676,
        -0.04288908839225769,
        -0.04371850565075874,
        0.0722607970237732,
        -0.06488607078790665,
        -0.02844380959868431,
        0.04397112876176834,
        0.0037621071096509695,
        -0.0008753881556913257,
        -0.00466661574319005,
        0.018998373299837112,
        -0.07183849811553955,
        -0.07111093401908875,
        0.05388183519244194,
        0.03901670128107071,
        0.030038686469197273,
        0.034207846969366074,
        -0.0221167653799057,
        0.04551676660776138,
        -0.023164840415120125,
        -0.08404552936553955,
        -0.05572284013032913,
        0.02666129544377327,
        -0.06960581243038177,
        -0.002677394775673747,
        -0.00045061210403218865,
        0.05487976223230362,
        -0.06303562968969345,
        0.07638529688119888,
        0.11909810453653336,
        0.05518529936671257,
        0.009510112926363945,
        -0.041659124195575714,
        0.08077746629714966,
        0.04926803335547447,
        -0.07081745564937592,
        -0.04756370186805725,
        -0.015894657000899315,
        -0.06371460109949112,
        -0.005702916532754898,
        0.014062643982470036,
        -0.03122217021882534,
        0.03469451144337654,
        0.007027845364063978,
        -0.06745502352714539,
        -0.045919183641672134,
        0.10067973285913467,
        -0.0078113083727657795,
        -0.030773194506764412,
        -0.04279424995183945,
        0.005804749671369791,
        -0.04663897305727005,
        -0.027414921671152115,
        -0.021731164306402206,
        0.047867435961961746,
        -0.08112168312072754,
        -0.030260233208537102,
        0.026840856298804283,
        -0.016349511221051216,
        0.025251293554902077,
        -0.04209958016872406,
        0.030181599780917168,
        -0.005242606624960899,
        -2.464653127897336e-33,
        0.003438982181251049,
        0.02711287885904312,
        -0.023865999653935432,
        0.03693349286913872,
        0.03366050869226456,
        0.0451836921274662,
        -0.014551053754985332,
        0.04076007753610611,
        0.04408670961856842,
        0.01072661578655243,
        0.0279126837849617,
        0.007104463409632444,
        -0.09819141775369644,
        -0.03316124156117439,
        -0.02183755859732628,
        -0.002338205697014928,
        0.06047558784484863,
        -0.020152011886239052,
        0.02111930027604103,
        0.006209481041878462,
        0.04410957545042038,
        0.02464313432574272,
        -0.06752177327871323,
        0.04120626300573349,
        -0.018984558060765266,
        0.025529352948069572,
        0.08911850303411484,
        0.025337714701890945,
        -0.04671444371342659,
        -0.022739017382264137,
        -0.07708648592233658,
        -0.1625910997390747,
        -0.1267368197441101,
        -0.059448204934597015,
        0.0065253786742687225,
        0.05898613482713699,
        0.036659371107816696,
        0.042872194200754166,
        -0.03229110687971115,
        -0.03336040675640106,
        -0.0025249463506042957,
        -0.035590123385190964,
        -0.04413202032446861,
        0.08424335718154907,
        -0.07410576939582825,
        -0.07755017280578613,
        -0.0463993102312088,
        -0.001487296656705439,
        0.042757634073495865,
        0.031801775097846985,
        0.03159357234835625,
        0.024994049221277237,
        0.037448424845933914,
        0.011460019275546074,
        -0.10939263552427292,
        0.04581717401742935,
        -0.024139123037457466,
        0.0896075963973999,
        -0.013092445209622383,
        0.0125510822981596,
        0.0276847705245018,
        0.0473041832447052,
        -0.06198318675160408,
        -0.029279327020049095,
        0.04630399867892265,
        -0.049788784235715866,
        0.04866486415266991,
        0.03343731537461281,
        -0.02929437719285488,
        -0.02637975476682186,
        0.05421437323093414,
        -0.024228569120168686,
        -0.024534938856959343,
        -0.08683987706899643,
        -0.028022995218634605,
        0.005150276236236095,
        0.003439668333157897,
        0.02091595157980919,
        0.0524694100022316,
        -0.004419309552758932,
        -0.01617904007434845,
        0.022607164457440376,
        0.047513097524642944,
        0.04789404943585396,
        0.051383063197135925,
        -0.04426511004567146,
        0.011454065330326557,
        0.015153588727116585,
        0.009384856559336185,
        0.057784345000982285,
        -0.012330658733844757,
        0.11431221663951874,
        0.06912675499916077,
        0.06409826129674911,
        0.053292930126190186,
        -6.456195222881433e-08,
        -0.014620130881667137,
        -0.07275587320327759,
        -0.0303107351064682,
        -0.05463626608252525,
        -0.025661537423729897,
        -0.06563457101583481,
        0.03499751538038254,
        -0.013346122577786446,
        -0.03652026504278183,
        -0.04291466251015663,
        0.02842286229133606,
        -0.03425098955631256,
        -0.04691990837454796,
        0.056960854679346085,
        0.05886249244213104,
        0.01895645260810852,
        -0.01837030053138733,
        0.06300769746303558,
        -0.06924623996019363,
        0.009165220893919468,
        -0.0054827164858579636,
        0.07347869127988815,
        0.1022738441824913,
        -0.027636675164103508,
        -0.032772768288850784,
        0.013598724268376827,
        0.06744781136512756,
        0.009124087169766426,
        0.11517742276191711,
        0.02125275507569313,
        -0.06324855983257294,
        0.043575312942266464,
        -0.04852592200040817,
        0.03993220254778862,
        0.025269024074077606,
        0.0388077087700367,
        -0.09882839769124985,
        0.007302312180399895,
        -0.04094194248318672,
        0.07823776453733444,
        -0.03164645656943321,
        -0.07449427992105484,
        -0.015536181628704071,
        0.054135628044605255,
        0.050872303545475006,
        -0.018535159528255463,
        0.020639510825276375,
        -0.09682779759168625,
        -0.012096176855266094,
        0.02144615352153778,
        -0.022138608619570732,
        -0.049077052623033524,
        0.01701635681092739,
        0.021935220807790756,
        -0.023263541981577873,
        -0.03358681499958038,
        -0.01424263697117567,
        0.0538402684032917,
        0.027381880208849907,
        0.06928245723247528,
        -0.029044995084404945,
        -0.09801965206861496,
        0.015317488461732864,
        0.10498517751693726
    ]
}