{
    "id": "YSAismB8ju4",
    "title": "Goodbye NVIDIA. – AMD RDNA3 Announcement",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-11-04T08:38:52Z",
    "video_url": "https://www.youtube.com/watch?v=YSAismB8ju4",
    "category": "Science & Technology",
    "tags": [
        "RX 7900 XT",
        "RX 7900 XTX"
    ],
    "views": 2795244,
    "likes": 104979,
    "comments_count": 7753,
    "description": "Shop Micro Centers Great Selection of Computer Parts:  Check out Micro Centers Top Deals:   PDQ.com: Start your FREE trial now! At   AMD just announced their RDNA3 GPUs and dang.. the RX 7900XT and RX 7900 XTX look amazing for gamers.  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Intro 1:05 - PDQ 1:20 - LTT Intro 1:29 - Performance Estimations 3:37 - Pricing 4:51 - Power consumption 6:58 - DisplayPort 2.1 7:54 - Media Engine 8:55 - The bad stuff 10:30 - Overall 11:08 - Micro Center! 11:40 - Outro",
    "description_links": [
        "https://micro.center/7re",
        "https://micro.center/kso",
        "https://lmg.gg/PDQOct",
        "https://linustechtips.com/topic/1465351-goodbye-nvidia-%E2%80%93-amd-rdna3-announcement/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- AMD is back! And Nvidia is about to pay for their outrageous pricing practices. The RDNA3 announcement just concluded. And while AMD gave us very little in the way of meaningful performance data, I'm really optimistic anyway, and here's why. Immediately after the stream ended, our labs team sprang into action building up test benches as close as possible to the ones that AMD used in their performance preview, that allowed us to expand on AMD's rather vague slides that didn't include a single Nvidia GPU and extrapolate some actually, useful comparative performance data. Now the bad news is that Nvidia might still be the performance king, but the good news is that I can confidently say that AMD's new Radeon RX 7900 XTX should come within spitting distance of Nvidia's RTX 4090 for $600 less. The only thing with better performance per dollar is this segue to our sponsor. - PDQ. PDQ makes device management simple, secure, and pretty damn quick. Automate your patch management and software deployment processes with PDQ Deploy and Inventory. Start your free trial now at pdq.com/ltt. (\"Supernova\") - In AMD's together we advance_gaming live event, they announced the two flagship tier GPUs that will lead their RDNA3 family. The Radeon RX 7900 XT and 7900 XTX with 20 and 24 gigabytes of GDDR6 respectively, which was my first surprise. I mean, why would they cheap out on the memory when they need to compete with Nvidia cards that are using faster GDDR6X. Two reasons, one, to save power, which fair enough, given the reputation their competition is built for unreasonable power consumption in thermals. And two, because they just don't seem to need it. The most useful slide that AMD provided was this one, where we see the 7900 XTX performing between 1.5 to 1.7 times the outgoing flagship 6950 XT at 4k. Now, AMD was frustratingly vague about the exact settings that they used to achieve these results, even when we probed them after the event, but we managed to extract just enough information to create our own set of performance graphs by extrapolating from our own reference 6950 XT. Let's start with \"Cyberpunk 2077.\" AMD's previous best managed 46 FPS, not great, but multiply that by 1.7 and we've got a spicy 78 frames per second. That's just a single frame per second behind the RTX 4090. What a generational improvement. In \"Call of Duty: Modern Warfare 2,\" Our RX 6950 XT managed a respectable 90 FPS. When we multiply that by AMD's 1.5 times, assuming of course they're not just outright lying, we can expect the 7900 XTX to lag Nvidia's flagship by only 6%, hot dang! Finally, in \"Watchdogs: Legion,\" the 7900 XTX takes its largest L compared to the RTX 4090, but that still only has it lagging behind by about 10%. Not too shabby AMD. Of course, performance is meaningless if it'll cost you two fingers and your right butt cheek. (coughs) Nvidia. And I have more good news, the 7900 XTX is a thousand dollars, while the 7900 XT comes in a hundred less at 900, which I mean I never thought I'd be happy about even a top-tier GPU being only a thousand dollars, but I guess, that really shows just how out-to-lunch Nvidia has been with the pricing of the RTX 4000 series. But wait a second, didn't Nvidia's CEO, Jensen, go out on stage and basically say the pricing is so high because of factors outside his control? \"Moore's law is dead,\" he said. So, well, how did AMD pull it off then? Well, first of all, by not using the latest and greatest manufacturing process. RDNA3 GPUs, at least the ones we've seen so far, are made using a combination of TSMC's 5-nanometer and 6-nanometer processes, making this both the very first chiplet designed GPU and way cheaper to manufacture than the 4-nanometer monolithic dyes that Nvidia uses for RTX 4000. But you'd think there'd be a downside to that, right? Like, don't older manufacturing nodes have worse power consumption? Believe it or not, the total board power of the 7900 XT and XTX is just 300 and 355 watts, respectively. And it's delivered by two good old fashioned 8-pin PCIe power connectors. I never thought I'd be adding not-a-fire-hazard as a selling point for a GPU, but here we are. This also means that if you're upgrading from something like a GTX 1080 Ti or an RTX 2080, you probably don't need to upgrade your system power supply, and you also probably don't need to upgrade your case. The reference 7900 XTX is a much more reasonable 287 millimeters wide and two and half slots tall, compared to the 304 millimeters and three and a half slots of the RTX 4090. Again, I never thought a GPU, physically fitting in your computer would be a major selling point, but here we are. How did they do this then? Well, AMD also packed in some really cool power management innovations. For starters, they decoupled the clock speed of the shaders, which now run at up to 2.3 gigahertz and the front end, which runs at 2.5. We've actually seen this before in mobile products but never in a desktop GPU. And the main benefit of this approach is that it allows them to prioritize the speed of one over the other, depending on the workload. For instance, if the game you're running doesn't hit the shaders super hard, maybe those are fine, just sipping power at 1.8 gigahertz while the front end runs at full speed. AMD says this can reduce total power consumption by 25%, which might not be something you care about. If you have a beefy power supply and a well cooled case already though, fear not. AMD says there will be AIB partner cards with more cooling and higher power consumption to enable even higher clock speeds, or AMD says anyway. So far we've only found this ASUS TUF model with three 8-pin connectors, which might indicate higher power consumption but nothing to say of the clock speeds. Now possibly the dumbest problem with the RTX 4090, aside from the burning up 12-pin power adapters, is that it only supports DisplayPort 1.4, which given how freaking fast it is, could actually become a problem in the very near future as new displays become available. AMD, on the other hand, managed to avoid this embarrassing situation by including DisplayPort 2.1, which can support ridiculous resolutions and frame rate combinations like 4k, 480 hertz, or 8k, 165 hertz. Now obviously, whether you go Team Green or Team Red, your GPU won't be able to keep up with that today, but with the way that upscaling and frame generation technology is progressing, DP 2.1 is some massive future proofing that could make the RTX 4090 unable to take full advantage of monitors that could be releasing as early as next year. AMD has also included a new media engine that has 8k 60 AV1 encode and decode support. This is a huge boon for streamers who are looking to get the best image quality going forward. And they announced SmartAccess video, which can share the load of encode and decode operations between AMD GPUs and CPUs, apparently giving a 30% uplift in 4K multistream transcoding. Though, we'll have to see how well this actually works when it lands in OBS in December. I'm a little skeptical, but in fairness to AMD, the recent software upgrades that they made to their media engine for Radeon 6000 did bring about image quality improvements to get them closer to Nvidia's NVENC than I would've thought possible. So with this new media engine, AMD might finally be a sensible choice for people who want to stream or record their gameplay. Another sensible choice is signing up for Floatplane.com for amazing behind the scenes and extras, like the shooting of our Starforge Systems review intro. To be clear, not everything that AMD announced today was mind blowing. In AMD's own slides, they show a 1.5 to 1.6 times increase in raytracing performance, which will take you from literal slide show to cinematic FPS at best. And the RTX 4090 walked all over AMD's best at nearly double the frame rate based on our \"Cyberpunk\" test and these projected numbers. Also, AMD built new AI accelerators that should allow for up to 2.7 times more AI throughput per compute unit, but the way it's implemented makes this increase only matter for games. At the moment, it's not gonna help you with general purpose AI. And actually, come to think of it, there was almost no mention whatsoever of non gaming tasks. And this, this is a long time thorn in Radeon users' sides. Some applications, like Blender or SOLIDWORKS Visualize, only support Nvidia CUDA, making Nvidia cards absolutely embarrass their AMD counterparts, and it doesn't look like this is gonna change anytime soon. AMD also promised that their new FSR 3 upscaling would be up to a two times increase over FSR 2, but it looks like, at least one of the ways they're going to achieve this, is with technology similar to Nvidia's DLSS 3 by generating new frames. And well, let's just say we're currently working on a video about DLSS 3 and its frame generation, and it's a first gen product. Overall, though it looks like the RX 7900 XT and XTX are going to be hecking fast GPUs for the money, and this might end up being the first generation of what feels like forever, where AMD is positioned to grab a good chunk of market share from our green overlords, which will hopefully push Nvidia to compete harder on pricing, and meanwhile, give AMD's GPU division the cash that it needs to ramp up R & D spending and come back even stronger next time. I can't wait to give you guys the full review when these cards launch on December the 13th, just like I can't wait to tell you about this segue to our sponsor. Micro Center. Micro Center carries a wide variety of laptops, computer components, monitors, communication devices, TVs, networking. You name it, they've got it, with over 30,000 items in stock. They are 25 stores across the US, provide amazing selection and competitive prices, so you always leave with what you're looking for. And we've done multiple video projects at Micro Center locations, and have always been impressed by the staff's knowledge and the stock that's available. Micro Center has great deals both in store and online, so click the link in the description to check them out today. If you guys enjoyed this video, go check out our RTX 4090 undervolting video, where the power consumption of the 4090 starts to look not that bad, even if the price is still obscene.",
    "transcript_keywords": [
        "AMD",
        "Nvidia",
        "RTX",
        "XTX",
        "power",
        "GPU",
        "power consumption",
        "give AMD GPU",
        "performance",
        "AMD GPUs",
        "AMD GPU",
        "single Nvidia GPU",
        "Nvidia RTX",
        "AMD GPU division",
        "Nvidia GPU",
        "Micro Center",
        "GPUs",
        "Nvidia cards",
        "consumption",
        "Radeon"
    ],
    "transcript_entity_values": [
        "2.3 gigahertz",
        "the 7900 XTX",
        "one",
        "GDDR6",
        "Radeon",
        "RDNA3",
        "7900 XT",
        "165",
        "8k 60",
        "GPU",
        "Moore",
        "December the 13th",
        "two and half",
        "Floatplane.com",
        "ASUS TUF",
        "AI",
        "FPS",
        "AMD",
        "Radeon RX 7900",
        "three",
        "Nvidia CUDA",
        "SmartAccess",
        "NVENC",
        "about 10%",
        "half",
        "AIB",
        "287 millimeters",
        "first",
        "Supernova",
        "Call of Duty: Modern Warfare 2",
        "46",
        "30,000",
        "25",
        "Blender",
        "just 300",
        "2080",
        "Watchdogs: Legion",
        "4",
        "1.6",
        "1.7",
        "OBS",
        "480",
        "6950",
        "TSMC",
        "2.5",
        "8k",
        "7900",
        "Micro Center",
        "Jensen",
        "6950 XT",
        "DisplayPort",
        "4000",
        "a hundred",
        "RDNA3",
        "5-nanometer",
        "December",
        "Radeon 6000",
        "Cyberpunk 2077",
        "Team Green",
        "a thousand dollars",
        "XT",
        "only a thousand dollars",
        "1.5",
        "304 millimeters",
        "4-nanometer",
        "FSR",
        "3",
        "25%",
        "2.1",
        "12",
        "as early as next year",
        "600",
        "Cyberpunk",
        "two",
        "PDQ",
        "second",
        "Two",
        "the 7900 XT",
        "1.4",
        "between 1.5 to 1.7",
        "XT",
        "up to 2.7",
        "today",
        "4k",
        "Starforge Systems",
        "up to",
        "30%",
        "4090",
        "6-nanometer",
        "20 and 24 gigabytes",
        "at least one",
        "8",
        "1.8 gigahertz",
        "US",
        "90",
        "a second",
        "AMD",
        "XTX",
        "Nvidia",
        "2",
        "RX 7900 XT",
        "only 6%",
        "GTX 1080 Ti"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG"
    ],
    "vector": [
        -0.06173305585980415,
        -0.0348711833357811,
        -0.025804447010159492,
        -0.026057811453938484,
        0.03199916332960129,
        -0.009409263730049133,
        -0.01854931190609932,
        0.02460196241736412,
        -0.05840177461504936,
        0.00010761861631181091,
        -0.03505318611860275,
        -0.0198842603713274,
        -0.02247612550854683,
        0.01998041942715645,
        0.026947302743792534,
        -0.010994513519108295,
        0.032857295125722885,
        -0.035843104124069214,
        -0.011121347546577454,
        0.027531620115041733,
        0.006650759372860193,
        -0.031669896095991135,
        -0.024863125756382942,
        -0.01467660628259182,
        0.0628531202673912,
        0.0776146799325943,
        0.07433298975229263,
        -0.0758226215839386,
        0.026040056720376015,
        -0.029250267893075943,
        0.0023293839767575264,
        0.07257040590047836,
        -0.01866103522479534,
        -0.03223836049437523,
        -0.03612644225358963,
        -0.017544420436024666,
        -0.018875250592827797,
        -0.1055968850851059,
        -0.11226976662874222,
        -0.07136542350053787,
        -0.03453852981328964,
        0.021187448874115944,
        -0.035215653479099274,
        0.019520791247487068,
        -0.00026284175692126155,
        -0.06604638695716858,
        0.026668857783079147,
        -0.09475437551736832,
        0.04590275138616562,
        0.02533818408846855,
        -0.041018594056367874,
        -0.11930057406425476,
        0.013721076771616936,
        0.019667552784085274,
        -0.009502364322543144,
        0.044221848249435425,
        -0.03356345742940903,
        -0.1051625981926918,
        0.045248448848724365,
        -0.05677035078406334,
        0.07126646488904953,
        -0.07426635921001434,
        0.021141454577445984,
        0.02677651308476925,
        0.0640747919678688,
        -0.007567751687020063,
        -0.022858044132590294,
        -0.005686775781214237,
        -0.01641063578426838,
        -0.020439567044377327,
        0.002719447249546647,
        0.04257126525044441,
        -0.06238917261362076,
        0.015596718527376652,
        -0.015603634528815746,
        0.024701686576008797,
        0.08951346576213837,
        -0.041691627353429794,
        0.01845923811197281,
        0.029518095776438713,
        0.025057917460799217,
        -0.02979179471731186,
        -0.003918283618986607,
        -0.0377235971391201,
        0.052315499633550644,
        0.0225161612033844,
        0.049038033932447433,
        -0.01877787336707115,
        0.005455540958791971,
        -0.06088046357035637,
        -0.08927327394485474,
        0.0976337119936943,
        0.060743361711502075,
        -0.03487718850374222,
        0.002560048596933484,
        -0.022419709712266922,
        0.007735167630016804,
        -0.05439337342977524,
        0.015994414687156677,
        0.05762246996164322,
        0.046820539981126785,
        0.04015826806426048,
        -0.03897984325885773,
        0.1256982386112213,
        -0.06997070461511612,
        -0.017690975219011307,
        -0.02479693852365017,
        0.08346699178218842,
        -0.08719860017299652,
        0.00993250496685505,
        -0.021784281358122826,
        0.062035154551267624,
        -0.0340280756354332,
        -0.06827492266893387,
        -0.05347101017832756,
        0.018704000860452652,
        -0.055738262832164764,
        0.033796608448028564,
        0.07071331888437271,
        -0.018471894785761833,
        -0.053762707859277725,
        -0.013659204356372356,
        -0.012515770271420479,
        0.02366609126329422,
        0.11717201769351959,
        0.06469200551509857,
        -0.05694350600242615,
        1.3664761833164153e-33,
        -0.04674878716468811,
        -0.033038560301065445,
        -0.06033756583929062,
        -0.044566020369529724,
        0.0726189911365509,
        0.028894316405057907,
        0.014916086569428444,
        -0.019374771043658257,
        -0.002221456030383706,
        0.002594771096482873,
        -0.08672142773866653,
        0.04618683084845543,
        -0.07030197232961655,
        0.04325786232948303,
        -0.0008249797974713147,
        -0.1244424358010292,
        -0.008138041011989117,
        0.005977594759315252,
        -0.0831015557050705,
        0.029017897322773933,
        0.010578802786767483,
        0.021385682746767998,
        0.04708145558834076,
        0.023343633860349655,
        0.01770217902958393,
        -0.016395028680562973,
        -0.03481293097138405,
        0.01172096747905016,
        0.03529580682516098,
        0.006066908128559589,
        -0.012754655443131924,
        -0.09096260368824005,
        0.0014138477854430676,
        -0.03201768919825554,
        -0.023920796811580658,
        0.020814012736082077,
        -0.10846026986837387,
        -0.09984996914863586,
        -0.03401648625731468,
        0.047734882682561874,
        -0.02726941742002964,
        0.04357592761516571,
        -0.08228038251399994,
        -0.1389736831188202,
        -0.05706579238176346,
        0.047332167625427246,
        0.031415123492479324,
        -0.003070357022807002,
        -0.026605352759361267,
        -0.011317610740661621,
        -0.03403036296367645,
        0.07725752145051956,
        -0.061501942574977875,
        -0.0016238467069342732,
        0.011356369592249393,
        -0.10428611189126968,
        -0.022936256602406502,
        0.04938173294067383,
        0.08600714802742004,
        0.11508481949567795,
        -0.06953882426023483,
        -0.03220171108841896,
        -0.025468196719884872,
        0.005294194910675287,
        -0.07052070647478104,
        0.0689045786857605,
        0.09461452066898346,
        0.046971436589956284,
        -0.07705767452716827,
        0.027542293071746826,
        -0.022727923467755318,
        -0.00630760146304965,
        0.0793018713593483,
        -0.049583736807107925,
        0.044567596167325974,
        -0.005995943211019039,
        -0.1057102233171463,
        -0.07011678069829941,
        -0.04793625697493553,
        -0.02458030730485916,
        -0.022930288687348366,
        -0.003184986999258399,
        0.0187519658356905,
        0.04139358550310135,
        -0.006468404084444046,
        -0.031114786863327026,
        0.024871664121747017,
        -0.07091948390007019,
        -0.03268434852361679,
        -0.018313081935048103,
        -0.101124107837677,
        0.014141715131700039,
        0.04774566739797592,
        0.017674192786216736,
        -0.021310515701770782,
        -3.9518852744798326e-33,
        -0.012267552316188812,
        -0.011212831363081932,
        0.019091175869107246,
        0.03341226652264595,
        0.012790413573384285,
        0.01948937401175499,
        0.04999851807951927,
        0.0121633755043149,
        -0.021246643736958504,
        -0.09270612895488739,
        0.03781484067440033,
        0.08049414306879044,
        -0.0408894382417202,
        -0.0029838457703590393,
        -0.007720154710114002,
        -0.03939170017838478,
        0.0506821945309639,
        -0.0743161216378212,
        -0.003978233318775892,
        -0.05776238813996315,
        0.0602463036775589,
        0.05412343144416809,
        -0.05343035236001015,
        0.02748803421854973,
        0.035091228783130646,
        -0.03563039004802704,
        0.07768916338682175,
        0.06066263094544411,
        0.01266317255795002,
        -0.02176046371459961,
        0.006277170497924089,
        0.021279146894812584,
        -0.002213903469964862,
        0.08503788709640503,
        0.02957366593182087,
        0.02670593187212944,
        0.11668317764997482,
        0.049982886761426926,
        -0.041156645864248276,
        0.013133037835359573,
        0.038075532764196396,
        0.0160407405346632,
        -0.020426401868462563,
        0.07255703210830688,
        0.006908744107931852,
        0.05261605978012085,
        -0.061482470482587814,
        0.028218787163496017,
        -0.003864701371639967,
        0.010711126029491425,
        -0.043199844658374786,
        -0.06293126940727234,
        0.0743737742304802,
        0.01992209255695343,
        -0.02065553143620491,
        -0.06600762158632278,
        -0.011431806720793247,
        0.03937041759490967,
        0.06363281607627869,
        -0.021364685148000717,
        0.07749476283788681,
        -0.0029404631350189447,
        -0.08377543091773987,
        -0.009981187991797924,
        0.021544449031352997,
        -0.022740105167031288,
        0.07206561416387558,
        0.014853209257125854,
        -0.016192730516195297,
        0.02721845731139183,
        -0.0332726389169693,
        -0.033328115940093994,
        -0.026606827974319458,
        -0.04924164339900017,
        -0.037170637398958206,
        0.051935549825429916,
        -0.01866891048848629,
        0.010054018348455429,
        0.07163656502962112,
        -0.08409655094146729,
        0.018069803714752197,
        -0.059320930391550064,
        0.08600844442844391,
        0.029886519536376,
        0.10612893104553223,
        0.029455499723553658,
        0.02685873955488205,
        0.01505800150334835,
        -0.03203629329800606,
        -0.03066200576722622,
        -0.08573830872774124,
        0.024185707792639732,
        -0.07446503639221191,
        0.05350184068083763,
        0.06611955165863037,
        -5.7560541222301254e-08,
        0.008063707500696182,
        -0.05330663546919823,
        -0.02993272803723812,
        0.031866405159235,
        0.07379420846700668,
        -0.03229452297091484,
        0.026662271469831467,
        0.004158306401222944,
        0.038881368935108185,
        0.04993123561143875,
        0.03841831907629967,
        -0.1229696273803711,
        -0.03296386078000069,
        -0.04864274337887764,
        0.03338738903403282,
        0.013898556120693684,
        -0.04978908225893974,
        0.11297864466905594,
        -0.019931353628635406,
        -0.06925149261951447,
        -0.08870647102594376,
        0.07374146580696106,
        0.06876864284276962,
        -0.06573399901390076,
        -0.009620211087167263,
        0.010503733530640602,
        0.05241187661886215,
        0.05540164187550545,
        0.10346870124340057,
        -0.08170314133167267,
        -0.030821628868579865,
        0.007440908346325159,
        0.09021361917257309,
        -0.05731790140271187,
        -0.019132424145936966,
        -0.029376715421676636,
        0.05791717767715454,
        0.10962280631065369,
        0.14291943609714508,
        -0.06187640130519867,
        -0.03721524402499199,
        -0.00614289240911603,
        0.023043492808938026,
        -0.005019390024244785,
        -0.03643009066581726,
        -0.010518752038478851,
        -0.04112429916858673,
        -0.06737322360277176,
        0.01162412017583847,
        -0.026883434504270554,
        0.01193024031817913,
        0.019573163241147995,
        -0.034286145120859146,
        0.012676776386797428,
        0.04267238453030586,
        -0.012639639899134636,
        -0.1161116510629654,
        0.061579469591379166,
        -0.011641628108918667,
        0.04311547800898552,
        0.07967700809240341,
        -0.1018659695982933,
        -0.0741223618388176,
        0.03333504498004913
    ]
}