{
    "id": "YsyKPhThDOM",
    "title": "This TV is INVISIBLE",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-01-05T21:05:00Z",
    "video_url": "https://www.youtube.com/watch?v=YsyKPhThDOM",
    "category": "Science & Technology",
    "tags": [
        "lg",
        "ces",
        "ces 2023",
        "2023",
        "lg oled",
        "oled",
        "lg oled m",
        "oled m",
        "oled t",
        "lg oled t",
        "oled flex",
        "lg oled flex",
        "lg gram",
        "gram 2023",
        "ultragear",
        "ultra gear",
        "austin",
        "austin evans",
        "this is",
        "denki"
    ],
    "views": 361527,
    "likes": 9273,
    "comments_count": 518,
    "description": "Thanks to LG for sponsoring check out everything at:   Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 LG CES 2023 0:16 LG OLED M 1:15 LG OLED T 2:15 LG OLED Flex 3:00 LG UltraGear OLED 4:29 LG Gram 2023 5:55 brid.zzz 7:00 Hover Gym 7:30 excicle 8:00 pluspot 8:34 MONSHOECL",
    "description_links": [
        "https://www.lg.com/CES2023",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "(upbeat music) - I am at CES 2023, and LG have given me an exclusive sneak peek, not only at their booth, but they've let me in early. It is six o'clock in the morning. The show hasn't even started yet, and they were kind enough to sponsor this video. I can tell you one thing. I found the OLEDs. It's a lot of pixels. Many, many, many, many millions. behind me is the LG OLED M, a 97-inch, 4K, 120Hz OLED, which of course looks terrific. But the thing that really makes this stand out is the fact that it is using wireless A/V. The only thing connecting these displays to anything is a single power cable. Instead, they're using this, the Zero Connect box, which is wirelessly sending a 4K, 120Hz signal from the box to the display. Then you might ask, \"What's the point? That doesn't seem necessary. I could just plug something in.\" But think about this. This is a very high end, stylish looking TV. You can imagine putting it in the middle of your room or, like, hanging it from a ceiling or something. You don't wanna have your game console or set-top box below it, so essentially what you can do is, as long as it's sort of fairly close, you can plug all the things you need into the Zero Connect box, and it is wirelessly beaming that signal directly to the TV. This is really cool tech. Being able to do wireless 4K, 120Hz? This my friend, is the LG OLED T. The T stands for transparent. (record scratches) - Wow. - This is wild. Right now, you can see behind the display. And if you look from the back, actually here, you can shoot through the back. Would you like to shoot through the OLED T? So the way this works is really, really interesting. Basically, what they've got is a transparent OLED, as you see right now, so I'm gonna put my hand here. There's a screen that's actually rolling up. So when you don't want it to be transparent, then you have a standard OLED that has that pure black and you can't see all the way through it. What's really cool about this is that this TV looks amazing pretty much no matter what. Now obviously, LG have their fair share of CES Innovation Awards, and the OLED T is the 2023 winner because look at the design here. I could stare at this thing all day. You can imagine this being, like, in the front of some insane view in your house or something. This is why I love going to CES, because you see this kind of stuff. You're never gonna see something like this anywhere else except in my house soon, I hope. We've had wireless, we've had transparent, so how about flexible OLEDs? This is the LG OLED Flex, and this is a gaming TV. So it's using a 42-inch OLED Evo panel, but it does it in a really interesting way. So there are 20 adjustable levels of curve that you actually can do with the remote. So if you just want to use it as like a standard TV, you can have it flat, do your whole thing. But if you want to see this thing with it's 900R curve, it will either flatten out or come all the way in. I did that right as it went flat, didn't I? If I wait a minute, it'll go back to being curved. But essentially the way it works is really interesting. The panel itself is flexible, and it's using this sort of arm to either pull or push the OLED to essentially give you the curve. And you can dial that in with 20 adjustable levels. Moving over to the UltraGear zone, the first thing that jumps out is this. So this is the LG UltraGear OLED Gaming Monitor. Specifically, this is the 45GR95QE. Now when I say that this is an immersive display, I mean it. Now, sitting in front of it, right, on camera, what you see is this is a massive 21:9 curved display. But saying curved doesn't really do it justice. Like, look at it from the side. This is an 800R curve. Do you see how curved this display is? The curve, I think, makes a big difference, especially when it comes to an ultra wide. Because essentially, what it does is it allows you to really lock into the game. It's taking up my entire field of view. CES is always a great place to look at some of the latest display tech. Obviously we've seen TVs and whatnot, but gaming displays are a little bit different, because while you want features, you also want response time, you want frame rate, and that is one of the things that really pushes the envelope with this specific display. So we're talking about a 240Hz panel that is not only of course OLED so you're getting those incredible colors and contrast, all the stuff you expect with an OLED, but you're also getting it with a 0.03 millisecond response time. So not only does it look cool, but the performance should be incredibly high. I'm not gonna say that I'm gonna spoil an upcoming video, but imagine if we have one of these in the studio and we're able to do all kinds of fun stuff. I'm just, I'm saying. They've got a few here. They don't need 'em all. One of my favorite LG products for quite some time has been the LG Gram. And today at CES, they have done a major redesign. So there're actually two new models. First, we have the LG Gram Ultra-Slim. As the name implies, it's ultra slim. Didn't see that one coming, did you? This is a 15.6-inch laptop that weighs 2.2 pounds. Is anybody gonna mind if I... This is like an absurdly light laptop. Like this is actually just ridiculous. And yeah, it feels a little bit dangerous for me to be holding this with two fingers and a mic in my hand, but you know what? I'm not gonna drop it. So this has a P-series 13th Gen Intel Core processor. You've got yourself the OLED display. You've got a 60 watt-hour battery. Now, I would never choose favorites because that's what the best of CES Innovation Award is for. If I were to pick, I would pick the LG Gram Style, specifically the 14-inch model. What this has is a 14-inch OLED that can go all the way up to 90Hz. The style part of the LG Gram really comes from the glass back of the actual display. Now, it can come in some very clean looking colors, or they have a ton of actually really cool looking designs as well. There's no track pad. Oh no, that's terrible. Oh, just kidding. So what basically it does is when you actually go to use the track pad, it actually lights up to show you the edges of the actual track pad, which is super, super neat. Life's pretty good. It's not their line, but I'm gonna just go with it. One of my favorite parts of CES is looking at the cool future tech that's not out yet, but it's coming. And Breeze is about the futurest of the future tech. So this might look like a fairly ordinary set of Bluetooth headphones, but it is not. This is designed to measure your brainwaves while you sleep and actually help to make you sleep better. So you can see, actually, as I'm holding it, it's starting to pick up some signals, but if I actually put it in my ear. This isn't just about measuring your sleep to give you super accurate sleep tracking, though. It actually is designed to help you sleep better. Because using the data that it is getting from the EEG to measure your specific brain waves, it can actually play binaural beats to give you some very specific sounds to help promote your brain to sleep better. The idea that you can put this in, go to sleep, and now I get an incredibly accurate sleep reading but actually literally sleep better by using your brain waves. Hello, my brain waves are calm. I am going to take a nap in the middle of the LG booth at CES. This is Hover Gym. So the idea is that you've got these handles and motors inside which can give you different levels of resistance, and it's also paired with this tablet here, although it's essentially an app, which is also being mirrored to this display. Now let's see how I can do this while I'm holding a microphone. All right. Oh, I'm feeling the weight. Okay, so the weight is being added. All right, so we're gonna do a nice, clean curl. I've got a 90, so I'm consistent, but I could do better. It's kind of my life story. We also have the excicle. Now, this is a bike which is designed to give you a very accurate simulation of various different conditions, right? So if I hop on, so I'm gonna do a ride through New Zealand. So essentially what we are looking at here is a real video of the place. So I'll say the actual, like, resistance that you feel with the motors inside here is good. - [Matt] Look a little winded. - Nope, I'm fine. Is just me or is it really hot in here? Now I'm sure you're familiar with e-scooters and bikes. That is where pluspot comes in. So this is actually actively in Korea at the moment. Essentially, the way it works, this is a wireless charging bay for bikes, for scooters and whatnot. But the way it works is that you actually can get rewarded for returning your scooter. Once you load it up here, it actually is going to start wirelessly charging the scooter, and then you can see over here, number one just showed up. So it'll actually say, \"Oh, look, this is being charged.\" I then get the ability to potentially win something. You as the user get rewarded for doing the right thing and not leaving your scooter in the middle of the street. So I've been known to buy a pair of shoes or two, and I don't do a very good job of displaying it, which is what this is all about. So there's a couple of elements to this. So the Monshoecl, this is like the actual part of the booth, but this is specifically the ShoeCase. It's the LG ShoeCase. What you're getting here is a way to display one of your favorite pairs of kicks. We'll have to deodorize them and whatnot, but you can see that those are not your ordinary shoes. Oh no, my friends. That is where Monshoecl comes in. So this is the ability to get NFT versions of your shoes. So these are all actually 3D-printed. So you can see, this case actually has basically a hologram built-in where you could see and display your virtual shoes in your real case. This, my friends, is just a little look at what LG has in store here at CES 2023. And of course, huge thank you to LG for not only letting me in their booth at six o'clock in the morning but also for sponsoring this video. If you wanna learn any more about any of the things I discussed today, check out the links in the description below. I'm gonna go take a nap now. It's a lot of tech. Too much tech for six o'clock in the morning.",
    "transcript_keywords": [
        "OLED",
        "exclusive sneak peek",
        "CES",
        "display",
        "thing",
        "sleep",
        "CES Innovation",
        "OLED display",
        "sneak peek",
        "exclusive sneak",
        "essentially",
        "OLED Gaming Monitor",
        "CES Innovation Awards",
        "OLEDs",
        "tech",
        "Gram",
        "OLED Evo panel",
        "OLED Flex",
        "OLED Evo",
        "OLED Gaming"
    ],
    "transcript_entity_values": [
        "21:9",
        "Monshoecl",
        "800R",
        "New Zealand",
        "Gen Intel Core",
        "60 watt-hour",
        "97-inch",
        "Breeze",
        "90Hz",
        "2.2 pounds",
        "Connect",
        "120Hz",
        "first",
        "CES Innovation Award",
        "the LG Gram",
        "Hover Gym",
        "Korea",
        "two",
        "15.6-inch",
        "the LG Gram Style",
        "Matt",
        "LG",
        "LG Gram Ultra-Slim",
        "4",
        "Evo",
        "one",
        "0.03 millisecond",
        "CES",
        "2023",
        "90",
        "millions",
        "ShoeCase",
        "a ton",
        "six o'clock in the morning",
        "14-inch",
        "all day",
        "CES Innovation Awards",
        "a minute",
        "Zero",
        "240Hz",
        "One",
        "42-inch",
        "45GR95QE",
        "today",
        "First",
        "NFT",
        "20"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "LAW",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.05560459569096565,
        -0.01445383857935667,
        0.10296384990215302,
        -0.037835050374269485,
        0.10742828249931335,
        -0.013348271138966084,
        0.02425931580364704,
        0.012690022587776184,
        0.06249196454882622,
        -0.039456989616155624,
        0.026858791708946228,
        -0.0019852665718644857,
        0.04014836624264717,
        -0.08462873101234436,
        -0.024373121559619904,
        -0.0823676586151123,
        0.09614534676074982,
        -0.11723802238702774,
        -0.09044695645570755,
        0.0014470131136476994,
        0.05580738186836243,
        -0.02512768842279911,
        -0.023021498695015907,
        -0.013743172399699688,
        -0.0015299931401386857,
        0.021207299083471298,
        0.05060957744717598,
        -0.022228984162211418,
        0.045176662504673004,
        -0.09551941603422165,
        0.06789359450340271,
        0.1068030595779419,
        0.033352117985486984,
        0.020694833248853683,
        -0.03567362204194069,
        -0.042263757437467575,
        -0.013576137833297253,
        -0.08600160479545593,
        -0.07721864432096481,
        0.02867707423865795,
        0.061320461332798004,
        -0.06046527251601219,
        0.08950527757406235,
        -0.05956224352121353,
        -0.010624779388308525,
        -0.02684926427900791,
        -0.023094821721315384,
        -0.08287514746189117,
        0.04149538278579712,
        -0.04189622774720192,
        0.009094813838601112,
        -0.014527841471135616,
        0.013575523160398006,
        0.006277848035097122,
        -0.06492388993501663,
        -0.010798689909279346,
        0.011955645866692066,
        -0.011703353375196457,
        0.059060074388980865,
        0.045060861855745316,
        0.05165776237845421,
        0.01165561843663454,
        0.010247583501040936,
        0.07538756728172302,
        -0.003927742596715689,
        0.065272256731987,
        -0.003523135557770729,
        -0.02124805934727192,
        0.032335780560970306,
        -0.07007494568824768,
        -0.0017182262381538749,
        0.01619506999850273,
        -0.04752638563513756,
        0.07388840615749359,
        0.08331375569105148,
        0.037509407848119736,
        0.03562670573592186,
        -0.08763489127159119,
        0.04872201383113861,
        -0.056302934885025024,
        0.04650328308343887,
        -0.06703308969736099,
        -0.06120593100786209,
        0.001632220228202641,
        0.040460776537656784,
        -0.037422943860292435,
        0.05823931470513344,
        0.03536507859826088,
        0.009081565774977207,
        0.01813916489481926,
        -0.04633432999253273,
        0.07014095783233643,
        -0.11099836230278015,
        0.0745091438293457,
        0.009648021310567856,
        0.053194284439086914,
        0.022422172129154205,
        -0.05043536052107811,
        -0.019908325746655464,
        0.05439750477671623,
        -0.008933397009968758,
        0.0566401407122612,
        0.05906737223267555,
        0.013541845604777336,
        -0.0836879089474678,
        -0.1180543527007103,
        0.0692363902926445,
        0.0893823429942131,
        0.0038881886284798384,
        -0.03693528100848198,
        0.024077029898762703,
        0.006888090167194605,
        -0.052034080028533936,
        0.03781583532691002,
        -0.060819514095783234,
        -0.03991939127445221,
        -0.0027383267879486084,
        -0.029400749132037163,
        0.030393661931157112,
        -0.060884006321430206,
        0.05681653320789337,
        0.011124460957944393,
        -0.026163985952734947,
        0.0171654149889946,
        0.04860691353678703,
        0.001313976477831602,
        -0.07896142452955246,
        8.563996501990603e-33,
        0.0041599818505346775,
        0.016982218250632286,
        -0.06120774894952774,
        -0.04013398662209511,
        0.011679413728415966,
        0.05871877446770668,
        -0.05634605884552002,
        0.06095414608716965,
        -0.0002039727260125801,
        0.018004564568400383,
        -0.015131909400224686,
        0.06836462765932083,
        -0.03867734223604202,
        0.020247433334589005,
        0.03887790068984032,
        -0.055006805807352066,
        0.01622755080461502,
        -0.013526283204555511,
        -0.07007364183664322,
        -0.01965055987238884,
        -0.026153331622481346,
        0.05128410831093788,
        0.009223712608218193,
        -0.10761000961065292,
        -0.03213085979223251,
        0.061795834451913834,
        -0.017420046031475067,
        -0.014726606197655201,
        0.04511186480522156,
        0.04178854450583458,
        -0.0520908385515213,
        -0.000880486739333719,
        0.02297837659716606,
        -0.011577538214623928,
        -0.010371391661465168,
        -0.010194148868322372,
        -0.06665138900279999,
        -0.10621626675128937,
        0.05169723927974701,
        0.023397764191031456,
        -0.018863728269934654,
        0.05083369091153145,
        -0.005207024980336428,
        0.007894718088209629,
        -0.059602756053209305,
        0.16345198452472687,
        0.06863423436880112,
        0.009055695496499538,
        0.0030857676174491644,
        0.06623624265193939,
        0.04066568985581398,
        0.013863365165889263,
        -0.013669968582689762,
        -0.09539671242237091,
        0.053125884383916855,
        -0.011546201072633266,
        -0.03634249046444893,
        -0.023672986775636673,
        0.06983653455972672,
        -0.007575737312436104,
        0.0035159310791641474,
        0.1222604438662529,
        0.01266700029373169,
        0.08068230003118515,
        -0.08661346882581711,
        -0.02309281751513481,
        0.024585198611021042,
        0.05633614957332611,
        -0.0392918735742569,
        -0.008391245268285275,
        -0.014965725131332874,
        -0.05004099756479263,
        0.1118081584572792,
        -0.04364689067006111,
        0.06227169930934906,
        -0.025993483141064644,
        0.016042431816458702,
        -0.02003893256187439,
        -0.0032726561184972525,
        0.030183110386133194,
        0.029514199122786522,
        -0.04171440005302429,
        -0.017323296517133713,
        -0.07210467010736465,
        -0.035389166325330734,
        -0.021147044375538826,
        -0.02108282409608364,
        -0.03458184003829956,
        0.0050061955116689205,
        -0.02969953790307045,
        -0.0561847984790802,
        -0.041608184576034546,
        0.007479977793991566,
        0.031470607966184616,
        -0.10253822803497314,
        -9.135732709659578e-33,
        0.01899978145956993,
        0.006219042930752039,
        0.000849190924782306,
        -0.015460293740034103,
        0.04480072855949402,
        -0.026604063808918,
        0.05048464983701706,
        0.066951684653759,
        0.012059956789016724,
        -0.030732983723282814,
        0.10657718777656555,
        -0.015512337908148766,
        -0.07437760382890701,
        -0.12709848582744598,
        0.0007231621420942247,
        -0.046729471534490585,
        0.06705726683139801,
        -0.05431009456515312,
        -0.0710577666759491,
        0.008444673381745815,
        -0.019326744601130486,
        -0.009576172567903996,
        -0.0047347755171358585,
        0.028688866645097733,
        0.055891960859298706,
        0.04967878386378288,
        0.022146759554743767,
        0.04302966967225075,
        -0.05773026496171951,
        0.038343168795108795,
        -0.022342050448060036,
        -0.01315363124012947,
        -0.03725149855017662,
        0.03537130728363991,
        0.018507016822695732,
        0.0630006268620491,
        0.09888362884521484,
        -0.0157653596252203,
        -0.04390406608581543,
        -0.06758949160575867,
        -0.011400742456316948,
        -0.010506261140108109,
        -0.009087109006941319,
        0.01848510652780533,
        0.01656600460410118,
        0.03959432244300842,
        -0.020051579922437668,
        -0.05227426812052727,
        -0.03742436319589615,
        0.04305204749107361,
        0.03017600253224373,
        0.03212610259652138,
        0.016559870913624763,
        -0.023904850706458092,
        -0.03180982545018196,
        -0.019613124430179596,
        -0.016758251935243607,
        0.06456170231103897,
        -0.0012489717919379473,
        -0.02723434381186962,
        0.06989128887653351,
        -0.04287731647491455,
        -0.07478263229131699,
        -0.05376577749848366,
        -0.043574582785367966,
        -0.01432228647172451,
        0.046164337545633316,
        -0.01586524024605751,
        -0.023089174181222916,
        0.008957616053521633,
        0.031111352145671844,
        -0.08401980251073837,
        -0.11673267185688019,
        -0.10268837958574295,
        -0.02577872760593891,
        0.08019938319921494,
        0.04733455926179886,
        -0.03492287918925285,
        -0.012136993929743767,
        -0.02256760187447071,
        0.030840110033750534,
        -0.009153418242931366,
        0.05248349905014038,
        -0.028557809069752693,
        0.08167187869548798,
        0.054382167756557465,
        -0.04498465731739998,
        0.032543253153562546,
        -0.010873931460082531,
        0.05523773655295372,
        -0.06287665665149689,
        0.0400937981903553,
        -0.06545862555503845,
        0.020544709637761116,
        0.11141600459814072,
        -6.262914098442707e-08,
        -0.048617444932460785,
        -0.009751354344189167,
        0.021816058084368706,
        -0.058321259915828705,
        0.04876558110117912,
        -0.1355563849210739,
        -0.004212907515466213,
        0.002419139724224806,
        0.015528496354818344,
        -0.04628146067261696,
        0.056149598211050034,
        -0.023481469601392746,
        -0.04625461995601654,
        0.00858902558684349,
        0.12165360152721405,
        -0.01644652709364891,
        -0.15644004940986633,
        -0.015501163899898529,
        -0.06531371176242828,
        0.04371406137943268,
        -0.041887685656547546,
        -0.011274266988039017,
        0.06530384719371796,
        -0.04275990277528763,
        0.031356729567050934,
        0.04757985100150108,
        0.001043429016135633,
        0.0182054303586483,
        0.04652787744998932,
        0.0031911954283714294,
        0.024946443736553192,
        -0.0652589276432991,
        -0.039968643337488174,
        -0.0021154931746423244,
        0.0500672273337841,
        -0.04359288141131401,
        -0.05945026874542236,
        -0.02650550939142704,
        0.05668693408370018,
        0.09484321624040604,
        -0.033937007188797,
        -0.08500543981790543,
        0.046778157353401184,
        0.07284130901098251,
        -0.00949100498110056,
        -0.03077811188995838,
        0.022480877116322517,
        -0.03292658179998398,
        -0.0040747616440057755,
        -0.002122282749041915,
        -0.0029019112698733807,
        -0.08126542717218399,
        -0.08165331929922104,
        -0.012426712550222874,
        0.04898684099316597,
        -0.12304384261369705,
        0.02369394339621067,
        0.06827150285243988,
        -0.03713718056678772,
        0.010880791582167149,
        0.03868016600608826,
        -0.047655846923589706,
        -0.03314555436372757,
        0.11263680458068848
    ]
}