{
    "id": "yTINu4UQz4Y",
    "title": "Kali Linux WiFi",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-12-05T20:01:05Z",
    "video_url": "https://www.youtube.com/watch?v=yTINu4UQz4Y",
    "category": "Science & Technology",
    "tags": [
        "kali linux",
        "kali linux wifi adapter",
        "kali linux install",
        "kali linux wifi not showing",
        "kali linux wifi",
        "kali linux wifi not working",
        "kali linux wifi adapter 2019",
        "kali linux wifi 2020",
        "kali linux 2020",
        "kali linux for beginners",
        "kali linux hacking tutorials",
        "kali linux virtualbox",
        "kali linux vmware",
        "kali linux 2019",
        "kali linux 2019.4",
        "kali linux undercover",
        "kali",
        "linux",
        "kali linux tutorial",
        "packet injection",
        "wireless adapters",
        "panda wireless",
        "monitor mode",
        "wireless card"
    ],
    "views": 226760,
    "likes": 4852,
    "comments_count": 297,
    "description": "Need to get a WiFi connection working with Kali Linux? This video shows you how. I explain which network cards will work with Kali Linux and why. I show you how to fix multiple issues with Kali Linux and Wi-Fi adapters to get monitoring and injection working. In this video I am using Kali Linux 2019.4 running as a virtual machine (VM) within VirtualBox. I also demonstrate the process to get Wireless working with Kali and VMware Workstation Pro.  It's important that you as a network professional know how to protect networks. Even the new Cisco CCNA 200-301 exam covers some of these network security topics. Don't just learn the theory penetration testing, learn how to pentest practically.   Menu: Overview: 0:00 Why specific Network Cards: 0:20 RTL8812AU Chipset: 0:42 Recommended Wireless NICs to use with Kali: 1:00 Kali 2019.4 and topics: 1:20 Download Kali Linux 2019.4 2:28 Import Kali Linux into VirtualBox: 4:00 Fix USB Issues with VirtualBox Extension Pack: 5:10 Start Kali Linux: 7:43 Connect USB NIC To Kali: 9:15 Install RTL8812AU Chipset Kali Linux Drivers: 10:15 Troubleshoot Issues with USB Drivers: 12:20 Install github drivers to solve issues: 13:39 WiFi is working on Kali! 16:25 Use Kali Linux WiFi Tooks: 16:50 VMware Workstation Kali Linux Wifi: 20:30 Kali 2019.4 Undercover Mode: 21:54  ====================== Wireless cards: ====================== - Alfa Long-Range Dual-Band AC1200:  - Alfa AWUS036NHA:  - Alfa AWUSO36NH:  - Alfa AWUS036NEH:  - Alfa AC1900 WiFi Adapter:  - Alfa Long-Range Dual-Band AC1200:  - Panda Wireless PAU06:  - Panda Wireless PAU09:  - TP-Link TL-WN722N:    ====================== CCNA content: ====================== Free CCNA content:   CCNA course:    kali linux Ethical hacking Pentesting kali linux wifi  EVE-NG GNS3 VIRL Packet Tracer 10x Engineer CCNA Cisco Devnet Associate   CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!    ========================  #kalilinux #kaliwifi #kali",
    "description_links": [
        "https://amzn.to/2qquW3R",
        "https://amzn.to/38aseAi",
        "https://amzn.to/2PnyYT8",
        "https://amzn.to/2qlh4Yq",
        "https://amzn.to/2RrDqCL",
        "https://amzn.to/34UUCEL",
        "https://amzn.to/369ge02",
        "https://amzn.to/33UIqlS",
        "https://amzn.to/2PkN2wz",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKM3niunUBTLjOR4gMt_uR_a",
        "http://bit.ly/2PmTVPD"
    ],
    "transcript": "- In this video I'm gonna show you how to get wireless network adapters working within Kali Linux. In this example, I'll show you how to get a wireless network adapter running within Kali, within both VirtualBox as well as VMware Workstation Pro. In this example, I'm using an Alfa network adapter, but other network adapters are also supported. Now, there's a reason why you don't wanna use the wireless built-in network adapters in a lot of laptops: they don't support monitor mode, they don't support injection. Only certain wireless network adapters support the injection of packets onto a wireless network, as well as the monitoring of wireless networks. So you have to use specific chipsets. In this example, we're gonna be using a wireless RTL8812AU wireless chipset. This supports 802.11 AC, so much quicker wireless standard, and it also supports injection of packets onto the wireless network. I've put a list below this video of wireless network adapters that you can purchase. You could use wireless network adapters from Alfa or Panda, or tp-link, as an example. There are, as always, advantages and disadvantages to some of these network adapters. I found that this wireless network adapter from Alfa works well for my needs. Now, I'm gonna be covering quite a lot of topics in this video. Offensive Security have just released, at the time of this recording, version 2019.4 of Kali Linux. So I wanna show you how to get this version working, get it working within VirtualBox, and get it working with a wireless network adapter. The same process for getting the wireless network adapter applies to VMware Workstation Pro. So, at the end of the video, I'll show you that I've got this working in both, VirtualBox as well as VMware Workstation Pro. Now, if you enjoy this video, please consider subscribing to my YouTube channel, please like this video, and please click on the bell to get notifications when I post a new video. Now, without further ado, let me show you how to get wireless working within Kali Linux, running within VirtualBox or VMware Workstation on a Windows 10 laptop. I've been in your waters I thought you were my love I know one thing for sure Okay, so the first thing is we need to download the latest release of Kali Linux. So I'm gonna go to kali.org, I'm gonna go to Downloads, Download Kali Linux, I'm gonna scroll down and in this example, I'm gonna be running Kali as a virtual machine in VirtualBox. So I'm gonna be using the 64-bit version of Kali. You could use VMware, if you prefer. I've been able to get this working in both, VMware Workstation Pro as well as VirtualBox, so you could use either. So, again, the Kali Linux 64-bit VirtualBox OVA is available on the Offensive Security VM download page. So go into that page, I'm going to select VirtualBox, and download the 64-bit version. The OVA is now downloading. The reason why I wanna get the 64-bit is my computer is running Windows 10, 64-bit operating system. It's an Intel i7 processor with eight gig of RAM. I've enabled nested virtualization in the bios of this computer, so I can use the 64-bit version of Kali. If you don't have nested virtualization support on your laptop, you'll need to use the 32-bit version. Use this link, if you wanna see how to enable nested virtualization in the bios of your computer. Now, once you've downloaded the OVA, you can import it into VirtualBox. So, in this example, we can see that Kali Linux 2019.4, VirtualBox, amd64bit, OVA has been downloaded. So what I can do now is start VirtualBox. So I'm gonna click on Oracle VM VirtualBox. Now, I've previously imported an older release of Kali Linux, as well as Ubuntu18.04. In this example, I'm gonna go to File, Import Appliance, I'm going to click Choose a virtual appliance file to import. I'm going to browse to my Downloads directory, select the OVA that I downloaded, click Open and click Next. A summary of the appliance settings is displayed. I'm gonna leave most of the settings at default. So, in this example, I'm simply gonna click Import, to import the appliance into VirtualBox. So all you need to do now is wait for the appliance to import. Okay, so as we can see, the appliance has been imported. Before you start up a virtual machine in VirtualBox, verify the settings. So I'm gonna click on settings, and notice we're told that there are invalid settings detected. We're told that USB 2.0/3.0 is currently enabled for this virtual machine. However, this requires the Oracle VirtualBox extension pack to be installed. Please install the extension pack from the VirtualBox download site, or disable USB 2.0/3.0 before you start the machine. So if I go to USB, I can either set the USB to version 1.1, which means I don't need the extension pack, or I could use USB 2.0, which is what the OVA has been configured to use, but that requires the extension pack. On the VirtualBox website, we're told that the VirtualBox Extension Pack Personal Use and Evaluation License governs your access to and use of the VirtualBox extension pack. It doesn't apply to the VirtualBox base package or its source code, which is licensed under the GNU General Public License. VirtualBox is open-source software, but the VirtualBox extension pack isn't. This is closed-source software or proprietary software. So, basically, you can use it for personal use or as evaluation software, but you can't use it permanently for commercial use. But make sure that you read the license carefully. And if you want to use this software, go to virtualbox.org, click on Downloads, and then download and install the extension pack. So I'm gonna click on the All supported platforms link. We're told, once again, that this license is different to the open-source license that applies to VirtualBox. Okay, so my VirtualBox extension pack is downloaded, I'll double click on the file, and then I'll click Install to install the extension pack within VirtualBox. We're asked to read the license once again, you need to accept that. The extension pack has now been successfully installed. So now, when I click on Settings, notice we no longer receive an error when using USB 2.0. I no longer have to use USB 1.1, I can use 2.0, which is better, and that's the setting that the OVA used. So now, I can click Start, to start up Kali Linux. And, as you can see, it's now booting up. The interface looks very different to previous releases. I'm gonna log in as root and default password of T-O-O-R. So root spelled backwards, which is the default for this virtual machine. Again, very different interface to the previous release. I'm gonna click on Terminal to open up a terminal. So here's my terminal. The font is very small, I'm gonna go to File, Preferences, and what I'll do is change that font. So I'll make it 18 so that it's easier to read. Type ifconfig, notice we don't see anything but an ethernet interface and a loopback currently on this virtual machine. So I now wanna install adapters. Now, if I plug in my wireless adapter, Windows has recognized it. So if I go to Control Panel, Network and Internet, Network and Sharing Center, Change adapter settings, I now have this external network adapter, but it's being managed by Windows, notice USB network interface card. So what I'll do here is shut down Kali, and go to Settings, go to USB, and click plus. And what I wanna do now is get VirtualBox to control this external network adapter. So it's now gonna be used by the virtual machine, rather than by Windows, and what I'll do now is start up VirtualBox once again. In Windows, we can see that the network adapter is no longer used by Windows. It's now being used by the virtual machine. So log in as root, I'll open up a terminal, ifconfig, notice we still only have an ethernet zero adapter and a loopback adapter, even though this virtual machine is controlling this wireless network adapter. So what I'm gonna do is, essentially, follow the instructions on the 2017.1 release, and use apt-get update and apt install. So I'll use apt update to update references. And then, apt install, and, once again, it's a realtek-rtl adapter. So realtek, and I'll type rt tab to auto-complete, and press Enter. Software is now being downloaded and installed. Now, one thing I've noticed with this release, running within VirtualBox, is I get a lot of flicker on the screen. Not sure if you can see that, but there's quite a bit of flicker when moving around from one window to another, but hopefully it's not affecting the video, but you may encounter that when using this release within a virtual machine on Windows 10. Okay, the installation has completed, but notice I'm getting an error. Failed to attach USB device Realtek 802.11 NIC to the virtual machine. So what I'm gonna do is unplug the USB connection and what I'll do now is plug it back in again. I'm gonna type ifconfig. Notice I still don't have the wireless adapter showing within Kali. I'll unplug it again, plug it back in. So I'm having some errors at the moment. So what I'll do is shut down Kali, and shut down VirtualBox. And then, I'll start it up again. And then, boot up Kali Linux again. You may sometimes have these issues. So I'm gonna log in as root again, open up a terminal window, type ifconfig, and, as you can see, I still don't have my virtual card, so I'll unplug it and plug it back in. Type ifconfig now. So, at the moment, I'm having issues with USB version two, even though I removed the USB and plug it in, VirtualBox is having an issue connecting that to the virtual machine. So what I'm gonna do is go back to USB version 1.1. So I'll shut down the virtual machine, go to Settings, so what I'm gonna do is go back to USB 1.1 and click OK and then start up the virtual machine. It's better to use USB 2.0, but I'm gonna revert back to 1.1 in this example, because I'm having issues with version 2.0. I'm gonna log in with my username and password. I'll remove the USB adapter, plug it back in, open up a terminal, type ifconfig. No error at the moment, but I'm not seeing the network adapter. So what I'm gonna do now is revert back to a back-up plan, to get this working. And, to do that, I'm going to download additional software from GitHub. So I'm gonna open up a web browser, and I'm gonna browse to github.com, go to aircrack-ng, and get to the driver for this chipset. So I wanna get this driver, rtl8812au. That's the driver that we downloaded originally using Kali, but I'm having issues with that driver, so I'm gonna click on Clone or download, and I'm going to download the zip file. So I'm downloading different drivers from GitHub onto my virtual machine. And I'm gonna save those drivers to the local computer. The software is downloaded. I'm gonna go to File Manager, go to Downloads, I'm gonna right click on that zip file, and I'm gonna click Extract Here, the file contents has now been extracted. So in my terminal window, I'm currently in my home directory, ls shows me that I have a Downloads directory, so I'll move to that. So cd Downloads, ls shows me the directories, so I'll move to that directory and I'm now gonna run this script to install the software. So ./dkms-install .sh. You now simply need to wait for this new driver to be installed. It may take it a while, so go and grab a coffee or something while you wait, but, as you can see there, the build has completed, the driver has been installed, ifconfig shows me that I still don't have a wireless network adapter. But what I'm gonna do here is restart networking. So restart networking, so systemctl restart networking, and I'm gonna restart network-manager. ifconfig, notice we still don't have that network adapter. So what I'm donna do is plug it back in again, ifconfig, not working, I'll shut down Kali again, and restart it. Wireless adapter's now associated with Windows, but what I'll do is restart the Kali Linux virtual machine. I'll log in once again as root, open up a terminal, ifconfig, it's taking it a while now, that's a good sign, so hopefully it's picked up on my wireless network adapter, and there you go. Notice, wlan0 is available within Kali Linux, running within VirtualBox on my Windows 10 computer. Okay, so again, ifconfig, that's what we wanna see, but now we wanna try and do something with this network adapter. So I'm gonna use airmon-ng, check kill. This process has now been killed. And we're gonna use iwconfig wlan0 mode monitor to set the mode to monitor. I'll bring the interface up again, so ifconfig wlan0 up. ifconfig shows me my wireless lan interface once again. And let's use airodump-ng wlan0 and notice we can now see wireless networks. So, as an example, ABC1 is my wireless network. Here's my Windows computer connected to that wireless network, using its built-in wireless network adapter. The USB wireless network adapter is no longer connected to Windows. It's connected to my Linux virtual machine, running within VirtualBox. We can see as an example the BSSID, we can see the cipher used, we can see that the authentication is Pre-Shared Key. And we can see the actual SSID name. So I'll stop that, let's run aireplay-ng, press Enter, you need to spell that correctly. Notice one of the options we have here is test injection. So we can use minus nine, if we prefer, or we can use test, like this, to test whether we can use wireless injection with that network card. Notice injection is working, two APs have been found. I've now shown you that I can successfully use this external USB wireless network adapter within Kali Linux, running within VirtualBox on a Windows 10 laptop. Once again, ifconfig shows me that my wireless network adapter is available within Kali Linux. Now, this is only the beginning. I've shown you how to successfully connect an external wireless network adapter to Kali Linux, running within VirtualBox. I had multiple issues getting it working, and I've shown you some work-arounds, including the fact that in this example I had to revert back to using USB 1.1. You may have better luck using USB 2.0. So that being said, actually, let's shut down this virtual machine, and let's change it to use USB two and see if that works better this time around, now that I've installed drivers from GitHub. Okay, virtual machine is booted up, I'll log in, open up a terminal, ifconfig, that looks a lot better. Notice I've got wireless lan zero. So look at my history, I could, as an example, run command 38, airodump, and notice I'm able to discover wireless networks once again in this example when using USB 2.0. I'll cancel that and let's test whether injection works on this wireless network adapter. Notice injection is working on this wireless network adapter. So try and use USB 2.0, if you have issues then revert back to USB 1.1. Now, I'll shut down this Kali Linux host. I wanna show you that you can do something very similar with VMware Workstation Pro. So I'll start up VMware Workstation Pro. Here's my 2019.4 Kali Linux host, I'll power the host on, so, under VW, Removable Devices, this device has now been connected to this virtual machine. So it's no longer connected to VirtualBox, because that VM has been turned off. So in my VMware virtual machine I'll log in, here's my terminal, ifconfig shows me that I have that wireless network adapter available within VMware Workstation Pro. So I can find out my networks, and, as you can see there, I'm able to discover the same networks using VMware Workstation Pro, that I was able to discover using VirtualBox. VMware, by default, supports USB two. So the virtual machine is using USB two, and VMware Workstation Pro supports that by default. My personal preference is to use VMware Workstation Pro, however that's paid software, so you may prefer using VirtualBox, which is free. Now, while we're here, let me show you one of the cool options available in this release of Kali Linux, which is Undercover Mode. If you're used to previous releases of Kali, you'll notice the interface is very different. But I can, by simply selecting that option, make my computer look like a Windows 10 host. So here's my real Windows 10, and here's my so-called Windows 10 running within a virtual machine, but it's actually Kali Linux. So if I click on the web browser, which looks like Internet Explorer, it's actually gonna run Firefox. This is not Internet Explorer, it's the Firefox built into Kali. So if I go to Help, as an example, you can see that this is Firefox. All the tools are available here. So we have, for instance, Sniffing and Spoofing, Wireshark, and this looks very much like Windows. We have a Windows skin here, including File Explorer. So applications like Wireshark, look like Wireshark on Windows, and my file manager looks like Windows, so going to Downloads, it looks like Windows, but it's actually Linux. If you wanna disable that, open up a terminal, terminal still looks like Linux, and type kali-undercover, and what you'll notice is my menu has changed, I'm back to a Kali shell, rather than a Windows shell, but I could simply type that command again, and what you'll notice is the start menu will change to a Windows start menu. So there you go. I've shown you a lot of options in this video. If you enjoyed this video, please subscribe to my YouTube channel, please like the video and please click on the bell to get notifications. I'm David Bombal and I wanna wish you all the very best. I've been in your waters I thought you were my love I know one thing for sure",
    "transcript_keywords": [
        "Kali Linux",
        "wireless network adapter",
        "Kali",
        "wireless network",
        "network adapter",
        "USB",
        "VMware Workstation Pro",
        "network",
        "Linux",
        "Windows",
        "Workstation Pro",
        "wireless",
        "VirtualBox",
        "virtual machine",
        "Download Kali Linux",
        "USB wireless network",
        "adapter",
        "Kali Linux virtual",
        "Kali Linux host",
        "VMware Workstation"
    ],
    "transcript_entity_values": [
        "first",
        "realtek-rtl adapter",
        "airodump",
        "Oracle VM VirtualBox",
        "airmon-ng",
        "Linux",
        "Realtek 802.11 NIC",
        "minus nine",
        "USB",
        "BSSID",
        "Removable Devices",
        "VirtualBox",
        "32",
        "VMware Workstation Pro",
        "Oracle VirtualBox",
        "AC",
        "Pre-Shared Key",
        "donna",
        "ABC1",
        "USB 2.0",
        "File, Import Appliance",
        "VW",
        "64",
        "two",
        "airodump-ng",
        "Wireshark",
        "eight",
        "Windows",
        "Control Panel",
        "1.1",
        "USB 1.1",
        "Alfa",
        "APs",
        "YouTube",
        "aircrack-ng",
        "Downloads",
        "File Explorer",
        "Kali",
        "Linux",
        "SSID",
        "2017.1",
        "Explorer",
        "one",
        "Linux",
        "VMware",
        "RAM",
        "GitHub",
        "Intel",
        "2019.4",
        "Windows 10",
        "Kali Linux",
        "Panda",
        "Wireshark",
        "Windows",
        "USB 2.0/3.0",
        "VM",
        "David Bombal",
        "Firefox",
        "38",
        "VMware Workstation",
        "2.0",
        "18",
        "Terminal"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.03143998980522156,
        0.04388226196169853,
        0.0012442535953596234,
        0.063210628926754,
        -0.009730588644742966,
        0.035074420273303986,
        -0.029759908095002174,
        -0.03925458341836929,
        -0.07291410863399506,
        -0.005866921506822109,
        0.06400451809167862,
        -0.03547970578074455,
        -0.05060374364256859,
        0.004012741148471832,
        -0.01655380241572857,
        -0.02611985243856907,
        0.06216307729482651,
        -0.02988671325147152,
        -0.004443585406988859,
        -0.022144876420497894,
        0.010464664548635483,
        -0.002334392163902521,
        0.058250658214092255,
        -0.024526087567210197,
        -0.036539845168590546,
        -0.049630239605903625,
        0.09340133517980576,
        -0.00022372872626874596,
        0.0012059088330715895,
        -0.018963880836963654,
        -0.0028326818719506264,
        -0.002593575743958354,
        -0.05409141257405281,
        0.0036893868818879128,
        -0.0692514106631279,
        -0.10631502419710159,
        -0.04324657842516899,
        0.03788531571626663,
        0.0414670966565609,
        -0.03821605443954468,
        -0.0595477893948555,
        -0.10482245683670044,
        -0.07699398696422577,
        0.0584942102432251,
        0.04021428897976875,
        -0.07959415763616562,
        -0.02963460236787796,
        0.04463285207748413,
        0.03570149093866348,
        -0.05292766913771629,
        0.008938171900808811,
        -0.023197481408715248,
        -0.028892677277326584,
        0.0414864718914032,
        -0.022596169263124466,
        -0.09417696297168732,
        0.0018995102727785707,
        0.012928465381264687,
        0.08167729526758194,
        -0.03992906212806702,
        0.029103267937898636,
        -0.014085891656577587,
        -0.04333554580807686,
        0.020983660593628883,
        -0.03312968835234642,
        -0.04485412687063217,
        0.035018134862184525,
        0.10810889303684235,
        -0.019812380895018578,
        -0.03360895812511444,
        -0.05706825479865074,
        0.08726707845926285,
        0.031348951160907745,
        0.028520960360765457,
        0.06252045184373856,
        0.06529772281646729,
        -0.03167489916086197,
        -0.022110097110271454,
        0.048980552703142166,
        0.05953999608755112,
        0.0940290167927742,
        0.07523394376039505,
        0.030967559665441513,
        -0.05018750578165054,
        0.02793949283659458,
        0.05807314068078995,
        -0.033725421875715256,
        0.02728373557329178,
        0.006176350172609091,
        -0.10358419269323349,
        0.04622279852628708,
        0.060962628573179245,
        -0.05392599478363991,
        0.050920017063617706,
        0.10889019072055817,
        0.03717819228768349,
        -0.07851243764162064,
        -0.03251279890537262,
        -0.015063604339957237,
        0.02019226923584938,
        -0.039691612124443054,
        -0.059110481292009354,
        -0.024740558117628098,
        0.02948305383324623,
        0.009844553656876087,
        0.06086800992488861,
        0.06649017333984375,
        -0.0639505535364151,
        0.03735945373773575,
        0.055959537625312805,
        -0.01839381456375122,
        -0.009757058694958687,
        -0.04548689350485802,
        -0.0752076804637909,
        -0.003597653703764081,
        0.05051910877227783,
        -0.014957810752093792,
        0.08389005810022354,
        0.055740948766469955,
        0.030903328210115433,
        -0.024647453799843788,
        -0.013059149496257305,
        -0.014339483343064785,
        -0.0391705147922039,
        0.05380741506814957,
        -0.027352282777428627,
        -0.009338653646409512,
        6.254262509272106e-33,
        0.029104335233569145,
        0.04273030906915665,
        -0.05991997942328453,
        0.051647718995809555,
        0.07364723086357117,
        -0.140205979347229,
        0.02593173086643219,
        -0.049967605620622635,
        -0.08954653143882751,
        0.06395214796066284,
        -0.025332331657409668,
        -0.05060293897986412,
        -0.09174323827028275,
        0.007094234228134155,
        0.07713925838470459,
        0.036139603704214096,
        -0.03701615333557129,
        -0.011015241965651512,
        0.0184401236474514,
        0.1310959756374359,
        0.020045146346092224,
        -0.08591607958078384,
        0.03919702023267746,
        -0.009877447038888931,
        0.082595594227314,
        0.04258072003722191,
        -0.05893111601471901,
        -0.05023093894124031,
        0.018423860892653465,
        0.012659731321036816,
        -0.07964830845594406,
        -0.02743273228406906,
        -0.023856695741415024,
        0.010113758035004139,
        -0.05189685523509979,
        0.011523092165589333,
        -0.06273866444826126,
        -0.010696792043745518,
        -0.04662153869867325,
        -0.049699168652296066,
        0.016842463985085487,
        -0.009978646412491798,
        -0.05833379924297333,
        -0.03853587433695793,
        0.10945652425289154,
        -0.07139904797077179,
        -0.006237080320715904,
        0.05451924726366997,
        0.040482379496097565,
        0.10745401680469513,
        -0.07388807088136673,
        -0.05572815239429474,
        -0.037221603095531464,
        -0.008703175000846386,
        0.0008883729460649192,
        0.03363414853811264,
        0.031402770429849625,
        0.02287481166422367,
        0.01842604950070381,
        0.06762368977069855,
        -0.08311773091554642,
        -0.01771588996052742,
        -0.02622857317328453,
        -0.00531489634886384,
        -0.01742871291935444,
        -0.04331248253583908,
        -0.07627373933792114,
        -0.004580680280923843,
        0.029268084093928337,
        0.018470894545316696,
        -0.06278273463249207,
        -0.034552235156297684,
        -0.038433417677879333,
        -0.013158516958355904,
        -0.017754293978214264,
        -0.012905937619507313,
        0.03643270209431648,
        0.030452582985162735,
        -0.03211790695786476,
        -0.015662461519241333,
        0.06677117943763733,
        0.01614505611360073,
        0.05237652733922005,
        0.0035200773272663355,
        -0.006571075413376093,
        -0.08133852481842041,
        0.018099207431077957,
        -0.0485588014125824,
        0.06470666825771332,
        0.014415433630347252,
        0.06068681925535202,
        0.0940668135881424,
        0.03451251611113548,
        0.024848392233252525,
        0.02313266135752201,
        -6.731101792683167e-33,
        0.008885460905730724,
        0.07724806666374207,
        0.022368675097823143,
        0.014707374386489391,
        -0.025730542838573456,
        -0.049304407089948654,
        -0.007655718829482794,
        0.021319877356290817,
        0.027629965916275978,
        -0.05519482120871544,
        -0.03630824014544487,
        -0.009552962146699429,
        0.004967739339917898,
        -0.0036368658766150475,
        -0.02481689490377903,
        -0.0598764605820179,
        0.023122156038880348,
        -0.07432518154382706,
        -0.011135103181004524,
        -0.024858055636286736,
        0.00010122129606315866,
        0.19441387057304382,
        0.0012664564419537783,
        -0.04870638623833656,
        -0.04314390569925308,
        -0.04095445200800896,
        0.06595250219106674,
        0.04799218103289604,
        0.0026532940100878477,
        0.05169302597641945,
        0.004103091079741716,
        -0.041683923453092575,
        0.1019136980175972,
        0.06414437294006348,
        0.08711032569408417,
        -0.008605304174125195,
        0.13676448166370392,
        0.06112870201468468,
        0.03356321528553963,
        0.01993362233042717,
        0.10789623111486435,
        0.059684012085199356,
        -0.10701259225606918,
        -0.06283491849899292,
        0.02949710190296173,
        -0.046738289296627045,
        0.05422729253768921,
        0.018629005178809166,
        -0.072275310754776,
        -0.1038607507944107,
        0.0919918417930603,
        -0.014367984607815742,
        -0.04918072372674942,
        0.04693962633609772,
        -0.011660843156278133,
        0.027659686282277107,
        0.013032260350883007,
        -0.020961225032806396,
        0.04028671979904175,
        0.0650939792394638,
        0.02747870609164238,
        -0.03155789524316788,
        -0.01579827070236206,
        0.05478404462337494,
        0.002683530794456601,
        -0.05795219540596008,
        -0.07266725599765778,
        0.007494668941944838,
        0.026425719261169434,
        0.017177274450659752,
        -0.11758506298065186,
        0.023608911782503128,
        0.03430594503879547,
        0.024058258160948753,
        0.07434236258268356,
        0.006053468678146601,
        -0.00393163226544857,
        0.016772828996181488,
        -0.028236214071512222,
        0.0412437804043293,
        -0.04504324868321419,
        -0.0005984549643471837,
        -0.061731088906526566,
        -0.01778176613152027,
        0.000632063951343298,
        0.08752233535051346,
        0.014944502152502537,
        -0.04946495592594147,
        -0.0067127239890396595,
        -0.04197908192873001,
        -0.09348300099372864,
        -0.04354749992489815,
        -0.01882537640631199,
        0.059526920318603516,
        0.012191246263682842,
        -4.9841233362712956e-08,
        0.006217803806066513,
        0.07676535099744797,
        -0.03299620375037193,
        0.011414491571485996,
        0.003275454044342041,
        -0.0009699779329821467,
        0.0799126997590065,
        -0.13373218476772308,
        0.009884022176265717,
        0.08982193470001221,
        -0.05521178990602493,
        0.05888036638498306,
        -0.05636310949921608,
        0.03589710220694542,
        0.07100456207990646,
        0.00948640052229166,
        -0.053983889520168304,
        -0.0019224381539970636,
        -0.04173359274864197,
        -0.01111333817243576,
        0.0791962519288063,
        0.023420991376042366,
        0.020799409598112106,
        0.005863639060407877,
        -0.0007733886013738811,
        0.03646098077297211,
        0.06785328686237335,
        -0.0266109611839056,
        -0.07848269492387772,
        0.07405447959899902,
        -0.08090850710868835,
        -0.002479477785527706,
        -0.06700648367404938,
        0.019390413537621498,
        -0.04620246961712837,
        0.04232728108763695,
        -0.04130145162343979,
        0.025200864300131798,
        0.04120248183608055,
        0.043084993958473206,
        -0.13971032202243805,
        -0.0870102122426033,
        0.01269884966313839,
        -0.07248205691576004,
        -0.05396094173192978,
        -0.011585087515413761,
        -0.05064935237169266,
        0.014719772152602673,
        0.013514102436602116,
        -0.01951124332845211,
        0.05719202011823654,
        0.011338070034980774,
        -0.04650590196251869,
        -0.07753590494394302,
        -0.01282587181776762,
        0.034710079431533813,
        0.08382123708724976,
        -0.011798685416579247,
        -0.010501832701265812,
        -0.05438515171408653,
        0.03375207632780075,
        -0.03670908510684967,
        0.050120141357183456,
        -0.02152593806385994
    ]
}