{
    "id": "ytPbm1RczCI",
    "title": "The BIGGEST vs SMALLEST Gaming PC",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-09-28T15:05:53Z",
    "video_url": "https://www.youtube.com/watch?v=ytPbm1RczCI",
    "category": "Science & Technology",
    "tags": [
        "pc",
        "gaming pc",
        "pc build",
        "mryeester",
        "mr yeester",
        "micro center",
        "microcenter",
        "biggest",
        "largest",
        "smallest",
        "tiniest",
        "austin",
        "austin evans"
    ],
    "views": 501206,
    "likes": 18913,
    "comments_count": 543,
    "description": "Shop Top Deals:  Overland Park Home Page:  New Customers Exclusive - Get the Creality Ender 3d Pro for $99 after coupon:  Submit your Build to Micro Centers Build Showcase:    Shop AMD Ryzen 5 5600G:  Shop Gigabyte X570SI Pro AX DDR4 AMD AM4 Mini-ITX Motherboard:  Shop Corsair Vengeance LPX 16GB DDR4 RAM:  Shop PowerSpec 650W Power Supply:  Shop PowerColor AMD Radeon RX 6500 XT ITX GPU:  Shop Crucial P3 Plus 500GB M.2 Internal SSD:  Shop Cooler Master MasterAir RGB CPU Cooler:    Additional Parts:   Inland iK100 USB Keyboard:  Inland PSU Sleeved Extension Kit:  iFixit 64 Bit Driver Kit:  GAEMS Vanguard Personal Gaming Environment:  NTE 9.84ft Flexible Neon EL Wire 2.33mm:  NTE Electronics Wire Batter Power Supply AA Batteries:  NTE Electronics Switch Round Pushbutton:  Schmartboard Inc. 9 Male to Female Jumper Wires with Headers:  Inland HDMI Male to HDMI Male 24k Gold Plated Ethernet 12ft:  Duracell 4-Pack AA Rechargeable Batteries:   Shoutout to @mryeester for holding it down on camera with me!  Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 The PC Challenge Begins 1:41 Building the Gaming PCs 4:37 The \"Secret\" Weapon 5:57 Things Get Dangerous 7:45 Teamwork Makes the Dream Work 9:42 Austin Says the Word \"Sack\" Too Much 11:08 Which PC is Better?",
    "description_links": [
        "https://micro.center/00c",
        "https://micro.center/r10",
        "https://micro.center/4iz",
        "https://micro.center/6yf",
        "https://micro.center/x30",
        "https://micro.center/5b2",
        "https://micro.center/j5u",
        "https://micro.center/hb6",
        "https://micro.center/73g",
        "https://micro.center/ojb",
        "https://micro.center/wip",
        "https://micro.center/f27",
        "https://micro.center/96q",
        "https://micro.center/nm5",
        "https://micro.center/yxo",
        "https://micro.center/6ho",
        "https://micro.center/dzv",
        "https://micro.center/u6t",
        "https://micro.center/9ys",
        "https://micro.center/n4p",
        "https://micro.center/fe9",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hello, my friends and welcome to a very special occasion. We've traveled all the way out to Overland Park, Kansas, to visit our sponsors at Micro Center for one simple challenge. I'm going to build the greatest gaming PC known to mankind. - Now, hold up. If you're gonna build the greatest PC, then I'm gonna put you up to the challenge and try to best you. - That's impossible. We have to build PCs and they're going to live here. (button clicking) Oh, look at that. (button clicking) - How convenient. - Whoa, whoa, whoa. - If you would like to come into the Overland Park store before October 2nd, you can come and vote on our builds in person. I think I need to get some ideas, so. - Yes, I agree, and I actually, I have some seeds planted in my brain. I'm just here to build the most ridiculous PC as I can. - [Austin] If you do not follow mryeester, you're probably unaware of his ridiculous nonsense. Hmm. - Are we going straight for the RGB? Is this how you're gonna try to win people over? (blowing raspberry) - Hey, I hear super glue makes great thermal paste. You should try that. - You know, I actually have in the past and it does work much better than you'd expect. Don't try that at home. Really hard to take off. So these are ATX standoffs. So these are the normal size standoffs that a computer would normally have underneath the motherboard. But I have an idea that's gonna take this maybe times 20 or times 50. - They also have a lot of graphics cards. The thing is, we're not doing a straight gaming test. It doesn't matter to performance by a huge amount, right? We're just trying to impress people. It's much more so about the aesthetic than the um. - Performance. - [Austin] as we look at the cases. (button clicking) - Whoa, I'm just gonna give him some extra help too. (button clicking) He needs it. - Oh this, look at this little guy. I never built this before. Thermal tape. I need to find something even smaller though. I feel like I need to find something almost suspiciously small. My genius foolproof plan is in full effect. Adam, would you like to see what I've got here? - I would love to see, Austin. - How do you feel about GAEMS? - I love GAEMS. - GAEMS. I'm going to attempt to build my entire gaming PC in a GAEMS VANGUARD case. Yeah you usually have a PS3 in there, or an Xbox Series S. - Oh, so you're gonna put your whole entire motherboard and stuff where this PlayStation is currently? - Yep. - I think we have something cooler over there. - Oh, by all means. - I'm thinking, if I wanna build the biggest PC as possible, why not build upwards? Look how much ceiling space we have here - That's pretty tall. - And so I brought this secret, secret ingredient. These standoffs are probably 20 to 30 times taller than your normal motherboard standoff. - Are you gonna daisy chain them? - I'm going to stack them as high as possible without the computer falling over. I do need to have some type of base to build my computer. - And this is the base you chose? It says two person lift. - Well, you know that that PC gym we were talking about? It's in full effect. This is the biggest case that I've ever dealt with. - Look, I get it. I get it. You need to compensate. I'm not gonna judge. - We are ready to go. - Fair fight. - Good luck, sir. You're gonna need it. - You don't need this anymore though. - Oh, I don't need a CPU? - No. I've decided that I'm gonna go for my dual CPU set up. But anyway, fair fight. Best of luck, my friend. - I don't have a CPU. - The number one thing I need to do is actually get my case out. I'm hopeful that I will have enough space to actually work in, 'cause that's really gonna decide almost everything from this point on. I've tried to pick the smallest components that I can. I may have more space than I think though. Uh oh. (chuckling) - There's some instructions here for Xbox and PlayStation. Where's the PC instructions? - Instructions? Where we're going, we don't need instructions. - Oh my gosh. I may have bit off more than I can chew. This case has like 200 parts to it. This is the third layer of styrofoam. - So vaguely think about it like this. Motherboard here. Running extra cables, I can just slit a hole in the back here to run any cables in or out. And I can just kind of cinch this up. The good thing about this is that the actual PC part is really straightforward. I've got my X570 AORUS PRO AX board, which importantly is an ITX board. And I'll have you know, I grabbed it off of the clearance section, because our good sponsors Micro Center, I gotta make sure I'm repping their terrific deals available every day, but also specifically here at the Overland Park store. - My case has too many parts. - Can I remind you that our flight leaves and about four and a half hours? - Oh, no pressure's on. - All right. Adam, you got your system done yet? - I got the case up, so I'm just gonna install as much as I can into the motherboard before I can't reach it anymore. That'll include the SSD. We'll install this into the slots, and then we'll install the RAM, the CPU, plop on the cooler, and then upwards and onwards we go. Whoa. - What happened there? - Fighting words. So I'm also using a Ryzen 5 5600, and I am actually gonna use the pre-applied thermal paste, but I'm gonna spice things up a little bit. Somewhere with me, I have brought an inconspicuous little baggy, and this is the secret formula for beating Austin over there. - Hey your secret, what? - Oh no, sorry, what? Are you over in your section? You can. - No, I'm good actually. - Oh, oh, okay. But this here is 22 carats of finally grained diamond powder. And if you're unaware, diamond has some of the highest thermal conductivity of all non metals. And thermal paste's job is to have really high thermal conductivity. And so I'm going to add a little pinch of diamond powder into my pre-applied thermal paste to help increase the thermal performance of the core. - That's either genius or the most ridiculous thing I've ever heard. - Why not both? Don't try this at home, kids. Drop in a few little bits of diamond, just like that. We are on the CPU. Let's go. - Look at this though. Look at my little baby 6500 XT. So a big reason why I chose this card is 'cause it had ITX on the box. And look, it's small. I mean, everyone knows the 6500 XT is the greatest card that AMD have ever created. Who needs more than two display outs? Am I right? At least it's very lightweight. So there we go. Does that look dumb? That doesn't look dumb, right? Are you getting a ladder? - It's an essential part of building a PC. - Oh my God. (laughing) - Is this not? - That's illegal. - Is this not what yours looks like? What are you doing over there? - I'm calling the police. - They're gonna have to get me down from up here. - [Austin] If you breathe on it though, you're gonna snap something. - Yeah, if you could walk carefully around here. - No, no, you know what? I wanna see this. - All right, so. - You ready? - Yes, so I need. - Which orientation do you want? This way? - This side up here, yep. - Okay. Hey Adam, you know, you didn't have to pick such a heavy motherboard that I'm gonna have to hold over my head for the next 10 minutes. - I just, I really wanted to make you sweat. - Can I just point out that there's a growing group of people waiting for this to collapse who just are coming to spectate? The train wreck is incoming. - Yeah, here's the moment of truth. Yeah, let's go. - [Austin] None of these are straight. - Hey, but at the end of the day, it's standing. But now we still have to plug in a graphics card and all of the power into it. - What's this we? No, please don't touch. (laughing) This is gonna be the caution tape, 15 feet around. - While Adam is building the leaning tower of questionable, I am ready to do my first test boot. I want to, before I do anything more final, actually just make sure everything will fire up and work correctly. Otherwise, I'm gonna be in some trouble. Fire up the games. Power supply on. Oh. (sighing) I was stressed there for a second. Okay, so we've got fan action. I've got RGB on the bottom of the board. I forgot that that was there. Please post. Please post. Post, post, post, post. I wouldn't need to update the bios, would I? No signal. (groaning) - [Adam] What's happening over there? - Nothing at all. - [Adam] What was that? - That was an excited exclamation of brilliant happiness. (chuckling) Oh! - [Adam] Never mind, we're good. - Again, very excited. Very excited right now. Very excited. That was the longest post I've ever had in my life. (laughing) So Adam's having a little problem, in that this is very wobbly. 'Cause there's nothing really drilling it in, right? I can screw it all I want. - I'm gonna take two off of here. I wonder if we can just put one underneath that'll kind of pinch it together. - Oh, that's a terrific idea. - All right, yeah, this is. Okay, look at this one. This one's much more stable. One off the top. Put it at the bottom. - [Austin] Yeah, that is. - We're making it work. We're making it work. - The main hurdle of this thing not working is done. Now, it's really going to be about bringing more of the wow factor. The question is, do I need to add more danger to my system? Do I need to add some confidence? Adam. - Hello, sir. - Is your monitor being held up by your graphics card, which is dangling from a riser? - Yeah, they typically say you're between a a rock and a hard place. Here, you're between a graphics card and standoffs. It's just to see if it's possible. - Okay. - How many of these PCs have you seen in the past? - None. - I haven't seen any. - Zero. - So. - Zero. - We're gonna see if it's feasible. - Is this what it's gonna look like? Are you, this is it? - I mean, I'm gonna make sure it works first. - Okay. - And then, we'll see if we can tidy up the cables. - Smart move, smart move. - Lights are on. Is it spinning? It's spinning. - Something's happening. Graphics card's also spinning. - Oh, cycling. - Okay. - Cycling. - You just have to think about it. - Cycling one more time. I might be able to just try to plug the graphics card top. - Directly in, yeah. - Yeah, let's give that a shot. We will make this work. - I shouldn't be helping you right now. - Yeah, you shouldn't. Get outta here. - I'm now going to have to pick my best thermal pace pattern with the thermal pace master. - I will be judging you. - Should I do a grain of rice? I hear that's the best way of doing it, right? - [Adam] Well if you want to be fancy, you could do a smiley face. - All right, I'm gonna do a smiley face. Do, do, do, do, do, do, do - [Adam] Hey. - [Austin] His eye's a little small. - [Adam] He's winking at ya. - [Austin] There we go. I'm happy that I'm gonna win this competition. - I don't know why you're so confident. - I'm not confident. - Have you seen that over there? - I have seen, you've got Patrick. (laughing) - [Adam] Patrick typically lives under a rock, but today, he's upgraded to living under a PC. - The last step here before we actually fire everything up, including Ken's neato little custom power button, is to load my sacks, cut my sacks, run cables through my sacks, and then we'll be ready to sack it up. Look, let's just shove it in the sack, and then we'll call it a day. - [Adam] Yeah, if we can avoid cutting the sack, that sounds like a. - It's a very bad idea to cut the sack, usually. But today, we might have to make an exception. I don't need commentary on my sack, okay. I'm trying to get it round. I mean square. - I mean, as long as it looks good. - It's a little lumpy right now, which is usually concerning. - [Adam] Normally, you don't have an audience for this kind of thing. Looks like it won Tour de France at least once. (laughing) - This one's gonna be way simpler. Cutting the sack. Adam, I appreciate your devotion to the cause here. - [Adam] My fingers are sacrificing for this. - That's fine. I'll do it myself. I'll do it myself. I don't want to be responsible for mryeester having one less finger than he did before. - [Adam] Good luck. - I think I'm ready to fire up my ultimate system and see if this all comes to life or not. Three, two, one. Three, two, one. Yeah! - Let's go. - Wait, wait, wait. Wait for it to post, wait for it to post. Yeah. - Let's go. Good stuff. - We've built a portable gaming PC that's not a laptop or a Steam Deck or an INEO or an Alienware. Even a MacBook could probably be better than this, actually. It is time. Our largest versus smallest gaming PCs have been successfully completed. Adam, would you be please bees, bees, be kind. (chuckling) Will you please be so kind as to show us the wonderful system that you have crafted with your own bare hands. (laughing) It's got a fan on the bottom. - Yeah, that's the underglow. With this much space. - Where did Patrick come from? - The great 3D printing services here at Micro Center. - Oh. - Directly from that. Yeah, his face kind of internalizes the feeling that you get when you look at this PC. - I feel like this too, most of the time. - If you're gonna have a big PC, you might as well have a big keyboard as well. - The compensation jokes really write themselves for this video. Dude, I gotta say, this is legitimately really impressive. - Shall we take a look to see what you've come up with? - You might wanna get your magnifying glass out though, 'cause mine's a little bit small. - All right, let's take a look. - My friend, welcome to the world's smallest gaming PC. This is an all in one unit. Would you like to do the honors pressing the big red button? - Oh wow, you have a red button to press? - [Austin] Yes. - That matches your button to vote. - Exactly. (button clicking) - Oh, and it boots right to life. That's awesome. - So, we've got our Ryzen 5 5600G, 16 gigs of RAM. And if I tab over here, 500 gig SSD. - Impressive. - And then if you would like, you could hide your gaming PC in this and no one would ever suspect it. It's foolproof. - [Ken] TSA. - No, don't take this through security. Go ahead, gently try to close it. - Just try to close it as normal? All right, just like that, it hinges nearly, completely shut. - Yeah, just the power cable's in the way. - [Adam] This is impressive. I love how you laid it out such that everything, honestly, it looks like it was made for PCs, but it was made for PlayStations and Xboxes. Aesthetically, it does look like it's all supposed to be together. - If you live in the Kansas City area, then by all means, come down to the Overland Park Micro Center. Not only do they have some terrific deals that you can only get in store, but you also could come and press these amazing buttons. Let us know in real life. You also could let us know in the comments. But Adam, thank you very much for joining me on this excursion. And thank you very much to Micro Center for sponsoring this absolute madness. Ken, no! - Yeah, let's go Ken. (chuckling)",
    "transcript_keywords": [
        "Yeah",
        "Micro Center",
        "Overland Park",
        "build",
        "Adam",
        "thermal",
        "post",
        "Overland Park Micro",
        "Good",
        "Park Micro Center",
        "graphics card",
        "Overland Park store",
        "special occasion",
        "CPU",
        "card",
        "Micro",
        "gaming",
        "Center",
        "sack",
        "case"
    ],
    "transcript_entity_values": [
        "about four and a half hours",
        "Ryzen 5 5600",
        "Kansas City",
        "AMD",
        "third",
        "PlayStations",
        "MacBook",
        "20 to 30",
        "15 feet",
        "Three",
        "Alienware",
        "X570",
        "first",
        "RAM",
        "PlayStation",
        "Ken",
        "6500",
        "Austin",
        "Adam",
        "RGB",
        "ITX",
        "October 2nd",
        "two",
        "the Overland Park Micro Center",
        "the end of the day",
        "XT",
        "Tour de France",
        "Xbox",
        "Patrick",
        "50",
        "one",
        "second",
        "22 carats",
        "more than two",
        "16",
        "500",
        "Xbox Series S. - Oh",
        "ATX",
        "CPU",
        "every day",
        "SSD",
        "Xboxes",
        "200",
        "GAEMS",
        "Overland Park",
        "GAEMS",
        "One",
        "Kansas",
        "the next 10 minutes",
        "today",
        "Micro Center",
        "20"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "LAW",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL",
        "GPE",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        0.0684630498290062,
        0.0317859910428524,
        0.01521445345133543,
        -0.0183931402862072,
        0.06125662103295326,
        0.011959266848862171,
        0.010224119760096073,
        0.036447733640670776,
        -0.07145139575004578,
        0.07039771229028702,
        -0.04192299023270607,
        0.0017828954150900245,
        0.014228878542780876,
        -0.03705219551920891,
        0.012843959964811802,
        0.04938467592000961,
        0.11639479547739029,
        -0.03261995315551758,
        -0.018211761489510536,
        -0.052254319190979004,
        -0.02230405993759632,
        -0.06304240971803665,
        -0.047059353440999985,
        -0.03490867465734482,
        -0.009395447559654713,
        0.06735243648290634,
        0.08369597047567368,
        0.054723143577575684,
        0.005779060069471598,
        -0.04408905655145645,
        0.006713154725730419,
        -0.0014774072915315628,
        0.037797216325998306,
        0.02095179073512554,
        0.031125865876674652,
        -0.01283891312777996,
        0.06726229190826416,
        -0.08448672294616699,
        -0.009797848761081696,
        -0.07837558537721634,
        -0.05455246940255165,
        -0.023089945316314697,
        0.027845753356814384,
        0.06388091295957565,
        0.010839320719242096,
        0.03089217282831669,
        -0.03285982087254524,
        -0.08071698993444443,
        -0.021110059693455696,
        -0.05842619761824608,
        0.046869322657585144,
        -0.0362023189663887,
        -0.0037452345713973045,
        -0.0017162107396870852,
        -0.07115797698497772,
        0.0007588152657262981,
        -0.056867752224206924,
        -0.06859511137008667,
        0.06090322509407997,
        -0.00351266679354012,
        0.0017356505850329995,
        -0.12587250769138336,
        0.022854944691061974,
        0.032746706157922745,
        0.006797803565859795,
        -0.03165995329618454,
        -0.04289849475026131,
        -0.03953750804066658,
        -0.028438718989491463,
        -0.03743206337094307,
        0.015861893072724342,
        0.0007629423053003848,
        -0.011194387450814247,
        0.04099413752555847,
        0.03077072650194168,
        -0.00587836978957057,
        0.06448697298765182,
        -0.049631908535957336,
        -0.021187786012887955,
        0.05653080716729164,
        -0.05324660241603851,
        -0.008442608639597893,
        -0.011272565461695194,
        -0.028338177129626274,
        -0.0029918623622506857,
        -0.007356865797191858,
        0.04914760962128639,
        -0.03323376923799515,
        -0.014267794787883759,
        -0.07998418807983398,
        0.007021017838269472,
        0.06994375586509705,
        0.034897465258836746,
        0.012261916883289814,
        0.032842956483364105,
        -0.005202383268624544,
        -0.036447517573833466,
        -0.08109178394079208,
        -0.07002396136522293,
        0.032130636274814606,
        0.03521822765469551,
        0.07487234473228455,
        0.14427918195724487,
        0.06801564246416092,
        0.013390433974564075,
        -0.005386026576161385,
        -0.0627877414226532,
        0.006916212383657694,
        -0.045831888914108276,
        -0.04577212780714035,
        -0.02992670238018036,
        0.02100137621164322,
        -0.031710587441921234,
        0.01058658491820097,
        0.05386345461010933,
        -0.04920868203043938,
        -0.046474624425172806,
        0.05258423462510109,
        0.09901230782270432,
        -0.0020735401194542646,
        0.03862038254737854,
        0.004350295756012201,
        -0.026812320575118065,
        0.02242494374513626,
        0.037328049540519714,
        0.11380387842655182,
        -0.055659219622612,
        2.1722524346133446e-32,
        -0.020987873896956444,
        0.13015241920948029,
        -0.07381852716207504,
        -0.010662310756742954,
        -0.00642592366784811,
        0.041997600346803665,
        0.05523335561156273,
        -0.02794034220278263,
        -0.007398069370537996,
        0.07246080785989761,
        -0.021279720589518547,
        0.02642369270324707,
        -0.022127561271190643,
        0.06588515639305115,
        0.10975910723209381,
        -0.0780785009264946,
        0.017418978735804558,
        0.00506350863724947,
        -0.033400703221559525,
        -0.04724038392305374,
        -0.02031131461262703,
        0.06432066112756729,
        0.04745855554938316,
        0.0020717016886919737,
        0.011046713218092918,
        -0.059234604239463806,
        -0.03848790004849434,
        -0.056326545774936676,
        -0.003690301440656185,
        -0.0016486486420035362,
        -0.03925180807709694,
        -0.1370045393705368,
        -3.2038253266364336e-05,
        -0.011545935645699501,
        0.014521312899887562,
        -0.0007779773441143334,
        0.011557376943528652,
        -0.0694592222571373,
        -0.03211777284741402,
        0.0003138986066915095,
        -0.04895014315843582,
        0.07298294454813004,
        -0.0704379603266716,
        -0.08505000174045563,
        -0.04258926212787628,
        0.014495457522571087,
        0.017774812877178192,
        -0.0065646907314658165,
        0.03506823256611824,
        -0.020407291129231453,
        -0.09280210733413696,
        0.02456558123230934,
        0.04935694485902786,
        -0.0011161245638504624,
        0.009700893424451351,
        -0.032171450555324554,
        0.051759131252765656,
        -0.04309220239520073,
        0.14506076276302338,
        0.10105380415916443,
        -0.09282965958118439,
        -0.03336017578840256,
        0.006625146139413118,
        0.056278444826602936,
        -0.012243619188666344,
        0.05280068889260292,
        0.09159460663795471,
        -0.029296889901161194,
        -0.05523692071437836,
        0.025797218084335327,
        -0.0026317292358726263,
        0.010650163516402245,
        0.13131581246852875,
        0.002617388032376766,
        0.1281924545764923,
        0.04899581894278526,
        -0.04644988104701042,
        -0.0696084126830101,
        -0.08058705925941467,
        -0.07979529350996017,
        -0.08880078047513962,
        0.06818969547748566,
        -0.01610034517943859,
        0.047101300209760666,
        0.01032913476228714,
        -0.04120490327477455,
        0.017976759001612663,
        0.02940436825156212,
        0.0033486923202872276,
        -0.05299260467290878,
        -0.049745358526706696,
        -0.02945753000676632,
        0.025863761082291603,
        0.029752708971500397,
        -0.023004258051514626,
        -1.73272437045494e-32,
        -0.020816171541810036,
        -0.034320734441280365,
        0.040916964411735535,
        0.09260169416666031,
        0.023953856900334358,
        -0.024012839421629906,
        0.07855174690485,
        0.013725952245295048,
        0.026130620390176773,
        -0.08708072453737259,
        0.024667074903845787,
        0.06128806993365288,
        0.06471966207027435,
        0.007686677388846874,
        0.015754781663417816,
        0.03441249951720238,
        0.008435153402388096,
        -0.09596174955368042,
        0.12052809447050095,
        -0.02012004517018795,
        0.045769672840833664,
        0.058619674295186996,
        -0.015849262475967407,
        -0.041939545422792435,
        0.03677600249648094,
        0.023789383471012115,
        0.019790565595030785,
        -0.06901529431343079,
        -0.0058507416397333145,
        0.0063599166460335255,
        -0.037021104246377945,
        0.022862985730171204,
        0.02773152105510235,
        0.1167556419968605,
        0.04062404856085777,
        -0.04768425598740578,
        0.022655297070741653,
        0.019267333671450615,
        0.0065392558462917805,
        0.016510499641299248,
        0.01833384484052658,
        0.01544546615332365,
        0.010971762239933014,
        0.027378013357520103,
        0.01235209871083498,
        0.0266890749335289,
        -0.027397695928812027,
        -0.0558660589158535,
        0.05846038833260536,
        -0.008293881081044674,
        -0.10509233176708221,
        -0.02160416729748249,
        -0.016805075109004974,
        -0.026556141674518585,
        0.028611507266759872,
        -0.10129701346158981,
        -0.01902453415095806,
        0.08516263961791992,
        0.03735039383172989,
        -0.04201383888721466,
        0.0938909500837326,
        0.02125326730310917,
        -0.030318835750222206,
        -0.010364443063735962,
        0.002768278121948242,
        -0.013081704266369343,
        0.007940912619233131,
        0.038940224796533585,
        -0.006707336287945509,
        -0.017772044986486435,
        -0.10594963282346725,
        -0.03099828213453293,
        0.005014235619455576,
        -0.09380759298801422,
        -0.08951368927955627,
        0.05490116402506828,
        0.037340763956308365,
        0.03592902421951294,
        0.11441618204116821,
        0.011390537954866886,
        -0.02971816621720791,
        0.013366078026592731,
        -0.011868974193930626,
        -0.025694776326417923,
        0.047881633043289185,
        -0.01515637431293726,
        -0.006623284891247749,
        0.003279206110164523,
        -0.01389089785516262,
        -0.06032343953847885,
        -0.04348650202155113,
        0.026698365807533264,
        0.039863307029008865,
        -0.002334046410396695,
        -0.04671034589409828,
        -7.045174044151281e-08,
        0.04162298142910004,
        -0.062270667403936386,
        -0.0008171204244717956,
        0.04901020601391792,
        0.11379490047693253,
        -0.044764719903469086,
        0.0741894468665123,
        0.03251907229423523,
        0.026915395632386208,
        0.07871787995100021,
        0.05501478165388107,
        -0.06888075172901154,
        -0.020139846950769424,
        -0.015499630011618137,
        0.032853446900844574,
        0.0318441204726696,
        -0.06798264384269714,
        0.0424896664917469,
        -0.02601345255970955,
        -0.11328625679016113,
        -0.023949965834617615,
        0.069453664124012,
        0.04801236093044281,
        -0.04829252511262894,
        0.007911376655101776,
        -0.05042974650859833,
        0.0067593734711408615,
        -0.045000191777944565,
        0.03261798992753029,
        -0.005940686911344528,
        -0.0506209060549736,
        -0.00908912904560566,
        0.007045556791126728,
        -0.07612848281860352,
        0.07290410250425339,
        -0.04368787258863449,
        0.03766556829214096,
        0.14425283670425415,
        0.10148972272872925,
        -0.0452004112303257,
        -0.06108243390917778,
        -0.12720461189746857,
        -0.058613091707229614,
        -0.07183507084846497,
        -0.030049633234739304,
        -0.0064856912940740585,
        -0.10514561831951141,
        -0.10118965059518814,
        -0.0060648443177342415,
        0.03328699991106987,
        -0.044564079493284225,
        0.0018201355123892426,
        -0.0002435446804156527,
        0.018105989322066307,
        0.08192494511604309,
        0.005424035247415304,
        -0.06972893327474594,
        0.05522676929831505,
        0.01958523318171501,
        -0.051160603761672974,
        0.014602248556911945,
        -0.026066597551107407,
        -0.043846406042575836,
        0.016051767393946648
    ]
}