{
    "id": "yVPWGK54bRQ",
    "title": "The Cheapest Off Road Wheelchair for kids!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-01-24T15:12:00Z",
    "video_url": "https://www.youtube.com/watch?v=yVPWGK54bRQ",
    "category": "Howto & Style",
    "tags": [
        "off road wheelchair",
        "notawheelchair",
        "not a wheelchair",
        "home made off road wheelchair",
        "accessibility",
        "accessible",
        "electric wheelchair",
        "childrens wheelchair",
        "kid off road wheelchair",
        "cheap wheelchair",
        "bike chair",
        "disability",
        "spinal injury",
        "electric atv",
        "atv",
        "the rig",
        "kid rig"
    ],
    "views": 638360,
    "likes": 48234,
    "comments_count": 2544,
    "description": "Customize your own Not-a-Wheelchair Kid Rig HERE:  or help us make Accessibility more affordable by getting the Collectors Coin HERE:  than YOU for watching and sharing our videos. Its what makes all of this possible. We don't take any profit from the sale of these machines. We just want to create affordable non-medical accessible equipment that help kids (and adults) get out and explore!   See the full ADA requirements for \"Other Power Driven Mobility Devices\" here:    Like any activity, riding the Not-a-Wheelchair involves the risk of injury and damage. By choosing to ride a Not-a-Wheelchair, you assume full responsibility for the risks. Know the rules of safe and responsible riding and practice them. It is up to you to ensure you know how to use and maintain your vehicle. Be sure to always ride with a helmet and/or protective gear. Be aware of all applicable laws which may govern the use of this product in public areas as this product is not to be used in such instances which may violate local laws and/or in public areas which may cause injuries or accidents to bystanders.   Our adult Rig video can be found here:  See Cambry's story here:    Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.notawheelchair.com/products/the-kids-rig",
        "https://www.notawheelchair.com/donate",
        "https://www.ada.gov/opdmd.htm",
        "https://youtu.be/vuMg0QwKAGI",
        "https://youtu.be/ILCDfIBn1fw",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "My name is Zack Nelson and you've probably seen this. Our four wheeled off-road wheelchair that we've been selling for a couple years now. It's gotten a lot of places on dirt, grass, snow. We've taken it on vacations. It's been a lot of fun. We really enjoy this rig and what it can do. You guys talk too much, let's get started. [Intro] Today Cole thinks he's coming for a test drive, but we're going to give him a kid rig of his very own to keep. But he doesn't know that yet. These are like motorcycles, but like dune buggies. Yeah. Cole, how do we know each other? Well, you did become my fair pass for a little. Yeah, for a little bit. And you did come to my wedding and you danced hard. Well, my sisters, I danced way harder. Oh, okay. I was sweating my body off. But we've been friends for about five years. Would you say Cambry's your best friend? What's your favorite thing about Cambry? He always plays games with me. Yeah? Cole's always down to have fun. He always likes adventure. Yeah. But there's still more fun to be coming. Let me show you our latest project from Not A Wheelchair. We call it the kid rig. The biggest request we've had since releasing our adult sized full version of the rig back in 2020 has been to create a kid sized version of that. So we did. We found that off-road wheelchairs are incredibly expensive and for kids basically non-existent. So we're hoping that our Not A Wheelchair kid rig can help fill that gap. We have six different colors starting over here. We have red, blue, crinkle black, white, green, and pink. And these are made mostly from bike parts. We also made sure that replacement parts were easy to find in local bike shops. So for example, these wheels after a couple hundred miles are going to need to be replaced. You get them on Amazon, Walmart, or your local bike shop for like $20 to $30. Our whole goal here at Not A Wheelchair is to make inexpensive, non-medical accessible equipment for super cheap. And now it's time for Cole to try his out for the very first time. So step one if you want to get in something, make sure you've got balance or you're not going to make it. If I'm going to fall you've got to help me. Jill, do you think you can make it? That's a big jump. Nice work. What's the horn? Yeah, we need a horn. That's like the first thing. This is the coolest thing ever. Alright, you're a YouTuber now. You've got a camera going on you. Hey, anybody that's watching this, first thing about this, these are the brakes. Twelve miles an hour this thing can go. Just remember, I'm kind of a professional on this. Don't try this at home. It can be going a little bit faster. I want to bring some speed. I'm okay with it. Okay, bye. Wait, can this go on snow? Yeah, it can. Yes! This is epic! Now I can go as much speed as I want. I'll meet you at the playground. This is awesome! This is the greatest thing ever! Hi! Did I pet your dog? This is the best day of my life! Gary! This is the best day of my life! Now, the KidRig is not all daffodils and roses. It doesn't have the fine tuning or precision that you might find in a medical device. It's definitely a bike and definitely not a wheelchair. And still has all the quirks and maintenance that come with bikes. Now punch it! Especially the brakes. Just like on a regular bike, we have cable brakes that need to be squeezed by the rider in order to slow down. One on either side. We do have a parking brake that can be activated to hold it in place. But everything is controlled by the rider. We have a top speed of 12 miles an hour with lower power settings that can keep the KidRig at a walking pace. The rear mounted e-bike motor does have reverse. At a full charge, it has a total range between 10 and 20 miles. The seat can be adjusted back and forth along the main rail. And the bumper has a foot rest skid plate that comes off for easy entry and exit. As Cole did an amazing job of demonstrating on his first try. Wahoo! Oh, you're so close. Nice. I think it has a toothpick. Wow. Alright, you got your toothpick? Let's get out of here. So obviously passengers are strictly forbidden. I'm just doing the durability test to show how much weight this can actually hold. We recommend staying below about 150, but currently with this test we're pushing about 250 pounds and it's handling just fine. We have a 500 watt motor and a braking system that when you squeeze it, it shuts off power to the motor for safety. What age the driver is? Yeah, the age of the driver should be about 5 years old. How old are you Cole? 8. You're 8 years old? He's perfect. So it might be a little hard to drive because this road is completely covered with dust. They need somewhere to be. This thing cannot do that much sound. So it's hard for most animals to be scared if they can't hear much sound. Like he said, it's very quiet. Perfect for ducks. It sounds like a cricket. Ok, now you can do the talking. Remember the Kid Rig is a very powerful machine and definitely not a toy. You should always wear a helmet and have adult supervision. You might be curious where you can ride the Kid Rig. And according to the American Disability Act, or the ADA, other power-driven mobility devices that are driven by a person with a medically recognized physical impairment are allowed to go in areas where members of the public are allowed to go so long as it's safe. And of course outdoors. Kids without physical impairments can ride as well, of course. There are just more restrictions as to where it could go. And of course, just like our regular adult rigs, the Kid Rigs are welded, powder-coated, and assembled right here in the USA by Utah Trikes, the largest trike manufacturer in the USA. We'll also be including a motor cover with each unit to protect little digits from moving parts. These Kid Rigs are for sale right now on our website, $24.99, and the full spec list can be found at NotAWheelchair.com. We're not here to make money on these obviously. We're just here to bring the price of accessibility down for those who need it,especially kids. If you want to help out though, you can by purchasing one of our collector's coins. One hundred percent of all the money we make from these coins goes straight into the business, keeping lights on, hiring more people, and making our products even cheaper for those who need them. Generosity from people like you goes a long ways towards giving smiles to kids like Cole. Even just sharing this video is extremely helpful. Speaking of which, do you think Cole is ready for his surprise? Yeah. You going to throw it? Ah, it didn't go through. We got to find a bigger rock. Like that one? That's huge. Try that. I'm not that strong. Woo! I'm going on the side of it. Make it break! Woo! So what do you think Cole? What do you think of your off-road wheelchair? Pretty good. Yeah? What would you do if you had one of these? Probably go pretty fast. What does this do? That's the pretty fast button. I want to push it. You want to push it? Uh huh. Do you want to keep this? Yes. You want to keep it forever? Okay man, it's yours. You can have it. Thanks! Oh yeah. Okay. Yeah! Alright dude. We have a lot more riding to do. Thanks a ton for watching. I'll leave a link down in the description if you want to check out the current pricing for yourself. And thanks a ton for watching. We'll see you around. Hello whoever's watching this. Please subscribe. Stay connected.",
    "transcript_keywords": [
        "Zack Nelson",
        "kid rig",
        "Yeah",
        "Cole",
        "kid",
        "rig",
        "Wheelchair kid rig",
        "Kid Rigs",
        "wheelchair",
        "thing",
        "Zack",
        "Nelson",
        "make",
        "kids",
        "bike",
        "rigs",
        "offroad wheelchair",
        "Wheelchair kid",
        "years",
        "lot"
    ],
    "transcript_entity_values": [
        "24.99",
        "2020",
        "ADA",
        "12 miles an hour",
        "Cambry",
        "Walmart",
        "four",
        "about 250 pounds",
        "six",
        "American",
        "Gary",
        "8 years old",
        "Twelve miles",
        "between 10 and 20 miles",
        "one",
        "about five years",
        "KidRig",
        "a couple hundred miles",
        "a couple years",
        "8.",
        "Amazon",
        "Jill",
        "500 watt",
        "the Kid Rigs",
        "USA",
        "the Kid Rig",
        "below about 150",
        "first",
        "about 5 years old",
        "Utah Trikes",
        "One",
        "the Kid Rig",
        "One hundred percent",
        "30",
        "Zack Nelson",
        "Cole"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "PERSON",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "GPE",
        "FAC",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "MONEY",
        "PERSON",
        "PRODUCT"
    ],
    "vector": [
        -0.016540637239813805,
        -0.017073074355721474,
        0.019802475348114967,
        0.0026320971082895994,
        -0.028993714600801468,
        0.018324825912714005,
        0.00951571948826313,
        0.09067412465810776,
        -0.006950031500309706,
        0.03551485016942024,
        0.06346561759710312,
        0.030479127541184425,
        0.0678032785654068,
        0.005469667725265026,
        -0.004419213160872459,
        0.03230699896812439,
        0.09217216819524765,
        0.006188185419887304,
        0.016102192923426628,
        0.004581167828291655,
        0.0405578538775444,
        0.04902207851409912,
        0.008375633507966995,
        0.013494417071342468,
        -0.08292260766029358,
        0.09243090450763702,
        0.013170497491955757,
        -0.015609915368258953,
        0.001182636828161776,
        -0.0010317729320377111,
        -0.008399822749197483,
        -0.07934704422950745,
        -0.04804044961929321,
        -0.07223884016275406,
        -0.0058000716380774975,
        0.0005202397587709129,
        0.07734846323728561,
        -0.015754034742712975,
        -0.04857320338487625,
        -0.04912194982171059,
        -0.05973448604345322,
        -0.03519623726606369,
        -0.036411743611097336,
        -0.07814178615808487,
        -0.003303112927824259,
        0.011553212068974972,
        0.030646471306681633,
        -0.1192818433046341,
        0.07250439375638962,
        -0.005325133912265301,
        0.03657731041312218,
        -0.0001417174789821729,
        0.12213979661464691,
        -0.023263707756996155,
        -0.07385054975748062,
        -0.08026278764009476,
        -0.013534899801015854,
        0.00404823524877429,
        0.039119016379117966,
        -0.005987323354929686,
        0.022787462919950485,
        -0.05863802880048752,
        -0.027650300413370132,
        -0.015490341931581497,
        -0.06197185069322586,
        -0.009699874557554722,
        0.007173644378781319,
        -0.11784200370311737,
        0.033195365220308304,
        0.004854354541748762,
        -0.10326462984085083,
        -0.018928198143839836,
        0.07432439923286438,
        0.03550262749195099,
        -0.02311972714960575,
        -0.009427925571799278,
        0.10701816529035568,
        -0.06374024599790573,
        0.0870712548494339,
        -0.005875925067812204,
        0.01182581763714552,
        0.09804636240005493,
        0.051933445036411285,
        0.04959501698613167,
        0.04196840897202492,
        0.05864477530121803,
        -0.0319451242685318,
        0.07636528462171555,
        -0.030867300927639008,
        -0.020862281322479248,
        -0.005572604015469551,
        0.01994604803621769,
        -0.012838502414524555,
        -0.01504223421216011,
        0.040435947477817535,
        -0.037208475172519684,
        0.004245514515787363,
        -0.06415805220603943,
        -0.030098730698227882,
        -0.020593196153640747,
        0.037004776298999786,
        0.047837816178798676,
        0.10110104829072952,
        0.031939998269081116,
        -0.018225476145744324,
        -0.020392486825585365,
        -0.027274103835225105,
        -0.024609049782156944,
        0.05351781100034714,
        0.08216220140457153,
        0.057270076125860214,
        -0.075524240732193,
        -0.03469780087471008,
        0.020246896892786026,
        -0.10980650037527084,
        0.026351377367973328,
        -0.07651930302381516,
        -0.03449159860610962,
        0.0019730436615645885,
        0.006614303216338158,
        -0.06143471226096153,
        -0.013290359638631344,
        0.037121132016181946,
        0.013630813919007778,
        0.042174916714429855,
        -0.047019246965646744,
        -0.010298024863004684,
        1.77694944340295e-33,
        -0.05052603408694267,
        0.020674142986536026,
        0.02126503363251686,
        0.01425190456211567,
        0.024763992056250572,
        -0.05448142811655998,
        0.040875859558582306,
        -0.02047659456729889,
        0.03272479027509689,
        0.02542738988995552,
        0.055245235562324524,
        0.021050026640295982,
        0.00922604463994503,
        -0.030682552605867386,
        0.02830268070101738,
        0.022634357213974,
        -0.038836121559143066,
        -0.06060537323355675,
        -0.08189867436885834,
        0.02848654054105282,
        -0.001902540447190404,
        -0.0371536910533905,
        0.0004811687977053225,
        0.06782872974872589,
        0.03617190197110176,
        -0.004976792261004448,
        -0.0037081448826938868,
        0.014047572389245033,
        0.12121742963790894,
        0.013119937852025032,
        -0.08204306662082672,
        -0.03227871283888817,
        -0.06782755255699158,
        -0.023812495172023773,
        0.04574991762638092,
        -0.06725848466157913,
        -0.0839654728770256,
        -0.06037965044379234,
        -0.068021260201931,
        -0.015799539163708687,
        -0.028515581041574478,
        -0.01911211386322975,
        -0.0051317764446139336,
        -0.04187477380037308,
        0.03086322918534279,
        0.008763140998780727,
        0.07795899361371994,
        -0.013390726409852505,
        -0.0719173476099968,
        -0.06792206317186356,
        -0.0755588710308075,
        0.09026095271110535,
        -0.11231093853712082,
        -0.05591168999671936,
        -0.09873849898576736,
        -0.04984622076153755,
        -0.0035394271835684776,
        0.009366868063807487,
        0.07112220674753189,
        -0.017767101526260376,
        0.00361583917401731,
        -0.03483055904507637,
        0.03852366283535957,
        -0.02235732600092888,
        -0.048173900693655014,
        -0.041972529143095016,
        0.06813625246286392,
        0.0045708161778748035,
        0.006772628985345364,
        0.0030319897923618555,
        0.0970858559012413,
        0.0030064161401242018,
        -0.001403538160957396,
        0.023241423070430756,
        -0.0029397537000477314,
        0.04004240408539772,
        0.010998688638210297,
        0.006213074084371328,
        -0.0009085547644644976,
        -0.009188343770802021,
        -0.05560700595378876,
        0.024297555908560753,
        -0.014323483221232891,
        0.022045930847525597,
        0.08983557671308517,
        -0.06989923864603043,
        -0.0992312952876091,
        -0.044352855533361435,
        -0.10349468141794205,
        -0.07590335607528687,
        -0.0315718874335289,
        -0.01971842162311077,
        -0.07929452508687973,
        0.03541030362248421,
        -0.027797386050224304,
        -4.651431513545776e-33,
        0.047899723052978516,
        0.05447034537792206,
        0.08365891128778458,
        -0.08389689028263092,
        0.028614435344934464,
        -0.049252625554800034,
        0.04307367280125618,
        -0.07740548253059387,
        0.1017334833741188,
        -0.009779905900359154,
        -0.13065479695796967,
        0.05179021880030632,
        0.028677714988589287,
        -0.018584879115223885,
        0.046810418367385864,
        -0.005045749247074127,
        -0.045438267290592194,
        0.0638362467288971,
        -0.00901052262634039,
        0.06536317616701126,
        0.07677735388278961,
        0.0703267827630043,
        0.006271814927458763,
        0.06308037042617798,
        0.019002670422196388,
        -0.03534876927733421,
        -0.1038566380739212,
        0.01617172732949257,
        0.006136275827884674,
        0.04478026181459427,
        -0.03224716708064079,
        -0.043490346521139145,
        0.10683734714984894,
        -0.0212306659668684,
        -0.04943977668881416,
        0.0021695327013731003,
        -0.07465434819459915,
        -0.029296020045876503,
        -0.0511421337723732,
        0.014285442419350147,
        0.08220238983631134,
        0.018375316634774208,
        0.04033543914556503,
        0.011889471672475338,
        0.0713195949792862,
        -0.07261564582586288,
        -0.09131113439798355,
        0.009071669541299343,
        0.008135433308780193,
        -0.04729529842734337,
        0.02328302152454853,
        0.03715181723237038,
        0.03151291608810425,
        0.01265515387058258,
        -0.053263142704963684,
        -0.013612545095384121,
        0.06111205741763115,
        -0.0165257565677166,
        -0.010928464122116566,
        -0.018235860392451286,
        -0.018503006547689438,
        0.017599858343601227,
        -0.0806695818901062,
        0.08247409015893936,
        -0.03352188318967819,
        -0.012680324725806713,
        -0.008876489475369453,
        -0.007151856552809477,
        -0.0409075953066349,
        -0.0037367111071944237,
        -0.054627932608127594,
        -0.01341971755027771,
        0.030496422201395035,
        -0.05238049849867821,
        -0.0073393564671278,
        -0.010770783759653568,
        0.11009003221988678,
        0.03594507277011871,
        0.06090868264436722,
        0.007673037238419056,
        0.04957418888807297,
        -0.03084072843194008,
        0.06994079053401947,
        0.031820278614759445,
        -0.006099133286625147,
        -0.0035691282246261835,
        0.05408591032028198,
        -0.11331507563591003,
        -0.056187715381383896,
        0.07860009372234344,
        0.02299901843070984,
        0.05788939446210861,
        -0.04814518988132477,
        0.09340726584196091,
        0.051144082099199295,
        -5.208569575643196e-08,
        0.06483150273561478,
        0.05145721882581711,
        0.02006732113659382,
        0.04250192269682884,
        -0.030942421406507492,
        -0.022132184356451035,
        -0.021101459860801697,
        0.012684307992458344,
        -0.0640731006860733,
        0.052220944315195084,
        -0.02366098202764988,
        -0.04142037034034729,
        0.055703818798065186,
        0.03252408653497696,
        0.03098808415234089,
        0.10345717519521713,
        -0.00842705462127924,
        0.058861032128334045,
        -0.035082872956991196,
        0.04012514278292656,
        -0.009660190902650356,
        -0.08464501798152924,
        0.0424974299967289,
        0.036496616899967194,
        0.0023840684443712234,
        -0.03308497741818428,
        -0.009961805306375027,
        -0.05914413556456566,
        -0.11630448698997498,
        -0.016370350494980812,
        -0.013151859864592552,
        0.001415953622199595,
        0.005503017921000719,
        0.030461257323622704,
        -0.040492214262485504,
        -0.04678954929113388,
        -0.04907984659075737,
        0.022974397987127304,
        -0.028460189700126648,
        0.09093604981899261,
        0.0021644230000674725,
        0.012053195387125015,
        0.02567414753139019,
        0.0171061959117651,
        -0.04850561171770096,
        0.050022732466459274,
        -0.13265085220336914,
        -0.03345351293683052,
        0.01558378804475069,
        0.16706055402755737,
        0.020343493670225143,
        -0.12829002737998962,
        0.06505352258682251,
        -0.0621858574450016,
        0.0249163955450058,
        0.08269496262073517,
        0.01858159340918064,
        0.013073787093162537,
        -0.050689246505498886,
        0.0727325826883316,
        0.06524402648210526,
        0.07907676696777344,
        0.010889465920627117,
        -0.012751946225762367
    ]
}