{
    "id": "YwJ_-bUlzTQ",
    "title": "This Phone is STILL Banned? - Mate 30 Pro Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-01-29T14:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=YwJ_-bUlzTQ",
    "category": "Howto & Style",
    "tags": [
        "Mate 30 pro",
        "durability test",
        "huawei mate 30 pro",
        "Huawei",
        "huawei ban",
        "huawei ban usa",
        "mate 30 pro",
        "huawei mate 30 pro review",
        "Mate 30 pro durability test",
        "huawei mate 30 pro camera",
        "Mate 30 pro unboxing",
        "smartphone",
        "android phone",
        "best smartphone",
        "flagship"
    ],
    "views": 2871291,
    "likes": 77688,
    "comments_count": 4368,
    "description": "Its time to durability test the Mate 30 Pro! Get your first audiobook and two Audible Originals for free when you try Audible for 30 days visit  or text jerryrig to 500 500! The Huawei Mate 30 Pro is one of the world wide most popular flagship smartphones. But you CANT buy one in the United States unless you import it internationally. Today we dive into the Huawei ban and see whats changed since it got implemented almost a year ago. This Mate 30 pro seems like a good phone, even if it has some little quirks. What do you think? Would you buy a banned smartphone?   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.audible.com/jerryrig",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "It's time for the durability test of the banned Huawei Mate 30 Pro. There is currently a ban in place here in the United States that prevents US companies from doing business with Huawei. It's not illegal for civilians to have the phone, of course, but Android phones that don't get updates or have the Google Play Store are not very appealing at the moment. Outside of the USA though, Huawei is still globally the number 2 smartphone manufacturer, right under Samsung, and right above Apple at number 3. So it's still worth taking a look at. The first thing I noticed is the wraparound endless screen called the Horizon Display, which pushes the power button onto the back half of the phone. Rather interesting. The display wraps quite a bit further around the edge of the phone than it does on the curved edge of my Note 10 Plus. This should be a good durability test. Let's get started. [Intro] Now you might be thinking to yourself, 'Wow, this large circular camera lens cutout on the back reminds me of another phone.' And you're right. Both this Mate 30 Pro and the OnePlus 7 both have large circular camera lenses with multiple cameras inside. The OnePlus 7 shattered during my durability test. I think the large hole cutout made the glass weaker. So it'll be interesting to see what happens with this Mate 30 Pro which has the same size hole. Let's start with the scratch test. It's been a minute since we've done a scratch test. If you remember, these Mohs hardness picks can tell the difference between plastic, which scratches at a level 3, and glass, which scratches at a 5 or 6. Sapphire, which scratches at a level 8 or 9 is one of the harder screen materials. If we look closely we can see that we are starting the year off right with scratches at a level 6 and deeper grooves at a level 7. The Mate 30 Pro is using Gorilla Glass 6. The tempered glass surface will be scratch resistant. And my razor blade will do no damage. There is a notch up top. This guy is hiding the front facing sensors, along with the 3D time-of-flight camera, and a 32 megapixel selfie camera. With no visible grill slot, the Mate 30 Pro has an underscreen speaker that vibrates up through the glass. We'll have to see what that looks like from the inside during the teardown video. It is one less hole they have to make water resistant. And the phone is ip68. 50% of the sides are covered by the front glass from that wraparound screen. The other half of the sides is covered with a very thin strip of aluminum before the curve of the back glass starts. It's mostly all glass. The one-colored power button is metal. The top of the Mate 30 Pro is also metal, along with the small black circular IR blaster for changing the channels on TVs. I basically just acts like a remote control. Now, the sides of the phone are where things start to get tricky. There is no room for volume buttons on this phone, so in order to adjust the volume you have to tap on the side to bring up a volume slider...which is probably one of the worst ideas of all time. Like if your phone starts ringing in class, or you forget your media audio is on during a meeting, or you know, any other situation where you need to quickly turn down the volume, this method is anything but quick. And you have to very specifically make sure to touch the screen half of the side bezel since that's the only place that will sense your finger. The aluminum frame will not. Personally, I'd skip this phone for the volume reason alone. There is a USB-C port on the bottom. No headphone jack, but there is a SIM card tray with a proprietary sized Huawei nano memory card slot, which basically means the memory slot doesn't exist. Huawei nano memory is 45% smaller, but also costs 45% more than standard micro SD. Not worth it. I do, however, appreciate the back of the phone. It's back panel catches reflection and then throws them back at weird angles. Kind of like a fun house mirror. I kind of like it. The back panel has no musical texture like we saw in the Mate 20 Pro last year. But it does have four cameras tucked into this circular camera lens. A 40 megapixel normal camera, a 40 megapixel ultrawide camera, and an 8 megapixel 3x telephoto zoom camera with an additional 3D depth sensing camera. There's also some dual LED flash action over here on the side, and it's all covered with the same scratch resistant glass. You can see the trippy reflections on the back panel a little better over here, kind of like you're seeing double of everything. There is still quite a bit of controversy around the Huawei ban here in the USA. Some people say there was espionage, but others say the reason for the ban was in part because the trade war and that Huawei had passed Apple in global smartphone shipments. Microsoft, who worked with Huawei providing Windows software for laptops, was one of the loudest voices asking for valid proof and reason for the ban. Unsure if they ever got the proof they were looking for, but Microsoft was allowed to start selling licenses to Huawei again in November of 2019 just a few months ago. The 6.5 inch 1176 x 2400 OLED display lasted about 25 seconds under the heat from my lighter and actually recovered leaving no burn marks behind. Huge thanks to Audible for sponsoring this video. If real life government spying conspiracies tickle your fancy, and you'd like to educate yourself for the new year, there's an interesting audio book called Permanent Record by Edward Snowden. Controversial to be sure, but still worth a listen. You can get your first audio book for free plus two Audible Originals when you try Audible for 30 days. Audible.com/jerryrig or text the word jerryrig to 500-500. Audible Originals are the exclusive audio titles created by story tellers of all genres and are only available on Audible. Audible's also issuing a challenge for the new year to both current and new listeners to finish 3 Audiobooks by March 3rd and you'll get a $20 Amazon credit. Finish three by 3/3 and get $20. You don't need to do anything to enter. Audible will keep track of that for you. Permanent Record did win NPR's Best Book of 2019 Award, so it's got that going for it which is nice. Audible.com/jerryrig or text jerryrig to 500-500. Now it's time to see if this Mate 30 Pro has the same cracked glass fate as the OnePlus 7. With a bend from the back we see no flex in the device. It could be the way that the glass is curved that's adding more structure. Or it could just be the super-strong frame that's keeping the whole phone rigid. Bending from the front we get the same result. The Mate 30 Pro is a well-built solid phone. Even though it has a huge hole cut out of the back of the glass, the reason the glass didn't break is because of how stiff it is. The OnePlus 7 is just more flexy which allows the glass to move out of it's comfort zone and shatter. Anyway, thumbs up to the Mate 30 Pro for everything except that volume button situation. But like always, let me know what you think down in the comments. Are invisible volume buttons the way of the future? Hit that subscribe button so you don't miss the teardown. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "banned Huawei Mate",
        "Mate",
        "Pro",
        "glass",
        "Google Play Store",
        "phone",
        "Huawei",
        "back",
        "camera",
        "United States",
        "Huawei Mate",
        "Audible",
        "banned Huawei",
        "volume",
        "circular camera",
        "back glass starts",
        "Google Play",
        "Play Store",
        "large circular camera",
        "test"
    ],
    "transcript_entity_values": [
        "the Mate 30 Pro",
        "US",
        "Microsoft",
        "Permanent Record",
        "8 megapixel",
        "3x",
        "30 days",
        "9",
        "ip68",
        "6",
        "Windows",
        "8",
        "Edward Snowden",
        "the year",
        "Instagram",
        "four",
        "2400",
        "20",
        "two",
        "jack",
        "20",
        "three",
        "Mohs",
        "standard micro SD",
        "Huawei",
        "half",
        "a few months ago",
        "the new year",
        "Best Book of 2019 Award",
        "Amazon",
        "6.5 inch",
        "the OnePlus 7",
        "the Google Play Store",
        "the United States",
        "USA",
        "Apple",
        "5",
        "first",
        "last year",
        "500-500",
        "The OnePlus 7",
        "Sapphire",
        "the Horizon Display",
        "Samsung",
        "NPR",
        "Android",
        "50%",
        "March 3rd",
        "30",
        "3",
        "45%",
        "32",
        "40 megapixel",
        "USB",
        "November of 2019",
        "about 25 seconds",
        "Audible",
        "3/3",
        "one",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "EVENT",
        "ORG",
        "GPE",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.09744935482740402,
        0.025748148560523987,
        0.07537679374217987,
        -0.15642553567886353,
        0.07670360803604126,
        -0.008042493835091591,
        0.05042465031147003,
        0.02821352519094944,
        -0.04869231581687927,
        0.10708834230899811,
        0.09323049336671829,
        0.07097407430410385,
        0.06699130684137344,
        0.04889655485749245,
        0.07974886894226074,
        0.02338525652885437,
        0.0415097139775753,
        -0.08922428637742996,
        -0.03176266327500343,
        0.05364547669887543,
        0.04615490511059761,
        0.02114955708384514,
        0.02774571254849434,
        0.031139351427555084,
        -0.02621457353234291,
        0.006085808854550123,
        -0.06754756718873978,
        0.04870642349123955,
        -0.04300598427653313,
        -0.033931829035282135,
        0.004782391712069511,
        0.10419759899377823,
        0.018548715859651566,
        -0.005356520414352417,
        0.01171153411269188,
        -0.1199435144662857,
        0.008630841039121151,
        -0.07993711531162262,
        -0.07578425109386444,
        -0.03206947073340416,
        -0.016596198081970215,
        -0.03556789457798004,
        -0.011703744530677795,
        -0.04126947000622749,
        0.03543020039796829,
        -0.04796149581670761,
        0.04509836807847023,
        -0.003600438591092825,
        -0.003280924865975976,
        -0.028858477249741554,
        0.008803235366940498,
        0.013716094195842743,
        0.03052539937198162,
        -0.01586177945137024,
        -0.058591607958078384,
        0.002926351735368371,
        0.019748792052268982,
        0.02084193006157875,
        0.06603994220495224,
        -0.009385674260556698,
        0.030112260952591896,
        0.03885641321539879,
        -0.06890354305505753,
        0.05242502689361572,
        -0.05118792876601219,
        0.020606402307748795,
        -0.07398451119661331,
        -0.06329746544361115,
        0.035608693957328796,
        0.08316142857074738,
        -0.06184334680438042,
        -0.016713425517082214,
        0.06096598133444786,
        0.06709593534469604,
        -0.01102790329605341,
        0.029993457719683647,
        0.03688511997461319,
        -0.010485738515853882,
        0.004943359177559614,
        -0.043686285614967346,
        0.022519899532198906,
        -0.05997355282306671,
        0.028204258531332016,
        -0.08036932349205017,
        0.04333989694714546,
        0.015757326036691666,
        -0.004637243691831827,
        0.08610917627811432,
        -0.03936489298939705,
        -0.07252129912376404,
        -0.03880555182695389,
        0.10409695655107498,
        0.013848979957401752,
        0.06400343775749207,
        -0.0017929679015651345,
        -0.02359934337437153,
        -0.05222673714160919,
        -0.04607411473989487,
        -0.08748619258403778,
        0.04209648817777634,
        0.007574743125587702,
        0.031609345227479935,
        -0.002932256553322077,
        -0.014349370263516903,
        0.038718320429325104,
        -0.038185104727745056,
        -0.0014906858559697866,
        0.011023006401956081,
        -0.030878352001309395,
        0.027589650824666023,
        -0.0481601245701313,
        0.04587994143366814,
        -0.027511555701494217,
        -0.021385157480835915,
        -0.04787421599030495,
        0.07263187319040298,
        -0.06453186273574829,
        0.019725263118743896,
        0.08492130041122437,
        -0.029049258679151535,
        0.005080229602754116,
        -0.019621729850769043,
        -0.0495649017393589,
        -0.06210179254412651,
        0.01556314155459404,
        0.007886599749326706,
        -0.02121850475668907,
        3.144907667956363e-33,
        0.017144901677966118,
        0.10942830890417099,
        -0.05038520321249962,
        -0.003852266352623701,
        -0.006489666644483805,
        0.008910669945180416,
        0.06755419820547104,
        0.04945109784603119,
        -0.08943629264831543,
        -0.01721084490418434,
        0.0028891516849398613,
        -0.014575693756341934,
        -0.012410839088261127,
        0.05060277879238129,
        0.12046589702367783,
        -0.013398930430412292,
        0.006956848781555891,
        -0.04647407680749893,
        0.011838264763355255,
        -0.03364748880267143,
        0.0348949208855629,
        -0.07230817526578903,
        0.019122524186968803,
        0.02236895076930523,
        0.015387948602437973,
        0.029469231143593788,
        0.04390586167573929,
        -0.04594945162534714,
        0.11867434531450272,
        0.039467811584472656,
        -0.14331547915935516,
        -0.006399859674274921,
        0.05836491659283638,
        -0.015162761323153973,
        0.007693041581660509,
        0.05485920235514641,
        -0.04659941792488098,
        -0.07929820567369461,
        -0.05878417566418648,
        0.028144527226686478,
        -0.013794676400721073,
        0.004053010139614344,
        -0.07653457671403885,
        -0.026208195835351944,
        0.024416936561465263,
        -0.004011073615401983,
        -0.04900741949677467,
        0.022884564474225044,
        -0.03494405373930931,
        -0.0046766637824475765,
        0.00850402470678091,
        0.011481844820082188,
        -0.08127531409263611,
        -0.01956045627593994,
        -0.1051555648446083,
        0.003041530027985573,
        -0.01685980334877968,
        0.0027142404578626156,
        0.048612479120492935,
        -0.05227316543459892,
        0.08901998400688171,
        -0.046396899968385696,
        0.005693293176591396,
        0.08762351423501968,
        -0.02406909130513668,
        -0.0002582220477052033,
        -0.01251756027340889,
        0.0016898680478334427,
        -0.08888573199510574,
        0.05224785953760147,
        -0.015334862284362316,
        -0.05488337576389313,
        -0.011302740313112736,
        -0.04473602771759033,
        0.03360290452837944,
        -0.00016654882347211242,
        -0.017055010423064232,
        -0.05480598658323288,
        -0.008179739117622375,
        -0.02608306147158146,
        -0.038967106491327286,
        0.02435818314552307,
        0.040017254650592804,
        -0.0042885360307991505,
        -0.06651517748832703,
        0.005692139267921448,
        0.0532117523252964,
        -0.060679104179143906,
        0.027355220168828964,
        0.055006761103868484,
        -0.07908382266759872,
        -0.04715120047330856,
        0.0037677614018321037,
        0.03069021739065647,
        -0.012087659910321236,
        -4.734546310988605e-33,
        -0.06791660189628601,
        0.008384531363844872,
        0.024168847128748894,
        -0.01250528171658516,
        0.011335078626871109,
        -0.06412124633789062,
        0.08540380746126175,
        0.11243602633476257,
        0.03915004804730415,
        -0.04263896122574806,
        0.0304565392434597,
        0.010931102558970451,
        0.046805787831544876,
        -0.016287459060549736,
        -0.009028729051351547,
        -0.08188813179731369,
        -0.029334304854273796,
        -0.08412014693021774,
        0.023806806653738022,
        0.04861211031675339,
        0.03555440530180931,
        0.010212148539721966,
        0.025373047217726707,
        0.054983243346214294,
        -0.11544153839349747,
        0.02003997005522251,
        -0.04936837777495384,
        -0.02176583558320999,
        0.030993439257144928,
        -0.07900328934192657,
        0.006587604526430368,
        -0.04642842337489128,
        -0.018877089023590088,
        0.08725591003894806,
        0.07090750336647034,
        0.030762862414121628,
        0.008706455118954182,
        -0.02439556084573269,
        0.012345380149781704,
        -0.04049481451511383,
        0.009430024772882462,
        0.04266694188117981,
        -0.0030078080017119646,
        -0.042398858815431595,
        0.02174159698188305,
        -0.08863236010074615,
        0.05170372128486633,
        -0.05052683874964714,
        0.022722383961081505,
        -0.01997986063361168,
        0.06053827330470085,
        0.027620645239949226,
        0.018918314948678017,
        0.06008901074528694,
        -0.07622437179088593,
        -0.02417232282459736,
        0.03471290320158005,
        -0.12840549647808075,
        0.02202616259455681,
        -0.03502075374126434,
        0.0741577073931694,
        0.06147313117980957,
        -0.10759884864091873,
        0.02819225564599037,
        -0.0012758804950863123,
        -0.009663226082921028,
        0.08103549480438232,
        0.03271555155515671,
        0.043577950447797775,
        0.025112057104706764,
        0.019902655854821205,
        -0.03407280147075653,
        -0.04858575016260147,
        -0.019741253927350044,
        0.05360724776983261,
        -0.003848534543067217,
        -0.10629402846097946,
        0.03398236259818077,
        -0.05228089168667793,
        0.006420013960450888,
        0.04564235359430313,
        -0.013911888934671879,
        0.02911931835114956,
        0.001224546111188829,
        0.07808395475149155,
        -0.03517203778028488,
        -0.018802108243107796,
        0.015874242410063744,
        0.02368604950606823,
        0.015185938216745853,
        -0.0790799930691719,
        -0.06721155345439911,
        -0.14913086593151093,
        0.059161871671676636,
        0.05269072949886322,
        -5.293461313726766e-08,
        0.041636012494564056,
        0.0009362485725432634,
        -0.031203575432300568,
        0.06355046480894089,
        -0.0453314371407032,
        -0.03293626755475998,
        -0.001417584135197103,
        -0.05769062414765358,
        0.10056450217962265,
        -0.009372740052640438,
        0.008047117851674557,
        -0.13627982139587402,
        -0.08370758593082428,
        0.042590297758579254,
        -0.07145414501428604,
        0.07046876847743988,
        0.0439603254199028,
        0.07935787737369537,
        -0.010506370104849339,
        0.024107251316308975,
        -0.05483242869377136,
        0.07780612260103226,
        0.04099038988351822,
        -0.03310031443834305,
        -0.03916146606206894,
        0.050253935158252716,
        -0.09064355492591858,
        -0.05591912567615509,
        0.05281532183289528,
        0.042232781648635864,
        -0.030789054930210114,
        0.004910608287900686,
        -0.0051506804302334785,
        0.03949262574315071,
        -0.020483843982219696,
        -0.030954651534557343,
        -0.012947840616106987,
        -0.004370058421045542,
        0.05236848443746567,
        0.04278108477592468,
        0.06658780574798584,
        -0.0620260052382946,
        -0.001141331042163074,
        0.023009326308965683,
        0.030321527272462845,
        -0.0801621675491333,
        -0.040638748556375504,
        -0.13844060897827148,
        -0.026052318513393402,
        0.09187581390142441,
        -0.04327709227800369,
        0.006440005265176296,
        0.007018097210675478,
        -0.004380494821816683,
        0.03222911059856415,
        0.0039425380527973175,
        0.03991559147834778,
        -0.05345836281776428,
        -0.09068404138088226,
        0.018920378759503365,
        0.08896138519048691,
        -0.09511410444974899,
        0.04708818718791008,
        0.044911839067935944
    ]
}