{
    "id": "YwUiOpZP9ZU",
    "title": "Your Laptop Will Never Be The Same.",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-02-19T17:04:58Z",
    "video_url": "https://www.youtube.com/watch?v=YwUiOpZP9ZU",
    "category": "Science & Technology",
    "tags": [
        "gaming",
        "gaming pc",
        "gaming laptop",
        "laptop",
        "thunderbolt",
        "thunderbolt 3",
        "gaming box",
        "aorus",
        "gigabyte",
        "rtx 2080ti",
        "rtx",
        "nvidia",
        "razer",
        "dell",
        "razer blade",
        "blade",
        "xps 13",
        "thunderbolt gaming",
        "external gpu",
        "thunderbolt graphics",
        "graphics",
        "gpu",
        "graphics card",
        "upgrade",
        "computer",
        "pc",
        "review",
        "tech",
        "hands on",
        "this is",
        "austin evans"
    ],
    "views": 606965,
    "likes": 16555,
    "comments_count": 920,
    "description": "The water cooled AORUS RTX 2080Ti Thunderbolt 3 gaming box is ridiculous in the right ways.  Trying the CHEAPEST gaming keyboards on Amazon   Everything you need to know about the Samsung Galaxy S20    My new podcast The Test Drivers!  Our second channel @thisis!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/E46wP_S-eT4",
        "https://youtu.be/C6W4jbMnJrY",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. This is the RTX 2080 Ti liquid cooled Thunderbolt gaming box. Now, I have three questions. First of all, what exactly is the point of pairing the most powerful consumer graphics card available in a Thunderbolt enclosure? My second question is, does it make any sense whatsoever? I mean you have the bottleneck of Thunderbolt, you have the bottleneck of whatever thin and light laptop you connect it to, and finally, and probably most importantly of all, is this worth the massive $1500 price tag? Let's find out, shall we? So up front, we have a USB 3.0 port, and if we flip around to the back, we actually have a pretty decent selection of ports. Including all the graphics outputs. We have Type C, Thunderbolt USB as well as ethernet. This is a very weird concept, because on one hand you have an RTX 2080 Ti. You have the ridiculous overkill capabilities of what you're going to get out of water cooling. So, realistically you should be overclocking it. On the other hand, you have limitations of Thunderbolt. Now, they do have what seems to be a pretty decent liquid cooling set up here. So we have a 240 mil radiator on the top, and a waterblock over the GPU itself, as well as the VRM. I mean you've got the dual 120 mil fans, which are exhausting straight out the top. It has a dedicated 450 watt power supply right down here. I mean, this looks like a pretty solid gaming setup. I guess there's only one way to find out. So for testing we'll be taking advantage of my daily driver, a 2019 Dell XPS 13 2-in-1, with 10th gen Core i7, as well as importantly Thunderbolt. As when you're using one of these GPUs, you need Thunderbolt 3 built into your laptop or desktop or whatever. Now another reason why I'm using the XPS 13, is I think this is sorta the sweet spot. So obviously there are much beefier, much more powerful gaming laptops that do take advantage of Thunderbolt. However, if you've got something that thick and that bulky, you probably already have a decent GPU anyway. Whereas this, while the integrated graphics are fine, they're certainly not up to hardcore gaming. Which is where this supposedly will come in huge handy. (music stops) Huge handy? - Wow. - Mm. - Mm. - Mm. - Huge-handy, I don't like that one. (laughing) That's something you have to pay for, I'm sorry. - Hey, when you pay $1500 for a GPU, you get a huge handy. (guitar music) I feel not particularly happy with this monitor right now. It is freaking really hard on this display. Argh, damn it, nothing works. Uh, so one slight issue that we've had is that it does not like running on the internal display. So I just disable the internal display, but Battlefield doesn't understand that I have two screens connected because generally speaking with Thunderbolt you don't want to run with the internal display on because it's soaking up your bandwidth. Can I please kick it over? Oh, look at that! Okay, this is not respecting me at all right now. (banging on desk rhythmically) (clicking keyboard) (banging on desk) - How's tech support in the forest? (laughing) - I don't think this is necessarily the game box's fault. This is just a matter of Thunderbolt and this XPS are really not agreeing. It just doesn't understand how to deal with this monitor. - Do you think another Thunderbolt laptop would work? - Maybe. - So it's another day and surprise, surprise, switching to the Razer Blade, a laptop which is actually designed to work with an external GPU, is working flawlessly. So the setup is exactly the same as it was yesterday. So we have the Blade. The screen is turned off to get the maximum performance. Now let's see if this actually works. Wouldn't that be lovely? Okay, we are up and running with a very cinematic 23 FPS. (laughing) So I am not particularly surprised considering that we are running it literally with everything completely maxed out. Let me bring a couple settings down to something reasonable and see what we get. Oh, look at that! Literally just by turning my ray tracing from ultra to medium we went from 20 to 40 FPS. I mean you can see it looks incredible. This is definitely a scenario in which we are getting some real performance out of the 2080 Ti. So next up we have GTA 5. Now this might not seem like a really obvious choice. However it's actually still a pretty good game to test. Specifically DirectX 11 and, very specifically, CPU usage. So this is a game, which, once you crank it up can still actually be fairly demanding. So this is mostly maxed settings at 4k. So we're in like the mid-30s right now and we can certainly turn the settings down but I actually think this is where we're starting to run into some bottlenecking. So even though the Razer Blade is still a fairly powerful laptop, it's still using a mobile chip. Which mean that while it will boost up to a fairly high clock speed, over time as you're hitting it with a pretty sustained load, that clock speed will start to drop which will start to hurt our performance. This is fine and we can very easily turn the settings down just a little bit and probably be well above 60 FPS. But I do think this is probably the first real example of a game which is starting to run, not necessarily badly, but this is nowhere near what I would expect a 2080 Ti to do if it had a better CPU and wasn't being bottlenecked by Thunderbolt. So for reference, I have this same graphics card paired with a Core i7-9700k getting 12,750 points in the Time Spy test. Now, we're not going to hit that. But I'm curious to see exactly how close we are obviously with whatever bottlenecks that exist. CPU I'd think is definitely going to be one of them. Okay, and our score is, ooh, 9600. Okay, so that's not terrible but we are certainly losing performance, not only on the CPU score, but specifically, even the graphics score is a little bit down than compared to what I would expect. For reference, though, that is still over three times more powerful than the GTX 1650 which is inside this laptop. So there's no doubt that we're getting a huge performance gain. It's just that a water-cooled 2080 Ti is obviously going to be bottlenecked running over Thunderbolt. Now what I'm curious about is if we actually start overclocking it can we get that much higher, or are we just fundamentally limited by this setup that we have here? Let's, uh, let's see. So Gigabyte does offer some software that will supposedly autoscan for GPU boost. I don't know exactly how good this is going to be. I assume not great, but let's see what we can actually get. - You see what I would do is get it to whatever the slider lets you go to and work it down. - Is that the School of Ken Overclocking? Crank it up to 11 and figure it out later? - Yeah. - Or you could go maximum at all times. So it, wait, no, that's dumb because if I had it set to this it only goes to a higher clock speed when it gets hotter! (laughing) Fan speed is fine. GPU voltage will not let me unlock, oh I can unlock, okay, cool, yeah. Give me a hundred more. I'll leave memory alone and I'll do manual GPU boost of-- - All the way! No, I'm not gonna... It's not gonna work if I do it all the way. - Why not? - Why not? It's just not gonna work. - We'll never find out. We'll never know if you don't do it. (laughing) - Why do I let you talk me into these dumb things? All right. (laughing) Wow, Ken, I can't believe that didn't work! No way! (laughing) - As Wayne Gretzky said, \"You miss 100% of the shots you don't take.\" - How is that a shot? You crank something up to a million and it doesn't work, the end. Like, that's not-- - We also have the most powerful laptop on the face of the planet. (laughing) I'm just gonna restart the whole system now. God damn it. Okay, so we have now done the auto overclocking tool with the 2080 Ti. I did manually bump up, not only the power limit, but also the GPU temperature. And let's see what we've got. So again, for reference, before we overclocked we had a score of 9,628. Let's see if this actually made a difference or whether our watercooling is not useful. The suspense is real. Ooh! That's very slightly better. So 10,072. Look, if I'm gonna be real for a second this actually is pretty impressive. So we're getting most of the performance out of our 2080 Ti using Thunderbolt. And you have to consider that there are two major bottlenecks. So first of all is the Thunderbolt 3 port. Now while, yes, it's quite fast, you still are only getting about a quarter of the bandwidth than using a PCI slot on a desktop motherboard. It's not the end of the world but it does hurt performance. But probably our biggest bottleneck here is the mobile Core i7 inside this laptop. Now, don't get me wrong. The Blade Stealth is a very nice laptop and you do get a lot of power for a 13 inch laptop, but at the end of the day you have severe thermal limitations and power restraints compared to a full desktop. So if I was using a Core i7 on a desktop I could easily tune it to go well over 100 watts of power, lots of cores, lots of clock speed. But on a laptop, you're really limited. I mean, we're realistically using, like what, a fifth that power budget, and it can't boost anywhere near as high. And when you combine those two it totally makes sense that we're losing some performance. But 20% based on all that is actually not too far to drop. However, I have one more thing I want to try. So this is the AORUS 2070 gaming box. So they actually make a couple of these. So this is the one that I think is probably the best bet for most people, or at least that was my assumption before starting this video, as essentially what you get here is still a very high-end graphics card but it is significantly cheaper. So that's actually one of the things that I haven't really touched on too much. $1500 for a RTX 2080 Ti gaming box sounds excessive and extreme, but when you actually start looking at it, it's not a bad value. So the 2080 Ti, if you just want to buy that graphics card, is $1200. So if you consider that the extra $300 goes into the enclosure, all the Thunderbolt peripherals, as well as stuff like the ethernet and USB, you also have watercooling, RGB. That's not cheap. And when you consider that Razer is one of the companies who makes a lot of these gaming enclosures, these GPU enclosures, they're charging usually about $300 for it by itself. This is actually a pretty respectable deal. My real question here is that, while this is good, should you just save yourself a few hundred dollars and buy something that's not quite as powerful? I think that might actually be a pretty smart move. So now we have the RTX 2070 gaming box connected. The nice thing is they all use the exact same cables and drivers are all set up, so it's literally just a plug and play kind of thing. So again, for reference, the 2080 Ti got 9,628 whereas the 2070 got 7,117. Hmm. So essentially, the pricing difference is almost double. So this is about $800 versus $1500 for the 2080 Ti. So right now, while yes, the 2070 is what 25% off, it actually isn't wildly off of a normal RTX 2070. So while, yes, this is cheaper, so we're looking at an $800 GPU enclosure as opposed to a $1500 one, you're not sort of seeing that doubling of performance by any stretch. This is a lot smaller and it's cheaper. I would argue it's better for most people. However, the real question here is not so much is this a practical good idea to spend this much money, but rather should you buy an RTX 2080 Ti and push it to the absolute limit? Not counting your overclocking, but like, something a little bit more grand than that. (clears throat) (upbeat electronic music) So this is the culmination of our Thunderbolt setup. So we have three 4k displays all being powered by the RTX 2080 Ti as well as that Razer Blade which is connected with a single Thunderbolt cable. Or at least, that's what I'd like to tell you. So yes, this set up is currently running on our 2080 Ti Thunderbolt gaming box, but the issue is, well, nothing really wants to work well together. And actually, I will say that this has really nothing to do with the Thunderbolt side and much more more to do with the fact that between our T.V.s, our cables and adapters going into the 2080 Ti, as well as Windows and the NVIDIA software fighting, we've had a real issue trying to get any of this stuff actually up to full resolution. So it is currently playable. You can see I have the wheel up and running but I did have to turn the resolution down to 3840 by 960. Now performance, no problem with that resolution but it doesn't look anywhere near as sharp as it should across three 4k displays. Realistically this is the upper limit of what anyone would really be doing with Thunderbolt. While, yes, this is a perfectly reasonable gaming setup there are a lot of issues. The way I would really prefer to this is if I was using three gaming monitors instead of the T.V.s. While the T.V.s work, there's too many issues with the adapters we have to get over to HDMI for this to be a viable setup, but it does do a good job of showing off that while yes, we're losing a little bit of performance compared to the 2080 Ti and a full dedicated gaming PC, even something like this is totally usable considering we're running on a 13-inch thin and light laptop. Also, I'm really really trying hard not to crash right now and it's not easy. (mimicking car wrecking) No! (banging on wheel) (laughing) It's so hard, man. - So, um I don't know why I'm playing this game. - What? What do you mean you don't know why? - I just got brought into maybe play better or worse than Austin. We will find out. - I have a lot of faith in you, my friend. - Um, you probably shouldn't, but... - All right, well, let's see what you got. What are you doing? Shift faster, you're gonna blow your motor! You only get four of those a year. - (laughing) Do you really? - Yeah. Ken you need ABS. - Oh, Jesus Christ. - And traction control. - And traction control. - Oh! - And I died. I died. - So, Ken, would you like to sum up your experiences as a world class Formula One driver? - Um, yeah. I am very bad at it. (chill electronic music) - Oh, and it crashed. - No, no, no! My beautiful racing set-up! - Oh, and it just shut off. - Wait, the game crashed. Wait, no, the computer's fine, the game just crashed. It couldn't handle our excellent Formula One driving capabilities. Anyway, thank you very much for watching this video all about this ridiculous gaming box. Make sure to subscribe to the channel for more content like this. And until next time, Ken and I are going to Monaco. - Really? - No. - Oh. (upbeat electronic music)",
    "transcript_keywords": [
        "Thunderbolt",
        "GPU",
        "Thunderbolt gaming box",
        "gaming",
        "laptop",
        "Thunderbolt gaming",
        "performance",
        "RTX",
        "gaming box",
        "Razer Blade",
        "work",
        "Thunderbolt USB",
        "cooled Thunderbolt gaming",
        "pretty",
        "Blade",
        "Thunderbolt laptop",
        "graphics",
        "game",
        "running",
        "box"
    ],
    "transcript_entity_values": [
        "13 inch",
        "5",
        "the Razer Blade",
        "Razer Blade",
        "2080",
        "2070",
        "first",
        "10th",
        "about $300",
        "a million",
        "two",
        "3840",
        "four",
        "one",
        "Dell",
        "23",
        "Thunderbolt",
        "20%",
        "fifth",
        "only one",
        "13-inch",
        "GPU",
        "2070",
        "2080 Ti",
        "10,072",
        "Core",
        "Ti Thunderbolt",
        "USB",
        "Ken",
        "XPS",
        "Austin",
        "the end of the day",
        "20 to 40",
        "4k",
        "PCI",
        "12,750",
        "13",
        "three 4k",
        "1200",
        "Jesus Christ",
        "daily",
        "9600",
        "240 mil",
        "a hundred",
        "9,628",
        "GTA",
        "800",
        "120 mil",
        "yesterday",
        "RGB",
        "a few hundred dollars",
        "300",
        "another day",
        "Thunderbolt",
        "100%",
        "DirectX 11",
        "11",
        "7,117",
        "mid-30s",
        "CPU",
        "One",
        "960",
        "Gigabyte",
        "First",
        "AORUS",
        "XPS",
        "VRM",
        "about $800",
        "Wayne Gretzky",
        "three",
        "the XPS 13",
        "2019",
        "Razer",
        "Windows",
        "Monaco",
        "Austin",
        "second",
        "1500",
        "the School of Ken Overclocking",
        "about a quarter",
        "25%",
        "2080 Ti",
        "NVIDIA",
        "2080 Ti",
        "450 watt",
        "Time Spy",
        "3"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "GPE",
        "ORDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.005449882708489895,
        -0.009912397712469101,
        0.022016827017068863,
        0.04115870222449303,
        0.019113756716251373,
        0.04902586340904236,
        -0.05579133704304695,
        0.018973378464579582,
        0.04383062198758125,
        0.005129112396389246,
        -0.027406739071011543,
        0.02832609973847866,
        0.10452205687761307,
        -0.022528311237692833,
        -0.011064326390624046,
        -0.02511359564960003,
        0.08971104025840759,
        -0.1047726422548294,
        -0.03835815191268921,
        -0.01151120476424694,
        -0.042780350893735886,
        -0.03797922655940056,
        -0.05706457793712616,
        -0.08646053820848465,
        0.02660737931728363,
        0.030498353764414787,
        0.0887281745672226,
        -0.08753605931997299,
        -0.03113579750061035,
        0.06467738002538681,
        -0.01442733034491539,
        0.0024777206126600504,
        -0.03790794685482979,
        0.00751947145909071,
        -0.05495834723114967,
        -0.1014486774802208,
        0.025550739839673042,
        -0.06353528797626495,
        -0.040186576545238495,
        -0.0958200991153717,
        -0.06634237617254257,
        -0.04083840176463127,
        0.036845382302999496,
        0.0018938211724162102,
        0.07471798360347748,
        -0.054734040051698685,
        -0.001282674609683454,
        -0.02526484802365303,
        -0.07928739488124847,
        -0.05062923952937126,
        0.010455457493662834,
        -0.020823275670409203,
        -0.047313008457422256,
        -0.019902262836694717,
        -0.06746362894773483,
        0.091380275785923,
        0.014607560820877552,
        -0.06554309278726578,
        -0.01656213589012623,
        0.018164141103625298,
        0.07545121759176254,
        -0.07070309668779373,
        -0.016962435096502304,
        0.03345288708806038,
        0.02039070427417755,
        -0.08725962787866592,
        0.05353798344731331,
        -0.005769331473857164,
        0.03241335228085518,
        0.06962517648935318,
        0.03465278074145317,
        -0.005554112605750561,
        0.032706040889024734,
        -0.028931081295013428,
        0.0510823093354702,
        0.04452734813094139,
        0.023263704031705856,
        -0.06593704223632812,
        0.06964986771345139,
        0.028854696080088615,
        -0.01176273450255394,
        0.023119349032640457,
        -0.02777237258851528,
        4.628396709449589e-05,
        0.026566963642835617,
        -0.10067767649888992,
        -0.03781343996524811,
        0.03394816815853119,
        -0.053361304104328156,
        -0.020897243171930313,
        0.08376775681972504,
        0.03879885375499725,
        0.00261359428986907,
        0.02109760418534279,
        -0.03706016391515732,
        0.05530481040477753,
        -0.10003948956727982,
        -0.04634943976998329,
        -0.01465474534779787,
        -0.002969614462926984,
        -0.029045792296528816,
        0.008846938610076904,
        0.05690193176269531,
        -0.019092030823230743,
        0.02451932057738304,
        0.016350427642464638,
        -0.030295874923467636,
        -0.031118446961045265,
        -0.049956314265728,
        -0.028024183586239815,
        -0.030070891603827477,
        -0.04589977115392685,
        -0.0995648130774498,
        0.06640151143074036,
        -0.0457458570599556,
        0.0344216525554657,
        -0.026115722954273224,
        -0.04079842194914818,
        0.09342468529939651,
        0.0589592382311821,
        -0.08898361772298813,
        -0.022696802392601967,
        -0.023851260542869568,
        -0.016695989295840263,
        -0.011456581763923168,
        0.020521048456430435,
        -0.10512527078390121,
        3.567281889990012e-33,
        -0.03734399005770683,
        0.07110316306352615,
        -0.07579246163368225,
        -0.01840088702738285,
        0.056524377316236496,
        0.03455203026533127,
        0.047572311013936996,
        -0.040039703249931335,
        0.03736871853470802,
        0.08792939782142639,
        -0.10994786769151688,
        0.06295095384120941,
        -0.03770636022090912,
        0.04150082543492317,
        0.022867165505886078,
        -0.047096896916627884,
        -0.03582267090678215,
        0.036544155329465866,
        -0.06750772893428802,
        0.04355071485042572,
        0.04029151797294617,
        0.0013998618815094233,
        0.009300682693719864,
        -0.06593341380357742,
        0.017581433057785034,
        0.002527688629925251,
        0.07976901531219482,
        -0.022123130038380623,
        0.06166395545005798,
        0.046827081590890884,
        -0.0031391012016683817,
        -0.07761754095554352,
        -0.012391799129545689,
        -0.027995452284812927,
        0.01826726458966732,
        -0.01352787483483553,
        -0.014824151992797852,
        -0.04868914932012558,
        0.08327028155326843,
        0.03521811589598656,
        -0.03197963535785675,
        0.04672977700829506,
        -0.07342305034399033,
        -0.003849234664812684,
        -0.04407218471169472,
        0.04250864312052727,
        0.02041582763195038,
        0.011760436929762363,
        -0.09750702977180481,
        -0.009910044260323048,
        0.0021787392906844616,
        0.03359339013695717,
        -0.021097568795084953,
        0.0194201972335577,
        -0.015652265399694443,
        -0.081712506711483,
        -0.044033948332071304,
        0.07552407681941986,
        0.1389157772064209,
        0.0916631892323494,
        -0.08129658550024033,
        -0.0037048279773443937,
        -0.0037157339975237846,
        0.022395670413970947,
        -0.04612106829881668,
        0.08601440489292145,
        0.08436331152915955,
        0.022357307374477386,
        -0.01778097078204155,
        -0.005573148373514414,
        0.03649464622139931,
        -0.003938303794711828,
        0.015979625284671783,
        -0.05758902430534363,
        0.12562869489192963,
        0.009850933216512203,
        -0.0008372328011319041,
        -0.019339434802532196,
        -0.01408353727310896,
        -0.023086218163371086,
        -0.10237763077020645,
        0.05075390636920929,
        0.03319874778389931,
        0.08155880123376846,
        -0.05143477022647858,
        -0.0020523827988654375,
        -0.03506693243980408,
        -0.0014843086246401072,
        0.04065193235874176,
        0.1024274006485939,
        -0.006442332174628973,
        0.02158316969871521,
        0.03197908028960228,
        0.013127589598298073,
        0.030640261247754097,
        -3.0273003765115547e-33,
        0.005065230652689934,
        -0.0759640783071518,
        -0.013811173848807812,
        0.02253885567188263,
        0.030216122046113014,
        0.010809873230755329,
        -0.011735673993825912,
        -0.03181621804833412,
        0.08434682339429855,
        -0.05307343229651451,
        0.02470771223306656,
        0.10475171357393265,
        0.013606604188680649,
        0.027501214295625687,
        0.020476918667554855,
        -0.07978711277246475,
        0.012318069115281105,
        -0.028075603768229485,
        0.018385060131549835,
        -0.05617068335413933,
        -0.024572663009166718,
        0.01761576719582081,
        0.03980245813727379,
        0.030402814969420433,
        -0.09291002154350281,
        0.03809909150004387,
        0.026011396199464798,
        -0.033260881900787354,
        0.02388632297515869,
        0.0547676682472229,
        0.021386904641985893,
        0.0398184135556221,
        0.091116763651371,
        0.04894334450364113,
        0.03594481572508812,
        0.0357193723320961,
        0.09719043225049973,
        -0.031118230894207954,
        0.011155733838677406,
        0.019573191180825233,
        0.06646810472011566,
        0.040321480482816696,
        0.03092498518526554,
        -0.027942614629864693,
        0.05235067009925842,
        0.045204080641269684,
        -0.035786282271146774,
        -0.10131902247667313,
        0.06270455569028854,
        -0.012299415655434132,
        0.020749961957335472,
        -0.01074611023068428,
        0.0008602921734564006,
        -0.026383040472865105,
        -0.022481197491288185,
        -0.1283932477235794,
        -0.033404525369405746,
        0.0131284911185503,
        0.026104670017957687,
        0.03354886546730995,
        0.08308687806129456,
        0.07309288531541824,
        0.04268190264701843,
        0.01187843456864357,
        0.033539049327373505,
        -0.030297724530100822,
        0.03083932213485241,
        -0.011373195797204971,
        0.04279101639986038,
        -0.022749926894903183,
        -0.06349097192287445,
        -0.07838775217533112,
        -0.039106693118810654,
        0.030600296333432198,
        0.007222944404929876,
        0.12346348911523819,
        0.0512930229306221,
        -0.015705890953540802,
        0.07511817663908005,
        -0.034274451434612274,
        -0.010957322083413601,
        0.06539762765169144,
        0.01875191554427147,
        0.0018012874061241746,
        0.04004638269543648,
        -0.06423342227935791,
        0.010297508910298347,
        0.03392702341079712,
        0.017649183049798012,
        0.0023963144049048424,
        -0.0526990108191967,
        -0.04613516107201576,
        -0.08073645830154419,
        -0.06190888211131096,
        -0.000533312326297164,
        -4.936891784268482e-08,
        -0.0005939383991062641,
        0.023747049272060394,
        0.01115806307643652,
        0.11080588400363922,
        -0.14582303166389465,
        -0.03920497000217438,
        0.027863267809152603,
        0.008447570726275444,
        0.16653110086917877,
        0.008624405600130558,
        0.03506386652588844,
        -0.1312645822763443,
        0.011662128381431103,
        -0.03451888635754585,
        -0.002908269641920924,
        0.08258526027202606,
        -0.010727728717029095,
        -0.040960319340229034,
        -0.013024449348449707,
        0.016318561509251595,
        0.003550886642187834,
        0.09335429966449738,
        0.05541917309165001,
        -0.02441156841814518,
        0.005527425091713667,
        0.024480009451508522,
        -0.03520771116018295,
        -0.005675649270415306,
        0.01047777384519577,
        -0.07481838017702103,
        -0.06067582219839096,
        -0.012121851556003094,
        -0.048195384442806244,
        0.136270210146904,
        0.017926666885614395,
        -0.08649979531764984,
        -0.028915831819176674,
        0.03670506551861763,
        0.08103999495506287,
        0.08102826029062271,
        -0.04248017445206642,
        -0.07972212135791779,
        -0.08247536420822144,
        -0.040846943855285645,
        0.008833695203065872,
        -0.06996981799602509,
        -0.010903767310082912,
        0.018459565937519073,
        -0.08460717648267746,
        0.09105686098337173,
        -0.03797411173582077,
        0.005510643590241671,
        -0.04272163286805153,
        -0.019253136590123177,
        -0.0003678670327644795,
        0.008614284917712212,
        -0.007231493014842272,
        0.01211861614137888,
        0.008414565585553646,
        0.003289379645138979,
        0.0036788342986255884,
        -0.03573836758732796,
        -0.07824096828699112,
        0.03209244832396507
    ]
}