{
    "id": "yYEj-yaWYJ8",
    "title": "These Smart Glasses Put Your Phone In Your Eyeball – Focals by North Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-07-28T01:15:34Z",
    "video_url": "https://www.youtube.com/watch?v=yYEj-yaWYJ8",
    "category": "Science & Technology",
    "tags": [
        "focals by north review",
        "focals by north",
        "focals by north unboxing",
        "focals smart glasses",
        "focals review",
        "smart glasses review",
        "wearable tech",
        "mrmobile",
        "michael fisher"
    ],
    "views": 762656,
    "likes": 18385,
    "comments_count": 1183,
    "description": "Sponsored by SurfShark VPN. Get Surfshark VPN at   use promo code MRMOBILE for 83% off and 1 extra month free!   [FOCALS BY NORTH REVIEW]  What if your smartphone was something you could wear on your face? No, not the creepy, canceled consumer version of Google Glass  but instead the classy, understated Focals by North. These smart glasses are an awkward first step into the future  but the particular future they promise might redefine the way you wear technology.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S FOCALS BY NORTH REVIEW]  MrMobile's Focals by North Review was produced following one month with a Focals by North review sample provided by North. In keeping with MrMobiles review policy, no compensation was requested or accepted, and North was given no editorial input or copy approval rights prior to publication.   [LINKS]  Norths Focals Laser Beam Scanning AR Glasses  Color Intel Vaunt [Karl Guttag on Technology]:    [SOCIALIZE]        [MUSIC]  \"Until Forever\" by Mattjis Muller, available at Premium Beat:   What You Got by Luciano Music Co., available at Premium Beat:   \"You Know U Iz\" by GG Riggs, available at Premium Beat:    [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #focalsbynorth #smartglasses #focals #wearabletech #wearables #googleglass #augmentedreality",
    "description_links": [
        "https://surfshark.deals/mrmobile",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.kguttag.com/2018/10/25/norths-focals-laser-beam-scanning-ar-glasses-color-intel-vaunt/",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.premiumbeat.com/royalty-free-tracks/until-forever",
        "https://www.premiumbeat.com/royalty-free-tracks/what-you-got",
        "https://www.premiumbeat.com/royalty-free-tracks/you-know-u-iz",
        "http://www.mobilenations.com/external..."
    ],
    "transcript": "- [Narrator] What if your smartphone was something you could wear on your face? No, not like that. More like this. These are called Focals by North. They're the first pair of smartglasses I've ever reviewed and they're an awkward first step into an amazing future. (upbeat music) For reasons I'll explain in a second, each pair of focals is custom built for the customer. That means if you wanna buy a pair, you have to physically visit a store in New York, Toronto or one of the company's pop-up locations. So, back in April, I went with Android Central's Russell Holly to order our review units at the Brooklyn store, which turns from a sort of industrial minimalist Warby Parker on the first floor into something more like the Starship Enterprise sick bay on the upper deck. I'm led into a booth where 11 cameras create a 3D model of my face, giving North the data it needs to build my very own custom-fitted set of focals. Over in the next room, I'm sized up for the ring I'll use to control the glasses and I'm given a chance to customize the color of both the glasses and their accompanying clip-on shades. (swiping) It's late June by the time our orders are ready and we head back to the Brooklyn store for the final calibration and setup. This turns out to take a lot longer than it was supposed to because of various bluetooth and battery issues. But eventually, my phone finally starts talking to my glasses and the result of that very 2019 sentence, I get a heads up display that appears to float right in front of my eyes. It is, indeed, like a smart watch in your eyeball. And just like a smart watch, the display doesn't turn on unless you need it. Os most of the time, you don't see anything at all. You might as well just be wearing a pair of good-old fashioned dumb glasses. But, when a notification hits your phone, the focals spring to life with a gentle tone from the speaker over the right ear followed by the message appearing to just materialize maybe two feet in front of you. If you don't need to act on the message, it fades after a few seconds. If you want to respond, you can use the control ring to select a quick reply or since the focals also have a microphone, you can dictate a reply instead. Oh and if you're already down in the comments saying, \"Well, how will we ever know if someone \"wearing smart glasses is actually paying attention \"to us in a conversation?\" Don't worry about that. It is painfully obvious when someone is reading one of these messages. Just that ability to get messages right in my eye line had me hooked on these after like a day. Whether I was walking with my hands full of bags and tripods or doing yard work, focals are even more convenient than a smart watch 'cause you don't need to do anything. Your message just appears in front of you. And look, it's not just messages. The first day I wore these in public, there was music playing on an overhead speaker and I was surprised to find the name of the song and the artist just appearing out of nowhere right in front of me. There's a good morning feature that takes you through a run down of the weather, news, and calendar appointments when you first put these things on in the morning. There's a clever location widget too if you wanna bookmark a coffee shop or a restaurant for later on. And if you wanna navigate to a new place, just click the ring button. You can ask Amazon Alexa to take you there with turn by turn directions. There's a ton of features I didn't get to try like making a shopping list and having that list automatically appear when the glasses detect that you're walking into your local store and all of it is rendered in this friendly, accessible, playfully animated fashion that just feels so comfortable. Seriously, the interface is a joy to use. If this were a commercial, that's where I'd stop. But as amazing as the focals are, you never really forget that they're a first generation product. First off, the ads and the in-store demos give you the impression that the interface just dominates the whole right-side lens, but in reality, the display is about the apparent size of a postage stamp. And at 300 by 300 pixels, it's even fuzzier than most of the smart watches I've reviewed this year. My biggest frustration is how easily the display disappears when the glasses aren't perfectly aligned on your face. This is because of the LBS technology North is using to create the heads up display. The projector on the inside right arm shines a set of lasers onto the right lens to which has this tiny little holographic window that reflects the laser light into your eye so you can see the projection. The good news is this is apparently perfectly safe, safer than it sounds. But the bad news is that the eye box, the area where your gaze has to be focused to see the projection, is very small. This is why each pair of focals needs to be custom made for each customer and even though these were built just for me, I often have to readjust them to see the display because they're heavy enough that they gradually creek down my nose pretty much all day long. Overall, the hardware design is great. It's surprising how few people even noticed I was wearing any kind of special glasses. But even here, there are trade-offs. The wide, thick arms eliminate your peripheral vision. Also, they can only fold up in a technical sense. You can't hang them from your collar and they only last about a day per charge. The carrying case helps with that since it's got a built in batter but it's just huge. And then there's the ring. As a concept, I love that you don't need to reach up to touch the focals to control them, like you did with Google Glass. But it needs a capacitive touch sensor, not a physical button because not only is it ugly, it triggers every time you pick something up or shake someone's hand. Oh and its metal cursor is just lethal to the finish on glass smartphones and just look at these things. The software shortcomings worry me less because North is just pumping out updates like nobody's business. In the time since I got my review device, it's gotten support for Spotify, EverNote, Google Keep, Trivia Game, Language Flash Cards, but some of those like Spotify suffer from long lag time and probably my favorite feature, the turn by turn walking directions is just not good. North is using Mapbox for those directions and even when I asked it to direct me to a restaurant I knew to be right down the street, it wanted to take me on a one-block detour for no apparent reason. Alexa's voice interface tends to hang a lot. The dictation tends to cut you off before you're actually done talking. Ya know, there are still plenty of bugs. So given all that, are they worth it? Well, stick around through this quick word from my sponsor and I'll tell you how much focals will run ya and whether you should pick em up. If you use free public WiFi a lot, your data bill is probably in good shape but your security might not be. That's why you should encrypt your connection with a VPN like today's sponsor. Surfshark VPN protects you while you're sharing a public network and it also helps when traveling to countries with internet censorship, which can limit access to tools like Google and YouTube. Just open Surfshark, hit the quick connect button and presto. You can browse anywhere as if you were back at home. This also comes in handy for streaming geo-restricted movies or TV shows. Try Surfshark now at the link below and use promo code MRMOBILE. You'll get 83% off of your subscription and one month free. Thanks to Surfshark for sponsoring this video. Depending on style and prescription, Focals by North will run you between six and 900 dollars. And while in one sense, I actually think that's a pretty fair price, in their current form, I just can't recommend them to most folks. They need to be lighter with a larger display, bigger eye box before I'd call them suitable for the mainstream. But at the same time, I think these are better than they have any right to be. They're at the leading edge of a brand new category of technology and in terms of software and making a product you won't be embarrassed to wear, one that won't make people around you uncomfortable, North really nailed it. That gives me hope that the second and third generations of focals might be the ones to propel smart glasses mainstream success. The only question is whether North can do it before a larger company does. Folks, if you're into wearable tech, I've got reviews from Google's Project Jacquard digital jean jacket all the way to most modern smart watches. Please subscribe to The Mr Mobile on YouTube and sound off in the comments with your favorite piece of wearable tech. This video was made possible by a review sample provided by North, but I don't take money for reviews and the company did not receive copy approval rights either. They're seeing this at the same time you are. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Focals",
        "North",
        "glasses",
        "time",
        "smart",
        "display",
        "pair",
        "smart glasses",
        "turn",
        "smart watch",
        "Brooklyn store",
        "Android Central Russell",
        "Central Russell Holly",
        "Google",
        "wearing smart glasses",
        "Surfshark",
        "store",
        "front",
        "eye",
        "ring"
    ],
    "transcript_entity_values": [
        "one month",
        "Mapbox",
        "a ton",
        "First",
        "Google Keep",
        "Flash Cards",
        "third",
        "Google Glass",
        "late June",
        "Project Jacquard",
        "Warby Parker",
        "Brooklyn",
        "Android Central's",
        "Spotify",
        "Alexa",
        "300",
        "a few seconds",
        "YouTube",
        "The Mr Mobile",
        "this year",
        "April",
        "today",
        "North",
        "one",
        "first",
        "Toronto",
        "Google",
        "83%",
        "Surfshark",
        "EverNote",
        "North",
        "second",
        "Amazon Alexa",
        "VPN",
        "MRMOBILE",
        "2019",
        "Surfshark VPN",
        "two feet",
        "New York",
        "Russell Holly",
        "11",
        "Trivia Game",
        "The first day",
        "between six"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "LOC",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.10274337232112885,
        -0.003185319947078824,
        0.05017261579632759,
        -0.09147802740335464,
        0.06622855365276337,
        -0.02901858277618885,
        0.08348169177770615,
        -0.023365020751953125,
        -0.0862264633178711,
        -0.00946617778390646,
        0.014314859174191952,
        0.09133431315422058,
        0.02590542659163475,
        0.016747480258345604,
        -0.027823342010378838,
        -0.026059076189994812,
        0.07268998771905899,
        -0.08753080666065216,
        0.019829025492072105,
        0.09598100930452347,
        0.02078958787024021,
        -0.04531323164701462,
        0.014563188888132572,
        -0.02890249341726303,
        -0.002766302088275552,
        -0.004828562028706074,
        -0.05597883090376854,
        -0.04232368990778923,
        -0.004498329944908619,
        -0.02206956036388874,
        0.028850477188825607,
        0.0474453903734684,
        0.02529051899909973,
        0.02463977038860321,
        -0.040774617344141006,
        -0.11973835527896881,
        -0.060260970145463943,
        0.07339813560247421,
        -0.10502541810274124,
        -0.021495331078767776,
        -0.09192118048667908,
        -0.08433780074119568,
        -0.059538520872592926,
        0.03500107303261757,
        0.07077126950025558,
        0.010299397632479668,
        0.056614309549331665,
        -0.07019932568073273,
        -0.02383744902908802,
        0.0072351680137217045,
        -0.11296280473470688,
        -0.08635395765304565,
        -0.00954356323927641,
        -0.04238908365368843,
        -0.020278463140130043,
        0.056796930730342865,
        -0.053768839687108994,
        0.026651693508028984,
        0.06357955932617188,
        0.03721645846962929,
        0.042449742555618286,
        -0.05449298024177551,
        -0.054139722138643265,
        0.03156450763344765,
        0.024930212646722794,
        0.09630981832742691,
        -0.0028005437925457954,
        -0.00822116807103157,
        0.06634921580553055,
        -0.06121936812996864,
        -0.005499138496816158,
        0.03957327827811241,
        0.08278480172157288,
        0.03865265101194382,
        -0.010989834554493427,
        0.06796042621135712,
        0.0941072329878807,
        -0.09543652087450027,
        -0.019712163135409355,
        -0.006931732874363661,
        0.0356491319835186,
        -0.014870692044496536,
        -0.01098758913576603,
        -0.021547632291913033,
        0.03439055010676384,
        -0.036664918065071106,
        -0.04827011376619339,
        0.0246620811522007,
        -0.008511237800121307,
        -0.0836053416132927,
        -0.02231726422905922,
        0.03287544101476669,
        -0.0509209968149662,
        -0.04573303833603859,
        0.03880200907588005,
        -0.05235031247138977,
        -0.11008629202842712,
        -0.08392658829689026,
        -0.0282124150544405,
        0.04646577686071396,
        0.09302032738924026,
        -0.01121082715690136,
        -0.0043784272857010365,
        0.00300006614997983,
        0.011903182603418827,
        -0.041530754417181015,
        -0.04244014248251915,
        0.05521412938833237,
        0.07084181159734726,
        0.08409221470355988,
        0.0007096677436493337,
        0.07819483429193497,
        -0.0066047306172549725,
        -0.05172678083181381,
        -0.059933461248874664,
        -0.03668348118662834,
        -0.05019336938858032,
        0.052237141877412796,
        0.1558138132095337,
        -0.04052172228693962,
        0.016458949074149132,
        0.01396851148456335,
        -0.03326776996254921,
        -0.10006552189588547,
        0.024119948968291283,
        0.01892995834350586,
        -0.013139269314706326,
        4.69365343391739e-33,
        -0.001034718588925898,
        0.1061139777302742,
        -0.024828551337122917,
        0.006221705116331577,
        -0.0011295495787635446,
        -0.013692880049347878,
        -0.004140631295740604,
        0.013194373808801174,
        -0.0017568891635164618,
        -0.01463470607995987,
        0.041419800370931625,
        0.05254185572266579,
        -0.029898235574364662,
        0.03214757889509201,
        -0.014379069209098816,
        -0.07487565279006958,
        0.034118592739105225,
        0.011651352979242802,
        -0.08350755274295807,
        0.022153235971927643,
        -0.055840857326984406,
        -0.0494513176381588,
        -0.02552623860538006,
        0.018218953162431717,
        -0.009344898164272308,
        0.07702077925205231,
        0.021330857649445534,
        -0.008105017244815826,
        0.07162737101316452,
        0.05514408275485039,
        -0.0260482020676136,
        0.08744309097528458,
        0.03881349414587021,
        -0.006228644400835037,
        0.05032815784215927,
        0.016908401623368263,
        -0.04345136508345604,
        -0.0764196440577507,
        0.03444749861955643,
        -0.07702483981847763,
        -0.044214218854904175,
        0.09889229387044907,
        0.01381267886608839,
        0.0004026088572572917,
        0.023962223902344704,
        -0.02269548736512661,
        -0.07443863153457642,
        0.12167354673147202,
        -0.0631273165345192,
        -0.020207909867167473,
        0.01987442374229431,
        -0.041143495589494705,
        -0.14996041357517242,
        -0.05812365934252739,
        -0.07637717574834824,
        0.02327815815806389,
        0.023806199431419373,
        0.004039505030959845,
        0.026964042335748672,
        -0.12070789188146591,
        0.06742025166749954,
        -0.01279965415596962,
        -0.028715986758470535,
        0.011301741935312748,
        -0.04766680672764778,
        0.012595443055033684,
        -0.02966376580297947,
        -0.005867981351912022,
        -0.07592736929655075,
        0.07100880146026611,
        0.023714782670140266,
        0.0016414326382800937,
        -0.004159236326813698,
        -0.0369674488902092,
        0.012095625512301922,
        -0.012671219184994698,
        -0.011041375808417797,
        0.09111427515745163,
        -0.016782628372311592,
        0.05129433795809746,
        -0.06994879990816116,
        0.04101714864373207,
        -0.060367655009031296,
        -0.055965665727853775,
        0.0043314602226018906,
        -0.025221114978194237,
        0.0052282982505857944,
        -0.09082157164812088,
        -0.016524355858564377,
        -0.0011786350514739752,
        0.002353635849431157,
        -0.01816198229789734,
        -0.03811397776007652,
        0.0020366101525723934,
        -0.10922887921333313,
        -6.1348671807171014e-33,
        -0.0466776080429554,
        -0.05057992786169052,
        -0.0028765066526830196,
        0.018598230555653572,
        0.03391542285680771,
        -0.03486964479088783,
        0.055656421929597855,
        0.053015585988759995,
        0.01985744945704937,
        -0.04712748900055885,
        0.02225171960890293,
        0.005533624906092882,
        -0.055056385695934296,
        -0.0354185476899147,
        0.0003710213059093803,
        -0.02296573668718338,
        0.03399276360869408,
        -0.04449008032679558,
        -0.03647514060139656,
        0.060294799506664276,
        0.0887082889676094,
        0.02701372466981411,
        -0.0008434690535068512,
        0.09894325584173203,
        0.021665461361408234,
        0.015974638983607292,
        0.06015484035015106,
        0.004275091923773289,
        -0.01933329924941063,
        -0.0054844957776367664,
        -0.007754351943731308,
        -0.017628543078899384,
        -0.055400971323251724,
        0.031194735318422318,
        0.022244766354560852,
        0.035662516951560974,
        0.023295767605304718,
        -0.07793373614549637,
        -0.018402481451630592,
        -0.027151960879564285,
        0.03991256654262543,
        0.021223608404397964,
        0.05518379807472229,
        0.016616497188806534,
        -0.05124432221055031,
        -0.13226354122161865,
        -0.007393375970423222,
        -0.005635579116642475,
        -0.03943392634391785,
        0.0035032208543270826,
        0.001701686647720635,
        0.012359417974948883,
        -0.01968090422451496,
        -0.013432607986032963,
        -0.08578002452850342,
        0.03992978483438492,
        0.03350650891661644,
        0.0209256149828434,
        0.04237223416566849,
        -0.018166763707995415,
        0.08055100589990616,
        0.038399845361709595,
        -0.06581579893827438,
        -0.07995512336492538,
        -0.07066638767719269,
        0.08154948055744171,
        0.0755632147192955,
        0.026501601561903954,
        0.08632702380418777,
        0.0032413562294095755,
        0.0284225232899189,
        -0.006731046829372644,
        0.04929659888148308,
        -0.054345786571502686,
        -0.029846206307411194,
        0.009657636284828186,
        -0.0035949270240962505,
        0.06555051356554031,
        -0.06210336089134216,
        -0.0189160518348217,
        0.04596644639968872,
        0.01383943296968937,
        0.04553699120879173,
        0.14335717260837555,
        0.05071502551436424,
        -0.039996981620788574,
        0.07105861604213715,
        -0.08357110619544983,
        -0.08981018513441086,
        0.03509235382080078,
        -0.03264837712049484,
        0.027760861441493034,
        -0.05913906544446945,
        0.0410233810544014,
        0.011135425418615341,
        -5.3272280808869255e-08,
        0.05611865967512131,
        0.04529079422354698,
        0.04538624361157417,
        -0.0117341298609972,
        0.006108849309384823,
        -0.033026453107595444,
        -0.020879844203591347,
        -0.016765283420681953,
        -0.0375867635011673,
        -0.02792397513985634,
        0.01379310805350542,
        -0.0031295965891331434,
        -0.027528066188097,
        0.01194006111472845,
        0.04070856049656868,
        -0.011487147770822048,
        0.04092461243271828,
        0.026215260848402977,
        -0.07667476683855057,
        0.06093047186732292,
        -0.02340679243206978,
        0.016011686995625496,
        0.03957276791334152,
        0.027870383113622665,
        -0.010545814409852028,
        0.0872092992067337,
        -0.027049511671066284,
        -0.037800952792167664,
        0.09520357847213745,
        0.044311147183179855,
        -0.004798051435500383,
        0.05045885220170021,
        0.050007253885269165,
        -0.018571501597762108,
        0.0038001583889126778,
        -0.05607479438185692,
        -0.025690503418445587,
        -0.002912377007305622,
        0.05816265195608139,
        -0.009575010277330875,
        -0.006449887063354254,
        -0.07197066396474838,
        0.03813813999295235,
        0.08370174467563629,
        -0.06313364207744598,
        -0.06400280445814133,
        -0.004750382155179977,
        -0.10433901101350784,
        -0.06296772509813309,
        0.09755919128656387,
        0.03072439320385456,
        -0.08080021291971207,
        -0.048058945685625076,
        0.04180007427930832,
        -0.02980998158454895,
        -0.05105145275592804,
        0.1040121540427208,
        -0.056482139974832535,
        -0.03568516671657562,
        0.017095232382416725,
        0.06828994303941727,
        0.008703429251909256,
        -0.0264301635324955,
        0.06266739964485168
    ]
}