{
    "id": "yyqNR6W_MUQ",
    "title": "The Pixel 4 XL has 4 little problems...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-11-05T13:15:25Z",
    "video_url": "https://www.youtube.com/watch?v=yyqNR6W_MUQ",
    "category": "Howto & Style",
    "tags": [
        "Pixel 4",
        "Pixel 4xl",
        "pixel 4 XL",
        "pixel 4 durability test",
        "bend test",
        "scratch test",
        "burn test",
        "broken pixel 4",
        "cracked pixel 4",
        "lastpass",
        "lastpass login",
        "password generator",
        "lastpass chrome",
        "lastpass download",
        "lastpass premium",
        "random password generator",
        "password manager",
        "recover",
        "lastpas",
        "laspass",
        "lastpass premium features",
        "delete account mobogram",
        "lastpass.com",
        "how secure is my password",
        "last password",
        "Pixel 4 review",
        "Pixel 4 unboxing",
        "pixel four",
        "google phone"
    ],
    "views": 3799044,
    "likes": 108338,
    "comments_count": 10229,
    "description": "Its time to durability test the Pixel 4 XL! Thanks to LastPass for sponsoring a portion of this video. Click here to start using LastPass:  The systematic durability test from JerryRigEverything is a rite of passage for any upcoming smartphone. Todays Pixel 4 XL is no different. Most phones survive my durability tests without any major damage. This Pixel 4 XL is not one of the survivors. Google's smartphone has cracked in four different places along the frame. Each of the antenna lines covered by thick paint cracks when the  phone is bent. The Pixel 4xl should not be placed in your back pocket, or anywhere where the the phone can be flexed.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://lastpass.onelink.me/HzaM/2019Q4NovemberJerryRigEverything",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "A portion of today's video is sponsored by LastPass. Today we're going to be durability testing the Pixel 4 XL one of the most hyped Android phones of 2019, that does look strangely familiar. Huge thanks to LastPass for sponsoring today's video. LastPass is a totally free app that relieves the burden of remembering all of your passwords. It generates super long secure passwords and then autofills the username and password for any app or website that you want to visit. And it works whether you're on a smartphone or a computer. With LastPass you don't have to write down, remember, or keep resetting passwords when you forget. LastPass allows you to keep track of all of your passwords easily. Used by millions of people, there is unlimited password storage and free cross device sync. So switching between computers and cell phones is super easy. Now you don't have to be like your grandparents using the same simple password for everything. All of the passwords are encrypted and stored within the LastPass app itself. It simplifies your life. LastPass also supports the new face unlock on the Pixel 4, which means you can use your face to log into apps as well. The app itself is 100% free, but if you want a few extra perks like one gigabyte of encrypted storage it's just $3 a month. Click the link below in the description to learn more, and huge thanks to LastPass for sponsoring this portion of the video. Now it's time for the durability test. Let's get started. [Intro] So the Pixel 4 is the most recent in Google's long line of smartphones. The Pixel lineup is a continuation of the Nexus lineup back in the day. It's kind of supposed to be the latest and greatest of what Android has to offer. You know, the pure experience. This latest version though looks mostly just like Pixel tried to copy iPhone's homework, didn't change anything, and still managed to get the answers wrong. Inside the box we get the USB-CD/USB-C charging port, along with a regular USB adapter and 18 watt charger. Same as the charger included with the iPhone 11 Pros. Most phones released this year have either bezel-less displays or a small notch of some kind. The Pixel line probably got its feelings hurt last year with so many jokes about the bathtub notch, so it decided to just skip the notch entirely and go back to the bezels of 2017...that match my 2 year old Galaxy S8 perfectly. This would all be fine of course since you know, function matters more than aesthetics, but the Apple homework that Pixel copied, yet still got wrong, goes much deeper. The square camera cutout, which takes up the same amount of space, is missing an entire camera. I'll get to that more in a second. The Pixel 4 is kind of like that we have food at home meme, but instead of having an iPhone at home, it's a Pixel 4. Let's get going on that scratch test. You know how this works. On Mohs scale of hardness, plastic, like on the Nintendo Switch, scratches at a level 3. Glass would be a 5 or 6. And sapphire would be levels 8 or 9. The Pixel 4 XL is using Gorilla Glass 5, and starts scratching at a level 6 with deeper grooves at a level 7. Perfectly on par with the rest of the tempered glass covered smartphones out there. Now this large top bezel isn't for nothing. It does contain an 8 megapixel selfie camera that films in 1080p, and it has a flush wire mesh protecting the interior top stereo speaker. Along with some other face unlock sensors. Keep in mind that the Pixel 4's face unlock still works with your eyes closed, which is an extremely creepy flaw. But most uniquely, next to the speaker grill is a small underscreen radar system that can sense your hands and wake up the phone before you even touch it. Kind of nifty. We'll have to take a look at that little guy from the inside. The Pixel 4 comes in 3 colors: black like you see here, along with a white and an orange. The metal frame isn't anodized like most metal smartphones. Pixel is doing that same thick kind of paint thing they've been doing on their last few phones. They call it a matte finish hybrid coating. It's pretty thick stuff. Dropping your phone might cause it to chip instead of just scratch. You can see all the flakes coming off of my razor. The SIM card tray has a singular SIM slot. There's no expandable memory. It does have a rubber ring around the opening to keep water out. The Pixel 4 XL is ip68, but tested at 1.5 meters. Remember, the flagship iPhone 11 Pro is also ip68 but tested at a much deeper 4 meters. If the Pixel 4 really wants to copy the iPhone 11 Pro, then they definitely have a long way to go...and that's coming from me. The paint is thick enough to shave off. It also coats the volume rocker but not the power button. The power button is a white accent made from plastic. Down at the bottom we still have no headphone jack, but we do have the 18 watt fast charge capable USB-C charging port. There is a nice plastic buffer layer between the glass screen and the metal frame of the phone that will help protect the front glass during drops for the crazy people who don't like cases. Now let's check out this camera lens. The Pixel 4's this year have 2 cameras under this massive rear camera lens. It's scratch resistant and covered with glass. There's a 12 megapixel normal camera and a 16 megapixel 2x telephoto zoom camera. Personally I think telephoto is pretty cool and I'd be totally fine with this setup if it was still 2017. Nowadays, every major flagship has 3 perspectives, and that leaves the Pixel 4 pretty behind the times. You might be thinking to yourself, 'But wait, doesn't the Pixel 4 have that cool new high refresh rate screen? That's pretty futuristic, right?' Well yes, but actually no. The Pixel 4's 90 Hertz display only works at brightness levels above 75%. Of course you can go super nerd and enter the developer settings and force 90 hertz all the time, but unless Google puts out a software update, the average person will not be getting the 90 hertz display they thought they were paying for. The screen did last about 40 seconds under my burn test though, which helps out pretty much nobody. There was no damage done to the screen. Now don't get me wrong, maybe you want the Pixel Phone for it's on board Google Assistant or it's picture taking abilities. The Pixel does do somethings very well. But from the current price perspective and hardware perspective, I feel like there's some major room for improvement. Which brings us to bend test. Bending the Pixel 4 XL from the back is fine. The screen keeps the phone structurally solid with no kinks or cracks in the frame. Bending the phone from the front though...there's a loud pop. Honestly I haven't had a phone break in so long it kind of scared me...so I stopped. Right under the large square camera lens above the white power button is a full crack all the way across the frame. It looks fairly painful. Let's keep going to see if anything else breaks. Continuing the bend we hear another crack. This time on the other side above the SIM card tray. The Pixel 4 is now snapped in 2 places but it's still alive. Continuing on, we now have more cracks appearing at the bottom of the phone. The problem with the Pixel 4 XL is the antenna line placement. Every metal phone has antenna lines built into the frame. Pixel is using their thick paint to cover these antenna lines...which looks pretty aesthetic from the outside, but they never addressed the structural weak points inside of the phone. It's the same thing up here at the top. Another weak cracking point in the metal frame right next to the plastic antenna line. The Pixel 4 is broken in 4 places. Yeah, the screen is still alive along with the back panel, so it's not a total failure. But for this price point, it's kind of ridiculous. We've come full circle. Google's flagship Android phone, the Pixel 4, now does less and costs more than Apple's iPhone 11. And that hurts me a little inside. Now that all the major phones are out for this year, I think I will be upgrading my 2 year old Galaxy S8 Plus. I work a lot from my phone. Currently I'm leaning towards to Note 10 Plus, but we'll see what happens. Google has the budget and power to make a Pixel device for the ages. But instead we got a budget looking iPhone that isn't even structural. They aren't putting a whole lot of effort into innovation or competition, and it shows. There are quite a few mid range smartphones that I would pick over this Pixel 4 flagship. We can always try again next year. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Pixel",
        "phone",
        "LastPass",
        "Pixel Phone",
        "camera",
        "kind",
        "phones",
        "passwords",
        "iPhone",
        "year",
        "today video",
        "Glass",
        "Pixel line",
        "Google",
        "screen",
        "frame",
        "pretty",
        "Pixel lineup",
        "hyped Android phones",
        "today"
    ],
    "transcript_entity_values": [
        "Google",
        "just $3",
        "hertz",
        "2019",
        "iPhone",
        "Nexus",
        "Galaxy S8 Plus",
        "9",
        "ip68",
        "6",
        "8",
        "Twitter",
        "XL",
        "1080p",
        "Instagram",
        "2017",
        "100%",
        "one gigabyte",
        "last about 40 seconds",
        "iPhone 11",
        "4 meters",
        "Glass",
        "XL",
        "jack",
        "75%",
        "the Nintendo Switch",
        "16 megapixel 2x",
        "12 megapixel",
        "Galaxy S8",
        "4",
        "SIM",
        "next year",
        "this year",
        "Hertz",
        "5",
        "The Pixel 4",
        "Apple",
        "90",
        "millions",
        "last year",
        "second",
        "1.5 meters",
        "Pixel 4",
        "the Pixel Phone",
        "The Pixel 4",
        "today",
        "2 year old",
        "LastPass",
        "Android",
        "Today",
        "3",
        "The Pixel 4",
        "USB",
        "18 watt",
        "one",
        "the day",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "LAW",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.04668308421969414,
        0.06771072745323181,
        0.13157398998737335,
        -0.10902726650238037,
        -0.012337300926446915,
        -0.06189504638314247,
        0.019688501954078674,
        0.04335992410778999,
        -0.07291346043348312,
        -0.0015626295935362577,
        0.02153906039893627,
        0.036050666123628616,
        0.011420536786317825,
        0.025138428434729576,
        0.0013562248786911368,
        0.015460193157196045,
        0.029634375125169754,
        -0.03591081127524376,
        -0.11403190344572067,
        0.04918954148888588,
        -0.016445603221654892,
        -0.09062860161066055,
        -0.0230869073420763,
        -0.051396217197179794,
        -0.004216295201331377,
        0.07595685124397278,
        0.020173141732811928,
        -0.03532962501049042,
        0.0018037301488220692,
        -0.07946646958589554,
        -0.00219785887748003,
        0.1258530616760254,
        -0.0028644332196563482,
        0.04748184606432915,
        0.004491650499403477,
        -0.02682812698185444,
        0.016532830893993378,
        -0.010298122651875019,
        -0.015420054085552692,
        -0.0043324693106114864,
        0.01988639310002327,
        0.00046904466580599546,
        0.0001863053475972265,
        -0.03801950439810753,
        -0.0060618785209953785,
        -0.026181921362876892,
        0.12191415578126907,
        -0.022826384752988815,
        0.10047436505556107,
        -0.05578787252306938,
        0.0064248149283230305,
        0.030359186232089996,
        0.026603108271956444,
        0.0681886225938797,
        -0.08089416474103928,
        -0.00782641302794218,
        -0.023569853976368904,
        0.02059020847082138,
        0.048203304409980774,
        0.04436853900551796,
        0.1154056265950203,
        0.045237261801958084,
        -0.002401083940640092,
        0.10448581725358963,
        -3.772044146899134e-05,
        0.04091329127550125,
        -0.020347369834780693,
        -0.11967656016349792,
        -0.010113636031746864,
        0.06889732927083969,
        -0.01823950558900833,
        0.001342451898381114,
        -0.062384139746427536,
        -0.03980816528201103,
        0.013969113118946552,
        0.05901182070374489,
        -0.022055819630622864,
        -0.03367988392710686,
        -0.0034408788196742535,
        0.04850657284259796,
        -0.036091405898332596,
        -0.012116404250264168,
        -0.018817737698554993,
        0.03631330281496048,
        0.03998371958732605,
        0.04291291534900665,
        0.024484964087605476,
        0.07585066556930542,
        0.003212981391698122,
        -0.08797043561935425,
        0.029177047312259674,
        0.11628996580839157,
        -0.08423751592636108,
        0.09624665975570679,
        0.027332594618201256,
        0.006373655050992966,
        -0.03847500681877136,
        -0.10894742608070374,
        -0.012152856215834618,
        0.009085899218916893,
        -0.014372912235558033,
        -0.04312608763575554,
        0.025897404178977013,
        0.037577755749225616,
        0.007280718069523573,
        -0.07805555313825607,
        -0.040379878133535385,
        0.010375602170825005,
        -0.014833771623671055,
        0.012938743457198143,
        -0.0002915462537202984,
        0.014946422539651394,
        0.004166742321103811,
        0.06737930327653885,
        -0.009794363752007484,
        -0.04621032997965813,
        -0.03340260684490204,
        0.009048044681549072,
        0.05715763568878174,
        -0.03139346092939377,
        0.006207158789038658,
        0.014505031518638134,
        0.004445050843060017,
        -0.06977863609790802,
        0.045925822108983994,
        -0.02704002521932125,
        -0.07509563118219376,
        6.015971069919212e-33,
        0.02686699666082859,
        0.12104928493499756,
        0.0031995908357203007,
        -0.005416037980467081,
        -0.04443515092134476,
        0.03530682995915413,
        0.033231426030397415,
        0.07714373618364334,
        -0.007904627360403538,
        0.03192957118153572,
        0.01651132106781006,
        -0.008578493259847164,
        -0.04894504323601723,
        0.016297457739710808,
        0.0327930711209774,
        0.060870878398418427,
        -0.013791609555482864,
        -0.05909879505634308,
        -0.09486647695302963,
        0.046556830406188965,
        -0.006081792060285807,
        -0.06549249589443207,
        -0.027271168306469917,
        0.053580377250909805,
        -0.0031650725286453962,
        0.05159425735473633,
        0.07992382347583771,
        0.005158964544534683,
        0.016183095052838326,
        0.038542624562978745,
        -0.09299013763666153,
        -0.016859203577041626,
        0.03227567672729492,
        -0.013168321922421455,
        -0.0882851853966713,
        0.057040441781282425,
        -0.07463105767965317,
        0.001124569564126432,
        -0.04045366123318672,
        0.06749089807271957,
        -0.10731298476457596,
        0.0007037871400825679,
        0.05143575742840767,
        -0.08098763972520828,
        0.0835333839058876,
        -0.03335738927125931,
        -0.029071470722556114,
        -0.03714574873447418,
        -0.00044385925866663456,
        0.007222311571240425,
        0.03318151459097862,
        -0.0647202581167221,
        -0.0027981000021100044,
        -0.06045924499630928,
        -0.10005450248718262,
        0.010350490920245647,
        0.003066461067646742,
        -0.04092146456241608,
        -0.04943797364830971,
        0.06278964132070541,
        0.02258276753127575,
        -0.033707741647958755,
        -0.09995007514953613,
        0.07033831626176834,
        0.02970980480313301,
        -0.011339914985001087,
        0.033796362578868866,
        -0.025014124810695648,
        -0.10317021608352661,
        0.02651522494852543,
        0.029837628826498985,
        -0.030383069068193436,
        0.036570217460393906,
        -0.00681700836867094,
        0.010156060568988323,
        -0.03860600292682648,
        -0.05069833621382713,
        0.023284172639250755,
        0.039327241480350494,
        0.010603025555610657,
        -0.06627529114484787,
        -0.010919519700109959,
        0.09871049225330353,
        0.006128797773271799,
        -0.04561159387230873,
        -0.07070360332727432,
        0.0819304808974266,
        -0.0650467723608017,
        0.0016508214175701141,
        0.04090830683708191,
        -0.02897346392273903,
        -0.04662849009037018,
        -0.0668732225894928,
        -0.025130541995167732,
        -0.017442777752876282,
        -7.337515083701399e-33,
        -0.0021271700970828533,
        -0.007206187583506107,
        0.03492382541298866,
        0.04263397306203842,
        -0.024704402312636375,
        -0.045005518943071365,
        0.0850730836391449,
        0.1353365182876587,
        0.014185807667672634,
        -0.04836377874016762,
        0.035234760493040085,
        0.05039627477526665,
        -0.03884269297122955,
        0.05644255504012108,
        -0.019010215997695923,
        -0.050983309745788574,
        -0.05612529441714287,
        -0.1352834403514862,
        -0.07155881822109222,
        0.021571001037955284,
        0.042764198035001755,
        0.01071933377534151,
        0.05621364340186119,
        0.048351217061281204,
        0.040139324963092804,
        -0.011096792295575142,
        0.06088991463184357,
        -0.037855036556720734,
        -0.017282651737332344,
        -0.00900142453610897,
        0.0008294076542370021,
        -0.019892795011401176,
        -0.0025322623550891876,
        0.058499597012996674,
        0.07935868203639984,
        0.017513815313577652,
        0.04285410791635513,
        -0.04368947073817253,
        0.0834275335073471,
        -0.10429282486438751,
        0.020030979067087173,
        0.0584876723587513,
        0.02010638453066349,
        -0.051427699625492096,
        0.027607886120676994,
        -0.09162187576293945,
        0.004948403220623732,
        0.03315938636660576,
        -0.023227987810969353,
        0.1383911669254303,
        0.020572856068611145,
        0.04299096763134003,
        -0.03787431865930557,
        0.020959410816431046,
        0.0019245229195803404,
        -0.0020966543816030025,
        -0.01065048947930336,
        -0.08644670248031616,
        -0.005624503828585148,
        -0.03396051377058029,
        -0.022875161841511726,
        -0.023541200906038284,
        0.009657038375735283,
        -0.005730290897190571,
        -0.01635339856147766,
        -0.01536201685667038,
        -0.0027567052748054266,
        -0.001415239879861474,
        0.01407123263925314,
        0.0945352092385292,
        0.0042918031103909016,
        -0.03671751916408539,
        -0.03955844044685364,
        -0.07706411927938461,
        0.02550794929265976,
        0.07196854799985886,
        -0.13080473244190216,
        -0.04476788640022278,
        -0.032640863209962845,
        -0.03957090899348259,
        0.03419008478522301,
        -0.06100831553339958,
        0.022401493042707443,
        0.013385403901338577,
        0.07718124985694885,
        -0.03611167520284653,
        0.028878716751933098,
        0.03894577920436859,
        -0.008241935633122921,
        0.007912181317806244,
        -0.04551281780004501,
        0.028059016913175583,
        -0.05895918980240822,
        0.06905446946620941,
        -0.007081461139023304,
        -6.082289161213339e-08,
        0.010601821355521679,
        0.09201452136039734,
        -0.062074679881334305,
        -0.03118095174431801,
        -0.02181672677397728,
        -0.0738241896033287,
        -0.01010581012815237,
        -0.061908621340990067,
        0.13286615908145905,
        -0.033001359552145004,
        -0.03406583517789841,
        -0.07608612626791,
        -0.0776982381939888,
        0.06956296414136887,
        -0.04292100667953491,
        0.017782647162675858,
        -0.09269223362207413,
        -0.07522739470005035,
        -0.030024541541934013,
        -0.051435697823762894,
        -0.1195637583732605,
        0.014410089701414108,
        -0.006536034867167473,
        -0.004135945346206427,
        0.02224755845963955,
        0.03165310621261597,
        -0.04209458827972412,
        0.0006864297902211547,
        0.05266735702753067,
        0.025087915360927582,
        0.006206713616847992,
        -0.007787702605128288,
        0.04253905266523361,
        -0.00878999661654234,
        -0.07001876085996628,
        -0.052425697445869446,
        0.022759541869163513,
        -0.030179398134350777,
        0.12681999802589417,
        0.044815223664045334,
        0.043023742735385895,
        -0.04618676379323006,
        0.04015641286969185,
        -0.003944986965507269,
        0.036665331572294235,
        -0.11029229313135147,
        0.05933798477053642,
        -0.09792431443929672,
        -0.019347956404089928,
        0.035878606140613556,
        -0.04715105891227722,
        0.03758053109049797,
        -0.0779542550444603,
        -0.05176350474357605,
        0.044595181941986084,
        -0.0017588126938790083,
        0.04048565402626991,
        0.05604040250182152,
        0.025228796526789665,
        -0.007306981366127729,
        -0.02243439108133316,
        -0.028515540063381195,
        -0.021995751187205315,
        0.047337912023067474
    ]
}