{
    "id": "Z-SAI_ga8dM",
    "title": "A Porsche you still can’t afford - AOC Porsche Design PD32M",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-01-22T20:00:42Z",
    "video_url": "https://www.youtube.com/watch?v=Z-SAI_ga8dM",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "porsche",
        "design",
        "agon",
        "aoc",
        "monitor",
        "cool",
        "car",
        "144hz",
        "4k",
        "mini-led"
    ],
    "views": 392577,
    "likes": 14872,
    "comments_count": 753,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   Porsche is usually known for their super-luxury cars that only millionaire YouTubers can afford, but did you know that they also make monitors that only millionaire YouTubers can afford? Plouffe is here to take a look if this AOC x Porsche Monitor is worth your money or if you should leave the cash in your dream car fund.  Buy an AOC Porsche Design Agon Pro:  Buy a Cooler Master Tempest GP27U:  Buy a Samsung Odyssey Neo G7:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The Porsche tax 0:19 Unboxing 3:22 Stand adjustments and Monitor IO 6:31 Sponsor - SecretLab 6:57 Boot-up sound, monitor settings, and RGB 9:40 Watching HDR footage 10:21 Gaming and speaker impressions 12:07 Pricing, competitors, and overall thoughts 13:42 Outro",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://geni.us/VGw2",
        "https://geni.us/0tzqXdR",
        "https://lmg.gg/hxab8",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- How much are you willing to pay for something to be Porsche designed? Well, we've got the PD32M, which is really by Agon by AOC, but it's got the Porsche logo on it. It's a mini LED 4K 32 inch 144 Hz refresh rate display. Seems pretty good, but we won't know until we turn it on. Oh, I like their packaging. It's robust. This might be one of those ones, where it's worth it to open the bottom too. It's so tightly packed that there's like a vacuum seal. Oh my god. Okay, you're paying $300 or $400 for packaging, I guess. I will say, this is probably not the most eco-friendly packaging, but some of the nicest and most robust packaging I've seen for a monitor. If they're not going with something more eco-friendly like paper, cardboard, whatever, I at least prefer when they use this kind of foam rather than that crappy white styrofoam that just flakes off and gets everywhere. We got this box. It says Porsche design. Is it Porsche? Is it Porsche? - [David] Porsche? - Is it Porsche? Is it Porsche? I think it's Porsche but it's pretty... (laughs) Okay, so, cool. Power brick. I'm not a fan. I prefer... I'm okay with like a thick monitor if it means that I don't have this giant ass power brick laying down on the ground. There's a cool USB key. Why is this here? I am not sure. Looks pretty. Says Porsche design on it. What else we got? Power cable to match our brick. Wow. Is this a headphone extension? I genuinely don't know if this is just like an aux cable, but it's here. This is their little controller, so you can control the OSD, I'm guessing, the onscreen display menus, with this guy. I think parts of it are metal, although I'm not sure. The only kind of major downside is that it uses... Oops. (metal clanking) The only kind of major downside is that it uses AAA batteries. I really wish it was rechargeable or just plugged in. Honestly, I would be okay with the cable, but yeah, it's definitely like metal or something. HDMI ultra high speed certified. So, what does that mean, that it's 2.1? Yes, 'cause it says 8K on the cable. It's got display port cable and then a USB C to USB A. Pretty wild. It looks like the stand is all in this central piece here, so I'm gonna take that off. Yeah, I don't know what we'll do with this after. It's honestly pretty high end. It's mini LED, and it can do I think 1,152 dimming zones, which is pretty decent for a panel this size. It's not gonna beat OLED, where every pixel is zoned. I was almost ready built. I was so close to Jerry rigging everything. Oh, look at that. It's got a little symbol there. Is that the Porsche logo? It's not. I'm kidding. It's definitely not. (laughs) I have no idea. But yeah, we're gonna do the classic move of the foam, click in the stand. This one actually comes fully assembled. It's a single piece which is actually really nice. Well, no. Okay, sorry. It's not fully, fully single. There's like some... There's a gap here, so this is joined together. I do already really dig the design of the stand, but let's plug it in. Looks like it's just standard VESA 100x100. Okay, wow, this is heavy. Get off of here, foam. (foam rustling) (bag rustling) Cool. One thing that I would like when you're spending this much money is often you'll get a... Beneath this foam, you'll get like a really thin single sheet that covers the panel itself. Maybe they feel like they don't need it because this packaging is so good. That's fair I guess, so whatever. Otherwise though, it looks like it is what it is. It's a 32 inch panel. The stand has a bunch of movement to it, which is always wanted. You can go vertical if you really want to and I think you can do it. Yeah, you can go both ways, which is always nice. It doesn't make a big difference. You can just flip portrait mode to suit your needs. But you know, it's kind of nice when you have options like this. Maybe you want to have your access to your IO on this side instead of on this side and then you just rotate it the other way. I have no idea why you would want this panel for a vertical. It seems like a waste. Your vertical display is usually like code, or discord or something like that. It's not your main gaming display. And there's also height adjustment, which is actually quite a bit. That's not bad. I mean, that's pretty standard. Don't get me wrong. But they could have gone with like half of this and just said it's height adjustable, and I would've been pretty happy. Let me peel this weird tape off. I don't know why this is here. Does this come out? It says headphones. Click it. Ah, headphone hangar. Pretty nifty. I actually really like this design too. As much as I think that this is gonna cost an arm and a leg, and I don't really wanna buy it, I can appreciate small stuff like this. I think this looks a lot cleaner and just better than when you've got those ones that like fold out. You get two of them. (metal grinding) - Oh - Yeah. It's also metal (metal grinding) (groans) Aside from this weird logo I haven't figured out yet, maybe it's the egg on logo. I'm not sure. We've got a navigation nipple and a power button, which is always great. - [Bell] It stands for Porsche Design. - That's, oh, PD. Wow, Porsche Design. Yeah, okay, I'm just dumb. P and D for Porsche Design. Yeah, there's a mic jack, headphone jack, USB C, USB upstream, USB, actually four USB ports, which is great. On this side we've got power, Display Port, HDMI, probably 2.1 considering it came with a 2.1 cable and it's a 4K high refresh rate display, and then a PC mic cable. Oh, that's cool. Okay, so, it looks like what you can do is they give you this cable, so that you can, along with like your keyboard and mouse and whatever else you're gonna plug into the USB, you can plug in your mic to the monitor and then run your monitor to your computer, which is great. I don't think I've ever seen this. That's really cool. There's also something on the bottom of the stand here and it's a little adjustment gear, but I can't adjust at all. I don't know what that does. I don't know if it changes resistance or anything. I don't feel it changing anything. But yeah, there's some little gear down here. If we can figure that out later, we'll let you know. As for cable management, you're honestly not getting a ton unless this back pops off. I don't think it does. Yeah, you basically just go out here and up through here. It's okay. It'll work. I'm just surprised that for a company like Porsche that wants to do something that's elegant and sporty, they don't have a better cable management system. I do still really like the stand. Looks like we've got our speakers right here. There's a pair of eight watt speakers in this bad boy, and this is actually pretty good construction, so I'm really curious to see how they sound. We're gonna power this bad boy up, and listen to some Crab Rave, and play some games and stuff, but not before a word from our sponsor, Secret Lab. Thanks to Secret Lab for sponsoring today's video. Secret Lab chairs are engineered to keep you incredibly comfortable for long hours at work and play. Their new Titan EVO 2022 chair keeps you feeling comfortable for longer. Four way lumbar support, ultra comfortable line of different seat material and more. All chairs come with up to a five year extended warranty and a 49 day return policy. Head to the link in the description and check out Secret Lab today. Oh, they got a little light down there. (logo chiming) (laughs) It reminds me of the PlayStation One sound. It doesn't sound too much like it. Just the overall. (chuckles) (logo chiming) HDMI, so it automatically switched for me, which is great. Okay, we got HDR enabled. We have 1,152 dimming zones in this bad boy, which it's not gonna beat OLED. Don't get me wrong. But for a screen this size, that's pretty good. A lot of 55, 65 inch TVs on the mid-range to higher end are about that many dimming zones for mini LED right now. Anyway, we're running at 4K. We've got 10 bit color. It says peak brightness, 1,600 nits. I don't know how true that is. I think they have rated it for about 1,400. Either way, whatever. We don't want 60 Hz. We want... Oh, can HTMI 2.1 only do 4K 120 Hz. I thought it could do 4K 144 Hz. Yeah, I want to put the Display Port cable on just in case. Whoa, this is a weird OSD. What the hell? I, Okay. I actually really like this. I just don't like how like garbagey the text looks. I don't know if you can make that out on camera, but it does not look good. It looks like it was blown up and not rasterized, but the overall layout and design is actually really cool. I really love it. What does OSD setup do? Okay, it brings me into something more regular. USB selection. Okay, I don't want the... Oh, nope. I definitely don't wanna change the language. Sure, what's an extra input select? Auto. I want to use the Display Port. Okay, we got 144 Hz now with our display port cable. All right. What is light effects? Is there RGB? What the... Really? Changing may increase power assumption. Yes. - [David] Is it that little light thing on the bottom? - Yeah, there's this light on the bottom here. Oh is that with the... Yeah. Oh, cool. Okay, okay, okay. Pretty sweet. You know that weird thing I found on the bottom of the stand before? It changes the logo that displays. (laughs) I don't know. It's pretty cool. I wish you could turn it off, but it said rainbow breathing, so is there like RGB on the... What? (laughs) Oh my god. - [David] Oh, wow. - David, look at this. It's in the speaker and it's in this top bar here. And I don't know. I kind of wish that this was a big diffusion bar like a white diffusion bar, so that this was more prominent. Part of me kind of likes the like more muted aesthetic that they're going for with this. Either way, I dig it. I love the speaker part of it. And that looks really cool. And he's got that 8K footage, baby. - [David] Woo. - Wow, it is bright. Now, to be fair, I know we use YouTube, and it's not the best in terms of showing off HDR content, but honestly, it's at least a good indicator of whether it's gonna be terrible or not, as we've definitely seen on some other displays. There's some judder going on, which is more common in OLED than mini LED, and that might be the player. Let's get outta 8K. I went to 8K 'cause I'm dumb and I wanted to go to 8K. I bet you if we tried to stream it at 4K, (laughs) it probably fixes that right away. That's still happening, yeah. I wonder if that's something I just haven't noticed before and I wonder if it's YouTube. Oh, chromatic average. That's one I don't like. This is all good though, ultra, ultra high, very high, sure. (keyboard tapping) (car motor rumbling) Oh, baby, look at that. (car motor howling) It looks pretty good, but I will tell you motion and stuff. This is totally fine. It's actually really good. I don't know if I'm just crazy, but this is really crisp. Whoa, what's this guy doing? What's going on, gamer? Wow, those speakers are pretty good. I 100% think that you could actually get away with not using computer speakers. Don't get me wrong. A pair of really good studio monitors or even just off the shelf $100 dollars computer speakers is probably better overall, but that's pretty good. (upbeat music) It's not bad. There's definitely a lack of base, like duh. What are you expecting? There are a couple eight watts speakers sitting in a monitor, but this is totally acceptable. Cyberpunk looked real crisp even when I was like flicking around and stuff. But even with the 4,090, when we're set to ultra, the frame rate probably wasn't anything crazy, so I'd like to see something running in 300 frames a second on a 144 Hz display and I wanna just flick around, see how fast everything catches up. You can make those crucial flicks with the AWP. I've seen better. Obviously, you know when you're going with OLED or something, with those (fingers snapping) just instant lightning fast pixel response times, it's gonna win. But like... Oh, that's terrible. But this is clear. I turn and it's instant. And even when you're just cruising around, you can still make out the actual environment around you and everything. It's pretty sweet. I'm not gonna lie to you guys. This is a fantastic monitor. If you can get one on a major deal, go for it. But the problem is it is $1,800, and if you're a Canadian, it's even worse. For some reason their site listed as 31 Canadian dollars. (host and crew laughing) I wish. Buy, buy, buy, buy, buy, buy, buy, buy. 3,100 Canadian dollars. That is insane. That is more than just going from USD to CAD. It's like a 20% to 30% difference, whereas, that is not quite doubling, but it is way more than 30%. You can't justify that. I mean, the problem is you've got either the Cooler Master Tempest, which is a 27 inch screen and it's only got about 500 dimming zones, but it's 800 bucks for 4K 120 Hz or 144 Hz. If that's not good enough for you, you need the 1,000 dimming zones, the Samsung Neo G7 has 1,152 dimming zones, and it's like $1,300. So, you can save 400 bucks by just going with Samsung instead of with Porsche design. Now, it's got a really nice stand and the speakers are pretty good for computer monitor speakers, but I just don't think that that justifies $400 at least. Oh, my God. You could buy a whole other monitor for 400 bucks. You can get a decent 1440p high refresh rate monitor for like $400 or $500, at least, so I just can't recommend this thing. I think it's sick. If you ever get the opportunity to use it or to game on it, it's cool, and it's good, and you should totally try that. That's the PD32M from Porsche Design and AOC Agon. It's a really nice display. It's just a bit too expensive. This is the \"Short Circuit\". If you wanna check out other \"Short Circuits\", maybe check out the Cooler Master Tempest and see if that's the right one for you. It's a hell of a lot cheaper, few less features, but price is way more right than thing.",
    "transcript_keywords": [
        "Porsche design",
        "Porsche",
        "pretty",
        "pretty good",
        "good",
        "yeah",
        "display port cable",
        "display",
        "USB",
        "display port",
        "design",
        "cable",
        "Porsche designed",
        "Porsche logo",
        "cool",
        "buy",
        "Secret Lab",
        "monitor",
        "stand",
        "speakers"
    ],
    "transcript_entity_values": [
        "400",
        "half",
        "500",
        "144 Hz",
        "800 bucks",
        "49 day",
        "eight watt",
        "100%",
        "One",
        "about 500",
        "long hours",
        "Display Port",
        "8",
        "4",
        "one",
        "USB",
        "about 1,400",
        "60 Hz",
        "USB C",
        "USD",
        "$100 dollars",
        "a couple eight watts",
        "1,000",
        "Agon",
        "some Crab Rave",
        "Porsche",
        "OSD",
        "Secret Lab",
        "second",
        "YouTube",
        "five year",
        "Jerry",
        "Four",
        "1,300",
        "IO",
        "20% to 30%",
        "headphone jack",
        "Porsche Design",
        "the Display Port",
        "Samsung",
        "CAD",
        "300",
        "more than 30%",
        "AOC",
        "AAA",
        "10",
        "1,600",
        "the \"Short Circuit",
        "EVO 2022",
        "144 Hz",
        "two",
        "Canadian",
        "PD",
        "55",
        "400 bucks",
        "1,800",
        "four",
        "3,100 Canadian dollars",
        "300",
        "D for",
        "1,152",
        "RGB",
        "27 inch",
        "VESA",
        "the PD32M",
        "David] Porsche",
        "2.1",
        "4,090",
        "Cooler",
        "PlayStation One",
        "65 inch",
        "the Display Port",
        "today",
        "AWP",
        "31 Canadian dollars",
        "32 inch"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "GPE",
        "PERCENT",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "NORP",
        "GPE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "MONEY",
        "QUANTITY"
    ],
    "vector": [
        -0.07527291774749756,
        -0.027327531948685646,
        -0.03676784038543701,
        -0.03444506600499153,
        0.07220812141895294,
        0.014117089100182056,
        -0.0005568458582274616,
        0.04310206323862076,
        0.02442379854619503,
        0.003303782781586051,
        -0.007044922094792128,
        -0.012245643883943558,
        0.001637672889046371,
        -0.02525724284350872,
        -0.06627879291772842,
        -0.01688372530043125,
        0.09404878318309784,
        -0.03147582337260246,
        -0.017230583354830742,
        -0.021120382472872734,
        -0.07333245128393173,
        -0.11762472987174988,
        0.00394284026697278,
        0.02354278787970543,
        -0.03514309599995613,
        -0.023624634370207787,
        0.010219871997833252,
        0.0538422092795372,
        0.011502486653625965,
        -0.041779134422540665,
        0.016049448400735855,
        -0.02456004172563553,
        0.03678864985704422,
        -0.004783868324011564,
        0.014119807630777359,
        -0.08522547036409378,
        0.019140835851430893,
        -0.10739607363939285,
        -0.14442729949951172,
        -0.07648684084415436,
        -0.024730157107114792,
        -0.04202825203537941,
        -0.010245868936181068,
        0.019688250496983528,
        0.016514956951141357,
        -0.026837438344955444,
        0.014553464017808437,
        -0.015860792249441147,
        0.020945819094777107,
        0.021123716607689857,
        -0.018510175868868828,
        -0.1222926527261734,
        0.0006679103244096041,
        -0.051326632499694824,
        -0.10890579968690872,
        0.07359003275632858,
        -0.045627493411302567,
        -0.0022086279932409525,
        0.0065141706727445126,
        -0.022537609562277794,
        0.1062903106212616,
        -0.0723511129617691,
        -0.046882934868335724,
        -2.347739427932538e-05,
        -0.00418227119371295,
        0.018398091197013855,
        -0.002932250266894698,
        0.08607226610183716,
        -0.09263795614242554,
        0.08048895746469498,
        0.018575800582766533,
        -0.03234555944800377,
        0.027688922360539436,
        0.03800284489989281,
        0.011810260824859142,
        -0.0486462339758873,
        0.035159867256879807,
        -0.07579556852579117,
        0.08617880940437317,
        0.034321632236242294,
        0.022081254050135612,
        -0.006122239399701357,
        -0.08609489351511002,
        -0.03805100917816162,
        -0.0013393736444413662,
        -0.026176249608397484,
        0.05536592751741409,
        0.009319601580500603,
        0.011056911200284958,
        -0.02699897438287735,
        -0.04912160709500313,
        0.045828137546777725,
        0.04113882780075073,
        -0.07582195848226547,
        -0.04384426027536392,
        -0.011414365842938423,
        0.05418893322348595,
        0.004664340056478977,
        -0.029552089050412178,
        0.05937568470835686,
        0.04138600453734398,
        0.04611428454518318,
        0.041656821966171265,
        -0.008122346363961697,
        -0.10928581655025482,
        -0.018774231895804405,
        -0.03513718023896217,
        0.16010986268520355,
        0.01245853304862976,
        0.010746719315648079,
        -0.09029284119606018,
        0.07855314016342163,
        -0.018808607012033463,
        -0.008427949622273445,
        -0.0003144372021779418,
        -0.004306989721953869,
        -0.09509286284446716,
        -0.0247955285012722,
        0.10760507732629776,
        0.045465532690286636,
        0.004366161767393351,
        -0.0428365096449852,
        0.034669890999794006,
        0.08626702427864075,
        0.04739909991621971,
        -0.017123349010944366,
        -0.057998739182949066,
        2.811029987111393e-33,
        -0.026450110599398613,
        0.06739364564418793,
        -0.04186780005693436,
        -0.0005263833445496857,
        0.023829566314816475,
        0.1099659651517868,
        0.020290618762373924,
        0.055577706545591354,
        -0.03385530039668083,
        0.0365077368915081,
        0.013177064247429371,
        0.0071371449157595634,
        -0.08786290884017944,
        -0.0014598907437175512,
        0.05454464629292488,
        -0.03838065266609192,
        -0.025805706158280373,
        0.016733193770051003,
        -0.09105624258518219,
        -0.07777107506990433,
        0.0014900040114298463,
        -0.018291212618350983,
        0.025522852316498756,
        -0.0013686371967196465,
        0.12060447037220001,
        -0.031539808958768845,
        -0.00867921207100153,
        0.006968068424612284,
        0.07121525704860687,
        0.041544459760189056,
        -0.04920036345720291,
        -0.0007701650029048324,
        -7.582034595543519e-05,
        -0.03440265730023384,
        -0.046846065670251846,
        -0.04702882841229439,
        -0.09246138483285904,
        -0.07802365720272064,
        0.026962751522660255,
        0.02111220546066761,
        -0.014485852792859077,
        0.022499840706586838,
        -0.053346022963523865,
        -0.06930261105298996,
        -0.0515415295958519,
        0.04568760469555855,
        0.09002042561769485,
        0.041474599391222,
        0.04552501067519188,
        -0.005394547246396542,
        -0.036735933274030685,
        -0.05583468824625015,
        -0.12982121109962463,
        -0.043150052428245544,
        -0.024942368268966675,
        -0.039920683950185776,
        -0.025241905823349953,
        -0.05089541897177696,
        0.010946294292807579,
        -0.007894848473370075,
        0.006091469898819923,
        0.0006544344360008836,
        0.05807885155081749,
        -0.014197938144207,
        -0.10373744368553162,
        0.08589637279510498,
        0.03750469908118248,
        0.06864272058010101,
        -0.060588445514440536,
        0.04731680452823639,
        -0.041563283652067184,
        -0.027284175157546997,
        0.04647411033511162,
        -0.028323182836174965,
        -0.0021548480726778507,
        0.03728685528039932,
        -0.07242012023925781,
        -0.010379243642091751,
        -0.03351879119873047,
        -0.013260997831821442,
        -0.009869610890746117,
        0.001753669697791338,
        0.07204216718673706,
        0.0762375220656395,
        0.06987359374761581,
        0.03651615232229233,
        -0.008806065656244755,
        -0.01412146259099245,
        -0.012106983922421932,
        0.04564977437257767,
        -0.05563686788082123,
        -0.013453415594995022,
        -0.012884793803095818,
        -0.04028354957699776,
        -0.041538216173648834,
        -5.39135157545865e-33,
        0.00959398690611124,
        -0.03974461928009987,
        0.008114786818623543,
        0.0032813451252877712,
        0.05614103749394417,
        -0.008701175451278687,
        -0.0013638596283271909,
        0.006396993063390255,
        0.0542084164917469,
        0.012197570875287056,
        -0.006919513456523418,
        0.021893678233027458,
        -0.08252069354057312,
        0.0037201696541160345,
        0.00601082993671298,
        -0.07181669026613235,
        0.034987956285476685,
        -0.16493985056877136,
        -0.012492832727730274,
        -0.07498779892921448,
        0.05888732895255089,
        -0.0016416850266978145,
        0.030436920002102852,
        0.06332752853631973,
        -0.03390270471572876,
        -0.004078980069607496,
        0.0038481014780700207,
        0.06574690341949463,
        0.05755307152867317,
        0.05941930413246155,
        -0.020516877993941307,
        -0.06971728056669235,
        0.012574679218232632,
        0.03101487271487713,
        0.04738374799489975,
        -0.017895890399813652,
        0.07108528167009354,
        0.013828394003212452,
        -0.08725081384181976,
        0.042956020683050156,
        0.02805670164525509,
        -0.052029576152563095,
        -0.03914104029536247,
        0.014379303902387619,
        0.03945388272404671,
        -0.03819824010133743,
        -0.00011722798080882058,
        -0.0640660971403122,
        0.07533238083124161,
        -0.054276254028081894,
        0.03674278035759926,
        -0.08471792936325073,
        0.059774305671453476,
        0.044447220861911774,
        -0.14405901730060577,
        -0.042006492614746094,
        0.0227716863155365,
        0.06987273693084717,
        0.04485340416431427,
        0.02309197187423706,
        0.06854121387004852,
        0.021590447053313255,
        -0.0650903657078743,
        -0.05756761133670807,
        -0.009932221844792366,
        -0.09137219935655594,
        0.06019049882888794,
        0.04086824133992195,
        -0.0035101778339594603,
        -0.03701208531856537,
        0.0640229880809784,
        -0.04287291690707207,
        -0.04738164693117142,
        -0.045459337532520294,
        -0.027574101462960243,
        0.06955117732286453,
        0.023696169257164,
        0.004409810993820429,
        0.0867614671587944,
        -0.02096787467598915,
        -0.04537902772426605,
        -0.016987930983304977,
        0.10994207859039307,
        -0.011658902280032635,
        0.09975123405456543,
        0.0527753047645092,
        0.0020054089836776257,
        0.020975826308131218,
        -0.0006223380914889276,
        0.03205857053399086,
        -0.045627426356077194,
        0.057237159460783005,
        -0.0007538277423009276,
        0.035226669162511826,
        -0.010820860043168068,
        -5.9503236116142944e-08,
        0.0020527513697743416,
        -0.0013095326721668243,
        0.01830597035586834,
        0.02356266789138317,
        -0.05642401799559593,
        -0.10049984604120255,
        0.033792104572057724,
        0.017899446189403534,
        0.007051624823361635,
        -0.020995527505874634,
        0.03546834737062454,
        -0.08364246040582657,
        -0.001101945643313229,
        0.056577324867248535,
        -0.005051093641668558,
        -0.030341623350977898,
        -0.01677781715989113,
        0.060126014053821564,
        -0.03153447061777115,
        -0.02735627070069313,
        -0.026328302919864655,
        0.059389468282461166,
        0.08143839985132217,
        -0.04638765752315521,
        -0.025733737275004387,
        0.007374865468591452,
        -0.01075915526598692,
        0.08449363708496094,
        0.11105535179376602,
        -0.022608010098338127,
        -0.033330947160720825,
        -0.008958405815064907,
        0.06637860834598541,
        -0.04415196552872658,
        0.09033282846212387,
        -0.05688663572072983,
        -0.039201222360134125,
        0.052689120173454285,
        0.043084826320409775,
        0.01392308995127678,
        0.04143057018518448,
        -0.027049098163843155,
        -0.06709032505750656,
        0.046710144728422165,
        0.035244401544332504,
        0.04218238964676857,
        -0.02762751840054989,
        -0.1315808743238449,
        -0.024507218971848488,
        0.055244967341423035,
        0.014779753983020782,
        -0.01735973171889782,
        -0.059001389890909195,
        0.05184411257505417,
        -0.027571648359298706,
        -0.09130740165710449,
        -0.029592495411634445,
        0.02977748215198517,
        -0.03517141565680504,
        0.019598938524723053,
        0.08024647831916809,
        -0.09578064829111099,
        -0.032514024525880814,
        0.08455368131399155
    ]
}