{
    "id": "Z2TdsdAg1_8",
    "title": "I'm a thief",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-01-29T20:50:37Z",
    "video_url": "https://www.youtube.com/watch?v=Z2TdsdAg1_8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "100 thieves",
        "LCS",
        "LoL",
        "league of legends"
    ],
    "views": 192842,
    "likes": 7125,
    "comments_count": 681,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? Welcome to today's vlog. We've got something very exciting going on today. Number one, being brunch. We're meeting Josh, Sunquist, and Ashley and Jenna's coming along, as well. Hello. - You caught me mid yawn. Hello. - Oh, are you sleepy? - Oh, well. - We're also going to one of their LCS match. This is week number two. So far 100 Thieves is 3-0. - Can you believe it? - I actually can't, who are they playing today? - I think Cloud Nine. I think, let me check. - Ohh, that's going to be a pretty good match up. So we went last week, and I don't think I even posted that vlog. So here's some footage from week one. - So there, we're here. What do you think Matt, what do you think? - I am more nervous than I thought I would be. I think I'm more nervous as an owner, than I was as a player. I am, but I'm just excited to get them on stage. I can't wait. - [Jenna] Jersey's look great. - [Justine] Yeah. - [Jenna] Turn around, show us the back. - [Justine] Oh wow, wow look at that. (laughing) - Your Yeezy (mumbles) - Come on. - [Justine] So this is the first, first of the season right? - First match of the season, playing Optic. I've been talking my trash talk to Hector, back there. But we're gonna be up here soon, so we should go inside. (excited screaming) - [Jenna] Look at you! - This is so exciting. So for some of you guys that might not know, this is Matt, this is Nadeshot. He is now the proud owner of 100 Thieves and today is one of the first matches. His team is going to be playing here at the LCS arena and I'm so excited because they're playing Optic. So you guys know, this is the fun times. - Would you guys say that you're 100 Thieves fans then? - Oh Matt, we've been there since the beginning. We remember when you were like, what do you guys think of this name 100 Thieves? - We're like fan one and two. - [Justine] And three. - I was like, I was looking like, do I frame this text message now and give it you today or? - 100 Thieves, me asking you guys about it? No way. - I don't, Ed does. - Ed has everything So, when do you guys go up? Like, next? You guys are playing Optic. - Like, any minute, literally any minute. - Someone needs to spot Matt. Watch the sign! - Sup man? Good to see you! - This is intense. - You should be up there, casting all of it. - That's okay. - Well you did such a good job at Call of Duty. E-Sports needs Justine back. - I only know Call of Duty, I can't handle League. Okay, (mumbles) did you find some seats? I'm vlogging you! Are you nervous, Jenna? - Yeah, but I believe. - I believe, too. (music) (cheering) (screaming) - So, I have to admit that I don't know a lot about League of Legends, because I've really never played. I've only played a very little bit, but I can say that this game was so long! Yay, 100 Thieves! I'm going to have to start playing if we're going to keep coming to these games. Because I need to understand a little bit more of what's going on. Call of Duty, I gotcha, but this is a whole 'nother world. - Winner winner, chicken dinner! - Did you enjoy the game? - It was amazing, yeah! Congratulations to Matt. - This is a really, really nice arena. I love it. - The first match, they won! I know, I'm so happy! (music) - There is the man of the hour. - There he is! (cheering) - They did so good. - High five. - You did it! - Oh, I need some water, help me. - I still haven't played League of Legends in about five years, so watching these matches I'm learning a lot every single week. I can't see myself really getting into this game because I know that I do not have the time to dedicate to it. This is one of those games where you need time. There's so much that goes into it that it's super overwhelming. - Time to learn, we gotta learn! - So, we gotta go. Packing up my drone, and we're going to go to brunch, because you should always bring your drone to brunch. (music) - So we're on our way to the match. I didn't even vlog during brunch. I filmed the beginning of brunch and then I forgot to film. And I have to show you guys what Josh and Ashley got me. It is, by far, the best gift ever, but more on that very, very shortly. Do you think it's starting now, are we late? - Um, we're probably a little bit late. We're not going to have time to analyze the snacks. - We're not going to be able to interview the snacks. (laughing) (music) - You're vlogging today. - Hello, Nadeshot! - Hello! - Are you excited? What's happening? Tell me everything. - 100 Thieves undefeated so far in the North American LCS. In our first season ever. - Cool! - We are facing off against a team called Cloud Nine. They're a talented team. They're 3-1, I believe. - Yep. - And so, it's going to be a really tough match-up. - This vlog is basically a compilation of the first time we came, too. So, this is like, a two-part series. (announcer speaking) (cheering) - It happened, GGs. - I'm sorry, Matt. - It's okay, Cloud Nine, they play well. That was a good game. It was a hard fought match. - You guys did well. I think so. - First shot! Okay, bye. First shot. Really unfortunate that they lost. But that's okay, there will be more games. Now I have to figure out where I parked, because I don't remember. Oh! Found my car. So now unfortunately I have to go to the craft store because I'm shooting a bunch of cooking videos, finally! You guys have been requesting them, and finally, finally, finally, I'm going to be shooting some Valentine's videos. So to make the movie magic tomorrow, I have to basically bake everything tonight so that it's easy to shoot tomorrow. So I'm at the craft store and this place is overwhelming because there is just so much stuff here that I don't even know what to do. But I know a few of the items that I need. I need this, some clear piping gel. These are a little bit small for what I need them for, but it's going to have to work because this is the only size that they have here. Now I'm going to run to the pet store really quick to see if I can find Matty a Valentine's Day present, even though it's not Valentine's Day for quite a while. But I feel like because of Youtubers and scheduling content it's Valentine's Day, tomorrow! Good Behavior bed-time bear. Mmm I know, I just don't think Matty is a good boy lately. Look at these toys! Bad Spaniels! (toy squeaking) That will get so annoying. This carrot! Are you kidding me? Wow. Oh, it's beautiful! I think Matty would absolutely look so handsome in it. I hope he enjoys it. I think he will. Hey! - Oh, are you filming? - Hey Thief! - Hi! - Wassup? - I stole a butter finger. - (mumbles) butter finger. - Mmhmm. - Hi Matty, I got you a present! You know something's in there? There's a present in there for you. See if you can find it. What we're really here for is what Josh and Ashley had custom made for Matty. So, we like to say that Matty looks like a lot of things. Mark Twain, George Washington, Matty is Presidential. What's this honey? Is that you? Is this you if you were George Washington? Is this not the best thing ever? - We have to get him a costume. - We do. So thank you so much, Josh and Ashley! I wanted to vlog at lunch, but then I completely forgot, but this is the most amazing thing ever. Like, it needs to have a special place. (baking) - [Announcer] Cash money. And tonight's prize is no normal prize. No, it is a whopping, flopping, cough-dropping 15000 despacitos, 15000 daddy yankees, 15000 US dollars! That's a lot of Sacajaweas, for that kind of Cheddar - What is he even saying anymore? (laughing) - Playing HQ Trivia and pre-baking for tomorrow's shoot. - [Announcer] It's going to be a bumpy ride. Let's get down to - Let's - Let's get down to the nitty gritty - Let's get to the nitty gritty - Numero uno, what sound does a cow make? - Oh, shut up! Now you're just insulting my intelligence. - [Announcer] The cow goes - Moo! - Moo, goes the cow. The dog goes woof-woof. - I have a bit of a problem. I always forget the cakes tend to expand a little bit. Uh oh. I'm hoping that those don't get much higher. Because if they do, I'm in trouble. That is not ready. - I think it looks nice. - It looks very nice, limited edition, too. - This is it guys, I made the team! - Whoa! I get one, too? - You do! - I'm a thief in the nights, I'm gonna - Yours looks a little bigger than Justine's. - Justine's? - Jenna's. - This is so cool! Thanks, Matt! I feel like a real thief! - When are we going to get Matty's jersey? - Ohh. - Imagine how cute he would look in his little jersey? - I'll work on that. - Does it say i Justine or Justine? - Justine. - That's me, that's me. - They don't do lowercase, so we thought uppercase would look better. - Oh then we do not put an 'i' if it can't be lowercase. - What did you do? - He just wants attention. - He's been playing Fortnite, he took down a whole tree. - He's like I've gotta - Matty, do you like Fortnite? - Fortnite? - Do you like Fortnite? - Oh, he doesn't understand. - So I'm trying to do two things at once. I just finished baking up all of my things for tomorrow that we're doing, and this No! You give me that back. Matty! If I ignore him, he'll stop, because he just wants to be chased. Anyway, I'm trying to watch Arrow, I'm on season 4, episode, I'm not sure, episode 9. This is a cake decorator stand, so you can spin this as you're decorating cake, but I'm using it for my laptop. So if I'm over here baking, I can just go like this spin! And if I'm over here, doing dishes, spin! Anyway, I'm gonna hopefully finish these up very soon. Go to bed, and we have a long day tomorrow of baking videos. But before I go I have to show you this picture of Matty. We put him in a 100 Thieves jersey. Oh, he's just so precious! Now you're eating that. Come here! Sit. He does not listen unless there are treats involved. Bad boy. I'll see you guys in my next video! Bye. (music)",
    "transcript_keywords": [
        "Matty",
        "guys",
        "Thieves",
        "Matt",
        "playing",
        "playing Optic",
        "Valentine Day",
        "Justine",
        "good",
        "Call of Duty",
        "Josh and Ashley",
        "today",
        "match",
        "tomorrow",
        "Josh",
        "Ashley",
        "Valentine",
        "time",
        "Fortnite",
        "Day"
    ],
    "transcript_entity_values": [
        "Thieves",
        "Matty",
        "Cheddar",
        "one",
        "15000",
        "? - 100",
        "Nadeshot",
        "week one",
        "the season",
        "Valentine",
        "Mark Twain",
        "Justine",
        "tonight",
        "far 100",
        "Fortnite",
        "Josh",
        "last week",
        "the North American",
        "yankees",
        "three",
        "season 4",
        "Arrow",
        "Call of Duty",
        "100",
        "about five years",
        "Ashley",
        "any minute",
        "our first season",
        "9",
        "League of Legends",
        "3",
        "George Washington",
        "Ed",
        "today",
        "two",
        "15000 US dollars",
        "first",
        "Cloud Nine",
        "tomorrow",
        "Matt",
        "every single week",
        "ta - Matty",
        "Hector",
        "Optic",
        "First",
        "Jenna",
        "a long day",
        "Sacajaweas",
        "Sunquist"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "GPE"
    ],
    "vector": [
        -0.06129932031035423,
        -0.04722719267010689,
        -0.06314746290445328,
        -0.1497412919998169,
        0.03782128915190697,
        0.05022561177611351,
        0.06424853950738907,
        0.059054479002952576,
        0.015351839363574982,
        0.04694744944572449,
        0.04585994780063629,
        0.0008754501468501985,
        0.01695440150797367,
        0.016907313838601112,
        -0.0010875719599425793,
        0.030595041811466217,
        -0.013547628186643124,
        0.016172144562005997,
        -0.0449216328561306,
        0.02903851866722107,
        -0.02113448642194271,
        -0.07418956607580185,
        0.034529633820056915,
        -0.02059001475572586,
        -0.044518083333969116,
        0.06123373284935951,
        0.019043046981096268,
        0.030521448701620102,
        -0.0982464849948883,
        -0.0732833743095398,
        -0.043750692158937454,
        0.005769350565969944,
        0.1287471204996109,
        0.018390119075775146,
        0.019666248932480812,
        -0.04499392211437225,
        0.057471636682748795,
        0.008644561283290386,
        -0.023559877648949623,
        -0.04087089002132416,
        -0.0060395412147045135,
        -0.05781284719705582,
        -0.008822385221719742,
        -0.03050200827419758,
        -0.06833048909902573,
        -0.07703782618045807,
        0.011993469670414925,
        -0.01153245847672224,
        0.06437437981367111,
        0.03067360632121563,
        -0.08946119993925095,
        0.03618401288986206,
        -0.022702883929014206,
        0.0566440112888813,
        -0.1100255623459816,
        0.004332341253757477,
        -0.042323578149080276,
        0.03399220481514931,
        0.06740913540124893,
        -0.07870209217071533,
        0.022469596937298775,
        -0.015066715888679028,
        0.013539833948016167,
        0.05706189572811127,
        -0.053809843957424164,
        -0.029725657775998116,
        0.020283490419387817,
        -0.002188002457842231,
        0.007406730204820633,
        0.02194385603070259,
        -0.1136706992983818,
        0.044887177646160126,
        -0.04822676256299019,
        0.037243399769067764,
        -0.0013380346354097128,
        0.0464935302734375,
        0.024734392762184143,
        -0.045733492821455,
        -0.0416351854801178,
        0.032385099679231644,
        0.03170815110206604,
        -0.04952821880578995,
        -0.0992337018251419,
        0.01457306183874607,
        0.01721852831542492,
        0.06428201496601105,
        -0.023285826668143272,
        0.0070618498139083385,
        -0.010379215702414513,
        -0.1054418683052063,
        -0.1104084923863411,
        -0.004640398547053337,
        0.007440521847456694,
        -0.039443425834178925,
        -0.02965136058628559,
        -0.07953950017690659,
        -0.026538589969277382,
        -0.02969355694949627,
        -0.04883434250950813,
        0.07812728732824326,
        0.04415508359670639,
        -0.06409371644258499,
        0.02977234683930874,
        -0.06272482872009277,
        0.009501626715064049,
        -0.10122086852788925,
        -0.019213128834962845,
        -0.0005812205490656197,
        0.008434903807938099,
        0.020425625145435333,
        0.0017819267231971025,
        0.07353780418634415,
        -0.057825565338134766,
        -0.02822158671915531,
        0.08471247553825378,
        0.11911804229021072,
        -0.0705772265791893,
        0.10256359726190567,
        -0.0008914179052226245,
        0.06769537180662155,
        -0.010040303692221642,
        -0.06663773208856583,
        -0.004734266549348831,
        0.06793910264968872,
        -0.033032190054655075,
        0.018649118021130562,
        -0.07732045650482178,
        1.218142387896074e-32,
        -0.013008365407586098,
        0.08047843724489212,
        0.0057740118354558945,
        0.051657892763614655,
        -0.017947636544704437,
        -0.040585972368717194,
        -0.003813414601609111,
        0.09635137021541595,
        -0.04997566342353821,
        0.02774994447827339,
        0.02629665844142437,
        0.031231269240379333,
        -0.016626711934804916,
        0.05620766431093216,
        0.05340733006596565,
        0.007303692866116762,
        0.007534604519605637,
        -0.06757312268018723,
        -0.05083494260907173,
        -0.022196412086486816,
        0.025286167860031128,
        -0.022619953379034996,
        0.04707729071378708,
        0.08379505574703217,
        0.1093321368098259,
        0.024334944784641266,
        0.05171522870659828,
        -0.03489227592945099,
        0.10621754825115204,
        0.013538237661123276,
        -0.047646332532167435,
        -0.041697386652231216,
        0.016310162842273712,
        -0.059131987392902374,
        0.008115551434457302,
        0.031180907040834427,
        -0.037672001868486404,
        -0.002407025545835495,
        -0.011769264936447144,
        -0.03967303782701492,
        -0.0347752720117569,
        -0.014777538366615772,
        -0.0333341620862484,
        -0.10298847407102585,
        0.07266943156719208,
        0.02201521024107933,
        0.06885939091444016,
        0.06272364407777786,
        -0.06757976114749908,
        0.0520864762365818,
        -0.04277326911687851,
        -0.0028559030033648014,
        -0.046912916004657745,
        -0.007788709364831448,
        -0.06948427855968475,
        -0.07288534194231033,
        -0.029688701033592224,
        0.06040458008646965,
        0.09570066630840302,
        0.03558005020022392,
        -0.007142236456274986,
        0.028336387127637863,
        -8.17378459032625e-05,
        0.0066358717158436775,
        -0.09146539866924286,
        0.03630984202027321,
        0.0721585750579834,
        -0.03880796954035759,
        0.03928835317492485,
        0.056066788733005524,
        -0.02965829335153103,
        -0.00462148105725646,
        0.018801070749759674,
        0.025419341400265694,
        0.012505915015935898,
        0.050097204744815826,
        -0.06352226436138153,
        -0.04109948128461838,
        0.041523974388837814,
        -0.05595553293824196,
        -0.12545494735240936,
        0.06364181637763977,
        0.011729546822607517,
        0.08917666971683502,
        -0.022448675706982613,
        -0.03768868371844292,
        0.05952909588813782,
        -0.07691112160682678,
        -0.014673612080514431,
        0.008372069336473942,
        0.019998209550976753,
        0.07311950623989105,
        -0.09626482427120209,
        -0.0520465262234211,
        -0.025363167747855186,
        -1.2042115308760821e-32,
        0.03433358669281006,
        0.013800286687910557,
        0.015520437620580196,
        -0.026689939200878143,
        0.04864908754825592,
        -0.041139986366033554,
        -0.011158348061144352,
        0.07134592533111572,
        0.05260434001684189,
        -0.06796903908252716,
        0.01572878658771515,
        -0.049638085067272186,
        -0.08991064131259918,
        -0.007294882088899612,
        0.03059099055826664,
        -0.04504605755209923,
        -0.022467786446213722,
        -0.03313080966472626,
        0.030181709676980972,
        -0.04215976968407631,
        0.05129985883831978,
        0.15587951242923737,
        0.08627867698669434,
        0.041957054287195206,
        -0.03299393132328987,
        0.017823733389377594,
        0.028023051097989082,
        0.05712129920721054,
        0.06440763920545578,
        0.030784089118242264,
        -0.026600565761327744,
        -0.023526940494775772,
        -0.0721549540758133,
        0.017041534185409546,
        0.005740363150835037,
        0.012871907092630863,
        0.035432588309049606,
        0.04174882173538208,
        -0.01024386566132307,
        -0.055097270756959915,
        -0.008945923298597336,
        0.005101602990180254,
        -0.019634556025266647,
        -0.020356694236397743,
        -0.06614841520786285,
        -0.129109188914299,
        -0.018864285200834274,
        0.030328387394547462,
        0.022603975608944893,
        0.0049372026696801186,
        -0.051021065562963486,
        -0.0278820488601923,
        -0.007658014539629221,
        -0.0414707325398922,
        -0.0246998593211174,
        0.021291956305503845,
        -0.0007132875616662204,
        -0.024139251559972763,
        0.0476088710129261,
        0.02334503084421158,
        0.030360087752342224,
        -0.02146678790450096,
        -0.0814947858452797,
        -0.07717657089233398,
        0.009613164700567722,
        -0.095644511282444,
        0.09662245213985443,
        0.04159760847687721,
        -0.03283696994185448,
        0.02851872146129608,
        0.012947085313498974,
        0.04209112375974655,
        0.061410363763570786,
        -0.02228187769651413,
        0.020172495394945145,
        -0.035769615322351456,
        -0.11049529910087585,
        0.02100103534758091,
        0.04232143238186836,
        -0.045188479125499725,
        -0.024179188534617424,
        -0.06356241554021835,
        0.010069544427096844,
        0.07615502178668976,
        0.058828018605709076,
        0.08707758784294128,
        0.11345445364713669,
        -0.017784589901566505,
        -0.015813812613487244,
        -0.014596560038626194,
        -0.015329824760556221,
        0.0700351819396019,
        0.056128330528736115,
        0.09346695244312286,
        -0.0891474038362503,
        -6.176809108637826e-08,
        0.02644411474466324,
        0.035569120198488235,
        -0.03317161276936531,
        0.0712578147649765,
        0.03642716258764267,
        -0.03899469971656799,
        -0.05709023401141167,
        0.024865100160241127,
        0.04650084674358368,
        -0.07035914063453674,
        0.0945214182138443,
        -0.059954483062028885,
        0.005126296542584896,
        0.09245332330465317,
        0.005884353071451187,
        -0.018224604427814484,
        -0.03801240399479866,
        0.0458938404917717,
        -0.051081180572509766,
        -0.0535094253718853,
        -0.053405508399009705,
        0.051581691950559616,
        0.035001806914806366,
        -0.004235167056322098,
        0.05506175383925438,
        -0.008357214741408825,
        0.014649172313511372,
        -0.03058285266160965,
        0.029195228591561317,
        0.0684875026345253,
        -0.08907008916139603,
        -0.010019397363066673,
        0.018761491402983665,
        -0.015188564546406269,
        -0.05268171802163124,
        -0.021402627229690552,
        -0.029379189014434814,
        -0.023821640759706497,
        0.007846372202038765,
        0.016833363100886345,
        0.014323730953037739,
        -0.12603068351745605,
        -0.0572352409362793,
        0.011097070761024952,
        -0.02495410665869713,
        -0.08880972117185593,
        0.08549030125141144,
        -0.08616812527179718,
        -0.0195054579526186,
        -0.033535879105329514,
        -0.03870777413249016,
        0.013111045584082603,
        0.03450679033994675,
        -0.01172045711427927,
        0.08201051503419876,
        0.006368894129991531,
        0.03204093500971794,
        0.04867919906973839,
        0.013709668070077896,
        -0.020579205825924873,
        0.050289422273635864,
        0.003631521249189973,
        -0.04594586417078972,
        -0.002041465835645795
    ]
}