{
    "id": "z5ckEKYvUts",
    "title": "Samsung made an Apple iPad - Tab S8 Ultra",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-04-16T19:02:11Z",
    "video_url": "https://www.youtube.com/watch?v=z5ckEKYvUts",
    "category": "Science & Technology",
    "tags": [
        "Samsung",
        "Apple",
        "iPad",
        "Tab S8",
        "Tab S8+",
        "Tab S8 Ultra",
        "Tablet",
        "Mobile Device",
        "Samsung copied an iPad Pro",
        "Never stop making tablets Samsung",
        "Samsung made an iPad"
    ],
    "views": 892541,
    "likes": 35104,
    "comments_count": 2805,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code shortcircuit at   Android tablets get a bit of a bad rap since Apple dominates the market with the iPad. Samsung made something truly ULTRA that can be used every day, but do you really want to spend $1100 for the Ultra version?  Buy a Samsung Tab S8 Ultra Tablet:   Purchases made through some store links may provide some compensation to Linus Media Group.  Thanks, LinksTV, for the test footage. Check out the video we used at   Read the full specs on the Samsung Tab S8 Ultra on GSMArena at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Is it just a big phone? 0:48 - Unboxing 1:29 - Exterior impressions 3:46 - 5G connectivity info 4:24 - S Pen 4:40 - Sponsor - Vessi! 5:15 - Display impressions 6:23 - Speaker impressions 7:26 - Android tablet thoughts against iPads 8:11 - Splitscreen feature and S Pen thoughts 8:40 - Random interruptions 10:54 - Other Tab S8 models and pricing 11:50 - Battery specs 12:04 - Fingerprint reader 12:30 - Tab S8 Ultra case impressions 12:58 - Camera impressions 14:49 - Final thoughts",
    "description_links": [
        "https://www.vessi.com/shortcircuit",
        "https://lmg.gg/7Bc6D",
        "https://youtu.be/eTtBDJn1Lqg",
        "https://www.gsmarena.com/samsung_galaxy_tab_s8_ultra-11274.php",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(Linus laughing) - It looks like a big Samsung phone. I used the Tab S8 Ultra as a phone. (playful music) (Jono laughs) Jono, what is this? This isn't even the tablet box. I'm unboxing the Galaxy Tab S8 Ultra, and you gave me the box for the case. - [Jono] The case is so cool that you have to check it out. - I'm having trouble controlling my emotions. So the Galaxy Tab S8 Ultra, I think it's kind of Samsung's attempt at making like an iPad Pro type of thing. iPads have been really great recently in my opinion, but Android tablets have sucked for quite a while. Like when's the last time someone had showed you an Android tablet and you're like, \"Wow, I would want to purchase that.\" Almost never. This' already opened. Like, I don't even have to open the box. It's just like loose. It's like... (box rustles) - [Jono] We don't have standards. - Dude, I wouldn't let this happen on techland. (indistinct conversation) No. Oh, my God. It's the connection. I would let everything else happen. Wow. That is a big boy. 14.6 inch screen. That's that's like a MacBook size. Apple's out here trying to tell you to use an iPad as your computer. Meanwhile, Samsung is like, we just literally took the screen off of one of our laptops and made it a tablet. (Linus grunts) Yo, what is the aspect ratio on the is tool, it's like... Is it 16:9? I'm gonna clean the screen with the banana. It's not just for scale. So let's look at the exterior real quick because that's what Jono always wants me to do. This is kind of like a matte metallic finish on the back. We got the sort of an iPad like rounded square edge corner thing going on here. You got that Andy? Can I show that to you? So that's interesting to see Samsung not really emulate their own phone design so much as they're emulating Apple's current iPhone and iPad design with this like square edge thing going on. Although it seems to me like maybe they're improving. Look at this thing, it's huge. Although this is the Tab S8 Ultra, right? - [Jono] Yeah. - There's the Tab S8 Plus, which is 12.4 inches, and then the Tab S8 non-plus, non-ultra, the lowest and which is 11 inches. So those are kind of more normal tablet sizes. But I like how big this is. On this side we got a power button looks like, and a volume rocker, probably a microphone, SIM card slot, 'cause this is a what? SD card? Okay. We've confirmed it's a micro SD card slot and not a SIM card slot. No data on this thing. That's too bad. iPads can have data, Samsung. On the bottom or the side or whatever, I mean it's a tablets, they're confusing. There's two speakers over here, and I guess two speakers on the other side. There's four full speakers in this one Just like the iPad Pro. A USB C port, which we have determined is a USB 3.2 Gen... (beep). Gen 1. What they probably mean to put is USB 3.2 Gen 1x1 that's five gigabits per second. It's not the 10 gigabits one. I'm pretty sure. Hey USB, figure out your (beep). Like it wasn't, it's not irritating to me until I have to have to deal with it again. And then I forget about it. I'm like, oh yeah, USB, that's kind of dumb. And then I have to like find out how fast the USB port is. And I'm like, goddammit this is stupid. On the bottom we got what looks like, Samsung version of a smart connector for like accessories and stuff. And on the back we got these antenna lines. Why do you need antenna lines like that If you don't have network connectivity? - [Jono] Wifi 6E. - Oh the fancy wifis are here. (Linus chuckles) - [Jono] So the Tab S8 Ultra is wifi 6E, is only wifi. But the Tab S8 Plus, which we don't have, has an option for 5G connectivity. - So the top end model cannot have 5G. But if you downgrade to the mid-tier option, then you can upgrade the mid-tier option to a 5G model. - [Jono] Apparently - Why don't they... Wait. What's the processor in this? It's a Snapdragon 8 Gen 1. Why don't they all have 5G by default? They should support... I mean obviously like, they have to put in the the actual like antenna and stuff, but like, come on you got the antennas right here. I'm upset. There's a magnetic attachment for the S pen which is pretty cool, that it like goes right on the tablet. Although I guess that's nice if you're like carrying it around the office or something and you just need to like quickly do that. But if you're putting that in your bag, that's coming off. Okay, let's turn this sucker on. But before that, a word from our sponsor. (Linus Sighs) Vessi. Vessi footwear is known for being lightweight, easy to pack, comfortable, and most importantly, water resistant with its Dyma-tex technology. Their everyday move lineup, is made to keep up with your active lifestyle with its added support at the midsole and better breathability. It also has a pull tab to take them off and put them on with ease and it's made creature free, so you can take each step in them guilt free. Trust me, you're gonna wanna wear these creatures everywhere. (Linus laughs) So keep your feet dry and save $25 with offer code, shortcircuit at Vessi.com/shortcircuit. Ooh, look at that. Is that moving? Does it have tap? Double tap to wake. For some reason, like, I just that to be on every device, but some people are like, \"Not every device is a tablet.\" It's like, it should. So the most important thing with the tablet probably, is like the image, right? Let's let's go straight to that then. Let's go straight to YouTube or something. See, this is funny. This is like a little message saying, this app is using the full screen. The home back and recent buttons are hidden to minimize distractions and to prevent you from leaving the app accidentally. How do I get to... I can't do the regular multitasking menu? Okay. Oh, I didn't even notice, it's got the notch too. This is the tablet where they put in the MacBook notch. Like crab rave is nice, but I should like...Like what's something beautiful? Have we done something beautiful in a bit? - [Jono] Crab rave looks pretty beautiful. - Damn dude. So it's not mini-LED like what's in the latest iPad Pro, but AMOLED still looks damn fine. Especially at the resolution of 2960 * 1848. Ooh, look at the colors. The colors, and the sharpness is like really there for me. Crab rave. (bright upbeat music) That's grimey, dude. (bright upbeat music) That's grimey dude. (bright upbeat music) Maybe pause the... (bright upbeat music) That's crazy. - Why would you want something this big? - Why wouldn't you? - I came over here 'cause I could hear it. It sounded like you were playing something on the TV. - Yeah, dude. - From the speakers over in the other set. - These are pretty good for like a tablet speakers. - Yeah. And it's so thin. - So in conclusion, the speakers, are freaking sick for a tablet. Holy crap. I like felt the bass on them. So there's four of them and they were tuned by AKG. So apparently this display 120HZ, HDR10+. As for performance, I mean like, so this is still an Android tablet. Now the Apple has really made a case recently, for turning their iPad from like changing it from a mobile device into like a fun and work device. And the thing Android tablets is that, Google hasn't really had to do a lot to like add that functionality into Android because it was always sort of there. So it's interesting to now be faced with like a pro class Android tablet, that's like, yeah, you can do what all Android tablets can do. But I guess like it'll come down to, if their performance can keep up with it. Because that is really the thing that Apple still has over Android tablets. Is the fact that they are running M1 processors now. How do I split screen? Boom. And then what else should I open? YouTube. That's sort of annoying to me. That you're in split screen, but it doesn't actually use the whole screen. It's got these rounded corners on the bottom. Would it do that If I got rid of the navigation thing on the bottom? Maybe. That's already a plus over the iPad. With the S pen you can actually use it for navigation. Like instead of only having the pen be useful... The Apple pencil be useful for something things on the iPad, Jonathan. - [Horst] Think with the finger, you control with the finger. - You sound like Jerry Seinfeld. - Ah, yes. Swipe gestures. - Oh, you can switch between having the recents on either side. - There's so much customization in Android. I've been using an Android phone for a day and it's amazing what I learned. - You're switching to Android? For permanent? - No. (Linus coughs mockingly) (laughing in the background) - No way. (laughing in the background) - I will be switching Android, to try it out. To then understand why Apple is superior. - Yeah, sure do. - I'm the person who thinks the iPad pro 12.9 is too big. - Oh really? - [Horst] Yeah. - I made the opposite argument. I like that there is this option, because if there are people who want to use a tablet as their like main device, then this is a great option. I mean, like, I like that there's a tablet this big for some... There's something like visceral... - Gee. - Jake. - He's ruined that...(indistinct) - Jake starts this car up. He purposely makes his car louder. - Yeah. - Why? - You know the M5 has a great exhaust note outta the factory. It doesn't need to sound like that at idle. (all laughing) I just need to make that clear. Hey, what's the computer that is the laptop and the screen comes off. - [Jono] Oh my God. How many host do we need? (overlapping conversation) - You're not searching up my question. Are ya? Oh, it's showing a... - That's horrible. Have you tried the iOS version of that? - No. - Scribble? - Yeah. Is it good? - No. Well, that's easy. The...(indistinct) What were we talking about before the... - [Jono] Get off the set! - You had one good point for this argument before you got interrupted by a ruined M5. - Android could be pretty close to a desktop operator. - Oh yeah? - Too closer than iPad OS. - You can do anything you want in Android. - Well, I'm gonna find that out when I try it out. - Now that this is here, I feel like we should do a video on like, can you use... 'Cause we did iPad Pro. Can you use an iPad Pro as a PC? We should do a video on, can you use this as a PC? - Well, that is a great LTT video. - [Jono] Right, get outta here! - No. One last thing. - [Jono] Get outta here! Get outta here! Get outta here! (Linus laughing) - You're glad that this exists. That Samsung has made a huge tablet. - [Jono] Get outta here! - Well, where's the tiny mini phone? - I wish that there were more small Android touchscreen phones. - [Horst] Thank you. - You know. - [Horst] Thank you! I'm out! - On the topic of using a tablet as a desktop operating system, this thing... Like the S8, S8+ and the S8 Ultra all come with eight gigs of Ram, and 128 and 256 gig storage options. But the S8 Ultra, you can also up the RAM to 12 gigs, and 16 gigs as well. And then there's also a 512 gig storage option. So like you can spec this thing out, like a crazy amount, although it stats just the eight gig, and 128 gig configs stats at 1100. Is that what you said? For the most part? I want companies to keep making these, so that they can exist as sort of like a demo of what the technology is capable of. I haven't really tested the performance in any like meaningful way, although one thing I will say right away... Oh no. Okay. I thought that it didn't preserve your split screen instance but it does 'cause iPad OS does that as well. There's an 11,200 mAh battery. Do we know how long Samsung thinks that's supposed to last? Go for hours. Go for hours. I mean, it's been on for how long and it's at 80%. I didn't see what it was at, at the beginning. Editor, you will know. Start scanning with the center of your finger. Oh, it's down here. This is a good position to have this in. Because I guess if you are using that tablet like that, that sort to make sense. But most people... I mean, most of the time, you're gonna be using it like this. So it's right where your finger is. Or your thumb is. Wait does it know when I pick it up? Pick on my tablet, and it doesn't wake right away. I can double tap though, and do that. Now I'm looking at this case 'cause I haven't looked at it yet. This is interesting. So without the case, it's a magnetic dock. But with the case, it's got like a little rubber doo-hickey, to keep it in place as well. This case is 50 bucks? - [Jono] Yeah. - Still pretty steep for a case. But I mean like it's a tablet case, and it does seem like pretty good construction. - [Jono] Oh wait, no, sorry. The Ultra one is $70. - This is $70? Yeah. Okay. So what I just said, but worse. So that's nice. That feels like a surface pro level almost. Cameras. Okay. That is something that's interesting about this. This is Samsung. This is their high end tablet. So I got big expectations. They don't even have it right on the front thing. Oh, it's right here. Okay. I just I'm unfamiliar with the Samsung icons. Okay. Wow. Yo, the preview here looks pretty rough. I mean the... Yeah. Like the color and the sharpness is not quite there. Double tap power button and we get a camera shortcut. So that's nice. Geez, Louise, look at how big that screen is. I mean like, I feel like I'm shooting a movie or something. - [David] I can't wait to take that to my next concert. (all laughing) - Okay. So we got the ultra wide as well though. (camera shutters) Wow. Yeah. That doesn't look great. Jono, I mean it's only 12 megapixel but like I feel like that's worse even than normal smartphone cameras these days. I'm not surprised that they were trying to save a little bit of money still on tab. Like as like tablets, not many people are buying them. You don't feel the need to like, put like the best camera on there. But still like this is an $1,100 tablet. - [Jono] Yeah. - So there's the normal length and we got... Oh, we got two cameras here that I did not mentioned as well. Correction, correction. These are both 12 megapixels. - [Jono] Yeah. - On the back we got a 13 megapixel and a six megapixel ultra wide. So that's why, when the I took the ultra wide shot right there it was particularly bad 'cause that's only a six megapixel camera. (camera shutters) Yeah. This is more like what I would expect from a modern smartphone camera. It's still a little bit fuzzier than I have seen on some other cameras, but it's a little... That's more along the lines of what I would expect. So conclusion time. I think I'm just happy to see that Android tablets are back in the market with like good quality units. And I'm not saying you should go out and buy these. I think it just makes me happy. Because like iPads have dominated. Anytime people have talked about tablets, you're talking about iPads unless you're like my father-in-law who refuses to buy new technology and will only shop on eBay or Craigslist for like used stuff. And he's like, I bought this new tablet for $20. I'm like... But maybe that's all you need. And so that's fair. But for people who are looking for a little bit more out of their Android tablets, this is nice to see. Your father-in-law has three iPads? Yeah. So then there's other types of people who just like buy a ton of iPads, 'cause they think that that's the only tablet you can get. More Android tablets are good in my book. Even if this one is probably overpriced. Although I don't even know it's $1,100. That's what the flagship phones are these days. And this is like a 15 inch thing. It's probably not overpriced for what it is honestly. - [Jono] Yeah. It just... For $1,100, all I really want is the option to have 5G. - That's true. But then it would be more expensive. The S8 Plus is $900, and it's got the 12.4 inch screen. The S8 is $700, and it's got the 11 inch screen. So if I was to say which one of these, you should probably buy, it would probably be the S8. Although this is not a recommendation. This is not a review, it's an unboxing. And hopefully we take a deeper look at these units in other Linus media group, channels, properties. TechLink will do a review. Go watch the TechLink if it's out. It might be out by now. And I guess subscribe to shortcircuit, if you, you really want to. That's the end. (Linus laughing) He's pontificating. The iPads for the finger. (laughing in the background) Some people like the finger, some people like the pen.",
    "transcript_keywords": [
        "Android tablets",
        "Android",
        "tablet",
        "Yeah",
        "iPad Pro",
        "iPad",
        "Tab",
        "Samsung",
        "thing Android tablets",
        "Ultra",
        "tablets",
        "thing",
        "screen",
        "Galaxy Tab",
        "Pro",
        "iPads",
        "USB",
        "case",
        "people",
        "Apple"
    ],
    "transcript_entity_values": [
        "Yo",
        "S8",
        "2960",
        "13 megapixel",
        "15 inch",
        "the iPad Pro",
        "USB",
        "five gigabits",
        "Google",
        "Dyma-tex",
        "700",
        "the S8 Ultra",
        "12.4 inches",
        "11,200",
        "six megapixel",
        "TechLink",
        "10 gigabits",
        "Samsung",
        "The S8 Plus",
        "12 megapixels",
        "14.6 inch",
        "iPads",
        "Linus",
        "MacBook",
        "120HZ",
        "iPad",
        "only 12 megapixel",
        "Tab S8 non-plus",
        "a ton",
        "Louise",
        "Ram",
        "Craigslist",
        "Andy",
        "YouTube",
        "LTT",
        "12.4 inch",
        "the Tab S8 Plus",
        "128",
        "256",
        "the Galaxy Tab S8 Ultra",
        "M1",
        "two",
        "Linus Sighs",
        "eBay",
        "SD",
        "50 bucks",
        "$1,100 tablet",
        "eight",
        "RAM",
        "1100",
        "one",
        "20",
        "USB C",
        "iPhone",
        "the S pen",
        "25",
        "Crab",
        "M5",
        "these days",
        "Android",
        "11 inches",
        "512",
        "12",
        "6E",
        "YouTube",
        "1848",
        "Apple",
        "1,100",
        "three",
        "One",
        "80%",
        "AKG",
        "a day",
        "900",
        "the Tab S8 Ultra",
        "70",
        "Vessi",
        "Jono",
        "5",
        "11 inch",
        "16",
        "Gen 1",
        "Jerry Seinfeld",
        "four",
        "iPads",
        "hours",
        "iPad Pro",
        "Vessi",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "FAC",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "EVENT",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.12411116808652878,
        0.004379154648631811,
        0.024848856031894684,
        -0.0901041030883789,
        0.037066925317049026,
        0.025681255385279655,
        -0.046664759516716,
        0.08485230803489685,
        -0.016716299578547478,
        0.03281289339065552,
        0.030589809641242027,
        0.03100145049393177,
        0.01514776237308979,
        -0.013680336996912956,
        0.046868178993463516,
        -0.06452138721942902,
        0.06918415427207947,
        -0.021795857697725296,
        -0.082034170627594,
        0.01926393434405327,
        0.03511247783899307,
        0.0016018030000850558,
        0.03854762762784958,
        -0.027220169082283974,
        0.032773345708847046,
        -0.011064868420362473,
        -0.00488654337823391,
        -0.06926227360963821,
        -0.014018665067851543,
        -0.011673360131680965,
        -0.03493271395564079,
        0.061907704919576645,
        -0.028946705162525177,
        0.042995959520339966,
        -0.047980185598134995,
        -0.09032697975635529,
        -0.017842117697000504,
        -0.059729330241680145,
        -0.031296372413635254,
        0.01678665727376938,
        -0.06669075042009354,
        -0.05023357272148132,
        -0.05377757549285889,
        -0.03524946793913841,
        0.0013424407225102186,
        -0.06465950608253479,
        0.0375019796192646,
        -0.019746240228414536,
        0.0010529275750741363,
        0.032322004437446594,
        -0.029399916529655457,
        0.017706187441945076,
        0.014180915430188179,
        -0.028328532353043556,
        -0.032214999198913574,
        -0.03830103576183319,
        -0.031253382563591,
        -0.05584673583507538,
        0.11018432676792145,
        0.02794930338859558,
        0.059090591967105865,
        -0.10265567153692245,
        0.04586474224925041,
        0.08429907262325287,
        0.03707326948642731,
        0.01560799777507782,
        -0.024776719510555267,
        0.0029567626770585775,
        0.010666845366358757,
        -0.012409521266818047,
        -0.019204290583729744,
        0.024518771097064018,
        0.05267040804028511,
        0.10011427849531174,
        0.0030262572690844536,
        -0.06263680756092072,
        0.0921829342842102,
        0.009605304338037968,
        -0.040064871311187744,
        -0.028689568862318993,
        -0.013567146845161915,
        -0.09104356914758682,
        -0.03044741041958332,
        0.020345013588666916,
        0.07238642126321793,
        0.019710155203938484,
        0.006611920893192291,
        0.05970912054181099,
        -0.061239633709192276,
        -0.028595902025699615,
        0.026847446337342262,
        0.07811595499515533,
        0.01747620664536953,
        -0.008177563548088074,
        -0.05596678704023361,
        -0.022052990272641182,
        -0.04015441611409187,
        -0.04747641459107399,
        -0.09929515421390533,
        0.05975485220551491,
        0.024742402136325836,
        0.0577663853764534,
        0.0293645728379488,
        0.054878152906894684,
        -0.0021177937742322683,
        -0.1015259176492691,
        0.05155070871114731,
        -0.009622961282730103,
        0.04856395721435547,
        0.031648728996515274,
        0.014405925758183002,
        -0.0025310860946774483,
        -0.06065158545970917,
        -0.04687923192977905,
        -0.03679658845067024,
        -0.027584070339798927,
        -0.034250907599925995,
        0.046450287103652954,
        0.12987175583839417,
        0.044822808355093,
        -0.028422171249985695,
        0.009743073023855686,
        -0.07603918015956879,
        -0.05592036992311478,
        -0.0802595466375351,
        0.06000044196844101,
        -0.06771641969680786,
        3.3524375221741915e-33,
        0.02660244144499302,
        0.13210204243659973,
        -0.05366376042366028,
        -0.13809266686439514,
        0.035826705396175385,
        -0.014276828616857529,
        -0.000568585644941777,
        0.07660195231437683,
        0.010868199169635773,
        -0.0018301804084330797,
        -0.057760581374168396,
        0.06713289022445679,
        -0.07283693552017212,
        0.051056332886219025,
        0.015868112444877625,
        -0.06250402331352234,
        -0.027195066213607788,
        -0.027240067720413208,
        -0.006477377377450466,
        -0.03338878974318504,
        -0.013838243670761585,
        -0.05275685340166092,
        0.030075278133153915,
        -0.04951874166727066,
        0.033852189779281616,
        -0.03619899973273277,
        0.0923585593700409,
        0.026185737922787666,
        0.06111618131399155,
        0.03993236646056175,
        -0.07377249747514725,
        -0.08275941759347916,
        -0.01315928716212511,
        -0.13510629534721375,
        0.013633187860250473,
        -0.08355630189180374,
        -0.017668789252638817,
        -0.06761729717254639,
        0.09661679714918137,
        0.02091677300632,
        -0.024821091443300247,
        -0.0018925471231341362,
        -0.07699686288833618,
        -0.0024276641197502613,
        -0.02098456397652626,
        0.005529397167265415,
        0.02523067221045494,
        0.055747371166944504,
        0.002835542894899845,
        -0.017295928671956062,
        -0.013758917339146137,
        -0.02053806744515896,
        -0.06595738977193832,
        -0.06406839191913605,
        -0.07812216877937317,
        -0.07040486484766006,
        -0.009200402535498142,
        -0.03780470788478851,
        0.045989733189344406,
        0.09515780210494995,
        -0.022869069129228592,
        -0.0018419217085465789,
        0.019912442192435265,
        0.02791539952158928,
        -0.116800457239151,
        0.03433151915669441,
        0.018642688170075417,
        0.011754697188735008,
        -0.04951420798897743,
        -0.06648591160774231,
        0.01813407428562641,
        -0.014596608467400074,
        0.12574203312397003,
        -0.05985299125313759,
        0.02424282766878605,
        -0.012412556447088718,
        -0.017126096412539482,
        -0.034610092639923096,
        -0.0015257983468472958,
        -0.01942482218146324,
        -0.07453513890504837,
        0.027521589770913124,
        0.06017782911658287,
        0.05838027969002724,
        -0.05946081131696701,
        0.034417010843753815,
        0.05774630978703499,
        -0.1021336168050766,
        -0.028462348505854607,
        -0.01487712375819683,
        -0.046868517994880676,
        0.02500595524907112,
        -0.017017893493175507,
        -0.03771165758371353,
        0.006681676022708416,
        -4.269117036962197e-33,
        -0.02458271197974682,
        0.03570142388343811,
        -0.035214509814977646,
        -0.03160523623228073,
        0.03519606962800026,
        -0.01814129203557968,
        0.05602917820215225,
        0.007595941424369812,
        -0.0046613686718046665,
        -0.00587106216698885,
        0.015770696103572845,
        0.03320280462503433,
        -0.008362035267055035,
        -0.09998229891061783,
        0.008075465448200703,
        -0.04557415097951889,
        -0.010290154255926609,
        -0.06343699991703033,
        0.05434912443161011,
        -0.07732795178890228,
        0.06143029034137726,
        0.019897274672985077,
        0.042582783848047256,
        0.08295457810163498,
        0.03985036164522171,
        -0.05511291325092316,
        0.020495424047112465,
        0.10196922719478607,
        -0.020983953028917313,
        0.022387566044926643,
        0.10514658689498901,
        -0.07319105416536331,
        -0.05091538280248642,
        0.05820141360163689,
        -0.006892041768878698,
        0.003989763557910919,
        0.008062310516834259,
        0.01922822929918766,
        -0.010449528694152832,
        -0.08236506581306458,
        0.08181162923574448,
        -0.05620569735765457,
        0.01925705373287201,
        0.02135527692735195,
        0.034382835030555725,
        0.031314581632614136,
        -0.003849572269245982,
        -0.019661230966448784,
        -0.022787224501371384,
        -0.030752232298254967,
        0.0675744041800499,
        0.001424382789991796,
        0.02316788025200367,
        0.01114700734615326,
        -0.028299707919359207,
        -0.016622457653284073,
        -0.050304871052503586,
        0.019458483904600143,
        -0.04865315183997154,
        -0.05937376245856285,
        0.058201298117637634,
        0.016636205837130547,
        0.016337018460035324,
        0.015205970034003258,
        0.009426086209714413,
        -0.0028419392183423042,
        0.06323498487472534,
        0.01041171420365572,
        0.016849372535943985,
        0.03285152092576027,
        0.017196783795952797,
        -0.04301450401544571,
        -0.003694965038448572,
        -0.027393581345677376,
        -0.013520915061235428,
        0.15484316647052765,
        0.01643369160592556,
        -0.027150854468345642,
        -0.017277555540204048,
        -0.0720316544175148,
        -0.008039652369916439,
        0.05458163470029831,
        0.0788305252790451,
        -0.04233161732554436,
        0.025263292714953423,
        0.026537995785474777,
        0.035629186779260635,
        -0.01347493939101696,
        -0.02579086273908615,
        0.09475524723529816,
        -0.05566732957959175,
        0.004325008485466242,
        -0.06363943964242935,
        0.051569290459156036,
        0.04483955353498459,
        -5.0851841848498225e-08,
        -7.100665243342519e-05,
        0.04606247320771217,
        0.03470365330576897,
        0.03173276409506798,
        0.01990387588739395,
        -0.08762580901384354,
        0.08341861516237259,
        -0.02779204025864601,
        0.11744730174541473,
        -0.028903845697641373,
        -0.04727957770228386,
        -0.1314702183008194,
        0.006329656578600407,
        0.019485317170619965,
        0.02330069988965988,
        0.08358242362737656,
        0.07180462032556534,
        0.0733780562877655,
        -0.014335853047668934,
        7.357286085607484e-05,
        0.0019407134968787432,
        0.0882226824760437,
        0.04919902980327606,
        -0.05976120010018349,
        0.008277726359665394,
        0.06547403335571289,
        -0.0614653043448925,
        0.025565311312675476,
        0.07193193584680557,
        -0.02710290439426899,
        -0.015610414557158947,
        -0.05065404623746872,
        -0.015376477502286434,
        -0.014020333997905254,
        0.009408947080373764,
        -0.10642852634191513,
        -0.07745210826396942,
        0.012498627416789532,
        0.03334054723381996,
        0.07752414047718048,
        0.0022510208655148745,
        -0.06426972150802612,
        0.012089709751307964,
        0.007591633591800928,
        -0.021003052592277527,
        -0.0832628607749939,
        -0.06302312016487122,
        -0.03134775161743164,
        0.05755093693733215,
        0.11101949214935303,
        0.01041288673877716,
        -0.04792190343141556,
        -0.01094153430312872,
        -0.030343294143676758,
        0.011577531695365906,
        -0.0091361403465271,
        -0.01750197820365429,
        0.028658702969551086,
        -0.0859888345003128,
        0.09890370070934296,
        0.08798468112945557,
        -0.07560651749372482,
        -0.04118778184056282,
        0.09021852910518646
    ]
}