{
    "id": "Z9CiafUurp4",
    "title": "I bought the biggest SCAMS on eBay!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-08-20T16:05:06Z",
    "video_url": "https://www.youtube.com/watch?v=Z9CiafUurp4",
    "category": "Science & Technology",
    "tags": [
        "ebay",
        "austin",
        "austin evans",
        "mystery tech",
        "tech",
        "unboxing",
        "review",
        "playstation",
        "camera",
        "game",
        "gaming",
        "this is",
        "denki",
        "amazon",
        "wish"
    ],
    "views": 852840,
    "likes": 27319,
    "comments_count": 829,
    "description": "The weirdest BANNED tech on @thisis:  The Z Flip 4 is confusing on @Denki:   Don't buy the cheapest tech on eBay trust me  Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 Ordering the cheapest tech on eBay 2:22 The cheapest iMac 4:06 Best HTC One is the phone of all time 6:13 Don't listen to Austin's \"advice\" 6:34 Cheap \"gaming\" laptop 8:21 Nintendo DS Lite & Drake and Josh 10:05 The worst Sony PSP ever 11:19 A highly sus Wii game 13:07 \"Gaming\" laptop update 13:42 The cheapest graphics card on eBay",
    "description_links": [
        "https://youtu.be/dRe97Cs8W1Q",
        "https://youtu.be/eqxVZKKTOw0",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today I am buying the cheapest items on eBay. What could possibly go wrong? (maniacal laughing) - Rules are simple. I have to search for an item, sort by buy it now and cheapest, and hit check out. Simple as that. I don't want to get scammed, I actually wanna try to find good items on eBay. What about a PlayStation? PlayStation console lot. I feel that's a good search, right? Brand new PS5. These are fireworks. Wait, they're selling fireworks, they put a PS5 controller on it. Oh my God. (laughing) Hit me up for prices, if you know, you know. What do we need? What do we need in our lives? - [Joanna] A graphics card. - Just graphics card, the cheapest graphics card on Ebay. - [Joanna] Just, yeah. - I'm gonna regret this decision. Oh, no. ASUS graphics card. $15, $11 shipping. What is this? I mean, I guess we'll just buy the mystery $15 graphics card and see what it is. Drake and Josh Game Boy Advance, in box, sealed, for $16 shipped? Add to cart, let's go. That's an easy one. What? What about an old school Mac? Like iMac maybe? (grunting) - The cheapest one that's actually functioning is a late 2006 iMac. It is $25, however, it is $45 shipping, which, to be fair, this is a big thing. Let me actually read it here. Had some video-related issues, that's gone away since a reinstall of OS 10.6.8. Had signs of previously being opened. I mean, look, this was a cool looking iMac. I mean, it's very old. Honestly, I haven't played with an old Mac like this in a while. I'm gonna add that to cart. I'm gonna deeply regret this search. I just said show more results, and now I have women's bulk underwear panties. - [Kinsey] I also see that. - I don't. - [Kinsey] $85? Why? - [Austin] 40 pack. - [Kinsey] Wait, wait, wait, wait. So I scrolled down and it gives computer specs. Like it has, these underwear, this underwear has a GTX 1060 in there. - Good game. - [Kinsey] Nice game. - Nice game. I'll gonna search it, nice game. Oh, here we go. We can get Wii Zumba Fitness 2 for 99 cents. Okay, look, not that I'm gonna sit here on my high horse but what's the point of selling a game for a dollar on eBay? Like what are you gonna get after seller fees? 35 cents? No! HTC One for $18! This is still one of my favorite phones of all time, for 18 bucks, man, sold, easy sold. Oh, I found a gaming laptop for $125. Do we buy the (bleep) gaming laptop on eBay? Hey, subscribe to find out. Okay. So I did not order a Lian Li case, you do know that, right? - [Matt] I just grabbed what came in. - Inside, we have the iMac! Oh, good Lord. Look how. Do you see how dusty this is? I can write my name on it. - [Joanna] You can't, you can't say that anymore. - I can't say that. - [Matt] Is he, hey guysing? Is he hey guysing? - No. This was listed as a late 2006 24-inch iMac. Checked out, won the auction. And then I got a message saying, hey, it doesn't boot anymore, do you still want it? So this is a total crap shoot. He said it had video issues and he reinstalled Mac OS and it worked but it then stopped working and he didn't wanna deal with it after I had already purchased it. So very real shot that I plug this in and nothing happens whatsoever. Haha. eBay. That sounds. - [Matt] Oh, that is not sounding good. (Mac start tone) - What a lovely chime. - [Matt] Did we scam eBay? - Eh. Yeah! This $25 iMac that was supposedly broken, booted up first try. I think we all have to be appreciative and accept the fact that today's our lucky day. This is showing up as the iMac 6.1, so Core 2 Duo, two gigahertz, we've got two gigabytes of RAM. Graphics, we've got ourselves a GeForce 7300 GT and a 1920 by 1200 screen. The memory app is blank. It's forgotten that it has memory. All right duds, it's frozen. The mouse moves and nothing else. It's locked. - [Joanna] Well, I mean it turned on, that's more than you thought it was gonna be. - Did we get $25 worth of fun out of this yet? I will not be deterred. You cannot hold me down. Absolutely not. Mr. eBay, you got another thing coming because next up we have the HTC One M7. It is locked, but fully functional, according to this. So I actually think that this phone has aged really well. It's got the kind of the antenna lines, which are much much more common these days. It also has a 1080p screen. This screen size even today, feels terrific. The speakers were great. It's got the IR blaster on top. You could be a dick at like a restaurant or whatever by changing old TVs to Maury. - [Maury Povich] You are not the father. - [Joanna] Maury? - [Austin] What Matt, what? - [Joanna] What's your deal man? - Did you read the description of this? (laughing) - [Austin] Yes, it's locked, but it says fully functional. - Did you see where it's locked to? - [Austin] Sprint. - The company that doesn't exist anymore. - Matt, I bought this on the hope that it would work on wifi and that I could activate it on wifi. This is a 50/50 shot. Are we all ready for this? (drum roll, children cheering) - Yup, there you go. Battery's on, charging. Step one. It is not totally dead. Step two, please, please work. If this does not let me get it on wifi and activate, I am going to actually cry on camera. - [Matt] That'd be great content. - It might let me do it. It might let me do it right now. It's let me sign into a Google account! It's letting me sign into a Google account! Red alert! Red alert! I'm not signing in with Google plus, skip, skip, skip, skip. - [Matt] Google+ is on there? - Google+ is on there, yeah. - [Matt] Am I in your circle? - No. I'm in the interface. We did it! $18.50 for the greatest smartphone of all time that you can't use on Sprint anymore because it doesn't exist, but it's working! It's alive! Okay. We are now recording on the HTC One. And as you can see, actually for all the cameras that we test on things like Mystery Tech, honestly, this is not bad. I think this video's been saved. Look at that, it's actually even pretty snappy. Look! (video playing) - [Joanna] Oh. - One of the speakers is dead. I'm telling you, these speakers were amazing. (Matt laughing) - One of them, in the last nine years, may or may not be dead right now. Not only is one of the speakers dead. The other one sounds like it's blown out. Take my word for it. Boomsound was great. I'm telling you it was great. Issues. Problems. If you ignore them, they will eventually go away. If the IRS can't contact you, then what are they gonna do? What, I'll levy your wages or something. (Austin laughing) - Wow. You are incredibly on point with that. As we all know, ignore your problems and they go away in life. Wow, that box looks horrible. Just gently. - That might be a box. - Thank you. One of the things that I really like about eBay, you get a little bit of homemade creativity. Oh, okay. Well packed. All right. What? Oh no. Is this our gaming laptop? Wow. That smells like a smoker's room from 2004. - [Matt] That is a beefy laptop. - Behold, my friends, the gaming laptop of my dreams. I will say, someone could have spent all of 30 seconds to wipe off the literal dirt. Grungy would be the word. Little crunchy. So it came with home premium and it was refurbished. Interesting. It also has the removable battery. - [Speaker] What the hell is even that? - Behold. (woman screaming) - Wow. - [Matt] The screen's in decent condition. - It smells exactly like 2006. Does everyone remember 2006? - [Joanna] I was six. So, no, I don't remember 2006 super well. - Now, I think nothing will tell you the age of this laptop more than the size of the trackpad. Yes. My friends that is about a two finger trackpad. - [Matt] So with shipping. - Yep. - [Matt] You paid a $105. - For a gaming laptop. That seems reasonable. Windows Vista! Let's go. Wow. Look at the ghosting. (Matt laughing) - Wow. Oh, it actually knows we're in August, oh. All right, I'm gonna plug this into ethernet. The first time a Windows Vista computer has been online since 2011. We've got a Core2Duo, a 1.5 gigahertz, two gigs of RAM, 32 bit operating system. So here's a problem, the fact that there's no driver installed is very bad. How are you supposed to game with no drivers? So to actually game on this, I'm gonna have to go and download some drivers. - [Matt] Well, that doesn't work anymore. - Next item is, gonna stay away from the side of the table. I'm just gonna just put those good vibes out there. This, my friends, is a Nintendo DS Lite. This is actually in really quite solid condition, which cost? - [Matt] $55. - 55 bucks. Is this what I think it is? (laughing) - The one and only Drake and Josh for Game Boy Advance. Looks actually like it's still brand new-ish. I'm gonna admit I did not really watch Drake and Josh. So I think this is gonna be a little wasted on me. - [Matt] Wait, wait, wait, wait, wait. - I know. I know. - [Matt] Wait, wait. - We got what? - [Matt] 11 bucks. - This might be the cheapest sealed Game Boy game of all time. Look, there are a precious few sealed Game Boy games in the world and I don't think this is one of them. You could have seizures, battery leakage. - [Joanna] That was not funny. It's just, why was that the first thing you said opening the instructions? - Seizures. (speaking foreign language) - Whoever in the comment you get. I was speaking. - [Matt] Dutch. - [Joanna] French? - Portu-latin. (gasping) There's power! Shoutout to the person who sold this to me with no charger, but a charged battery, you're a kind soul. - Look, Austin, it's gonna take some time to realign. But if you look inside, you'll realize I forgot the rest of the words. - [Austin] Is that the theme song? - [Matt] Yeah. - If this theme song doesn't start up right now. (electronic music) - What kind of generic bull(bleep) is this? Let me play the game. Is this supposed to be school? Oh, I'm trying to, supposed to sneak around everybody and they heard me, oh, look, she's gonna find me. Run, run, run, run, run. I had the doors locked. So I could see why Drake and Josh, new in box, after all these years was dirt cheap because it is a bad game. But you know what's not bad? The DS Lite. What a great time to remind you to subscribe to the channel and ring-a-ling the ding-a-ling button, because otherwise, you'll be forced to use this until the end of time. This is very newspaper-y. Oh! Ew! What's that on the corner? That's like some goo. There's some goo on this PSP. Don't pick at it! - I think it's nail polish, actually I can scrape it off. It's fine. - [Joanna] The PS ew. (all laughing) - I'm a little concerned about the quality of this. First of all, the screen is wildly scratched up. It also is missing the little nubbin for your analog stick. So it's just the actual plastic bit. I am really concerned about what's going on here though. It's almost like something on the inside ripped and like bulged this whole thing out. Let's take a look at Force Unleashed. All right. Well, let's see if this PSP wants to PS Wii. - [Matt] You had PSP go right there. - [Joanna] Yeah. - Okay. Well, it is seemingly functional. Here's a little problem. I think it's gonna make me update my PSP firmware. Yep, I don't know if 3.95 is a version of the firmware you can do things on. Unfortunately, I can't play the game without it. So I think I'm gonna have to just update. Listening to this. (UMD drive whirring) - While the PSP was great, UMDs were such a dumb idea and I can't update 'cause the battery is low, but there's no battery. We're we're getting really close to the side of the table right now. At this point in the video, I would say we're doing quite well. That's my Wii. So, I actually got a message from this person, who may or may not have been like, are you Austin? And they included, not only the 99 cent version of Zumba Fitness for the Wii, but also free of charge, Wii Fit. So thank you, Jarret, for your kind donation of an extra game. Sadly, I do not have a balance board but I do appreciate this 99 cent Wii game I got on eBay. Does anyone know how to do Zumba? - [Matt] Yeah. It's like. - [Joanna] Matt does. - Oh, look at this! Look, look, look. They knew. They knew exactly what kind of video they were getting themselves into. - [Matt] It'd be pretty cocky of them to like sign their name and then not work. - Yeah. Let's investigate Zumba Fitness 2, which I will mention is rated T for Teen because these tracks are so hot, children are not allowed, or seven year olds shouldn't have abs like that. Matt, do you have a good angle here? You got this. Remember, 99 cents. (upbeat music) - Woo. - [Joanna ] Nope, nope, nope. - There's literally nothing but butt shaking. I see why it's rated T for Teen. Oh no. You're supposed to use it with the belt. I'm not proud of about what I'm about to have to do. Look, desperate times call for desperate measures. - [Joanna] No- - So it's all about the motion. - I am downwind of this. - All right? We're getting hype. (clapping) - It's not failing me but I don't think I'm doing anything right here. I've seen Matt dance approximately three times in my life. - [Matt] What? How is it only three times? - Each time was a life changing experience. Look at the coordination. - [Joanna] Why aren't you sitting where Matt was sitting? - I will actually. I gotta get the good view of Matt. Oh woo. 99 cents. What could possibly go wrong? So this entire video, I have been letting this system try to update and I spent a lot of time on this gaming laptop. Remember it was called the gaming laptop. None of the Dell or Nvidia drivers work for the graphics. I also can't get the ethernet working, weirdly the wifi does and Windows Vista will not update in any way. Hardware acceleration is either disabled or not supported. Are you trying to tell me that I can't even play Minesweeper? There we go. Good start. Okay. So, alright. Okay. As it sits right now, considering that I bought it as a gaming laptop, I'm very sad to say, goes in the junk pile. I was hoping it would be better. - [Matt] Do you wanna game? - I do wanna game. - [Matt] Do you wanna be gaming? - I would like to do maximum gaming. Please tell me that this is some amazing gaming product that will make my life better. - [Matt] It is certainly a product. - Oh look, my ASUS graphics card, that I still don't know what it is. None of these labels on the back tell me what it is except that I think it came out of an HP prebuilt. Should I just plug this into a modern PC and see if it works? - [Matt] Yeah. - Something feels really wrong about taking an RTX 3070 out of a system and installing this mystery GPU. It's like taking your steak, throwing in the garbage and loading a big slice of Spam and hoping for the best. I am ashamed of how many items in this video I think belong in the trash pile. - [Matt] That sounds like a toy train. - Toy train is very accurate. It also is not functioning. Well, listen to that. And no video's coming up whatsoever. I regret my decisions deeply today and that's saying something coming from me. I gotta get a new hobby, man. This, this (bleep), this (bleep) is not healthy. - [Matt] This ain't your hobby, boy, this is your job. - Don't remind me. (crying)",
    "transcript_keywords": [
        "Game",
        "Wait",
        "gaming laptop",
        "Game Boy",
        "eBay",
        "graphics card",
        "gaming",
        "Game Boy Advance",
        "Game Boy game",
        "laptop",
        "time",
        "graphics",
        "good",
        "Drake and Josh",
        "yeah",
        "Matt",
        "Wii",
        "Josh Game Boy",
        "sealed Game Boy",
        "iMac"
    ],
    "transcript_entity_values": [
        "the last nine years",
        "DS Lite",
        "Game Boy Advance",
        "Zumba Fitness 2",
        "Wii",
        "first",
        "25",
        "Zumba",
        "Teen",
        "Wii Fit",
        "two",
        "125",
        "Matt",
        "August",
        "one",
        "16",
        "iMac",
        "32",
        "99 cent",
        "Dell",
        "French",
        "Maury",
        "six",
        "Minesweeper",
        "iMac 6.1",
        "Shoutout",
        "Kinsey",
        "50/50",
        "GPU",
        "2011",
        "PlayStation",
        "3.95",
        "Austin",
        "2006",
        "Ebay",
        "GeForce 7300 GT",
        "24-inch",
        "these days",
        "Maury Povich",
        "IR",
        "1060",
        "GTX",
        "35 cents",
        "Nvidia",
        "Joanna",
        "Drake",
        "1080p",
        "Josh Game Boy Advance",
        "today",
        "IRS",
        "PS5",
        "18.50",
        "Sprint",
        "two gigabytes",
        "1200",
        "Wii",
        "seven year olds",
        "Core2Duo",
        "Google",
        "two gigahertz",
        "2004",
        "Zumba Fitness",
        "ASUS",
        "11",
        "30 seconds",
        "40",
        "HP",
        "Maury",
        "Force Unleashed",
        "eBay",
        "Mac",
        "18 bucks",
        "1920",
        "Mystery Tech",
        "One",
        "iMac",
        "15",
        "First",
        "Lian Li",
        "85",
        "UMD",
        "three",
        "PS Wii",
        "only three",
        "RAM",
        "Windows Vista",
        "Jarret",
        "Nintendo",
        "55 bucks",
        "99 cents",
        "HTC",
        "3070",
        "Wii Zumba Fitness 2",
        "Core 2 Duo",
        "18",
        "eBay",
        "Mac",
        "1.5 gigahertz",
        "55",
        "45",
        "105",
        "Austin] Sprint",
        "Game Boy",
        "Josh"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "FAC",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "NORP",
        "GPE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "PERSON"
    ],
    "vector": [
        -0.08340321481227875,
        -0.008688014931976795,
        0.05727380886673927,
        -0.057595379650592804,
        0.05875508114695549,
        -0.02240072190761566,
        0.06578318029642105,
        0.09467506408691406,
        -0.03208522871136665,
        0.05671617016196251,
        0.0418262705206871,
        0.06421907246112823,
        0.11553584784269333,
        -0.01536435354501009,
        0.04030491039156914,
        0.003971306141465902,
        0.04262354597449303,
        -0.04694047570228577,
        -0.023872874677181244,
        -0.037359464913606644,
        -0.0017500632675364614,
        -0.09074079245328903,
        -0.015870193019509315,
        -0.038803666830062866,
        -0.01567710191011429,
        0.04240497201681137,
        -0.002294159960001707,
        -0.03164370357990265,
        -0.11509986221790314,
        0.00947845820337534,
        -0.0660201832652092,
        0.04352456331253052,
        -0.018214019015431404,
        0.06162535026669502,
        0.024656658992171288,
        -0.12138717621564865,
        0.011239107698202133,
        -0.06288713216781616,
        -0.057856716215610504,
        -0.07234030961990356,
        -0.052414678037166595,
        0.01808319240808487,
        -0.05852033570408821,
        0.03981442004442215,
        0.015527389012277126,
        -0.01865801215171814,
        0.0009317537187598646,
        -0.004643564112484455,
        0.03627986088395119,
        0.003520671045407653,
        -7.52737614675425e-05,
        0.00023065310961101204,
        -0.006191934924572706,
        -0.014213663525879383,
        -0.07029873132705688,
        0.041992224752902985,
        -0.013713193126022816,
        0.0222044475376606,
        0.1357865333557129,
        -0.03458218276500702,
        0.07468357682228088,
        -0.11202164739370346,
        -0.015533104538917542,
        -0.028634479269385338,
        0.001615283079445362,
        -0.046959903091192245,
        0.010834374465048313,
        0.021809469908475876,
        -0.041043028235435486,
        0.07885703444480896,
        0.05498442053794861,
        0.011569646187126637,
        0.05008920282125473,
        0.09708191454410553,
        0.008781040087342262,
        -0.005900504998862743,
        0.07029888778924942,
        -0.1309209018945694,
        -0.06743080914020538,
        0.11073438078165054,
        -0.06310828030109406,
        -0.04065019264817238,
        -0.07683669030666351,
        -0.09742303937673569,
        0.03614494577050209,
        0.02390969544649124,
        0.0091998977586627,
        0.001056079869158566,
        0.06777149438858032,
        -0.044825147837400436,
        0.0180821493268013,
        0.005983439274132252,
        0.0306467916816473,
        -0.008788338862359524,
        0.06924472749233246,
        -0.05661705881357193,
        0.01199126522988081,
        -0.027070865035057068,
        -0.032164860516786575,
        0.016513146460056305,
        0.010590163990855217,
        0.06123094633221626,
        0.041917890310287476,
        -0.0340096615254879,
        0.034660160541534424,
        -0.02214134857058525,
        -0.05594297870993614,
        0.053688894957304,
        0.00854179821908474,
        0.028628919273614883,
        -0.1436784565448761,
        0.024797216057777405,
        -0.041474636644124985,
        -0.0048126052133738995,
        -0.012688378803431988,
        0.09289824962615967,
        -0.016619140282273293,
        0.05704444274306297,
        0.008779117837548256,
        0.00593190360814333,
        0.027091706171631813,
        0.04842366650700569,
        0.0034119884949177504,
        -0.0074477726593613625,
        0.019717171788215637,
        -0.01563534326851368,
        -0.03074498474597931,
        4.5589888010871885e-33,
        -0.015304342843592167,
        0.07736769318580627,
        -0.03027649223804474,
        -0.08357875794172287,
        -0.06579795479774475,
        0.06152231991291046,
        0.06537119299173355,
        0.09387652575969696,
        -0.030321992933750153,
        0.11801944673061371,
        -0.06134471669793129,
        0.06250600516796112,
        -0.08359871059656143,
        0.07787735015153885,
        0.0795818343758583,
        0.015957610681653023,
        -0.008001644164323807,
        -0.04113604873418808,
        0.03102925419807434,
        0.020182760432362556,
        -0.0006039520376361907,
        -0.043382614850997925,
        0.05235695466399193,
        -0.08730138838291168,
        -0.03138759732246399,
        -0.07269664108753204,
        -0.09027568995952606,
        0.002692779991775751,
        0.13423025608062744,
        0.022697024047374725,
        -0.08877711743116379,
        -0.07099757343530655,
        0.06568688899278641,
        0.01916591078042984,
        0.008665665984153748,
        0.004864253103733063,
        -0.01829364150762558,
        -0.044065386056900024,
        0.03192523866891861,
        -0.010720175690948963,
        -0.0452437661588192,
        0.08846864849328995,
        -0.10434774309396744,
        0.006803977303206921,
        0.02329104021191597,
        0.04715019091963768,
        -0.02548644132912159,
        -0.06512097269296646,
        -0.039176419377326965,
        0.025577452033758163,
        -0.09312930703163147,
        0.022113142535090446,
        0.011129648424685001,
        -0.003329404629766941,
        -0.062419693917036057,
        -0.08788935095071793,
        0.05543411895632744,
        0.006368929520249367,
        0.06401187926530838,
        0.02447778917849064,
        0.060057662427425385,
        -0.0169356856495142,
        0.011339440010488033,
        -0.015345238149166107,
        -0.0973295271396637,
        0.0198667049407959,
        0.07511264085769653,
        0.015978354960680008,
        -0.1152581200003624,
        0.04365644231438637,
        0.020917745307087898,
        0.0036908823531121016,
        0.07065606862306595,
        -0.045015599578619,
        0.09903938323259354,
        0.05210781469941139,
        -0.01810145378112793,
        0.07794584333896637,
        -0.09382603317499161,
        -0.08143976330757141,
        0.0301817636936903,
        0.002133187372237444,
        0.011043664999306202,
        0.05545508861541748,
        -0.017542826011776924,
        0.040453553199768066,
        0.021825265139341354,
        -0.03200560063123703,
        -0.003748406656086445,
        -0.018082140013575554,
        -0.024190371856093407,
        -0.0014816793845966458,
        -0.00507854949682951,
        0.016556238755583763,
        0.06011030450463295,
        -4.513049747173084e-33,
        -0.06736868619918823,
        -0.07537880539894104,
        0.050627343356609344,
        0.050759196281433105,
        0.02128882147371769,
        -0.025323254987597466,
        -0.059352438896894455,
        0.006603610701858997,
        -0.002874840749427676,
        -0.05257342755794525,
        0.021619465202093124,
        0.05063018202781677,
        0.004876130726188421,
        -0.038371700793504715,
        0.060763049870729446,
        -0.027268018573522568,
        -0.01939871907234192,
        -0.013618509285151958,
        0.08019892871379852,
        -0.0203118696808815,
        0.049473706632852554,
        0.06192803010344505,
        -0.034251466393470764,
        0.005032588727772236,
        -0.05285186320543289,
        0.018149985000491142,
        0.02348824217915535,
        -0.005155767779797316,
        0.027791932225227356,
        0.014878370799124241,
        0.038410887122154236,
        0.015683647245168686,
        0.07497454434633255,
        0.07099134474992752,
        0.014408258721232414,
        0.01296283956617117,
        0.020371725782752037,
        -0.027685927227139473,
        0.03154224529862404,
        -0.029455658048391342,
        0.023204222321510315,
        0.05573895946145058,
        0.01401156559586525,
        -0.05486426129937172,
        -0.012248574756085873,
        -0.06101396679878235,
        0.009083679877221584,
        0.006791458465158939,
        0.1515355259180069,
        0.030608316883444786,
        0.05064600333571434,
        0.03822304308414459,
        0.006843976676464081,
        -0.043048255145549774,
        -0.05358346551656723,
        -0.04325411468744278,
        -0.08171018958091736,
        0.04235687851905823,
        0.06295579671859741,
        -0.016665562987327576,
        0.03346129134297371,
        0.04689963534474373,
        -0.08418651670217514,
        0.04349583387374878,
        -0.0012204258237034082,
        -0.052617765963077545,
        0.13658961653709412,
        0.02520797774195671,
        0.03866998106241226,
        -0.05021604523062706,
        -0.10739978402853012,
        0.012680182233452797,
        0.03763682395219803,
        -0.017599334940314293,
        -0.02405913546681404,
        0.0410788394510746,
        -0.01204077247530222,
        0.04019114747643471,
        0.05129880830645561,
        -0.009986014105379581,
        -0.000717836432158947,
        0.03984380140900612,
        0.04922943934798241,
        0.034044280648231506,
        0.03074994869530201,
        -0.031424976885318756,
        -0.04008202254772186,
        -0.05013502761721611,
        -0.0259891115128994,
        -0.04939986392855644,
        -0.028374629095196724,
        -0.04716727137565613,
        0.017715221270918846,
        0.05586108937859535,
        -0.0055292630568146706,
        -4.837259126588833e-08,
        0.09429997950792313,
        -0.07354354113340378,
        0.041145969182252884,
        0.07109461724758148,
        0.02393365278840065,
        -0.05249795317649841,
        0.00664065545424819,
        0.06636826694011688,
        0.054441992193460464,
        -0.016959751024842262,
        -0.024359017610549927,
        -0.02787364274263382,
        -0.06128906458616257,
        -0.03690558671951294,
        -0.02132364735007286,
        -0.04420889541506767,
        -0.022216226905584335,
        -0.0006927966605871916,
        0.012124041095376015,
        0.030818961560726166,
        0.01290272455662489,
        0.014913003891706467,
        0.0840049535036087,
        -0.0715111792087555,
        -0.04202141985297203,
        0.019378671422600746,
        0.006404629442840815,
        0.04455899819731712,
        0.010196208953857422,
        0.047094278037548065,
        -0.02534150518476963,
        -0.0954139232635498,
        -0.006544217932969332,
        -0.04476021230220795,
        0.00965884979814291,
        -0.0786319300532341,
        -0.03843800351023674,
        -0.03983156010508537,
        6.084462802391499e-05,
        -0.010322966612875462,
        0.050553515553474426,
        -0.1282859742641449,
        -0.009459646418690681,
        -0.029333719983696938,
        -0.03166735917329788,
        -0.0414864681661129,
        -0.05708526447415352,
        -0.11401500552892685,
        0.033064063638448715,
        0.004167086444795132,
        -0.0099085234105587,
        -0.02174682915210724,
        -0.0032227623742073774,
        -0.03560199588537216,
        0.027645928785204887,
        -0.04533294215798378,
        0.03226504102349281,
        -0.005502284970134497,
        0.03296205401420593,
        0.011672195047140121,
        0.031081877648830414,
        -0.10982862859964371,
        -0.06685353815555573,
        0.08529442548751831
    ]
}