{
    "id": "z_Ke0hiYEm4",
    "title": "Samsung Galaxy Fold Teardown! - How does it even work?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-10-10T12:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=z_Ke0hiYEm4",
    "category": "Howto & Style",
    "tags": [
        "Samsung Galaxy Fold",
        "Galaxy Fold",
        "Folding Phone",
        "Folding smartphone",
        "Galaxy fold teardown",
        "take apart galaxy fold",
        "Samsung folding phone",
        "broken galaxy fold",
        "fix galaxy fold",
        "galaxy fold version 2",
        "fold",
        "folding phone",
        "android",
        "iphone",
        "best smartphone",
        "cool phone"
    ],
    "views": 6470433,
    "likes": 121558,
    "comments_count": 5748,
    "description": "The new Samsung Galaxy fold is pretty much the coolest phone on the market right now. Yeah, folding smartphones are new, and the folding technology is new, BUT the innovation possibilities with folding phones is fascinating. The Galaxy Fold had a rough start with phones breaking left and right. But Samsung seems to have gotten their act together this time around, and is offering replacement screens for 149 dollars if it happens to break within the first year. ($599 dollars if the Galaxy Fold breaks more than once, or happens after the first year.) Super awesome of Samsung to take care of their customers like that.   Check out the Galaxy Fold Durability test:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/tZBk_Hb-X0w",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're going to take apart the Galaxy Fold. This is the phone from Samsung that opens up to show off a full internal display tucked inside the two halves. Since my inner screen was damaged during the durability test and is a bit finicky now, my question is can I disassemble the phone and just keep one half of it as a functional device? Cuz technically there is that one screen that still works on the outside. It should be an interesting little experiment. Let's get started. [Intro] So there are 3 surfaces to this phone: the large square inner screen, and then the two long rectangles that are located on the outside. Samsung phones are typically taken apart by removing the back glass and this Galaxy Fold appears to be no different. With a bit of heat from my heat gun, and a bit of fancy finessing from my razor blade, along with the suction cup, I can gently work my way around the back glass panel slicing through the adhesive. It's a tad difficult since the glass is curved, but not impossible. After the majority of the adhesive is cut, I can twist off the only piece of this phone that doesn't have a screen attached and pull it away from the phone. There are no ribbons or anything sensitive attached to the underside of the glass. We do get our first look at the wireless charging coil which I totally forgot this phone even had. Now we have two sides left. I'm going to assume that this phone has more components under the smaller display. So I'll grab my suction cup, heat gun and razor blade, and work my way around the glass once again, taking special care not to put my razor blade too deep into the phone because if the screen gets poked from the underside, it'll be dead. The screens are very fragile, as we learned from the folding screen inside of this phone. After the adhesive is warmed up and cut away, I can tilt the screen up and away from the hinge side, folding it open, allowing access to the thin ribbon cable plugged in underneath the black plastic cap. Once I unsnap that like a little Lego, the front screen and glass panel can be removed. It's a super thin compact little design. OLED screens are as thin as they come. It's the same style of screen we saw in the back of the Nubia X. And now we know that Samsung can do dual screens, maybe they'll start adding front and rear screens to their other phones just because they can. No complaints here. There are 19 visible screws holding down the internal back plastics to the phone. And three more screws hidden underneath the wireless charging flap. After those are removed, the wireless charging can be pulled away. This has the circular wireless coils in the center, along with what looks like NFC coils, all of which can communicate through the gold contact pads that rest up against the motherboard. Now I can remove the black plastics from the right side. The top section has a built in loudspeaker, along with a separate earpiece speaker. Kind of interesting that they are both right next to each other. Then we have a plain black piece of plastic that brackets around the battery. And lastly, we have the bottom plastics which contain the loudspeaker. One cool thing about this little speaker, just like we saw in the iPhone 11 Pro, are these little white foam dots that fill up the space inside of the speaker box. The lightweight specs are added to the speaker housing to dampen the speaker. As the speaker moves, air inside of the speaker box has to pass through the foamy dots, causing the air to scatter and act less dense, which then allows the speaker to sound bigger than it actually is. People have been adding foam to sub woofer boxes for years, so it's interesting to see the same concept applied here on this sub woofer for ants. Someone should count these for us. You might have noticed already that this phone has two batteries inside: a small little guy off to the left, and then a relatively proportional battery on the right side. I'll unplug each of them just like little Legos. Removing the battery is the same dangerous, tedious process that it always is with Samsungs. Even on this futuristic Galaxy Fold, Samsung still hasn't updated their battery adhesion practices. With two pry tools gently leveraging up the battery, I can finally remove it by hand, but any accidental bends would either cause the battery to just slowly expand over the next several months, or explode immediately. It's a fun little game that keeps you on your toes. I'll remove the extensions ribbon over top of the smaller little battery. And then commence the same gentle prying procedure while hoping nothing spontaneously combusts. The small battery is a 2100 milliamp hour, and the larger is a 2135 for a combined total of 4235 milliamp hours. Something I haven't noticed before is that both of the motherboards inside the Galaxy Fold kind of glimmer with a rainbow effect. Like a gasoline drip in a wet parking lot. It must be some kind of treatment that they use while assembling the boards. It looks super cool. I really do think that sometimes the insides of cellphones look cooler than the outsides. Thumbs up to Samsung for that one. Speaking of internals, here's a close-up shot of the guts. For those of you with a Galaxy Fold you can screenshot this, crop it, and make it a wallpaper. Back to business, it's time to see how this hinge works and how it was able to withstand my bend test. The SIM card tray does have a rubber ring around the lip, but there's definitely no ingress protection rating on this phone since dust can still very easily get inside at other points. I'll remove the 3 large ribbon connectors on this half of the motherboard. Remember that this is also the half of the phone that the smaller rear screen plugs into. There's one more Phillips head screw holding the motherboard down. And then I can lift up and unlatch the last little ribbon on the underside before pulling the motherboard free. The shimmery motherboard comes out with the outer camera still connected. It's a 10 megapixel camera with no optical image stabilization. There's also a large magnet along the side and up in the corners. This helps keep the phone closed but it's pretty well balanced without being too strong or noticeable. I'll unsnap the two large motherboard extension ribbons from the other half of the phone. Along with the side button connector. And I can pop out the two internal front-facing cameras. Remember, there are 6 cameras in here. These little guys are the 10 megapixel main camera, along with it's 8 megapixel depth sensing sidekick. Neither of which have optical image stabilization. After popping off the two bottom signal wires, the motherboard can start lifting away from inside the phone, and once it's out we get our first glimpse of the copper cooling pad underneath the board. The motherboard doesn't have any thermal paste, but it does have the foam pad to help transfer heat. The triple camera setup on the Galaxy Fold is very similar to the Galaxy Note 10 with it's 12 megapixel 2x optical zoom camera down at the bottom. Then the 12 megapixel main camera here in the center that also has optical image stabilization. The main camera also has the little variable aperture gizmo. I can magnetically adjust how much light can enter the sensor with it's little circular shutter thingies. Pretty cool. The 12 megapixel wide-angle camera up top does not have any optical image stabilization. Remember how I was going to take this phone apart and see if half of the Fold could still function as a full phone? Well, both sides do have a battery. And one half has an extra screen, so it was a good theory, but the problem is the small screen is on the opposite side of the USB-C charging port. So the Galaxy Fold definitely needs both halves of the phone to still function. Who would have thought? The copper vapor chamber can pry out of the phone easy enough. This little guy just dissipates the heat from the processor allowing the phone to run a little cooler. We've seen this kind of copper inside of a lot of phones at this point, so let's keep going. It's time to check out the massive internal 7.3 inch AMOLED screen and the complex hinge contraption that holds this whole thing together. Now you probably remember that this is the second time the Galaxy Fold has been released. The first time it launched there was what looked like a screen protector on top, but was actually part of the screen itself. Samsung has since extended that screen protector looking plastic component of the screen up underneath this plastic bezel, so people now won't be tempted to peel it off. My temptation to peel the screen off though is still pretty strong, so let's proceed. The screen is paper thin this time, and well, you know, it's foldable. It feels like a giant piece of thick packing tape just peeling away from the phone body. And it's rather satisfying. Samsung has added a metal plate under each half of the phone on this new version, and this is supposed to add a little bit of structure to the screen, at the same time while not allowing any dust to get behind the display to cause damage since the phone body is not dust proof. Samsung has said that anyone with a Samsung Fold can replace that inner folding screen during the first year for a one time fee of $149 which seems more than reasonable. But if you happen to break the screen more than once, or after that first year, it'll be $599. Funny how Samsung can replace the whole screen for the same price that Apple's charging to swap the back glass of an iPhone 11. Now let's take an upclose and personal look at this hinge. This floppy boy survived my durability test and I think it's time we found out how and why. There are some pieces of long thin black tape covering up the internal screws. I'll pull those away from the Galaxy Fold so we can see more of the impressive engineering. We can also see some of the sand that slipped up inside the Fold. This is still causing a grinding noise as the phone opens and closes. Let's take things a step further. The hinge of the Galaxy Fold is made up of three main components: the first of which being the massive back metal spine of the fold, and it's held in place by 10 screws. Once those are removed, the spine can be pulled from the center of the phone. It's metal design has chambers or ridges inside to help guide the other components of the hinge. It keeps them from bending too far or rotating out of place. Here in the center we see the inner gears inspired by watch mechanics, along with 3 of the 4 spring loaded clasps that lock the Fold into the open position. It feels extremely well balanced. Inside of the Fold we get these metal interlocked shovel looking gizmos. Two large ones in the center with two more smaller versions at both the top and the bottom. There are a lot of moving parts inside of this thing which does make it feel very balanced and natural while also being incredibly sturdy. But with all the precision that these moving parts require, there's not very much room for any specks of sand, and currently sand and dust can still get inside and grind away to their little heart's content. So while this hinge design was inspired by watch mechanics, hopefully Samsung can also seal it up like watches are in future versions of the Fold. I think it's an awesome innovation and it's good of Samsung to take care of their customers by offering replacement screens for so cheap during that first year. I look forward to seeing what other versions of the Fold come out next. Personally I want to see a smaller Fold that opens vertically into a normal size cellphone. Kind of like the old school flip phones. That'll be fun to see what happens. Do you think folding phones are ever going to catch on and be mainstream? Let me know down in the comments. Hit that subscribe button if you haven't already. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Galaxy Fold",
        "phone",
        "Fold",
        "screen",
        "Galaxy",
        "Samsung",
        "inside",
        "Galaxy Fold kind",
        "Samsung Fold",
        "futuristic Galaxy Fold",
        "phones",
        "battery",
        "screens",
        "camera",
        "motherboard",
        "speaker",
        "glass",
        "Samsung phones",
        "time",
        "back"
    ],
    "transcript_entity_values": [
        "19",
        "the Nubia X.",
        "8 megapixel",
        "7.3 inch",
        "6",
        "Lego",
        "the Galaxy Fold",
        "Instagram",
        "two",
        "the next several months",
        "three",
        "Two",
        "years",
        "2x",
        "4235 milliamp hours",
        "the Galaxy Fold",
        "12 megapixel",
        "half",
        "599",
        "Samsungs",
        "Phillips",
        "SIM",
        "the Galaxy Fold",
        "10",
        "2100 milliamp hour",
        "NFC",
        "Apple",
        "Fold",
        "Galaxy Note 10",
        "first",
        "this Galaxy Fold",
        "second",
        "the first year",
        "Fold",
        "Samsung",
        "one half",
        "that first year",
        "12",
        "Today",
        "3",
        "One",
        "Samsung Fold",
        "Galaxy Fold",
        "149",
        "10 megapixel",
        "2135",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.19306987524032593,
        0.05037425830960274,
        0.10875112563371658,
        -0.058954134583473206,
        0.03170294687151909,
        -0.052519842982292175,
        0.0027841904666274786,
        0.13306675851345062,
        -0.03565807268023491,
        0.061941999942064285,
        0.05487252026796341,
        0.02818819135427475,
        -0.005611646920442581,
        0.02941589616239071,
        0.030824923887848854,
        0.014178019016981125,
        -0.041744302958250046,
        -0.040416914969682693,
        -0.10345028340816498,
        0.09434562176465988,
        0.05965832993388176,
        -0.026189390569925308,
        -0.003145912429317832,
        -0.05521313101053238,
        0.04508574679493904,
        0.029852284118533134,
        -0.03136979043483734,
        -0.0416751392185688,
        -0.00530338054522872,
        -0.03702226281166077,
        0.047574255615472794,
        0.11017899215221405,
        -0.03699395805597305,
        0.06717441231012344,
        0.016933415085077286,
        -0.05283698812127113,
        -0.021598776802420616,
        -0.028836529701948166,
        -0.04950340837240219,
        -0.04075876250863075,
        -0.09260831773281097,
        0.0055015357211232185,
        0.003133063903078437,
        -0.013919937424361706,
        -0.00208843476139009,
        -0.05538039654493332,
        0.0739704892039299,
        0.008297506719827652,
        0.02580009214580059,
        0.0013507858384400606,
        -0.03482989966869354,
        0.053770244121551514,
        0.01597246341407299,
        0.05267919600009918,
        -0.053047072142362595,
        0.028619496151804924,
        -0.012175618670880795,
        -0.031586941331624985,
        0.023032503202557564,
        0.04079962894320488,
        0.123489610850811,
        -0.01942504197359085,
        -0.05306042730808258,
        0.054800547659397125,
        0.0272386372089386,
        0.02760566771030426,
        0.0504772886633873,
        -0.09212235361337662,
        -0.0008567472686991096,
        -0.016400938853621483,
        -0.0642177015542984,
        -0.034870825707912445,
        0.02060188725590706,
        0.02871261164546013,
        0.029894351959228516,
        0.026782158762216568,
        0.07480057328939438,
        -0.04776721075177193,
        -0.04699501022696495,
        0.020817071199417114,
        0.013618909753859043,
        -0.019794072955846786,
        -0.06261962652206421,
        0.03703382611274719,
        0.0019267842872068286,
        -0.004111517686396837,
        -0.013457642868161201,
        0.07103025168180466,
        -0.022583559155464172,
        -0.008800186216831207,
        0.04779791831970215,
        0.0704379603266716,
        -0.05147013068199158,
        0.006403360050171614,
        -0.042438894510269165,
        -0.03926211968064308,
        -0.10948769003152847,
        -0.04089722782373428,
        -0.007564252708107233,
        0.02497277781367302,
        -0.021428804844617844,
        0.019278332591056824,
        0.11226848512887955,
        -0.015672173351049423,
        0.03473664075136185,
        -0.09883217513561249,
        0.011315200477838516,
        -0.041731249541044235,
        -0.021441150456666946,
        0.03708776831626892,
        0.015969084575772285,
        0.028810730203986168,
        -0.027720609679818153,
        -0.002949862275272608,
        -0.015127819962799549,
        0.034127652645111084,
        -0.02438749000430107,
        0.06557045131921768,
        0.05400226637721062,
        0.04492519423365593,
        -0.0006116817821748555,
        0.03811734914779663,
        -0.042032353579998016,
        -0.08839717507362366,
        0.0018965514609590173,
        0.020148811861872673,
        -0.08391308039426804,
        4.179675141176068e-33,
        0.03615430369973183,
        0.0796666219830513,
        -0.007674350403249264,
        0.01303169596940279,
        0.0031544349621981382,
        -0.012426304630935192,
        -0.06741773337125778,
        0.03653158247470856,
        -0.0369509719312191,
        0.0545731745660305,
        0.006489165592938662,
        0.018499767407774925,
        -0.004346651956439018,
        -0.026578746736049652,
        0.059779565781354904,
        -0.06411603838205338,
        -0.019815970212221146,
        -0.03273047134280205,
        -0.07919953018426895,
        0.015605696476995945,
        -0.04483342543244362,
        -0.048253241926431656,
        0.08126864582300186,
        0.027661697939038277,
        0.04910000413656235,
        0.03139616921544075,
        0.07201647013425827,
        -0.009921273216605186,
        0.06185511499643326,
        0.027415329590439796,
        -0.09950021654367447,
        -0.01423669420182705,
        0.01492840051651001,
        -0.018212541937828064,
        -0.01831027679145336,
        0.03327499330043793,
        -0.044908612966537476,
        -0.061841484159231186,
        0.016035310924053192,
        0.043806180357933044,
        -0.10096348822116852,
        0.03015254996716976,
        0.0005041927215643227,
        0.0173940546810627,
        0.0376652292907238,
        -0.07902687042951584,
        0.016354192048311234,
        0.08543694019317627,
        -0.05101383477449417,
        -0.007345771417021751,
        0.03657586872577667,
        -0.06588456779718399,
        -0.025110818445682526,
        -0.03382892534136772,
        -0.07931523025035858,
        0.019440142437815666,
        0.04305276274681091,
        -0.06919039040803909,
        0.03620462864637375,
        0.053240031003952026,
        0.006696229800581932,
        0.014026771299540997,
        -0.08038914203643799,
        0.0705883800983429,
        -0.03798708692193031,
        0.020682083442807198,
        0.04841643199324608,
        0.003499675076454878,
        -0.07283537089824677,
        0.011175649240612984,
        -0.04972579702734947,
        -0.011567465960979462,
        -0.02962668426334858,
        -0.025443634018301964,
        0.025620436295866966,
        -0.004461402539163828,
        0.02660985477268696,
        -0.003027901751920581,
        0.07370330393314362,
        -0.03294028714299202,
        -0.030199117958545685,
        -0.012302843853831291,
        0.08949402719736099,
        -0.0367906391620636,
        -0.03833518922328949,
        -0.04079937934875488,
        -0.045612215995788574,
        -0.11926335841417313,
        0.011188723146915436,
        -0.02043190784752369,
        -0.048463158309459686,
        -0.04983918368816376,
        -0.007164828944951296,
        -0.05702847242355347,
        0.008611004799604416,
        -4.560499311327995e-33,
        -0.02388945035636425,
        -0.041517868638038635,
        0.005883939564228058,
        0.002086979104205966,
        0.0299286637455225,
        -0.06114800274372101,
        0.03118676319718361,
        0.0712282806634903,
        -0.04304890334606171,
        -0.05470053106546402,
        -0.05619415268301964,
        0.07105723023414612,
        -0.01896568201482296,
        -0.015831109136343002,
        0.004050315823405981,
        -0.03341643884778023,
        0.044779833406209946,
        -0.08900389820337296,
        -0.01909285970032215,
        0.011730561032891273,
        0.04690740630030632,
        0.06218600645661354,
        0.02906174212694168,
        0.05460645630955696,
        -0.028283776715397835,
        0.013784137554466724,
        -0.016240030527114868,
        -0.03211888670921326,
        0.11023484915494919,
        -0.02988319844007492,
        0.02048289217054844,
        -0.10975734144449234,
        -0.01915479265153408,
        0.0911330133676529,
        0.044793520122766495,
        0.041914764791727066,
        -0.00775453494861722,
        -0.020349357277154922,
        0.0744524747133255,
        -0.0777621939778328,
        0.0341273657977581,
        0.06631603837013245,
        -0.01417168602347374,
        -0.04308410733938217,
        0.00780209107324481,
        -0.0746174305677414,
        -0.015200262889266014,
        0.04283967241644859,
        -0.04871843010187149,
        -0.051254697144031525,
        0.0070464471355080605,
        0.024521000683307648,
        0.015229597687721252,
        -0.02336445078253746,
        -0.0348568819463253,
        0.03941337391734123,
        0.017529847100377083,
        -0.06147907301783562,
        0.021147562190890312,
        -0.0015252415323629975,
        0.07176996022462845,
        0.02621053345501423,
        -0.02593856491148472,
        -0.029199711978435516,
        -0.02354135923087597,
        -0.03335313871502876,
        0.09692945331335068,
        -0.025579795241355896,
        -0.003292432753369212,
        -0.010586980730295181,
        0.046953052282333374,
        -0.036053914576768875,
        0.0009772790363058448,
        -0.12474599480628967,
        0.042077597230672836,
        0.13704730570316315,
        -0.09063905477523804,
        -0.036950867623090744,
        -0.02209153212606907,
        -0.02897312119603157,
        0.08835143595933914,
        -0.07993821054697037,
        0.03600561246275902,
        0.036784298717975616,
        0.02905050851404667,
        -0.007702237460762262,
        0.008758650161325932,
        0.030951140448451042,
        0.031366512179374695,
        0.07056790590286255,
        -0.11187552660703659,
        0.005356115289032459,
        -0.013855934143066406,
        0.14386409521102905,
        0.018455171957612038,
        -5.027287741654618e-08,
        0.048440899699926376,
        0.06725883483886719,
        0.01163339801132679,
        0.011389853432774544,
        -0.004961902741342783,
        -0.04121733084321022,
        0.059296004474163055,
        -0.0461137555539608,
        0.06753712147474289,
        -0.024891341105103493,
        -0.019823042675852776,
        -0.08731231838464737,
        -0.07751137018203735,
        0.0917065441608429,
        -0.032684121280908585,
        0.03902384266257286,
        0.0021569530945271254,
        0.11019087582826614,
        -0.025390800088644028,
        0.08596457540988922,
        -0.05126737430691719,
        -0.008095892146229744,
        0.060885511338710785,
        -0.007795283105224371,
        0.01436799205839634,
        0.018882401287555695,
        -0.13531869649887085,
        0.031194262206554413,
        0.02775595895946026,
        0.013262261636555195,
        -0.01281662192195654,
        -0.0049959332682192326,
        0.01578967086970806,
        0.041485533118247986,
        -0.07022736221551895,
        -0.05888722836971283,
        -0.03337755426764488,
        -0.02891770377755165,
        0.09146151691675186,
        0.07886593043804169,
        0.06573052704334259,
        -0.0007981104427017272,
        -0.04162595793604851,
        0.055878423154354095,
        -0.038151051849126816,
        -0.09164979308843613,
        0.060711681842803955,
        -0.07844600081443787,
        -0.04321229085326195,
        0.05578469857573509,
        -0.013328514993190765,
        -0.05799213424324989,
        -0.12949632108211517,
        0.016186442226171494,
        -0.0011051601031795144,
        0.04365462809801102,
        0.08600935339927673,
        0.04487910121679306,
        0.002561942208558321,
        -0.0009540021419525146,
        -0.04360212758183479,
        -0.07208053022623062,
        -0.02230585366487503,
        0.07264174520969391
    ]
}