{
    "id": "zaclHVyFf6c",
    "title": "Razer, WHY are you like this??? - Razer Barracuda Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-06-09T17:58:15Z",
    "video_url": "https://www.youtube.com/watch?v=zaclHVyFf6c",
    "category": "Science & Technology",
    "tags": [
        "Razer",
        "Headphones",
        "Bluetooth",
        "2.4ghz",
        "Marketing",
        "Login",
        "Software",
        "THX",
        "ANC",
        "Active Noise Cancellation",
        "Barracuda",
        "Fish",
        "Pro",
        "Professional",
        "Audio",
        "Quality",
        "Razer are you ok?",
        "Why does Razer have to do this?",
        "Why are you like this?",
        "Frustrations"
    ],
    "views": 480971,
    "likes": 20097,
    "comments_count": 1518,
    "description": "Join us in War Thunder for FREE at  and get an exclusive bonus using our link - thanks for supporting the channel!  Razer is a juggernaut in the PC world, but by being so big, have they become their worse own enemy? Adam checks out the latest Barracuda Pro wireless headphones, and it's not great. Let us explain.   Buy a Razer Barracuda Pro:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Please don't copyright strike me 0:10 - Unboxing and overview 3:29 - Exterior first impressions 4:40 - Sponsor - WarThunder 5:18 - USB-C dongle woes 5:48 - Hybrid ANC overview 6:29 - Sound impressions 7:20 - So much PAIN 9:00 - Bluetooth connection impressions 9:20 - ANC first impression with background noise 9:45 - Why do I need to log in to so many accounts? 10:10 - Gaming audio impressions 10:50 - Final thoughts",
    "description_links": [
        "https://playwt.link/lttsc",
        "https://geni.us/Jt1DFW0",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Ooooooooooo Barracuda. - [David] No, no, no, no, no, no. - Razer's back with another one of their hostile fish headphones. This time it's named Barracuda. I do have history with Razer. I bought their 7.1 Megalodon headset that used military grade sound simulation to get 7.1 surround sound. And it blew 14-year-old mes noggin. (confetti pops) Let's look at the box for a second. So, one thing that I've always found kind of funny about Razer, is that they've always seemed like a marketing company that decided to make technology. Which is why like, every single thing they have is just like, it's branded to the tits. Like we have THX achromatic audio amplifier. We have, Razer TriForce bio-cellulose 50 millimeter drivers. Triforce? Razer smart switch dual wireless. So basically what smart switch dual wireless is is that you should be able to switch between 2.4 gigahertz or Bluetooth. That's cool. It just doesn't need a brand name. You know, it just it doesn't have to be called Razer TM smart switch just call it smart switching or whatever. So this is the flagship of Razer's whole Barracuda family refresh. They have the Barracuda X, which is the lowest here at a hundred US. Barracuda at $160 it's weird to have Barracuda X be cheaper, but whatever. And then the Barracuda Pros all the way up at 250 big ones which I know you're pushing into some pretty ambitious territory at that price. They do have hybrid ANC, which is good because I feel like if you're going, if you're a wireless headphone and you're anywhere in the $200 range and you don't, even probably $150 range or up, and you don't have ANC, it's unacceptable now because like you just should have it. It's kinda not that hard to do. it's hard to do really well but it's an easy feature to add. I like the classic presentation. Though, one thing that's kind of a disappointment is that this is big. Here's my laptop. - [Jono] No, no, no. You're not doing it right. - I know, but the bananas a less useful - [Crowd] Whoa - [David] What the f-- - So for context in your backpack full of bananas it's gonna take up a lot of space for your bananas cause that's three and then like we're too tall. So that's one, two, three that's six whole bananas worth of volume. That's insane. Lttstore.com In here we have a USB-A to USB-C braided cable with cable tie. What's the point of these? I hate this. I hate this. I just get tired of this. They sell 'em with like graphics cards and HDMI cables. Maybe they're really, really helpful for shipping. I find them annoying. This is another extension cable for USB-A. Quite a lot of reach, but that's great. Yeah, because if you're gonna use these plugged in with your computer, this might not be quite long enough. If you're trying to reach all the way around to the back of it, this probably will be. (chord whips) That's everything that's in here. Oh, there, no, there's a little, there's a little guy. Oh, this is their wireless USB-C adapter. You can use this with your Android phone. This would be for when that you're using the smart switch. So instead of using Bluetooth you can use their smart switch to use their high speed 2.4 gigahertz connection. So like what you-- - [Jono] Or on your laptop. - Or on your laptop or on your PlayStation, PC PlayStation. It says so right there. - [David] What about Xbox? - (beep) Xbox (laughter) So here are the headphones. I like the way they look. I know Razer's known for being pretty gaudy and very aggressive with their branding. These are pretty subdued. I do actually like the green accents. Build quality, it is all plastic. It's neither here nor there when it comes to headphones, you can get more expensive headphones that are also all plastic. You can get cheaper headphones with metal. We got our power button. This is like a volume control wheel. We have our mute switch for the microphone. Is there no boom microphone with this? I guess not. We didn't see one. And then this is, I believe their smart switch button which is on the left ear cup. Are these on? Oh now they're on, they weren't on. So they actually have really good sealing. I took them off thinking that maybe the ANC was on, but these actually have a really good seal. I can barely hear anything. This headband doesn't, it seems a little, the curves a little harsh. It felt a little weird on the top of my head. Sometimes that's just getting used to stuff. These are very soft and they're leatherette. These aren't, they're fake leather they're pleather. And memory foam, it's a lot of empty space. It's pretty soft memory foam. I'm not very impressed so far for $250. Let's power these on, but before we get any further we've gotta talk about our sponsor, War Thunder. War Thunder is a free to play online military vehicle combat game available on a variety of platforms with cross play. It features an incredible arsenal of more than 2000 historically accurate playable tanks, air crafts and ships from the 1910's to vehicles still in service today. You'll compete in massive combined arms battles on over 100 major battlefields, from world war II to modern environments. War Thunders vehicles are implemented with a high level of authenticity and detail, adding a huge amount of depth to its gameplay. Head to the link below to start playing War Thunder for free. You'll get a free bonus premium vehicle just for signing up. Let's connect it. This is the worst. Do you see why? Look at my choice. You're blocking other ports. - [David] That's dumb. - Yeah, that sucks. You could use yet another dongle or you would just use this, I guess but like it's nice having your adapter because sometimes you know, you go and you're like, you're in between a game. You just got downed and you go, oh, you know what? I'd like a little snicky snack and you just get up and leave your headphones on so you haven't missed anything. - [Jono] What is a snicky snack? - A snicky snack, sometimes you get hungry playing your games. So these have hybrid ANC, which use both feed forward and feedback ANC. Basically it listens to both, what you're hearing on the outside, as well as what it's hearing on the inside to get a more accurate representation of the audio that's surrounding you. This is the same kind of tech that Apple uses in AirPods pros. And it's kind of the gold standard for ANC at the moment. So they have three modes. They have ANC off, ambient which is a listen through mode, and they have ANC on. I appreciate that because ANC can shift the sound of what you're listening to. And I don't wanna have to choose between ambient mode and ANC like some headphones do that. I just, sometimes I just want the ANC off. So a press to turn, you just press this button on the right, the quick switch button to turn it on and off. (upbeat music) That sounds really (beep) bad. That sounds really atrocious. I'm gonna turn the ANC off. (upbeat music) Literally the ANC just killed it. The ANC like made it sound just so much worse. It's literally, it's literally canceling out its own base response. Like the ANC just makes it sound like a tinny mess. It sounds like you listen to like a phone speaker. Yeah. So that's good to know that the feed forward is working. It's just blocking off my, the sound I want to hear. Okay. I can't be dunking on 'em too hard because I do have to download their software to assess anything that they make. Oh and if you couldn't tell that I wasn't stoked about having to use software, I'm not stoked about having to use software. Oh, this is so annoying because what you do is that they give you a list of like here's all the things you can download or to install from the synapse software. There's five things. And if you don't select one of the things, an ad pops up asking you to install it. I don't want game booster, system booster and game rewards. I don't want Razer cortex. I want synapse and THX spatial audio. Razer, Razer, what are you doing? The issue is that they try hard at the wrong things. They try really hard to maintain this great image. And then they have mediocre software, annoying implementation, lackluster hardware and like, they still haven't really resolved their issues with reliability and longevity on their peripherals. It sucks because I think that what Razer does a lot of the time is cool, but it feels like they just do it to put another label on the box. It's taking a really, really long time to download. Oh, it's updating the headset. Yeah. So we spent about 15 minutes just waiting around for the headphones to update. And it said factory reset, powered off. And now it's telling me to unplug and then re plug the wireless dongle. But here's what doesn't make sense. Why did I waste all that time waiting for it to wirelessly transmit, when I have a cable? There's USB-C in for the headphones it could have happened so much faster. My dongle's been updated. We're still installing Razer Synapse. - [David] What? - It's still installing Razer Synapse, were only at 20%. - [David] Wait, only 20%? - We updated the headphones. - [David] It couldn't do it at the same time? - No, of course not. It's Razer. It's not supposed to be good it's supposed to be cool. We'll see if the updates fix any of those ANC issues I said where it was canceling out its own audio. (upbeat music) It seems like the ANC sounds a little bit less aggressive and is having less of an effect on my music. Yeah. So either the update fixed the problem cause the ANC is not cutting out the bottom end nearly as badly. I do kind of wanna just like, traffic noises cause I want to get some better, cause it's kind of quiet down here, I wanna get some better semblance of how good the ANC is. And so we're just gonna blast traffic noise. Ambient is working as intended, let's go to ANC. It's not amazing. It's not incredible, but it's not terrible either. When you have the music playing it cancels out noise well enough. Sign in with my Razer ID. Could I just end this painful existence instead? I have to log in to use THX spatial audio. Razer, it's so frustrating. I don't need an account to use headphones with my computer. Stop telling me to sign up for stuff. Hello there! You're clearly using a guest account where all settings are anonymous to us by using our software. That's the point. This is the fifth time they've asked me to log in to my account and I'm just trying to open the software. Just waiting for DOOM Eternal to load up. Again, the ANC, I don't know. It is through this wireless thing. The ANC is like, maybe it's something that can be fixed in Windows, maybe it's another setting. But the fact that it's like a gaming headset is having such a profoundly bad experience on a PC platform is really disappointing. I play with a pair of AKG K7XX's which are open-back headphones that have a really, really good sound stage. These are not doing anything special to me. DOOM has a pretty decent audio engine, like for spatial audio, I usually test it with stuff like Left 4 Dead, cause I always loved the positional audio in that game. It's not special, these aren't special. Razer has done it again. They've released a product that's too expensive and pretty bad. Razer I wanted to love you. I continue to want to love you, but you continue to be, yeah, you continue to be you. (laughter) Like if they don't start focusing on delivering quality products, then I do think that they're actually just gonna fall out of favor and no one's gonna ever care about them. If you're spending $250 on headphones you deserve better than this. Don't buy, don't buy these. Thanks for watching this video. If you're thinking, hey, I want some mediocre sound quality. Well, how about you save your money and spend one sixth the price on like some Nord Buds or something. You can check out my coverage of the OnePlus Nord Buds just down here-ish in the video ending boxes. (mumbles) Yeah.",
    "transcript_keywords": [
        "ANC",
        "Razer",
        "headphones",
        "Barracuda",
        "smart switch",
        "switch",
        "sound",
        "audio",
        "Razer smart switch",
        "Razer Synapse",
        "smart",
        "Yeah",
        "War Thunder",
        "kind",
        "Ooooooooooo Barracuda",
        "hybrid ANC",
        "good",
        "software",
        "ANC sounds",
        "wireless"
    ],
    "transcript_entity_values": [
        "over 100",
        "playing War Thunder for free",
        "Razer TriForce",
        "world war II",
        "only 20%",
        "Razer",
        "three",
        "250",
        "Razer Synapse",
        "one",
        "US",
        "USB",
        "20%",
        "a hundred",
        "Razer smart switch dual wireless",
        "fifth",
        "Razer TM",
        "ANC",
        "Windows",
        "second",
        "2.4 gigahertz",
        "Left 4 Dead",
        "one sixth",
        "today",
        "1910",
        "7.1",
        "Barracuda",
        "David] Wait",
        "Barracuda",
        "160",
        "50 millimeter",
        "14-year-old",
        "Razer",
        "two",
        "150",
        "Razer",
        "Android",
        "200",
        "about 15 minutes",
        "USB-C",
        "the OnePlus Nord Buds",
        "250",
        "Xbox",
        "six",
        "five",
        "AKG K7XX's",
        "between 2.4 gigahertz",
        "PlayStation",
        "USB-A.",
        "Apple",
        "Megalodon",
        "War Thunder"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "EVENT",
        "PERSON",
        "EVENT",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.034891702234745026,
        -0.08971411734819412,
        -0.04580762982368469,
        -0.10624614357948303,
        0.11943237483501434,
        0.0654049664735794,
        0.030249448493123055,
        0.0253630168735981,
        0.0018310920568183064,
        0.03489198163151741,
        -0.028616424649953842,
        0.009956596419215202,
        -0.014512150548398495,
        -0.0325251966714859,
        -0.010511339642107487,
        -0.024967974051833153,
        0.07397361844778061,
        -0.09922253340482712,
        -0.07162623107433319,
        -0.02823980711400509,
        -0.034738652408123016,
        -0.025286627933382988,
        0.06707735359668732,
        0.06503044813871384,
        -0.013998125679790974,
        -0.0039580329321324825,
        -0.016489798203110695,
        -0.013097361661493778,
        -0.025901135057210922,
        -0.07023520767688751,
        0.07037977874279022,
        -0.0011409887811169028,
        0.021211208775639534,
        -0.029790569096803665,
        -0.0088379280641675,
        -0.07962033152580261,
        -0.02983805723488331,
        -0.04363355040550232,
        -0.10844232141971588,
        -0.012065068818628788,
        -0.0029868180863559246,
        0.016120323911309242,
        0.011043453589081764,
        -0.008930881507694721,
        -0.04723556339740753,
        -0.07057223469018936,
        0.03327007219195366,
        -0.01774616166949272,
        0.02140282280743122,
        0.01489839144051075,
        0.051873829215765,
        -0.09519949555397034,
        0.04108608514070511,
        -0.01586001366376877,
        -0.10262220352888107,
        0.0367315299808979,
        -0.03129930794239044,
        -0.04182058200240135,
        0.025579014793038368,
        0.026115024462342262,
        0.04562954232096672,
        -0.0716942548751831,
        -0.0165383443236351,
        0.0562041737139225,
        -0.002621503546833992,
        -0.003638868685811758,
        0.039545197039842606,
        0.1455836445093155,
        -0.056022629141807556,
        0.02601424604654312,
        -0.02194042317569256,
        -0.017750341445207596,
        0.024134835228323936,
        0.11541417986154556,
        -0.0005826070555485785,
        -0.011774670332670212,
        0.08341623842716217,
        -0.02714656852185726,
        0.05574987083673477,
        0.07941786199808121,
        -0.008505206555128098,
        -0.05423108860850334,
        0.025441987439990044,
        -0.08059132844209671,
        0.0910240113735199,
        0.01684565842151642,
        0.055205654352903366,
        0.016375266015529633,
        -0.04628440737724304,
        -0.07851453125476837,
        -0.10458731651306152,
        0.11087106913328171,
        0.12432872503995895,
        -0.03874160721898079,
        -0.006687563378363848,
        -0.017122572287917137,
        -0.03446226194500923,
        -0.07633304595947266,
        -0.03966635465621948,
        0.07744651287794113,
        0.01708267070353031,
        -0.006805212236940861,
        0.004133515525609255,
        -0.04511397331953049,
        -0.0476049967110157,
        -0.08909489959478378,
        -0.015100658871233463,
        0.10533477365970612,
        0.01877005770802498,
        0.047819532454013824,
        -0.08067921549081802,
        0.043195053935050964,
        -0.08745499700307846,
        -0.020025018602609634,
        0.022475896403193474,
        0.06466756016016006,
        -0.05027924105525017,
        0.024324385449290276,
        0.05821414664387703,
        -0.08557859808206558,
        0.013725765980780125,
        -0.032213158905506134,
        -0.03576824814081192,
        -0.013468501158058643,
        0.05095336586236954,
        0.034404315054416656,
        -0.065701924264431,
        4.420371315954733e-35,
        -0.019745085388422012,
        -0.004196259193122387,
        -0.0515219047665596,
        -0.030034147202968597,
        0.05245715007185936,
        0.03723530098795891,
        0.009599405340850353,
        0.05019214749336243,
        -0.08996359258890152,
        0.04710126295685768,
        -0.08339674025774002,
        0.04253794625401497,
        -0.05592048540711403,
        0.012513399124145508,
        -0.01976938359439373,
        -0.06541772186756134,
        -0.06118272244930267,
        0.030992470681667328,
        -0.0419132225215435,
        -0.0479043610394001,
        0.003004342783242464,
        0.008557774126529694,
        -0.010448332875967026,
        0.03941306844353676,
        0.07770062237977982,
        -0.026308944448828697,
        -0.03219350799918175,
        -0.0572834238409996,
        0.11466304212808609,
        0.023833369836211205,
        -0.07818721979856491,
        -0.024162519723176956,
        0.026412056758999825,
        -0.09088411927223206,
        -0.02265353687107563,
        0.009001296013593674,
        -0.16182632744312286,
        -0.02870648168027401,
        0.045450951904058456,
        0.053158123046159744,
        0.03476070985198021,
        0.0017465258715674281,
        -0.11872595548629761,
        -0.09145854413509369,
        0.03304828330874443,
        0.020112881436944008,
        0.040426697582006454,
        -0.028215881437063217,
        -0.04764769598841667,
        -0.04483839124441147,
        -0.014580161310732365,
        0.03747056424617767,
        -0.061462949961423874,
        -0.02712312713265419,
        0.022032098844647408,
        0.004408576525747776,
        0.025585278868675232,
        0.04997440055012703,
        0.11518234014511108,
        -0.035787321627140045,
        0.03533689305186272,
        0.01770046167075634,
        0.01679622009396553,
        -0.03552699089050293,
        -0.05294385552406311,
        0.05512884631752968,
        0.08474568277597427,
        0.01589689403772354,
        -0.06445834040641785,
        0.008133805356919765,
        0.0071832239627838135,
        0.0363556332886219,
        0.018495474010705948,
        -0.05208728089928627,
        0.01552711520344019,
        0.026279186829924583,
        -0.10605677217245102,
        -0.006991625297814608,
        0.011402776464819908,
        0.03918030485510826,
        -0.019235843792557716,
        -0.015992600470781326,
        0.06287641823291779,
        0.07315225899219513,
        0.07907753437757492,
        -0.014995778910815716,
        -0.004518429283052683,
        -0.07610408961772919,
        -0.09441059082746506,
        -0.007061810698360205,
        -0.004407887347042561,
        0.09677551686763763,
        -0.02552710846066475,
        0.00799406785517931,
        0.0031527550891041756,
        -2.079754400451871e-33,
        0.024796180427074432,
        0.02660941705107689,
        0.01615588180720806,
        -0.011164440773427486,
        0.06235409900546074,
        0.023467544466257095,
        0.05293506756424904,
        0.007306297309696674,
        0.014857369475066662,
        -0.052949629724025726,
        0.00012483377940952778,
        -0.038197651505470276,
        -0.13557499647140503,
        -0.016680065542459488,
        -0.02226993255317211,
        -0.11576572060585022,
        0.053654745221138,
        -0.0709308609366417,
        -0.015901755541563034,
        -0.07239735871553421,
        0.0984899029135704,
        0.03873031586408615,
        0.045086853206157684,
        -0.004581640474498272,
        -0.03517632931470871,
        -0.08710106462240219,
        0.11072877794504166,
        0.024487541988492012,
        0.05940351262688637,
        -0.005804064217954874,
        0.0022084242664277554,
        -0.013601100072264671,
        -0.04807120934128761,
        -0.056719351559877396,
        0.06785286217927933,
        0.024792464450001717,
        0.036535877734422684,
        0.0881500393152237,
        -0.03838123381137848,
        -0.05150004103779793,
        0.00824588630348444,
        0.05441462621092796,
        -0.03270284831523895,
        -0.06275328993797302,
        0.03944902867078781,
        -0.07960507273674011,
        -0.10486222803592682,
        -0.035864390432834625,
        -0.023177068680524826,
        -0.03808177262544632,
        -0.014136908575892448,
        -0.06558140367269516,
        0.08432890474796295,
        -0.00549620995298028,
        -0.07740553468465805,
        0.028163477778434753,
        -0.043721072375774384,
        -0.0018952048849314451,
        0.05026533454656601,
        -0.012509224005043507,
        0.01057860441505909,
        -0.016332989558577538,
        -0.06341937929391861,
        -0.03515363112092018,
        -0.0007517830817960203,
        -0.027888832613825798,
        0.024817559868097305,
        0.05503875017166138,
        -0.02154543064534664,
        0.01773969829082489,
        0.013330243527889252,
        -0.036012016236782074,
        0.008294114843010902,
        0.004069810267537832,
        -0.029847823083400726,
        0.052791859954595566,
        -0.03578305244445801,
        -0.022391047328710556,
        0.04821615666151047,
        0.005744598805904388,
        -0.019852980971336365,
        0.00446424912661314,
        0.0801335796713829,
        0.01195264607667923,
        0.0654413253068924,
        0.053353071212768555,
        0.10801564902067184,
        -0.03976399451494217,
        -0.021474545821547508,
        0.03446568548679352,
        -0.0257132425904274,
        -0.006672206334769726,
        -0.036691587418317795,
        0.07454703003168106,
        0.038020964711904526,
        -5.8769199284824936e-08,
        -0.002789165824651718,
        0.004388753790408373,
        0.022144824266433716,
        0.056833039969205856,
        -0.0218755304813385,
        -0.026867005974054337,
        -0.007474292069673538,
        -0.04886842519044876,
        0.07908899337053299,
        -0.002849149750545621,
        -0.019017821177840233,
        -0.02750774659216404,
        -0.04625318571925163,
        0.0775972530245781,
        -0.029203610494732857,
        0.090765081346035,
        -0.03244112804532051,
        0.040853340178728104,
        0.010217626579105854,
        -0.04504803940653801,
        -0.032893747091293335,
        0.09078467637300491,
        0.09883621335029602,
        -0.04797090217471123,
        -0.012597769498825073,
        0.03465859591960907,
        0.010637597180902958,
        0.03278883546590805,
        0.08888272196054459,
        -0.07121725380420685,
        -0.09855357557535172,
        -0.0006022250163368881,
        -0.010762618854641914,
        -0.006502237636595964,
        0.0063360645435750484,
        -0.06202381104230881,
        -0.019246110692620277,
        0.014193620532751083,
        -0.00722067104652524,
        0.029595935717225075,
        0.0431661419570446,
        -0.016293717548251152,
        0.07959292083978653,
        0.005750182084739208,
        0.008301427587866783,
        0.01267640758305788,
        0.031001314520835876,
        -0.044993363320827484,
        -0.01771300472319126,
        -0.015012850053608418,
        0.006082575768232346,
        0.010055432096123695,
        -0.03200064226984978,
        0.0385260283946991,
        0.06561417877674103,
        -0.0014704413479194045,
        0.02759816125035286,
        -0.012920963577926159,
        -0.06802031397819519,
        0.0579378716647625,
        0.02044045925140381,
        -0.06423415243625641,
        0.01407109759747982,
        0.09017516672611237
    ]
}