{
    "id": "ZArBfxaPzD8",
    "title": "These digital clocks aren't digital at all",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2021-04-17T14:31:02Z",
    "video_url": "https://www.youtube.com/watch?v=ZArBfxaPzD8",
    "category": "Science & Technology",
    "tags": [],
    "views": 1232013,
    "likes": 62520,
    "comments_count": 4906,
    "description": "It's time.  Links 'n Stuff Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   And thank you to the following patrons! Mauve Co, Martin Rempel, Eric Graves, Philip Cheek, Alexander Schlickenmaier, Jesse Weaver, Thomas Kula, Ed McCloskey, Harold Godwinson, Johann Thomsen, Jordan DeLong, Keith Hemenway, Aaron Greenberg, Matt Brown, Benjamin Douel, mooncow , Oliver White, Andrew Eslick, Brent Medling, Joel V, Philip Rehorst, John Harris, Mike and Zack, DCBuffalo, Emilio Mendoza, Patricia , Cody, Henry Dwyer, Colin Coyle, Cuddlefisch , nate grover, Martin Smith, Darryl !, bagel mode, DankPods, Ian McDougall, Derek Watson, Marten van Wezel, TJ Zimmerman, Dan Barrett, Kristofer Luck, SingleMaltSloth, Tennavan, Corey W. Anderson, Aaron Teague, Jessie Coan, Nathaniel Caza, Andrew Chappell, Sammie Mammel, Joshua Saxby, Serge Wroclawski, Matthew Hackbarth, Joel Neatrour, John Zelinka, Jimmy Albin, Jordan Thoms, Bob Leonard, Erik Victory, Andre Alforque, Kevin , Roger Hosey, Paul Harland-White, Anthanasius, Jeremy Losek, Steven gindler, Theo Bruckbauer, Matt Keaveney, Keegan Carter, TJ , Zengwish, Bennett Colesberry, Ivan Avdeev, Ron Thomas, John Haager, Joshua Gancher, Melody Olvera, Joshua Nahum, Chris Galloway, Sobol, cyberstorm, SHAUN, Keith Chang, Brad Feehan, Mitch Brunner, Eric Rakestraw, Brett Caven, h2g2guy , Charlie Davidson, Noah W., Matthew Abbitt, Chris Boyle, Thomas & Robert Rhode, Steve McClellan, Nitin Dahyabhai, Dennis Morhardt, Scott Albertine, Jelle De Loecker, Michal Mikernk, Ry Biesemeyer, NobTinker , Devin Edwards, Randy Messinger, Seth Persigehl, Piro606 , Nathan Friedly, Jacco Boven, Robert Hausner, Tomina, Matthew David Chapin, Dominykas D, Bill King, Roadrunner 531, Gareth Brown, Butter Penguin, Maarten De Rocker, John Whitaker, Joo Pedro Francese, Joseph Russell, Mike Richards, Patrick E Mitchell, ZGryphon , Alton Toth, Eric Walter, Andreas Trottmann, Lee Sweet, Justin Zakrzeski,  , Jared Julien, Max Maguire, Gunnsteinn risson, RandallA, Luk Foral, John Heavisides, Rob Newman, Mark Muir, Andrew Moriarty, Steve Murray, Rolf Nordeide, J.C. Lundberg, Jacob Tuley, Alex Mader, Matthew Barnes, Joel Nichols, Hugh Jasole, Brian Thomas Garcia-Luense, Joel Eblin, Ted Kaplan, Sarah Marchesi, Dylan Ginsburg, Joshua Netterfield, Jim Thoenen, David Cichowski, ioangogo, Hargrimm , jay, Syber-Space, Todd Johnson, Turinggirl , Tanner Smith, Chris & Anne Nash, Jordi Pakey-Rodriguez, Jim Moores, Lukiday , Roger Melo, Marcus LaGrone, RegalRegex, Michael Lehenbauer, James Manes, Mihaly Barasz, Potatoots, DB, Mark Johansson, TheDee , Lee Dedmon, Berwin Xie, Grey Hodge, Jim Kropa, Tony B, David Collins, Alex Carbone, Ben Golus, Tim Doering, sanlaxsfo, Jonathan Grayum, Kodi , Colin, James Cox, Cody Henthorne, Mark Komarinski, Jeff G, Ryan McLaughlin, J.P. Stewart, NADAV GERBER, Cory Albert, Bryce Swearingen, Anthony Reyes, Blair Simpkins",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Its time for a simpler video. See, time is a precious commodity for me at the present time. Theres just a lot going on at the same time for me right now, and timing hasnt been great. In times like these, Ive found that talking about clocks works most of the time. Anyway, lets not waste any time and get a move on. Tick tock. As Im sure youve gathered from the thumbnail and the words below it, this videos about these clocks. Are these still popular? I think so. But, now that I think about it, maybe not so much anymore. I mean, they're no longer the default Android wallpaper on, like... all of them. Anyway, it doesnt matter because I like them. And while aesthetics are the main reason I like them, a close second is how they work. These clocks are a lot simpler than they may seem at first glance, but very clever. To understand them, well first need to learn about latent heat and the refrigeration cycle. Kidding! Haha, got you there. I sure am a stinker. But heres the thing: once you know how these clocks work? Youll flip! Flip clocks like these are digital clocks, but theyre also not at all. Sometimes called analog clocks with digital displays, these have much more in common with an ordinary clock like this than they do a digital clock like that. All this thing really is is a 24 hour clock with weird hands. I was hoping youd flip to eight oclock right there. Cmon, do it. Do it. Do it. Do it. Do it. [CLACK] There we go. First try! Take a look. Heres a normal clock. Its got two hands! Some even have a third hand which we call \"the second.\" Its great. But for now all we care about is the hour and minute hands. Now the job of every clock like this out there is to move the hands slowly and deliberately. How thats accomplished isnt important right now but the minute hand makes one revolution every hour and a bit of gearing slows that down by a factor of 12 so that the hour hand makes one revolution every 12 hours. Notice that the hands are stacked. The minute hand is in front of the hour hand. It has to be for the gearing to work, and thats really convenient for a flip clock. See, imagine the clocks hands were thick. The minute hand could be extended out, and the hour hand could extended inward. Now imagine that instead of hands they were drums. And now imagine that the clock were turned so that the edges of the drums were visible. Now were gettin somewhere! Weve now got two drums, one of which rotates once every hour, and the other rotates once every twelve. Ah, but Id like an AM/PM indicator please (or maybe 24 hours if thats your jam) so lets make one of them take a full day to go round. What have we accomplished? Well, we could print the numbers 00 through 59 on one of the drums, then the hours on the other, and have some sort of viewing window. But that would be really silly and take a huge clock to be readable at a distance. To be clear, clocks which used three drums as seen in this incredibly convenient stock footage were a thing, but were talkin about the flippy kind today. What if instead, we loosely attach a series of cards to the drums and hold them up like this? Like a Rolodex! Some of you know what those are. Attach the cards so that they can swing at least 180 degrees, and by holding the edge of one of them so that its vertical, the adjacent card will be hanging down and their edges will meet in the center. Print numbers on these cards so that the numbers span two of them and youve made a numeric display. Speaking of displays, some of you might now be thinking about the classic split-flap display of train station and airport departure boards of yesterday, FastPass distribution and return clocks of yestertoday, or that new one you can buy which is connected to the cloud because of course. I say that snarkily but Id be lying if I said I didnt want it. This is on a really low level the same sort of technology, but those displays are often alphanumeric and sometimes even more complicated than that. And they have much more in-depth mechanics and control circuitry. The way they show things is the same, but the technology behind them is a lot more involved. Id like to talk about them some day, but that days not today. Today its this, and this is just a clock. Anyway, as the drum... well actually now its more like a wheel. As the wheel is turned, the card being held up slowly gets pulled downward. The little catch holding it up doesnt move with the card so eventually the card thats currently out front slips past its little finger and flip! The next card is revealed. Look from the side and you can see how the cards intermingle. That catch is placed on a line roughly tangential to the front edge of the wheel, which not only ensures the two cards visible are proudly right out front, but causes the upcoming and ongoing cards to bunch up neatly. As they make their way around the back they get turned upside-down again and bunch up once more, waiting for their minute of fame. And thats all thats going on here! This wheel operates just like the minute hand of a normal clock. Its just turning slowly, making one complete rotation every hour. It becomes a digital clock simply by creating a choke point using this catch, which forces the cards to bunch up at the top and get displayed one at a time. When sped up you can see how the exposed face appears to be moving continuously downward. That is effectively whats happening as were seeing the front edge of a rotating wheel, and the gap between two cards is at the surface of the wheel itself. So, naturally, the other side of the clock is just an hour hand! But there are two special things going on here. One is that its geared in a 1:24 ratio to the other wheel so that this rotates once per day. But with only 24 cards, that would leave a large gap between them and thus a lot more of the upcoming card would be visible. You can always see a bit of the next card, and 24 just isnt enough to cover it up without seeing part of the actual text. Thatd be ugly. So instead there are 48 cards. Each hour has two cards so that the next card is more completely covered. You can see, if you look carefully, that sliiightly more of the next card is visible on the hours side than the minutes. And with only 24 cards that gap would be twice as large. You might think, then, that those hour cards flip at the bottom and top of the hour, but youd be wrong! They actually flip somewhere around twenty and fifty minutes past the hour. That might sound entirely silly. After all, if it flipped at 50 minutes youd have a clock go from saying 11:50 AM to 12:51 PM and thats no good, in fact entirely unacceptable! Simply not up to snuff! Inadequate! And so on. Nevertheless, thats exactly what the hour card does. But theres a catch. See, we simply dont have the precision to make the hour card flip exactly on cue with the transition from 59 minutes to 00 using an ordinary clock movement. At least, not by itself. The hour cards are in fact deliberately misaligned from the minute cards so that they flip much too early, and a clever little second catch prevents the second hour card from revealing the next until the minute card 59 has flipped. Take a look, heres the clock showing mmhm:55. The hour card has actually already slipped past the initial catch, but this little finger thing is holding it back once more. Starting at about 40 minutes you can see the finger start to move. Built into the minute wheel is this little ramp thing. As the wheel turns it pushes on this piece here which connects to the catch via a pushrod. Once its in place, the second hour card cannot fall beyond the catch. At some somewhat random point near the fifty minute mark it will fall from the main catch, and in fact you can see it leaning slightly forward once it does so, but it doesnt really matter when the second card falls so long as its after that catch has moved into position. As we get close to 59 minutes youll see that the ramp thing is no longer pushing on the catch. Instead, it hands that duty off to this little flag protrusion on the 59 card itself. By the time were at 59, thats the only thing pushing the catch to the left. So, once the 59 card falls, the catch is released, so the hour card also falls revealing the next hour at the same moment 00 is revealed. This not only ensures satisfying synchronization, but reduces the need to go overboard with precision manufacturing. So long as the hour card flips after the catch has moved but before its been released, its OK, and that gives about a 20 minute margin for error in alignment between the two wheels. Isnt this just the neatest idea youve ever heard of Thats hyperbole, yes, but this really is just the guts of an ordinary analog clock sandwiched between two very weird hands with a bit of support hardware. The main difference between these clocks and something like this one is that they have motors which continuously move, rather than the stepping action typical of quartz clocks. That means they dont tick, they just sort of rattle a bit and click every minute. Some flip clocks do have typical tick tock movements in them, for what its worth. Whether these have an actual quartz movement is unclear, but these two keep decent time so I think thats probably the case. However, these large clocks take D cells so I imagine the motor is larger than that which youd find in a quartz-but-smooth-second-hand clock, which do exist by the way. Does anybody know what Im talking about here? Doesnt matter, new paragraph! \\ This style of clock isnt without weaknesses, though. Even assuming you have a clock which keeps perfect time over a day, each minute flip will be just a little bit off. The way the clock works and its imprecise manufacturing means that the timing between flips is somewhat random and never exactly a minute. I mean, not *that* random but put a seconds reference next to one and youll see that its not exactly consistent when it flips. This also means that if youre the kind of person who hates having multiple clocks in the same room which dont show the exact same time (like me) youre not gonna want to display a collection of these together. They will never stay in sync. Perhaps their most serious drawback is that the mechanism is one-way only. To set the time you can only move forward, which means that in the fall when we do that thing with the clocks, you either need to set it forward by 23 hours (which is quite a chore) or take the battery out for an hour and try your best to remember to put it back. And even just setting them from the start is its own kind of annoying. Usually you need to overshoot the actual time by a minute because the mechanism will roll back slightly when you let go. For the kind of person who cant stand clocks being more than a few seconds off (like me) thats not ideal. But I do love the way these look so I put up with it. These new clocks are, of course, a retro revival of an old thing. The flip clock has been around for many decades, but being battery-operated is a fairly new implementation from what I can tell. Previously theyd operate on AC power and use a synchronous motor to keep time. Thats actually a fantastic time reference, between power outages anyway. Let me show you one. [I Got You Babe plays faintly in the background] Is that Sonny and Cher? This Panasonic alarm clock is a flip clock. Its the only thrift store flip clock I still have but like all of them Ive encountered it has a design on a little wheel that's attached to the motor so that you can tell its actually running. Clever. It also featured a tiny dial light so it can be viewed in the dark. Clever. (unfortunately it's burnt out) And it is also fundamentally no different from regular old analog clocks, even down to the alarm function. You know how lots of basic alarm clocks have a third (or fourth) hand that you use to set the alarm? This is exactly the same, but rather than a hand its this little wheel indicator. You set the alarm to the time you want, and somewhere deep in the depths of this mechanism theres a switch that gets tripped when the displayed time and the set time agree. Why am I bringing this up? Because Groundhog Day presents this alarm as going off exactly at 6:00 AM and that is not how it works! The actual time that you set this alarm to go off is merely a suggestion. Yeah, there are discrete clicks when you turn this wheel and that might make you think that theres some precision in this mechanism but, nope. There's no precision at all, and it will probably go off at least five minutes earlier than you actually set it. Its just like how no matter how straight you attempt to point the alarm hand on a clock like this, the displayed time will almost never match precisely when the alarm goes off. The mechanism in here just isnt tied to the when the numbers flip at all, its just gonna go off when it decides to goes off. Groundhog Day blatantly misrepresents this alarm clock! This is the sort of movie pedantry I live for. So, of course I did a test to find out exactly when this alarm would go off if set to 6:00 and at least here it was actually remarkably close. Only a few seconds early. [radio switches on] Now, I used to use this alarm clock every morning and I wrote the script based on my memories of that time, and its fair to say I was overselling the inaccuracy here but the point remains that the cards flip independently of the actual alarm mechanism. That little fact can just fit its way into your brain and bother you every time you watch Groundhog Day as it does me. Youre welcome! So why did Groundhog Day do it that way? Well, almost certainly because somebody on the production team figured out that having the alarm go off at 5:56 would annoy far more people who don't know the intricacies of how these clocks work than it would satisfy the insufferable nerds like me who do. Or perhaps even more likely its just way more satisfying and artistic license was taken. The clock we see on-screen is actually a prop clock built for the film. See, in 1993 alarm clocks like this were already well out of fashion and this model was almost certainly deliberately chosen to reinforce the tacky and outdated nature of the hotel. But, setting these clocks, as we've established, is an absolute pain. Especially since you cant go backwards after a missed take. So, to make production easier, a special clock was built that just goes back and forth between 5:59 and 6:00 on cue. You can actually see here that the card behind 00 is another 59. That is definitely not the top of a one. Another giveaway is that the whole thing jerks when the cards flip and that is just not right. Heres what it actually looks like. But anyway, thats it! Its time to go. I like these clocks quite a bit and there are a number of inexpensive options out there in various styles these days. I will say that, from my experience, you probably want to avoid this cheap one. Ive had two at various points over the years (whichever factory that produces these has been going for more than a decade it seems) and they both failed within just a couple of months. This model has a radically different mechanism from these and the hour cards actually do sort of get jerked forward like the Groundhog Prop Clock. Both clocks I bought stopped flipping the hour at all. Which was a bummer. This is actually the second of the same exact model that Ive purchased and both of them work perfectly (I gave the other one away). This model appears to have the same exact mechanism and its been going strong for more than five years. I just purchased this one. This is in no way a Victrola. Wish that branding wasnt there. And it also works fine, but when I got it the 43 card was installed incorrectly and was causing some binding in the adjacent numbers. Luckily it was easy to fix simply by removing and re-inserting that card. Oh and Ill leave you with one other bit of clock pedantry. These clocks? When theyre stopped its only right once a day. Think about that, idiom writers! punctually smooth jazz And while aesthetics are the main reason I like them, a close second is the faaaaa See, we. See, we simply. See, we simply don have the be deh de buh. And a clever second catch prevents the second hour card from revealing the next until BLEUH ...card from revealing the next This is a very clunky sentence, and its a very long one. To understand them, well first need to learn about latent heat and the refrigeration cycle. [laughs] I knew I would break! Ughhhh ...well first need to learn about latent heat and the refrigeration cycle. [breaks again] Theres no way Im gonna get through that! So what'd you think? Isn't it a scandal what the production team on Groundhog Day did? Misleading millions of people about how clock radios using Flip Technology work? The damage to our society is incalculable.",
    "transcript_keywords": [
        "clock",
        "clocks",
        "hour card",
        "card",
        "hour",
        "cards",
        "time",
        "flip",
        "flip clock",
        "minute",
        "hour cards",
        "hour hand",
        "hand",
        "catch",
        "alarm",
        "cards flip",
        "Groundhog Day",
        "hour cards flip",
        "hour card flips",
        "minute hand"
    ],
    "transcript_entity_values": [
        "more than a few seconds",
        "a minute",
        "6:00 AM",
        "two",
        "Only a few seconds",
        "50 minutes",
        "Groundhog Day",
        "every minute",
        "more than a decade",
        "fifty minute",
        "just a couple of months",
        "fourth",
        "between 5:59 and 6:00",
        "59 minutes to 00",
        "one",
        "00",
        "close to",
        "seconds",
        "millions",
        "6:00",
        "Panasonic",
        "Flip Technology",
        "5:56",
        "many decades",
        "every morning",
        "at least five minutes earlier",
        "43",
        "a full day",
        "at least 180 degrees",
        "23 hours",
        "the next hour",
        "AC",
        "first",
        "the minute",
        "these days",
        "the hours",
        "24 hour",
        "CLACK",
        "Cmon",
        "59",
        "1993",
        "three",
        "just an hour",
        "24",
        "about 40 minutes",
        "those hour",
        "Sonny",
        "every hour",
        "00",
        "20 minute",
        "today",
        "Today",
        "between two",
        "Tick tock",
        "Each hour",
        "a third",
        "Groundhog Day",
        "some day",
        "Cher",
        "48",
        "the hour",
        "around twenty",
        "Victrola",
        "third",
        "Rolodex",
        "the years",
        "twelve",
        "only 24",
        "12 hours",
        "24 hours",
        "59 minutes",
        "FastPass",
        "more than five years",
        "12",
        "BLEUH",
        "11:50 AM to",
        "59",
        "One",
        "12:51 PM",
        "an hour",
        "yesterday",
        "First",
        "second",
        "the Groundhog Prop Clock"
    ],
    "transcript_entity_types": [
        "TIME",
        "TIME",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "EVENT",
        "TIME",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "TIME",
        "TIME",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "TIME",
        "TIME",
        "ORG",
        "ORDINAL",
        "TIME",
        "DATE",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "PERSON",
        "TIME",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "TIME",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "TIME",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        -0.07239830493927002,
        -0.0843101516366005,
        0.03844323381781578,
        -0.057792216539382935,
        -0.014732805080711842,
        -0.024769162759184837,
        0.019780969247221947,
        0.06978192925453186,
        0.033267196267843246,
        -0.030507760122418404,
        -0.06961150467395782,
        0.04469064250588417,
        -0.019498776644468307,
        0.0016572794411331415,
        0.016655616462230682,
        -0.061238035559654236,
        -0.016870588064193726,
        -0.11651283502578735,
        -0.010981645435094833,
        -0.020511716604232788,
        -0.03351485729217529,
        -0.08700920641422272,
        0.023521244525909424,
        0.017553269863128662,
        0.06836386024951935,
        -0.009337914176285267,
        0.010444773361086845,
        -0.0570022389292717,
        -0.023920292034745216,
        -0.016353774815797806,
        -0.10226321965456009,
        0.1090385690331459,
        -0.04318622872233391,
        -0.0031490346882492304,
        -0.03618856519460678,
        -0.02548794075846672,
        0.10887326300144196,
        0.02760605327785015,
        -0.028610287234187126,
        -0.03947088122367859,
        0.060400526970624924,
        -0.08237094432115555,
        0.020207855850458145,
        0.04598730802536011,
        0.018990308046340942,
        0.04885398596525192,
        0.04443332925438881,
        -0.017626013606786728,
        -0.10656841844320297,
        0.03375658765435219,
        -0.02427099645137787,
        0.00401855306699872,
        0.09590688347816467,
        0.011793944053351879,
        0.007286700885742903,
        0.07500734180212021,
        0.06422272324562073,
        0.06640676409006119,
        0.03682054206728935,
        0.04238470643758774,
        0.05718924105167389,
        -0.02345598302781582,
        -0.09938239306211472,
        0.006174835376441479,
        0.028987960889935493,
        0.06530799716711044,
        -0.03419890254735947,
        0.06606143712997437,
        0.026988878846168518,
        -0.08236502856016159,
        -0.02066836506128311,
        0.010544462129473686,
        0.061739325523376465,
        0.05840759351849556,
        0.052439089864492416,
        -0.03293375298380852,
        0.044660791754722595,
        -0.03281082957983017,
        0.06763274222612381,
        -0.03793291002511978,
        0.0232390146702528,
        -0.01366905402392149,
        -0.005759210325777531,
        -0.056652892380952835,
        0.020539330318570137,
        -0.003172498196363449,
        0.015882393345236778,
        0.10228313505649567,
        0.004316323436796665,
        -0.07936026155948639,
        -0.023754460737109184,
        0.09352678060531616,
        0.010951105505228043,
        -0.0008738618344068527,
        -0.00356134120374918,
        -0.0003729435848072171,
        0.02541649527847767,
        0.026611994951963425,
        -0.05404949188232422,
        0.06246381998062134,
        -0.0340394601225853,
        0.06563936173915863,
        -0.03125615045428276,
        0.022839829325675964,
        -0.04234027490019798,
        -0.017989762127399445,
        -0.012657095678150654,
        0.037513189017772675,
        0.05115020275115967,
        -0.0010062576038762927,
        -0.02473987638950348,
        0.05044575035572052,
        -0.010355242528021336,
        -0.01885904185473919,
        -0.00990441907197237,
        -0.02417876198887825,
        -0.10920029878616333,
        0.044249989092350006,
        0.13960520923137665,
        -0.03110157884657383,
        0.008911489509046078,
        0.026002999395132065,
        -0.04194612056016922,
        -0.034519538283348083,
        0.07953266054391861,
        -0.008973320946097374,
        -0.04657251760363579,
        8.464062584439416e-33,
        -0.026513056829571724,
        0.062261905521154404,
        0.019023871049284935,
        0.015539772808551788,
        0.059931688010692596,
        0.005500204395502806,
        -0.11099077761173248,
        -0.014734453521668911,
        -0.022176479920744896,
        -0.03008246049284935,
        -0.018009943887591362,
        0.033477507531642914,
        -0.03422214463353157,
        0.0312007088214159,
        0.01487887091934681,
        -0.08956636488437653,
        -0.014192660339176655,
        0.022637154906988144,
        0.014849385246634483,
        -0.012211143039166927,
        -0.021698828786611557,
        -0.00544409966096282,
        -0.026484016329050064,
        0.0018119554733857512,
        0.0775601714849472,
        0.019215835258364677,
        -0.024754084646701813,
        0.06506645679473877,
        0.14826515316963196,
        0.02401718869805336,
        -0.024081334471702576,
        -0.0007058071787469089,
        0.002198660047724843,
        -0.0428774356842041,
        0.07647542655467987,
        -0.03251812607049942,
        -0.0041471365839242935,
        -0.09287020564079285,
        -0.0227586030960083,
        0.0371946357190609,
        0.045895766466856,
        0.023193780332803726,
        -0.04402521252632141,
        -0.047629233449697495,
        -0.050606850534677505,
        -0.008974306285381317,
        0.12086286395788193,
        0.012749993242323399,
        -0.01607409492135048,
        0.03507217764854431,
        -0.06641058623790741,
        0.02453416958451271,
        -0.08432777225971222,
        -0.12494783848524094,
        0.05167632922530174,
        -0.029363926500082016,
        -0.02663067728281021,
        -0.00915089063346386,
        0.03043377213180065,
        0.022190457209944725,
        0.023260917514562607,
        -0.00037795817479491234,
        -0.0041280160658061504,
        -0.03302573785185814,
        -0.03687118738889694,
        0.05492887645959854,
        0.04161260277032852,
        0.015333936549723148,
        0.029458491131663322,
        0.03564285486936569,
        -0.06812938302755356,
        -0.010770749300718307,
        -0.06507210433483124,
        -0.06876546889543533,
        0.03368798643350601,
        0.017016850411891937,
        0.047437552362680435,
        0.030992066487669945,
        -0.010590070858597755,
        0.026605971157550812,
        0.060479287058115005,
        -0.07871691137552261,
        0.04653013497591019,
        -0.036609068512916565,
        0.06759411096572876,
        -0.025094402953982353,
        -0.004997780080884695,
        0.015969671308994293,
        -0.04910408705472946,
        -0.03600121662020683,
        -0.015028712339699268,
        -0.036940060555934906,
        0.07305736839771271,
        0.07019475847482681,
        -0.06475289165973663,
        -7.403876147909133e-33,
        -0.046115703880786896,
        -0.04589661955833435,
        -0.005717577412724495,
        0.03883913531899452,
        0.07173056155443192,
        -0.06462777405977249,
        0.014970226213335991,
        -0.0356755331158638,
        0.11027395725250244,
        5.5758060625521466e-05,
        0.13295023143291473,
        -0.018815206363797188,
        -0.0481099858880043,
        -0.043801963329315186,
        -0.06419909745454788,
        -0.057009223848581314,
        0.030724454671144485,
        -0.007977716624736786,
        0.00404894445091486,
        -0.07188061624765396,
        0.06819964200258255,
        -0.021329203620553017,
        -0.08666010200977325,
        -0.0023088189773261547,
        0.04514983668923378,
        0.034926947206258774,
        -0.0035497015342116356,
        0.0501350499689579,
        0.015249327756464481,
        0.05371350795030594,
        -0.03757575899362564,
        -0.04340333491563797,
        -0.007178797852247953,
        -0.002115009818226099,
        0.039002612233161926,
        0.05613136664032936,
        0.0879424586892128,
        -0.009449276141822338,
        -0.06571988761425018,
        -0.06256737560033798,
        0.08330985903739929,
        0.03794370964169502,
        -0.04960760474205017,
        -0.06515868008136749,
        -0.07889901101589203,
        0.11214309185743332,
        -0.06612034142017365,
        0.012237000279128551,
        -0.11269491910934448,
        0.06605131924152374,
        0.08163288235664368,
        -0.02271825261414051,
        0.0640326589345932,
        -0.10398194193840027,
        -0.008318973705172539,
        0.043148189783096313,
        0.058828867971897125,
        0.016450820490717888,
        0.06381531059741974,
        0.02697688341140747,
        -0.025569623336195946,
        -0.08233246207237244,
        0.0460708849132061,
        -0.019192105159163475,
        0.06845308840274811,
        -0.04570099711418152,
        0.046312619000673294,
        0.08051793277263641,
        -0.07775755226612091,
        0.02212984673678875,
        0.04667184501886368,
        -0.008608019910752773,
        -0.1066533550620079,
        -0.05196782946586609,
        -0.03044586442410946,
        -0.05427156388759613,
        -0.02717076800763607,
        0.0018099144799634814,
        -0.11873511224985123,
        0.043027251958847046,
        -0.0009360321564599872,
        0.022878563031554222,
        0.03384174779057503,
        -0.019907964393496513,
        0.04996355250477791,
        0.08585122972726822,
        0.021631086245179176,
        0.038978833705186844,
        -0.06577562540769577,
        0.02050309255719185,
        -0.06304314732551575,
        0.026692697778344154,
        -0.013289419934153557,
        0.09581665694713593,
        -0.025566227734088898,
        -7.835329540739622e-08,
        0.061715662479400635,
        0.030032917857170105,
        -0.024183334782719612,
        -0.07117960602045059,
        0.04357805848121643,
        -0.059476181864738464,
        0.04904695600271225,
        0.018371181562542915,
        0.003961771260946989,
        0.025507504120469093,
        -0.0077871158719062805,
        -0.03176869451999664,
        -0.0304525475949049,
        -0.0010103899985551834,
        0.1520402431488037,
        -0.030426466837525368,
        -0.11783688515424728,
        -0.0844636783003807,
        -0.04838176816701889,
        -0.07071307301521301,
        0.07516562938690186,
        0.03300582617521286,
        0.042795419692993164,
        -0.011769183911383152,
        0.022203119471669197,
        0.10932367295026779,
        0.03176486864686012,
        0.08857294917106628,
        0.0346611849963665,
        0.018873590975999832,
        -0.052789460867643356,
        0.019046705216169357,
        -0.024477453902363777,
        -0.025362635031342506,
        -0.06783366948366165,
        -0.06818484514951706,
        -0.04532952979207039,
        0.011427531018853188,
        0.008512983098626137,
        0.05484003573656082,
        -0.004341428633779287,
        -0.026539945974946022,
        -0.04869217053055763,
        0.09936448186635971,
        0.018878692761063576,
        -0.026326745748519897,
        -0.037252988666296005,
        -0.04047003760933876,
        -0.03333992511034012,
        -0.051882535219192505,
        -0.0244586244225502,
        0.0635719820857048,
        0.005835698917508125,
        -0.05337504297494888,
        0.01579044759273529,
        0.020414328202605247,
        0.012877861969172955,
        0.014643421396613121,
        -0.05495542660355568,
        0.015462176874279976,
        -0.0027216707821935415,
        -0.016276931390166283,
        -0.024858128279447556,
        -0.011205313727259636
    ]
}