{
    "id": "zb7Bs98KmnY",
    "title": "Longer-lasting light bulbs: it was complicated",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2023-07-16T17:29:45Z",
    "video_url": "https://www.youtube.com/watch?v=zb7Bs98KmnY",
    "category": "Science & Technology",
    "tags": [],
    "views": 1264725,
    "likes": 63696,
    "comments_count": 5915,
    "description": "It's a hot topic.  Oh, wanna learn about high pressure sodium lamps? Have I got a video for you.   What about that weird fluorescent adapter thingy?   Technology Connextras (my second channel where stuff goes sometimes)   Technology Connections on Mastodon:   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://youtu.be/U1dMlVwUsrA",
        "https://youtu.be/JFJO3emhOyY",
        "https://www.youtube.com/@TechnologyConnextras",
        "https://mas.to/@TechConnectify",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Planned obsolescence - its an insidious thing. A business that designs the perfect product which lasts forever will run out of customers onceeverybody has one. And running out of customers is a pretty bad strategy for a business which strivesto be immortal. This simple reality, when viewed with a slightly twisted mindset, can be seenas a reason to never build the perfect product, and it is often argued - quite convincingly, I should say - that companies today are actively making their products worse to guaranteeyoull have to buy another one before too long. Now, Im not here to make any accusations. ThoughI do certainly wish to see us endowed with a right to repair the things we own, and maybe some otherthings while were at it. Uh, anyway, though I wont comment on what may or may not be happeningtoday, between the first and second world wars, an actual, documented conspiracy between lightbulb manufacturers across the globe existed. The Phoebus cartel, an arrangement between Osram, Philips, General Electric, and several others, established a maximum light bulb life expectancyof 1,000 hours. The organization even conducted tests on each others products and issuedfines to its members when their light bulbs took just a little too long to burn out. Mostinsidiously, they defined this 1,000 hour maximum after light bulbs with significantlylonger 2,500 hour lifespans already existed. That would seem to point straightat planned obsolescence - after all, the lifespan of light bulbs had steadily been going up before the cartel was formed, so surely we were on our way to some sort of everlasting lightbulb stopper. The manufacturers coming together to impose an artificial limit like they are known to have done seems on the surface at least nothing but a ploy to sellmore light bulbs. And light bulbs sales just so happened to increase after the lifespan limitwas enforced, which reversed a worrying trend. Sure smells like planned obsolescence to me! Indeed, the smell is so strong that manypeople point to the Phoebus cartel as the genesis of planned obsolescence, or atleast a very clear and undeniable example. And perhaps the most irrefutable piece of evidence comes from, of all places, a garage in California. Hanging in the firehouse in the town of Livermore is the Centennial Light, an incandescent light bulb that has been burning nearly continuously since 1901. Surely that light bulb with its century-plus longevity provesthat light bulbs never truly need to burn out. Well ok so have you ever actuallyseen an image of the Centennial Light? Here it is. Yeah, its barely glowing, is it? See *sigh* This topic is actually one that actually feels weird to cover. I definitely think that planned obsolescence has happened and arguablyis still happening today, and I wasnt just making wordplay back then - I am genuinely on theside of the right to repair movement, and giving something an artificial expiration date just to ensure you can sell more is, uh, pretty gross! However the incandescent light bulb is just not a good example of planned obsolescencefor lots of reasons, and using it as evidenceof planned obsolescence genuinely bothers me. Am I about to well, actually the Phoebuscartel story? [through gritted teeth] Yeah... Heres the thing - when the story of the PhoebusCartel is told, those telling it have a bad habit of downplaying or even outright ignoring the fact that there were real, significant, actual advantages to a light bulbthat only promised 1,000 hours of operating time. Such bulbs produced a whiter-looking light which was easier to see under, and they could produce more light with the same amount of power - which meant they cost you, the person paying that power bill, less to operate. Thats a pretty important caveat, dontcha think? Glossing over that little bit of context isbad enough, but a second rather important fact tends to get skipped, too: that beingthat light bulbs were never a durable good, and once we figured out howto automate their production, they werent exactly expensive. I mean, itsliterally just a little bit of glass, a little bit of wire, and a little bit of metal and resin to formthe screw base. There is more than 5 times as much glass in this empty jar of maple butter than thereis in this 40 watt light bulb. It took us years and years to figure out how to make these things,sure, but once we were able to use machines to crank these out in big ol light bulb factories well this isnt a very complex object now, is it? No, its not, but before we continue we needa little bit of background: incandescent light bulbs are called that because they rely on thephenomenon of incandescence to produce light in a bulb. Incandescence is this weird thing that happens when stuff gets really hot - all things emit electromagnetic radiation, and asthey get hotter, they start to emit waves with shorter and shorter wavelengths until, eventually, those wavelengths hit the visible light spectrum that our peepers detect. Thats why the wires inyour toaster glow an orangey-red - theyre just so hot that theyre emitting some visible light. But, not a lot. Theyre definitely really hot, but you need to get much much hotter to shiftfrom a dull orange glow to something more useful. And we knew how to do that just fine! We had beenplaying about with this electricity business for quite some time and plenty of experiments were done showing thin wires glowing quite brightly. The trouble was that when you make things so hot that they start emitting white light, those things tend to either melt orreact with oxygen in the air and burn. And that little problem is whatthe light bulb sought to fix. After years and years of experimentation, variouspeople whom I wont name to avoid comment-section flame wars arrived upon a filament whichcould get extremely hot without melting. When exposed to the atmosphere with all that oxygen floating around, it would still burn,though, and quickly go up in smoke. So, we putit in a clear, glass bulb that we sucked all the air out of with a vacuum pump. Now there was nooxygen in there for the material of the filament to react with, so it couldnt possibly burn. Andthere you go. Thats what a light bulb is. An impossibly hot bit of wire protected from burningaway by its own little envelope of nothing. The first functional lightbulbs didnt last long at all, but we were still learning how bestto make them. We tried all sorts of things - different shapes and materials for the filament, the bulb itself, the support structures, more-perfect vacuums, and eventually we got pretty good at it! But we still had an insurmountable barrier: the melting point of the carbon filament. There was a hard limit to how hot you could run the filament before it broke, so early light bulbs produced a rather dull, orangey-yellow light. Still beat the pants off of gas lamps, though. But then, we figured out how to form thin wirefilaments from tungsten. That alone was quite the engineering feat - tungstens hardness andbrittleness make it very difficult to work with. But figuring it out was the holy grail of light bulb makers because of tungstens extremely high melting point: the highest ofany known element at 3,422 degrees Celsius, 6,192 degrees Fahrenheit, or 3,695 Kelvin degrees. [stares knowing exactly what he did] If we could just crack that code, we could make the most brilliant light bulbs anyone had ever seen. Of course, we did - and with tungsten filaments, whiter, brighter, longer-lasting light bulbs started to become the norm. A couple of otherinnovations were still on the way: the coiled coil structure of the filament, through its compact anddense shape, allowed it to run hotter with less input power. And we found that adding a littleinert gas to the bulb like argon or krypton worked better for tungsten filament longevity than a purevacuum. But really, aside from those two things the light bulb wouldnt change anymore. Thisappliance bulb I just bought in a store the other day is no different from the light bulbsmanufactured a century ago - its just a piece of tungsten wire glowing because it gets literally white-hot when we run current through it, positioned inside of a thin glass bulb filled with an inert gas at low pressure to prevent the filament from reacting with oxygen and burningaway. Not exactly the pinnacle of complexity. However, the filament reacting with oxygen andburning isnt the only issue we have. Although tungsten wont melt until it hits 3,695 Kelvin, itdoes have this annoying habit of evaporating when it gets close to there. Or, I guess technicallythat would be sublimating. Anyway, as the lamp is operated, little bits of hot tungsten becomeliberated from the filament and wind up on the inside surface of the glass, which both darkensthe glass bulb and weakens the filament with time. Eventually, the filament becomes so weakthat it breaks, and pop goes the light bulb. And heres where the heaping spoonful ofoft-omitted nuance from the Phoebus cartel story comes back into play: how quickly a light bulbburns out depends on how hot you run the filament. The closer you get to tungstens melting point, the faster evaporation happens, which leads to the filament weakening more quickly and thus results in a shorter lifespan for the light bulb. Sounds like we should just not run them too hot,then, but see as you get closer to tungstens melting point, you also get a brighter, whiter, more energy-efficient light bulb. Theres a trade-off between qualityand efficiency of the light producedby an incandescent light bulb and how longthat light bulb will run before it fails. This is merely a physical reality of allnon-halogen tungsten-filament lamps. Its a reality we understood in 1925 whenthe cartel was formed, and its a reality that continues to be real for what few incandescent light bulbs remain on the market. For example, these are both 40 wattincandescent light bulbs. One of them is an appliance bulb like youd put in your oven rated for 2,500 hours of runtime. The other is a ceiling fan bulb which is really just a general-purpose bulb with a candelabra base. This bulb only promises 1,000 hours of runtime, and boy are these runtimes weirdly similar to how the cartel story started, thats strange. Anyway, when we compare the two side-by-side, the longer-lasting appliance bulbis noticeably dimmer and yellower despite using a nearly-identical amount ofpower. It is a longer-lasting light bulb, but it is also objectively worse at its single job of producing light with electrical power. So which is really the better light bulb? Sortadepends on what youre going for, doesnt it? But these are two different light bulbs - maybetheres some sort of manufacturing issue with the appliance bulb and it shouldnt be that dim. Well,to demonstrate slightly more scientifically, Ive got a big ol box of 555 indicator lamps. Theselittle light bulbs are designed to run at 6.3 volts and consume about 1.5 watts of power. Whenrun at their rated voltage, theyre definitely not the brightest things out there - they barelyproduce a visible glow when under this lampshade. But watch what happens when I double the voltage. The light has gotten much brighter, and whiter, too. Its also now drawing nearly 5 watts of power- and boy is this the brightest 5 watt light bulb Ive ever seen. Look how much brighter it is thanthis 4-watt night-light bulb. Thats impressive. So why dont we run all light bulbs like this? Well, you probably already know. Its because they dont last long at all when you do this. Whilewe are getting way more light out of this thing, the filament is getting weaker by the minute. Thisbulb was only run for 10 minutes at double its rated voltage, and already we can see significantdarkening of the glass. Thats from the evaporated tungsten which has deposited on the glass and thathappens in all non-halogen incandescent bulbs, but its particularly noticeable with these little fellas since the bulb itself is so small. To give a true running-time at this voltage, I ran a stopwatch on a test of a fresh bulb and found it only survived for 65 minutes at 12.6volts. And thats what it looked like in the end. And I want to be clear here, the meltingpoint of tungsten isnt the issue. Id estimate that at 12.6 volts wererunning the filament at somewherenear 3,100 Kelvin, and tungstenwont melt until 3,695 (plus tax). The problem is the rate of evaporation of thefilament. That happens faster with every increase in temperature, so the hotter you run it, theshorter the life it will live. If you just keep on cranking the voltage up, you will hit the meltingpoint and will experience an instant burn-out, but after sacrificing several bulbs for the goodof science, I found that 20 volts would keep us just below the melting point and we could seejust how bright we can get one of these suckers. And boy is it astonishingly bright - heres thattable lamp running the 40 watt general-purpose incandescent bulb again. And now, heres that samelamp but with our teeny little 555 indicator running at 20 volts. Thats nothing short of amazing, and aside-by-side comparison reveals its just about as bright. It might even be a little brighter, butits hard to make a direct comparison because of how drastically whiter the light is. In-personthis was weird, as it was an incandescent light bulb burning with the appearance of abright-white LED or fluorescent lamp. The brightness is impressive enough on itsown, but look at the power draw - were only using half an amp at 20 volts which works out toabout 10 watts, so were seemingly getting four times as much light per watt. Thats amazing andrivals the efficiency of some LED bulbs today. The catch? Well, lets let the videoactually play. Immediately the light begins to darken. Before long its much lessbright than the bulb on the left. And it lasts a mere 41 seconds before the filament breaks - and this was a really good showing. Whats going on here is that as the filament loses materialthrough evaporation, small weak spots form. We can actually see multiple breaks in this footage, but the filament keeps falling in on itself and keeping the circuit intact. Eventually, though,one of these fractures leaves a gap, the circuit is broken, and the light goes out. Depending onhow that happens, though, you can sometimes bring the bulb back to life with a little percussivemaintenance. If you manage to complete the circuit, the tungsten will sort of spot-welditself back together. For a while, anyway. Heres the rub: as Ive hopefully demonstrated, the design of the tungsten-filament incandescent light bulb was always an exercise in balancinglifespan with energy-efficiency and quality of light output. And this is why using thePhoebus cartel as evidence of planned obsolescence rubs me the wrong way. By thetime it was formed in 1925, scientists and engineers understood the lifespan-efficiencytrade-off. There are even equations for it! We had essentially perfected the tungsten-filament lamp by the time the cartel was formed, and you simply cannot optimize for lifespan without making the light bulb worse at being a light bulb. The 1,000 hour operational target was simply adecent sweet-spot in the middle (plus, of course, it was a nice round number figure and thoseare hard to resist). Somebody just had to define what the sweet spot was and makeit a standard. And thats what happened. To be clear, Im not forgetting that this wasa literal oligopoly with documented collusion efforts that undoubtedly set prices artificiallyhigh and did all sorts of other slimy things, too. Im not here saying the cartel wassome sort of wonderful organization. But I feel like ignoring the reality of theefficiency-lifespan tradeoff in tungsten lamps is... dishonest. It would definitelybe insidious if the 2,500 hour light bulbs the cartel sought to extinguish were just asgood and just as efficient as the agreed upon 1,000 hour light bulb but that just wasntthe case. Longer life light bulbs were always duller, dimmer, and thus required more power to produce the same amount of light. What I think really bothers me is that you dont have to look that deeply to uncover this context. Just looking up the cartel on Wikipediareveals that Some engineers deemed 1,000 hours a reasonable figure to balance the variousoperational aspects of an incandescent bulb, since longer lifespan means reduced efficacy (lumens per watt): a longer-life bulb of a given wattage puts out less light (and therefore proportionallymore heat) than a shorter-life bulb of thesame wattage. Nevertheless, long-life incandescentbulbs were and are available with lifespan ratings up to 2,500 hours, and these do in fact produceless light per watt. There is even an excerpt from a report from the Monopolies and Restrictive Practices Commission of the United Kingdom from 1951 which says quite plainly that while it mightlook like hanky panky was going on, conflicting factors make it impossible to view the great light bulb life shortening as anything nefarious. But then, I hear you asking, why establish tests to make sure the bulbs didnt last too long? Assessing a fine to your members for making a light bulb thats just a little too good seems pretty iffy. Well, again, would it actually be good? Thats upfor debate, and its kind of the whole point Im making, here. Also of note, many of the companiesin the cartel were also in the business of running power grids - or at least building much of themachinery that made those power grids work. They intimately understood that long-life lightbulbs would make that part of their businessharder and more expensive, especially as moreand more people got electricity in their homes and electricity demand grew. Thats a pretty solidreason to start favoring energy efficiency over lifespan and enforcing a standard to that end. Especially when, to repeat myself, this is just a little bit of glass and a little bit of wire made not by human hands but by machines which could crank out tens of thousands per day. They were not by any means precious objects. Now, I foresee some of you viewing thatlight-bulb makers were also being in thebusiness of power generation as evidence of a conflict ofinterest, and maybe it was but they sure didnt take advantage of that position. If their onlygoal was to maximize the money you gave them, well then they should have been selling nothingbut long-life light bulbs that needed much more power for the same amount of light. But thatsnot what happened. It was better for all parties involved to run cheap light bulbs as hot as you could in exchange for lower operating costs. I know how some folks feel about higherauthorities making decisions on theconsumers behalf, though I can assure you thatshappening all the time in the private sector, you just may not be so aware of it, buthonestly establishing a 1,000 hour lifespan was the correct decision - or, at the veryleast, far less insidious than it seems. The ultimate evidence of this is that it neverchanged! The cartel dissolved in 1939 and yet, decades later, 1,000 hours remained theoperational target for general-purposelight-bulbs. Later on you could getso-called long-life bulbs if you wanted to, much like this appliance bulb here, butto produce the same amount of light, they needed more power andthus consumed more energy. This Washington Post article from 1981 points outthat to produce the same amount of light as a 75 watt standard-life bulb, you need to move up toa 100 watt long-life bulb. Is it really worth a 33 percent increase in energy consumption just toavoid buying a $0.90 light bulb every six months? As a matter of fact, objectively no! In 1981the average cost for electricity in the US was 6.9 cents per kilowatt hour, nice. Over the2,500 hours of lifetime, those extra 25 watts would amount to 62.5 kilowatt-hours of energyexpenditure which would cost you $4.31. So, by choosing the equally-bright but longer-lastinglight bulb, you will spend $4.31 more on energy but you wont even save $2.00 on light bulbs. Thatmeans, objectively, you were spending more money running one of those long-life bulbs than youwould if you were just buying standard-life bulbs and changing them more frequently. And thats whythe article suggests to use long-life bulbs only in hard-to-reach places where the extra runningcosts are worth avoiding a bulb change-out. And thats with retail prices for light bulbs. Remember how I said they were really cheap to make? Well, I was talking with my momand dad about this video project and they told me something interesting - back in theday, ComEd (thats the power utility here in the Chicago area) would just give you freelight bulbs when you paid your power bill! And it turns out they still had some ComEd-branded light bulbs in their bag o bulbs. My grandfather used to say that he never paid for light bulbs thanks to ComEds free light bulb program. Oh, by the way, this is a three-way bulb whichmeans it has two filaments inside. One of them is 30 watts, and the other is 70 watts. Usinga second ring-shaped contact on the screw base, a three-way lamp socket can select between one,the other, or both filaments, allowing you to operate this as a 30, 70, or 100 watt light bulb. The middle contact powers the larger filament, and the cycle of zero, 30, 70, and 70+30 is thereason some lamps require two clicks to switch between on and off - those lamps are meantto use bulbs like this, and then they let you select between bright, brighter, brightest andoff. You can get LED versions of bulbs like this, but theyre usually tucked away with the specialtybulbs in the store and are weirdly expensive. Anyway, ComEd, because they had to deal with theoperational challenges of running a growing powergrid, had an incentive to hand out efficient lightbulbs like candy to keep people from focusing on the wrong metric and buying longer-lasting butless-efficient light bulbs which would strain the power grid more. In fact they sort-of stilldo this today. Theyre no longer handing out free light bulbs except in special programs, butthey heavily subsidize energy-efficient light bulbs in stores with instant rebates, and manyutilities across the country run similar programs. Now, was keeping power demand in-check theironly goal? Well, thats hard to say. Among all the light bulbs in the bag is a 100 watt ComEdbulb labeled long-life so that pokes a hole in the argument. Though, to be honest, when poweredup that thing is awful bright so Im not sure how long-lived it actually would be. Perhaps themore cynical among you will choose to believe their free light bulb program was actually doneto pad the power bills of their rate-payers and they were terrible light bulbs, though I thinkthe kind of bulb they subsidize today compared to those they dont points to the exact oppositeconclusion. Regardless, the broader point here is that incandescent light bulbs were cheap as chips- so cheap utilities were willing to just give them away or run exchange programs, and even atretail prices they were less than a dollar apiece. The simple fact is the incandescent light bulb was a consumable good, and thus to me they simply cannot be used as evidence of plannedobsolescence. Yes, in a very literal sense their demise is planned - after all, they are engineeredto fail after a specific number of hours. But you cant just say that without acknowledgingthe reasoning behind it - they deliberately traded lifespan for efficiency, and since incandescent light bulbsarent very efficient at all to begin with, their operating costs almost alwaysexceeded the purchase cost anyway and it was absolutely worth reducing theirlifespan to eek more light out of em. If you wanted a bulb with a longer lifespan, youeither needed to sacrifice efficiency and quality of light which almost always cost you more in theend on your power bill, or move to an entirely different lighting technology like fluorescentlights or high-intensity discharge lights, and those different technologies hadtheir own trade-offs, too. Mainly higher upfront purchase cost and, uh, rather uglylight quality, at least in the beginning. But thats the other thing - those othertechnologies existed! They existed and were on the market and anybody who valued efficiency and/or longevity could decide toinstall such light fixtures. There wasa sea of options by the 1950s but the good ol tungsten filament lamp remained thedefault because it had excellent light quality, was good enough, and most importantly was cheap. And despite the cartel no longer being a thing, 1,000 hours remained the efficiency-longevity sweetspot target for most applications. The Centennial light in Livermore, Californiahas burned for so long because its barely been burning. Why, exactly, is unclear. Supposedly, it should burn as a 30 or 60 watt bulb but has decreased in power overthe years for reasons unknown. Or perhaps, and heres where my money is, it was simplymanufactured incorrectly (after all bulbs were still hand-made back then) and it neverburned at the wattages it was supposed to. Perhaps thats why Dennis Bernal donatedit to the fire department - it was only bright enough to serve as a night lightso thats what it went on to do. Anyway, the reason isn't important, what is importantis that the Centennial Light has spent at least the majority of its existence as a very badlight bulb - albeit one with notable longevity. But now, I need to come upwith some sort of conclusion. What exactly is the point Im making here? Wellif we wanna get deep I suppose that would be that the world is complex, and you should be skepticalof simple narratives. Nobodys saying that the Phoebus cartel was a wholesome organization, Im certainly not anyway, but simply saying that they made sure light bulbs didnt lasttoo long leaves out too much of the story. If there were a way to make 2,500hour light bulbs perform like1,000 hour light bulbs then sure, by all means getout the pitchforks. But that just wasnt possible. I also think that, frankly, the incandescentlight bulb just doesnt speak to the spirit of planned obsolescence at all - they were simplyone of many products that got used up over time. When I think of planned obsolescence, I think of something like a dishwasher, car, or washing machine; a complex,expensive machine thats a major purchase. Light bulbs werent expensive, complex, or meantto be durable. At least to my eyes, a light bulb has more in common with, say, laundry detergentthan it does a washing machine. Just as that box of detergent gets used up and runs out, eventuallythe light bulb gets used up and burns out. And to really drive the point home, remember thatthe cartel dissolved in 1939 yet in the years that followed, that reality didnt change. The arrivalof halogen lamps which allowed for much hotter filaments and longer runtimes thanks to some wildchemical interactions between tungsten and iodine or bromine that I wont go into other than what Ijust said didnt even disrupt the practicalities of the light bulb all that much. Incandescentlight bulbs were a commodity product that had to balance efficiency, lifespan, and upfront purchasecost. For general household use, the plain ol 1,000 hour tungsten lamp remained right in thatsweet spot until, honestly, quite recently. Speaking of quite recently, perhaps ironically thelight bulbs of today are now, for real, actually becoming plagued with planned obsolescence - or, at least, lazy engineering with a heaping spoonful of cost-cutting. The arrival of the whitelight-emitting-diode was nothing short of a game changer to the lighting industry, and has unlockedextremely efficient and incredibly long-lived lighting products. At least usually. I personallyhave been very fortunate and can count on one hand the number of LED bulb failures Ive experiencedsince 2018, but sadly there are lots of products out there, especially on the lower-end of thecost spectrum, which have terribly flawed designs. Overdriven diodes, bad heatsinks,bargain basement capacitors, or even just shoddy manufacturing plaguefar too many LED lighting products, as anyone whos spent any time around BigClives channel would know. Of course, theres bound to be bad or defective productdesigns out there from time to time, purple streetlights anyone? But things like shoving morecurrent through the diodes than theyre designed for just to eek out that extra bit of lightare inexcusable, yet disturbingly prevalent. Still, beware the pitfalls of your biases. When asupposed 50,000 hour LED bulb burns out in a year, yeah thats probably gonna annoy you. Butif youre old enough to remember the days of tungsten lamps, which I realize many of youwatching might not be, think back to how often you used to have to change them. I can rememberseveral times from my childhood when I went to turn on my bedroom light and *plink* it burntout in a bright blue flash - and that was just a single light bulb in a ceiling fan. Now thatI have dozens of LED lights all over the house, many of which run automated routines and come onevery night, its pretty amazing that in the last five years Ive changed but a few. Light bulbs maynot not be perfect, no, but they sure are better. optimally smooth jazz to guarantee youll have tobuy another one before too long. That might have been a perfecttake but I wanna do it again, Though I wont comment on what may or may notbe happening today [bong from phone] butj sh-! Well, that was my fault. Its literally just a little bit of glass, a little bit of wire, and a little bitof me- yeah I picked up the wrong one. All things emit electromagnetic radiation, andas they get hotter, they start to emit irradia--- what the heck just happened there? with the appliance bulb and it shouldn't be that dim. Well thats distracting. Was keeping power demand in-checktheir only go? Now, geez. Now, Which works out to 10 watts. So were see... oh crap. I hope this video was illuminating! There's more to this story than it seems on the surface, and I was hoping I could shed a little light on it. There are definitely a lot of burning questions around light bulbs, and it's a hot topic. I hope I helped extinguish some of your fears, but now you can bask in the warm glow of a nice LED. Or a cool glow, if that's your thing.",
    "transcript_keywords": [
        "light bulbs",
        "light",
        "bulb",
        "incandescent light bulb",
        "bulbs",
        "watt light bulb",
        "hour light bulbs",
        "incandescent light",
        "light bulb life",
        "light bulb program",
        "free light bulb",
        "filament",
        "Centennial Light",
        "power",
        "longlife light bulbs",
        "hour light",
        "life light bulbs",
        "Planned obsolescence",
        "cheap light bulbs",
        "watt light"
    ],
    "transcript_entity_values": [
        "Butif",
        "a mere 41 seconds",
        "Centennial",
        "70 watts",
        "70+30",
        "two",
        "6,192 degrees Fahrenheit",
        "33 percent",
        "62.5 kilowatt-hours",
        "Kelvin degrees",
        "12.6 volts",
        "40",
        "the other day",
        "only using half",
        "one",
        "four",
        "ComEd",
        "Thisbulb",
        "the days",
        "this 1,000 hour",
        "a year",
        "overthe years",
        "a century ago",
        "Philips",
        "30",
        "Washington Post",
        "5 watt",
        "1,000 hour",
        "70",
        "30 watts",
        "thePhoebus",
        "ComEds",
        "BigClives",
        "75 watt",
        "first",
        "decades later",
        "40 watt light bulb",
        "the minute",
        "Nobodys",
        "1,000 hours",
        "2018",
        "every six months",
        "65 minutes",
        "about 1.5 watts",
        "Phoebus",
        "4-watt",
        "PhoebusCartel",
        "three",
        "555",
        "zero",
        "1951",
        "Kelvin",
        "the 1950s",
        "argon",
        "1939",
        "40 watt",
        "Chicago",
        "Osram",
        "3,422",
        "Dennis Bernal",
        "this today",
        "25 watts",
        "less than a dollar",
        "as much light per watt",
        "4.31",
        "Californiahas",
        "10 watts",
        "today",
        "Incandescentlight",
        "3,100",
        "Livermore",
        "Phoebuscartel",
        "the Monopolies and Restrictive Practices Commission",
        "tens of thousands",
        "60 watt bulb",
        "wasa sea",
        "10 minutes",
        "6.9 cents",
        "the last five years",
        "1901",
        "the Centennial Light",
        "ComEdbulb",
        "12.6volts",
        "years and years",
        "the years",
        "50,000 hour",
        "0.90",
        "30",
        "1925",
        "20 volts",
        "2,500hour",
        "2,500 hours",
        "Usinga",
        "Ijust",
        "2,500 hour",
        "more than 5",
        "1981",
        "General Electric",
        "3,695",
        "6.3 volts",
        "California",
        "US",
        "100 watt",
        "One",
        "the United Kingdom",
        "second",
        "2.00"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "TIME",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "TIME",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "GPE",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "TIME",
        "MONEY",
        "DATE",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "MONEY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "MONEY"
    ],
    "vector": [
        -0.06201915070414543,
        -0.02992062084376812,
        0.08237606287002563,
        -0.007100878749042749,
        0.03740076720714569,
        -0.03933865949511528,
        0.017381103709340096,
        0.07547266781330109,
        -0.06996303796768188,
        -0.005520427133888006,
        0.043562401086091995,
        0.06378930807113647,
        0.03362877666950226,
        0.03090694174170494,
        -0.023745378479361534,
        0.0017366647953167558,
        -0.05829116329550743,
        -0.09012174606323242,
        -0.09779227524995804,
        0.003987545613199472,
        0.04298271983861923,
        -0.09150124341249466,
        -0.01443134993314743,
        0.03353332728147507,
        -0.022228747606277466,
        0.025299234315752983,
        -0.024004846811294556,
        -0.10408104956150055,
        -0.06015757843852043,
        -0.04340881481766701,
        -0.023574495688080788,
        0.09753406047821045,
        -0.05274832621216774,
        -0.029729634523391724,
        0.04708566889166832,
        -0.05336259678006172,
        -0.03586138039827347,
        -0.026017051190137863,
        -0.02637636289000511,
        -0.026631901040673256,
        -0.0009476646082475781,
        -0.11344077438116074,
        -0.026686059311032295,
        0.015397538430988789,
        0.0030099344439804554,
        -0.05527842417359352,
        0.08606255799531937,
        -0.09409506618976593,
        -0.034667812287807465,
        -0.038624584674835205,
        -0.04696553200483322,
        -0.09023712575435638,
        0.10511938482522964,
        0.0030657837633043528,
        0.011220301501452923,
        0.012187827378511429,
        -0.059416696429252625,
        0.03083660826086998,
        -0.0013770430814474821,
        -0.0018841857090592384,
        0.12011048197746277,
        -0.05030420422554016,
        0.0048431591130793095,
        0.004398217424750328,
        0.019176257774233818,
        0.06054950878024101,
        0.001167611451819539,
        0.002972146961838007,
        -0.02197416126728058,
        0.07101455330848694,
        -0.025295961648225784,
        -0.049169380217790604,
        -0.029327234253287315,
        0.09554817527532578,
        -0.01799180917441845,
        0.032097574323415756,
        0.08550768345594406,
        -0.04945828765630722,
        -0.014070890843868256,
        0.01754976063966751,
        0.0329308919608593,
        -0.01215861551463604,
        0.004791761748492718,
        0.02836872637271881,
        0.0068282680585980415,
        -0.05857248231768608,
        0.05707641690969467,
        0.03201063722372055,
        -0.03187987580895424,
        -0.05173396319150925,
        -0.03589281812310219,
        0.09102392196655273,
        0.026538478210568428,
        -0.011104399338364601,
        0.01030054222792387,
        0.05093389004468918,
        -0.06816991418600082,
        -0.025245606899261475,
        -0.041915182024240494,
        0.025978241115808487,
        -0.014474265277385712,
        0.009199712425470352,
        0.004956696182489395,
        -0.01838662102818489,
        -0.04884995147585869,
        -0.06990041583776474,
        -0.08208924531936646,
        0.0883219987154007,
        0.04281675070524216,
        0.06726934760808945,
        -0.008248712867498398,
        -0.002550794743001461,
        -0.026227066293358803,
        0.04314354062080383,
        -0.008275269530713558,
        -0.02006714604794979,
        -0.05600422993302345,
        0.00548509880900383,
        0.06512445956468582,
        0.06790032982826233,
        0.05251482501626015,
        0.03325922042131424,
        -0.022851066663861275,
        0.006912275217473507,
        0.007840778678655624,
        0.0004729648644570261,
        0.00012837724352721125,
        4.8678899820420694e-33,
        -0.09520354121923447,
        0.06244568154215813,
        -0.05011298507452011,
        -0.012113260105252266,
        -0.06414984166622162,
        0.03626303747296333,
        0.011161061935126781,
        0.06461165845394135,
        -0.06620071083307266,
        -0.031725406646728516,
        0.03325079381465912,
        0.07170278578996658,
        -0.017668504267930984,
        -0.0007714556995779276,
        0.03579409793019295,
        -0.08735433965921402,
        0.019813111051917076,
        0.005970944184809923,
        0.044739723205566406,
        -0.0648450180888176,
        -0.03729648143053055,
        0.01093255914747715,
        -0.005200863815844059,
        -0.011042513884603977,
        -0.0029129236936569214,
        -0.1149093434214592,
        0.015891827642917633,
        0.04259355366230011,
        -0.028420737013220787,
        0.015518778935074806,
        0.06074874475598335,
        0.07621725648641586,
        0.021335534751415253,
        -0.041029192507267,
        -0.08003179728984833,
        -0.07072025537490845,
        -0.009864849038422108,
        -0.06467545032501221,
        -0.028587372973561287,
        -0.007074028253555298,
        -0.08025426417589188,
        0.13960836827754974,
        0.0026813754811882973,
        0.11873240768909454,
        0.04269615560770035,
        0.03674869239330292,
        -0.0012592015555128455,
        0.029404109343886375,
        -0.07733646035194397,
        0.02507564052939415,
        -0.08357436954975128,
        0.030010102316737175,
        -0.05891646072268486,
        0.03940300643444061,
        0.038805779069662094,
        0.02573665976524353,
        -0.0493447482585907,
        -0.11374449729919434,
        0.045971475541591644,
        -0.06853900104761124,
        0.0031927365344017744,
        0.010383649729192257,
        -0.1073254942893982,
        0.0017838955391198397,
        -0.006495683453977108,
        0.050162483006715775,
        0.030327385291457176,
        0.05723349377512932,
        -0.09023237228393555,
        -0.02770114503800869,
        0.04600302502512932,
        -0.09322219341993332,
        -0.0868334248661995,
        -0.044098131358623505,
        0.0018202371429651976,
        -0.025026390329003334,
        -0.021401939913630486,
        0.06221075728535652,
        0.024841314181685448,
        -0.033629607409238815,
        0.03774604573845863,
        -0.042210862040519714,
        0.02891295962035656,
        -0.008616619743406773,
        0.0896323025226593,
        0.025481056421995163,
        0.03173660859465599,
        -0.034210454672575,
        0.0007611986366100609,
        0.06438503414392471,
        0.03436000645160675,
        -0.0016227676533162594,
        0.020030513405799866,
        0.0012132982956245542,
        -0.015481158159673214,
        -4.9516399137763264e-33,
        0.0241288710385561,
        0.002411059569567442,
        -0.021630898118019104,
        0.0490148589015007,
        0.099378801882267,
        -0.018864843994379044,
        -0.11437521129846573,
        -0.03139536827802658,
        0.001094971550628543,
        -0.05216456204652786,
        0.050919584929943085,
        0.031410329043865204,
        0.009451908990740776,
        -0.030877791345119476,
        -0.07184243947267532,
        -0.055130694061517715,
        0.037893399596214294,
        -0.06898067891597748,
        0.030922841280698776,
        -0.10034964978694916,
        0.05716830864548683,
        0.07904814928770065,
        -0.12994201481342316,
        -0.021696127951145172,
        -0.10843560099601746,
        0.0619061104953289,
        -0.046710312366485596,
        -0.006621974520385265,
        -0.04051016643643379,
        -0.001870853011496365,
        -0.04599425941705704,
        0.01835601031780243,
        -0.005432000383734703,
        0.021797051653265953,
        0.0244468841701746,
        0.04469718784093857,
        0.0421513207256794,
        -0.04306895285844803,
        -0.04070231318473816,
        0.009646624326705933,
        0.05066598951816559,
        0.007848679088056087,
        0.041594307869672775,
        -0.0755447968840599,
        -0.03556358069181442,
        -0.05992995575070381,
        0.005325074307620525,
        -0.07598572224378586,
        0.07594418525695801,
        0.036425597965717316,
        0.04252542555332184,
        -0.0012637662002816796,
        0.02214822731912136,
        -0.06090414151549339,
        -0.07896588742733002,
        -0.03797491267323494,
        0.0616445355117321,
        0.041472453624010086,
        -0.0028200431261211634,
        0.0025224771816283464,
        0.12205469608306885,
        0.0017056461656466126,
        0.09178783744573593,
        -0.005723103880882263,
        0.04401969537138939,
        -0.0020173804368823767,
        0.11715412884950638,
        0.04069763794541359,
        0.025973768904805183,
        -0.052496783435344696,
        0.10131094604730606,
        -0.0038821117486804724,
        -0.08366242051124573,
        -0.013049963861703873,
        -0.00484470697119832,
        -0.010325453244149685,
        -0.037535734474658966,
        -0.003941958304494619,
        -0.07489322125911713,
        -0.031572770327329636,
        -0.018162811174988747,
        0.0351063497364521,
        0.0010809082305058837,
        0.013973299413919449,
        0.06233314797282219,
        -0.035257112234830856,
        -0.013045948930084705,
        -0.032297905534505844,
        -0.0033365057315677404,
        0.07360780984163284,
        -0.04749606177210808,
        -0.01778743602335453,
        -0.08884883671998978,
        0.04416753351688385,
        0.07168639451265335,
        -5.7869186775860726e-08,
        0.05889284238219261,
        0.041919417679309845,
        -0.04409480094909668,
        -0.007916891016066074,
        0.10721498727798462,
        -0.03564953804016113,
        -0.0018439756240695715,
        0.08206579834222794,
        0.028823964297771454,
        0.005571166053414345,
        0.052128080278635025,
        0.0646527037024498,
        0.054774172604084015,
        0.08742760866880417,
        0.010028645396232605,
        0.028369756415486336,
        0.0088621461763978,
        -0.007505017798393965,
        -0.02515614591538906,
        0.02390802465379238,
        -0.03324580192565918,
        0.032448939979076385,
        0.06194891780614853,
        -0.03483448922634125,
        -0.04677138850092888,
        0.038201380521059036,
        0.07039614021778107,
        0.09837347269058228,
        0.013432317413389683,
        0.00666153896600008,
        -0.032669153064489365,
        0.011709101498126984,
        0.06744811683893204,
        -0.008699527010321617,
        -0.026572048664093018,
        -0.0838502049446106,
        -0.015764273703098297,
        0.006597386673092842,
        -0.05973851680755615,
        0.02368667721748352,
        -0.07099148631095886,
        5.16779073223006e-05,
        -0.045390304177999496,
        0.08162195235490799,
        0.05266186594963074,
        -0.03927694633603096,
        0.011234838515520096,
        0.018893254920840263,
        -0.09076643735170364,
        0.07453682273626328,
        0.030997388064861298,
        -0.024126624688506126,
        0.0003444956091698259,
        0.004323611035943031,
        -0.08188055455684662,
        -0.03728891536593437,
        0.04942447319626808,
        0.0958452969789505,
        -0.09001041203737259,
        0.012554236687719822,
        0.07807474583387375,
        -0.0722322091460228,
        0.02343164011836052,
        0.06595408916473389
    ]
}