{
    "id": "Zbs1JL9VjF8",
    "title": "Vlogging Camera Setup!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-28T17:51:52Z",
    "video_url": "https://www.youtube.com/watch?v=Zbs1JL9VjF8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "camera",
        "vlogging",
        "gear",
        "setup",
        "lenses",
        "lens review",
        "testing",
        "audio",
        "video",
        "technology",
        "tech",
        "update",
        "justine ezarik",
        "tripod",
        "review",
        "video production",
        "editing",
        "photography",
        "internet",
        "sony",
        "2018",
        "education",
        "future",
        "lifestyle",
        "business",
        "community",
        "creators",
        "subscription",
        "affordable",
        "online",
        "learning",
        "fashion",
        "beauty",
        "blonde",
        "vlogger",
        "gears",
        "lense",
        "pretty",
        "girl",
        "iphone",
        "apple",
        "production",
        "gearhead",
        "photog",
        "photographer",
        "beautiful",
        "trending",
        "youtube",
        "free",
        "giveaway"
    ],
    "views": 240542,
    "likes": 7036,
    "comments_count": 671,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going, it's Justine. And today we're going to be doing an updated look at what I've been recently using to vlog with. Anytime I post vlogs I see you guys in the comments asking the same questions over and over again. What am I filming with? What kind of lenses am I using? What microphone? What tripod? All of those questions I will answer today in this video. A huge thank you to Skillshare for sponsoring today's video. If you guys haven't heard about Skillshare, definitely check it out. If you're like me, I have pretty much learned everything I know when it comes to video production and editing and taking photos, any time I have a question or anything, I'm always going to the internet to look up stuff. So Skillshare has over 17,000 classes and courses that you guys can take, ranging from a variety of subjects. Creative, business, technology, I was so excited because one of the things that I've always wanted to learn is how to take better photos at night. This was one of the first courses that I came across. They have so many things, so whatever it is that you're looking to learn, I guarantee that they will have something there for you. If you guys wanna check it out, the first 500 people to click my link and sign up in the description below will get premium membership for $0.99 for two months. And then after that, it's $10 a month if you choose to continue. All of the courses are taught by people who are experts in their field, and this is also pretty awesome too. I travel a lot and sometimes I don't always have an internet connection. You can download them on your iPhone or your Android phone. So if you are offline, you can still view the courses. So I don't want to overwhelm you guys, but let me go through all of the stuff that I have here. First, starting with the camera. I have two cameras that are my go-to for vlogging. This one is a little point and shoot, and this is the Sony RX100 Mark V. I've talked about this camera many, many times. I love this little thing. But the only downfall is it doesn't have an audio input. So that's where this one comes in. This is the Sony a6500. So what I'm filming this video with is the Sony a7S II, you, and you. The biggest difference is the Sony a6500 is not a full-frame sensor, so with this, I can use smaller lenses, it's much lighter. Whereas the a7S II, which I used to vlog with, is a full-frame, the lenses are so much heavier. And it's also much more expensive, so when I'm traveling and I'm carrying around this camera, a lot of bad things happen. I've dropped it so many times. It's always hitting off of things. So I definitely feel a little bit better about carrying this around, because it is way less expensive than the a7S II and all of the lenses that go with it. So I just recently got this lens, and it's a kit lens. It's also a power zoom lens, so it has this little zoom button right here. So it'll allow you to get some very steady, smooth zooms. Where all of the lenses that I was using before to vlog with were the manual kind, so you have to actually turn it to zoom. So what I love about this current setup is this camera is now super light. The 16mm, it gives you enough wide angle of a lens so that if you are vlogging and filming yourself you can entirely be in frame, but it also has the 50 mm zoom, so if there's something happening in the distance you'll be able to actually see it and zoom in on it. The two lenses that I was using previously was this one, I still really like this lens but I do like the look of this one a lot more because it is a lot clearer and I can zoom a little bit more, because this is the 10-18. It gives you a much wider field of view when you're filming yourself, so if you do want that kind of wide angle lens view, then this is the lens for you. I've been using this lens for the past couple of years, so any of the vlogs that I've shot with the a6500, there's a really good chance that this is the one that I was using. And the zoom lens that I was using before is a 16-70. I recently went to Austria, so I'm gonna show you a little bit of footage that I shot using this lens and this lens. I had the absolute best time in Austria. Everyone was so nice and it was so lovely to meet so many of you guys. So here's an example of using the wide angle lens. As you can see, you can get a little bit of zoom but not very much. But the wide angle is so perfect for vlogging. And here we have an example of what the 16-70 looks like. I'm able to really zoom in on the animals, and it looks pretty good. So you may be questioning right now, Justine, why don't you just stick with these two lenses? And that's a very, very valid question. I love these lenses, there is absolutely nothing wrong with these, but I was trying to find something that was smaller and lighter and a little bit more versatile. Which leads me to the next lens that I got. I watched so many reviews on these lenses before I got them. This is an 18-105, which means the 18 is a little bit zoomed in, but if you hold it out far enough you can still get your full self in the frame. To go from an 18 to a 105 in a single lens is incredible. So I feel like the next time I go to the zoo, this is gonna be the winner. It's just so hard to be able to be prepared for any situation. A lot of times you're gonna be filming yourself but a lot of times something is gonna be happening off in the distance and you're gonna wanna capture that. So let's pop this lens back on. So this lens is also a power zoom and I'm getting really into the power zoom, especially for vlogging. Maybe if you're a filmmaker or I don't know, I've read a lot of reviews where people are not power zoom fans. But I am now a huge fan of it. So you're able to zoom in and out like this. So as you can see, all of the zoom is happening internally, inside of this lens. Vlogging is its own sort of strange art form, because you have to be ready for anything. You don't have time to sometimes set up specific settings. So when you're shooting a movie or a film or a documentary or whatever it is that you're filming, if you're a professional cinematographer, sometimes vlogging, the way that we do, it completely throws people off, because they're like, what are you doing, this isn't how you do it. And I say, oh, no no no, this is how we do it. Maybe not how you do it. I also get a lot of questions about this little microphone, I'll put a link in the description to everything that I talk about, all of the cameras and the lenses. But this microphone I really like as well. It's very small and it sounds really great. It uses the Sony hotshoes so you don't need to power it with anything, the camera itself powers the microphone. That's one of the problems that I always ran into, is I would use the RODE microphones and the batteries would always be dead, because I would leave it on and always forget to turn it off. And then sometimes I would forget to turn it on and then I'd have no audio in my video. So having this hotshoe microphone has been such a lifesaver. Honestly, if there is one lens that you're gonna get, I do recommend this one so much. It's so small, it looks like a tiny little pancake. It's also a very inexpensive lens and some of the reviews that I read said it's not the best quality lens, but for what it is, it's pretty great for exactly what I need it for. Now I'm gonna take you guys out on a hike, where I tested out these two new lenses. I would love to hear what you guys think of them. So, let's go outside. We're now out on a hike, testing out these lenses. Nick is over there, he's got another camera, so he's basically gonna be filming me filming myself and then filming other things. So the first lens that I'm testing out is the 16-50. I'm really excited about this lens, 'cause it's really light, so if you're kind of on the go, in a hurry, this lens is perfect. But there is one downfall that I've seen. Because this lens is one of the power zoom lenses, if you try to manually zoom in and out, you can hear the grinding of the motors. So you guys can hear how loud this lens is. (lens grinds) So instead, you can use this little power zoom button, and it alleviates a lot of that sound. This is really riveting content. How far have we gone? - 0.2 miles. - 0.2 miles? Oh, I guess it's time for a slow-mo montage with this lens. (upbeat music) Okay. So should we do a lens change? - [Nick] Yeah. - Alright, let's put on the 18-105. So this is what the lens looks like if I'm vlogging with it. It is much heavier than the little 16-50 lens, but this is definitely lighter than when I used to vlog with my a7S II, because that camera in comparison to the 6500 is a little bit heavier, and the lenses are much heavier because it is a full-frame sensor. So with this one, I can use smaller lenses and really make it as light as possible, which is key for vlogging. I would love to vlog with the a7S II or the a7 III, but man, these lenses get so heavy. - I can't do it. - Mm-mm. - Can't do it. - [Justine] Even this is heavy. - It looks heavy. - You look good. So here's what it looks like zoomed all the way out. Now let's zoom all the way into that tower. I feel like we're playing Far Cry right now. I don't really care if you are mine I don't need another sign I'm wearing you down to the ground We're done for the night I really don't care if you are mine But I'm keeping you in the line You really don't know which way to turn You're always one step behind Going down this road again I don't want to explain myself Myself Myself You grasp for every crumb of hope Although you've reached the end of my rope The glimpse that you think you see Ain't nothing that I'll ever be That's the last I'll ever be So now I'm at the beach. I wanted to test these lenses out in a little bit of a brighter condition, because the hike that I did was a little overcast. So I wanted to show you guys what it looks like on a beautiful sunny day at the beach. And it is sunny, but don't be deceived. It's actually freezing. (\"Awkward\" by Janet Jones) Freezing outside A little bit high on the feeling Can't seem to focus In the corner of my best friend's sofa You walk in and bust a rum and cola Wasn't brave and I've yet just to talk to you Popped back on the 18-105 so let's see how much I can get with this zoom lens. Something 'bout you feels so special Prettier from the minute that I met you And one last thing, this is the tripod that I use. It is a tiny little tripod, I also love that this little mount here is moveable, although I think I might have got some sand in it. (tripod grinds) It's not moving as well as it used to. You can just attach it on, just like so. There we go, ready to vlog. Thank you guys so much for watching, I hope you guys enjoyed this video and I hope that you found something helpful here. Even if you don't make videos, this is how I make videos. I'm so excited though, because I just got the a7 III so I will be testing that out very shortly, so stay tuned for a full video review. And with that, I will see you guys in my next video. Bye! Prettier from the minute that I met you.",
    "transcript_keywords": [
        "lens",
        "zoom",
        "lenses",
        "guys",
        "zoom lens",
        "power zoom",
        "bit",
        "filming",
        "lot",
        "video",
        "Sony",
        "vlogging",
        "power zoom lens",
        "camera",
        "power",
        "vlog",
        "power zoom lenses",
        "love",
        "time",
        "things"
    ],
    "transcript_entity_values": [
        "500",
        "50 mm",
        "RODE",
        "10-18",
        "one",
        "Justine",
        "6500",
        "Sony",
        "iPhone",
        "16",
        "105",
        "the past couple of years",
        "0.2 miles",
        "the a7S II",
        "16-50",
        "Skillshare",
        "16-70",
        "18-105",
        "18",
        "0.99",
        "night",
        "over 17,000",
        "two months",
        "Far Cry",
        "Austria",
        "today",
        "two",
        "10",
        "Nick",
        "Android",
        "Janet Jones",
        "first",
        "the minute",
        "16mm",
        "First"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "TIME",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "ORDINAL"
    ],
    "vector": [
        0.011659595184028149,
        -0.06616514921188354,
        -0.06663470715284348,
        -0.13283327221870422,
        0.041185956448316574,
        0.027115287259221077,
        0.038745589554309845,
        0.03335462883114815,
        -0.015672504901885986,
        0.1028689295053482,
        0.028702450916171074,
        -0.02104320377111435,
        -0.02844267524778843,
        0.037521880120038986,
        0.0018352424958720803,
        0.0240870863199234,
        0.016138700768351555,
        -0.021110786125063896,
        -0.01702769473195076,
        0.06510645151138306,
        0.01091768965125084,
        -0.05793578177690506,
        0.04866420477628708,
        -0.004621917847543955,
        -0.013294522650539875,
        0.06398143619298935,
        -0.008851933293044567,
        0.03358614444732666,
        -0.06492669880390167,
        -0.06565508246421814,
        -0.0263050589710474,
        0.006565080489963293,
        0.09899456799030304,
        0.018913935869932175,
        0.019537337124347687,
        -0.06303296983242035,
        0.04265040159225464,
        -0.020122643560171127,
        -0.04644159972667694,
        -0.007230391725897789,
        -0.003993307705968618,
        -0.026657747104763985,
        0.00802317913621664,
        -0.06682398915290833,
        -0.060570526868104935,
        -0.0666118711233139,
        -0.0029332514386624098,
        -0.030129551887512207,
        0.06106921657919884,
        0.06735876202583313,
        -0.07638709247112274,
        -0.029016410931944847,
        0.058480266481637955,
        0.006441505625844002,
        -0.11957976967096329,
        0.02383572794497013,
        -0.08412814885377884,
        0.0022755549289286137,
        0.041679318994283676,
        -0.09875389188528061,
        0.02004200406372547,
        -0.012000768445432186,
        0.001865725265815854,
        0.043462444096803665,
        -0.07252529263496399,
        -0.08502033352851868,
        0.044194966554641724,
        0.04074298217892647,
        0.02841843292117119,
        0.022778870537877083,
        -0.14869816601276398,
        0.07951543480157852,
        -0.04808814451098442,
        0.002002199413254857,
        -0.009400879964232445,
        0.04664856195449829,
        0.035011135041713715,
        -0.05828215181827545,
        0.002588845556601882,
        0.005013249348849058,
        0.0535922534763813,
        -0.0065097627229988575,
        -0.08317207545042038,
        0.013730285689234734,
        -0.01800145022571087,
        -0.005922770593315363,
        0.0028412421233952045,
        0.03546922281384468,
        -0.014646693132817745,
        -0.07329636812210083,
        -0.09000211209058762,
        -0.02581110969185829,
        -0.016116242855787277,
        -0.013419121503829956,
        0.0008889800519682467,
        -0.020976925268769264,
        -0.0544750802218914,
        -0.0372762531042099,
        -0.018908338621258736,
        0.058593012392520905,
        0.0327141247689724,
        -0.0756666511297226,
        0.01570676453411579,
        -0.03960023075342178,
        -0.007500139996409416,
        -0.09698383510112762,
        -0.042189013212919235,
        0.03934456780552864,
        0.011324035935103893,
        -0.003164231311529875,
        -0.02411055378615856,
        0.07892337441444397,
        -0.05643467232584953,
        -0.03823951259255409,
        0.046613480895757675,
        0.14965374767780304,
        -0.03879644349217415,
        0.03420616313815117,
        -0.012690960429608822,
        0.008845641277730465,
        0.014255168847739697,
        -0.08754792809486389,
        -0.01903277263045311,
        0.04368559271097183,
        0.048295825719833374,
        0.003668318735435605,
        -0.02451234869658947,
        1.3048482471122675e-32,
        0.009687798097729683,
        0.09944670647382736,
        0.008534331806004047,
        0.07773745805025101,
        0.009801395237445831,
        0.04389309510588646,
        -0.024901963770389557,
        0.09011869877576828,
        -0.055702921003103256,
        0.021297156810760498,
        -0.01738782413303852,
        0.023957107216119766,
        -0.017850233241915703,
        0.0526043176651001,
        0.03265159949660301,
        -0.02375979535281658,
        -0.022738102823495865,
        -0.029395172372460365,
        -0.0547536164522171,
        0.00692386832088232,
        0.011568130925297737,
        -0.04142649099230766,
        0.036924101412296295,
        0.08771771192550659,
        0.11008382588624954,
        0.09365235269069672,
        0.07352214306592941,
        -0.0116714583709836,
        0.06221809610724449,
        -0.004244174808263779,
        -0.012906008400022984,
        -0.06100651994347572,
        -0.011743463575839996,
        -0.08266628533601761,
        0.016025735065340996,
        0.012860512360930443,
        -0.05982934311032295,
        -0.007377803325653076,
        -0.04952710494399071,
        -0.03505929931998253,
        -0.031902801245450974,
        0.011490285396575928,
        -0.07835325598716736,
        -0.09118751436471939,
        0.06647706776857376,
        0.03711544722318649,
        0.0009841080754995346,
        0.11077773571014404,
        -0.05812544748187065,
        0.029928700998425484,
        0.007555087562650442,
        -0.012853138148784637,
        -0.06386049836874008,
        -0.016784725710749626,
        -0.026841478422284126,
        -0.05766289681196213,
        -0.0044880942441523075,
        0.041140664368867874,
        0.028952261433005333,
        0.049510758370161057,
        0.029618876054883003,
        -0.04229703173041344,
        -0.01948072761297226,
        -0.023330874741077423,
        -0.06658840924501419,
        0.09712545573711395,
        0.0787397250533104,
        -0.04718451201915741,
        0.04374559968709946,
        0.02808419056236744,
        -0.004599789157509804,
        -0.02107003703713417,
        0.04606209695339203,
        0.006811859086155891,
        0.05727427825331688,
        0.11031822860240936,
        -0.09080851078033447,
        -0.028980396687984467,
        -0.001086247037164867,
        0.02724716067314148,
        -0.10442724078893661,
        0.05656910687685013,
        -0.03197237849235535,
        0.09819479286670685,
        -0.029079411178827286,
        -0.08746834844350815,
        0.015699639916419983,
        -0.002567316172644496,
        -0.040352653712034225,
        0.03429548814892769,
        -0.019955674186348915,
        0.111935093998909,
        -0.044891659170389175,
        -0.038846343755722046,
        -0.027828043326735497,
        -1.2247602741544096e-32,
        0.004501724150031805,
        0.08535249531269073,
        0.01946021057665348,
        -0.03673246502876282,
        0.053702738136053085,
        -0.03831810504198074,
        0.05789000913500786,
        0.05068184435367584,
        0.04161373898386955,
        -0.10232031345367432,
        0.03900237753987312,
        -0.10310807824134827,
        -0.11556746810674667,
        0.040922705084085464,
        -0.04904055967926979,
        0.00447354419156909,
        -0.04216157644987106,
        -0.05682220682501793,
        0.041008111089468,
        -0.0371582992374897,
        0.08501269668340683,
        0.13655757904052734,
        0.06920630484819412,
        0.02525448612868786,
        0.028060635551810265,
        -0.013812810182571411,
        0.04516907036304474,
        0.06077875941991806,
        0.040280379354953766,
        0.018282756209373474,
        0.01808306574821472,
        -0.06959554553031921,
        -0.029697300866246223,
        -0.03528261557221413,
        0.06396348029375076,
        0.060297030955553055,
        0.0454726405441761,
        0.06142546236515045,
        0.0019799387082457542,
        -0.05798361822962761,
        0.01392326783388853,
        -0.0041090757586061954,
        -0.023216597735881805,
        -0.05131708085536957,
        -0.013263636268675327,
        -0.12083301693201065,
        -0.06015095114707947,
        0.03964950889348984,
        0.0014348484110087156,
        -0.009297489188611507,
        -0.09601952135562897,
        -0.06716585904359818,
        0.012720450758934021,
        0.002607823582366109,
        -0.020111555233597755,
        -0.0009979273891076446,
        -0.06291479617357254,
        0.00711278198286891,
        0.03877640888094902,
        -0.009614755399525166,
        0.013645379804074764,
        -0.032807886600494385,
        -0.04849928617477417,
        -0.06277094781398773,
        -0.010224592871963978,
        -0.09540215134620667,
        0.09313550591468811,
        0.018802333623170853,
        -0.02046685852110386,
        -0.00497873080894351,
        -0.028000125661492348,
        0.013227890245616436,
        0.07544879615306854,
        0.021564967930316925,
        0.06911303102970123,
        0.008895509876310825,
        -0.08268660306930542,
        -0.03473842144012451,
        0.0863705426454544,
        -0.051383886486291885,
        -0.06455974280834198,
        -0.053118228912353516,
        0.01671985723078251,
        0.08047430962324142,
        0.08516690880060196,
        0.10958007723093033,
        0.09775865823030472,
        -0.035405442118644714,
        -0.004330523777753115,
        0.030420072376728058,
        -0.001469561830163002,
        0.04479629173874855,
        0.0605185329914093,
        0.11991699784994125,
        -0.07889620214700699,
        -6.238979466388628e-08,
        -0.01204408798366785,
        0.00030775979394093156,
        -0.030194176360964775,
        0.008593079634010792,
        0.030567588284611702,
        -0.04483099281787872,
        -0.011003297753632069,
        0.03316044434905052,
        0.04857847839593887,
        -0.06150083243846893,
        0.06312686204910278,
        -0.015765242278575897,
        0.0026542649138718843,
        0.09472394734621048,
        0.016655759885907173,
        -0.015286631882190704,
        -0.07204729318618774,
        0.048918113112449646,
        -0.03393496200442314,
        -0.042606171220541,
        -0.030125180259346962,
        0.0388101302087307,
        -0.00046500281314365566,
        -0.0012232140870764852,
        0.04707998037338257,
        -0.022430595010519028,
        0.004633627366274595,
        -0.04655326157808304,
        0.013779875822365284,
        -0.00038983518606983125,
        -0.033911142498254776,
        0.04128143563866615,
        0.007149445824325085,
        -0.008376882411539555,
        -0.06338387727737427,
        -0.03482203930616379,
        -0.04971282556653023,
        -0.017168721184134483,
        0.015722090378403664,
        -0.023069366812705994,
        0.004231534898281097,
        -0.11161452531814575,
        -0.014021161012351513,
        -0.03552382066845894,
        0.02702145092189312,
        -0.054170843213796616,
        0.03345184400677681,
        -0.08379344642162323,
        -0.040921058505773544,
        -0.030279619619250298,
        -0.057051077485084534,
        0.05807929113507271,
        0.05188697949051857,
        0.00395179120823741,
        0.07021529227495193,
        -0.024623392149806023,
        0.0742122232913971,
        0.030865762382745743,
        0.039076466113328934,
        -0.012675261124968529,
        0.027426015585660934,
        0.011794636957347393,
        -0.05120314657688141,
        0.023896725848317146
    ]
}