{
    "id": "zBT5aXoJghY",
    "title": "The Most Common EV Charging Misconception",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-06-28T00:16:01Z",
    "video_url": "https://www.youtube.com/watch?v=zBT5aXoJghY",
    "category": "Science & Technology",
    "tags": [
        "EV",
        "electric vehicle",
        "charging infrastructure",
        "chevy bolt",
        "chevy volt",
        "nissan leaf",
        "tesla",
        "tesla model 3",
        "tesla model s",
        "tesla model x",
        "electric car"
    ],
    "views": 197955,
    "likes": 9196,
    "comments_count": 2014,
    "description": "We need to talk about private home charging more than we do.  99% of our charging infrastructure already exists, and this is something that absolutely needs to be communicated and not enough people are doing.  Here is my attempt.  In short, no matter if it's a Chevy Volt, Bolt EV, Nissan Leaf, or any of Tesla's cars, you will most likely be charging it at home.  It's the cheapest and easiest way to do it--creating your own charging infrastructure.  This is the video from EE:   Some of my other EV videos:  Chevy Bolt EV Summer Range Test:   Bolt EV Winter range test (Chicago)   My experience installing the charging station in a condo building:   The Wind Powered Car:   You can support this channel on Patreon!  Patrons of the channel are the awesome people who keep these videos coming.  If you'd like to support the channel yourself, please check out my Patreon page.  Thanks for your consideration!",
    "description_links": [
        "https://www.youtube.com/watch?v=wLrvGtw8jAQ",
        "https://youtu.be/kO6yPUtvTnM",
        "https://youtu.be/UogqTenNrks",
        "https://youtu.be/QQqhoM3fDrQ",
        "https://youtu.be/7QLLYauN7sY",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "I just watched the most recent video by Jason of Engineering Explained about electric vehicles and the future of transportation. Now, I myself strongly believe that EVs are the future of transportation, and Jasons video was great and very thorough. But when discussing their use Jason made an oversight that so many people make that I feel we need to discuss it now. In the video, Jason brought up that if you live in an urban setting, with shorter travel distances and where the charging infrastructure is there, then an EV makes sense, but if you live in a rural setting, where the travel distances are longer and the infrastructure isnt necessarily there, then they dont make as much sense. Now I take issue with the rural point because my mom and dad, who live in a decidedly rural setting are living happily with their Bolt EV, but the more broad issue is one of infrastructure. Saying that theres more infrastructure in the city than in rural areas is, while technically true, kind of irrelevant. Why? Well, because most people with an EV build their own charging infrastructure! And they can do so because 99% of that infrastructure is already in place. The generation stations are electric vehicle infrastructure. These power lines are infrastructure. This substation is infrastructure. This transformer is infrastructure. These meters are infrastructure. This distribution panel is infrastructure. All thats missing to turn all of this into an electric car charging station is an EVSE, a new circuit breaker, and a run of wire to wherever your car is. I have seen time and time again from the people who doubt the feasibility of electric vehicles that the cost of creating charging infrastructure for them will be enormous. They see the thousands of fueling stations for petroleum cars and imagine that an EV will have to be refueled in a similar way. In their head, they see a need to convert all of these fueling stations into charging stations, but that simply isnt true. An EV can charge overnight every day when you have an EVSE installed where you live. Every morning you wake up to a fully charged vehicle, ready to take on your daily needs. A charging station like this Clipper Creek HCS-40 will add about 200 miles of range to a typical EV with 8 hours of charging. So even if you drive 200 miles every day, which would be putting more than 70,000 miles on your car annually, every morning your home charging station will have topped off your car. And if you have 200 amp service from your utility, then the charging station is only 16% of your homes electrical capacity. Because you already have electrical service from your utility, the cost of adding an EVSE can be very low. The chargers themselves are typically around $400, and if your circuit breaker panel is near your garage or parking location, you may very well spend less than $500 having an electrician install it for you. So essentially, depending on your situation, you can build a fueling station at home for less than $1,000 all in. And sometimes there are tax incentives for this process. Of course, there are caveats. One of the most difficult things to figure out is how to add charging stations to homes such as apartment buildings, or urban areas with on-street parking only. But these are tiny investments compared to building a fueling station. I myself live in a multi-family home - a condo building with more than 50 units. I took the initiative to jump through the hoops, and now theres a charging station in my spot. I made a whole video on this experience if youre interested. Thanks to this charging station and the station where my parents live, their Bolt EV has travelled nearly 10,000 miles now and has only ever been charged with this EVSE, or that EVSE. It has never visited a public charging station because I have built my own infrastructure, and so have my parents. This may sound harsh, but what will likely happen is that gas stations as we know them today will largely disappear. If level 2 charging equipment is available where you live, you simply will never visit a fueling station. Its just something you dont have to do anymore. There is no need to replicate the fueling experience of a gasoline or diesel powered car for electric vehicles. This is very hard to contextualize, and I dont blame anyone who cant right now, but with an EV you simply plug it in and walk away. It never goes to a gas station because you have your own gas station in your parking spot. I fear that as DC fast charging become feasible, people might imagine these charging stations as a fueling station replacement. While this might be a workable solution to the barriers to a home charging station that some people face, I think it makes far more sense to eliminate those barriers than to rely on public fast charging. If you only have on-street parking, then perhaps the utility and local government should get involved to help people like yourself install an EVSE near the road. For apartment buildings, management might consider adding a bank of chargers and allow access to them for a fee. Or better yet, workplaces can start to install level 2 chargers for their associates. If charging is limited to those who cannot charge at home, then their 8 hour day at work would get them the same 200 miles that an overnight charge can for everyone else. Now I get it, these solutions require new ways of thinking and adjustments to behavior. If gas stations simply turn into banks of DC fast charging stations, then no real change in behavior is required. Just visit the station when needed. But it will take far less effort to simply add basic level 2 charging stations at home or at work. It will cost a small fraction of installing big honking 350 kW DC fast chargers everywhere--particularly because these stations will almost certainly require the utility to upgrade the service wherever theyre installed. Where DC fast chargers will be needed is along interstate corridors to enable long distance travel. Thats what Tesla Superchargers do, and thats what the Electrify America initiative is going to do. We do need fast charging infrastructure, but its a fundamental mistake to think that this infrastructure needs to replace the fueling infrastructure we use day-to-day. Home charging or work charging will be what replaces your neighborhood gas station. DC Fast Charging will replace the truck stops along the highway. And smart truck stop owners might consider installing DC fast chargers, if their long term future is in their sights. To conclude, EV charging infrastructure should not be thought about in the terms of the fueling infrastructure we use today. In fact, it cannot be thought in this way. When you have an EVSE at home, longer range cars like the Bolt EV or Teslas or any number of future offerings wont need to rely on public charging at all. Thats where the infrastructure challenge really is--homeowners with garages face almost no challenge to installing an EVSE. But apartment dwellers, renters, and urban homeowners with on-street parking do face a barrier. I think its a wiser investment to eliminate their barriers and get them their own level 2 charging stations than to build up a DC fast charging infrastructure for their daily needs. Plus, its a lot more convenient to just plug in at home and walk away than to wait at the DC fast charger. My fairy-tale solution to this problem is for local utility companies to form their own EV charging operations. There might be regulations preventing this, but what I see as a great solution is a system where the utility can add the electric consumption from any charger to an individuals electric bill. Possibly through an RFID tag on the car and a reader on the charge cord, the charger will know what car its plugged into, and can directly bill the owner for their electricity use, regardless of where they plugged in. I think this would be a great solution for multi-residential buildings with unassigned parking, or public on-street charging. To finance the cost of the installation, the utility could perhaps charge $5 per connection until the units upfront cost has been recouped, after which point the energy is sold at standard rates. In any case, what needs to be understood is that an EV is charged opportunistically, pretty much whenever its parked. Going to a place to refuel is just not how they work. Though it can be hard to keep this in mind, its absolutely essential to understand the type of infrastructure we need. When you understand that, youll start to get the sense that this isnt as hard as it seems. Thanks for watching.",
    "transcript_keywords": [
        "Engineering Explained",
        "charging",
        "infrastructure",
        "charging station",
        "station",
        "charging infrastructure",
        "fast charging",
        "stations",
        "EVSE",
        "fast charging infrastructure",
        "fast",
        "home charging station",
        "Jason of Engineering",
        "home",
        "Jason",
        "fueling",
        "fueling station",
        "home charging",
        "live",
        "Engineering"
    ],
    "transcript_entity_values": [
        "Bolt EV",
        "less than $500",
        "200 miles",
        "200",
        "kW DC",
        "about 200 miles",
        "the Bolt EV",
        "99%",
        "Electrify America",
        "8 hour",
        "daily",
        "less than $1,000",
        "only 16%",
        "8 hours",
        "350",
        "Jason",
        "EVSE",
        "this Clipper Creek",
        "more than 50",
        "5",
        "Tesla",
        "2",
        "today",
        "EV",
        "around $400",
        "thousands",
        "Every morning",
        "nearly 10,000 miles",
        "Jasons",
        "One",
        "DC",
        "DC Fast Charging",
        "Jason of Engineering",
        "more than 70,000 miles",
        "Teslas",
        "RFID",
        "annually"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "LOC",
        "TIME",
        "DATE",
        "MONEY",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "FAC",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.06265131384134293,
        0.03937608376145363,
        -0.013817901723086834,
        0.020062630996108055,
        0.056131478399038315,
        0.0023994632065296173,
        -0.015691107138991356,
        0.0486932136118412,
        -0.01703646592795849,
        -0.028445007279515266,
        0.025975301861763,
        -0.006878795102238655,
        0.041225582361221313,
        0.029370363801717758,
        0.018039658665657043,
        -0.04455262050032616,
        0.04206566512584686,
        -0.03559410572052002,
        0.028035668656229973,
        0.05309383571147919,
        -0.02102835103869438,
        -0.012385847046971321,
        0.04298513010144234,
        -0.043351173400878906,
        0.1033967137336731,
        0.03187796100974083,
        0.01151074469089508,
        0.05461127310991287,
        -0.05997602641582489,
        -0.03492191806435585,
        0.03507518768310547,
        -0.05759177356958389,
        -0.017235860228538513,
        -0.03665574640035629,
        -0.014866434037685394,
        0.020154699683189392,
        0.008892165496945381,
        -0.022318527102470398,
        0.0015312278410419822,
        -0.01108973566442728,
        0.054406192153692245,
        -0.09151653200387955,
        0.015232664532959461,
        -0.060405392199754715,
        -0.007214293349534273,
        0.01837819069623947,
        0.07985451817512512,
        -0.025315167382359505,
        -0.01563831977546215,
        -0.07926347851753235,
        0.019953660666942596,
        -0.06147624924778938,
        0.044176988303661346,
        -0.015314392745494843,
        -0.14707835018634796,
        -0.02401193603873253,
        0.02016058750450611,
        -0.02042483724653721,
        0.06821520626544952,
        -0.01867355965077877,
        0.034193240106105804,
        -0.023207655176520348,
        -0.03964685648679733,
        0.04413396492600441,
        -0.060334522277116776,
        -0.00653174240142107,
        0.06238128989934921,
        0.1340225785970688,
        -0.029100770130753517,
        -0.05412223935127258,
        0.04222254827618599,
        0.014132457785308361,
        -0.05284935235977173,
        0.05690963938832283,
        0.002347933128476143,
        0.0009571487316861749,
        0.08159354329109192,
        -0.021579237654805183,
        -0.045209795236587524,
        0.011751862242817879,
        0.02532818168401718,
        0.016766276210546494,
        -0.08805136382579803,
        0.009770416654646397,
        0.012362700887024403,
        0.05622897297143936,
        -0.023698564618825912,
        -0.006835829466581345,
        -0.06603149324655533,
        0.07075250148773193,
        0.014707864262163639,
        0.03900860622525215,
        0.017176147550344467,
        0.04262324795126915,
        0.03548300266265869,
        0.143181711435318,
        -0.008008670061826706,
        -0.10911551862955093,
        0.003364205826073885,
        -0.0009255753247998655,
        0.04555635154247284,
        0.03703279793262482,
        0.011260168626904488,
        -0.02908412367105484,
        -0.048144057393074036,
        -0.0269276462495327,
        -0.01212986558675766,
        0.004389384761452675,
        0.040626730769872665,
        -0.028046712279319763,
        0.053614966571331024,
        -0.05275507643818855,
        -0.08323469012975693,
        -0.027505693957209587,
        -0.07801439613103867,
        0.03481738641858101,
        -0.020211247727274895,
        0.01668265275657177,
        0.08126640319824219,
        0.04387938976287842,
        0.00634225457906723,
        -0.012271424755454063,
        0.012609022669494152,
        -0.01676492765545845,
        0.11628355085849762,
        0.025827055796980858,
        0.03497294336557388,
        2.2335603057462825e-33,
        -0.10959051549434662,
        0.03230423107743263,
        0.0023041795939207077,
        0.013572401367127895,
        0.009110386483371258,
        0.06614464521408081,
        -0.038646094501018524,
        0.11533266305923462,
        0.04536512494087219,
        0.008957017213106155,
        -0.014337425120174885,
        0.02085709758102894,
        0.049896229058504105,
        -0.01663573458790779,
        0.012377047911286354,
        -0.01881990022957325,
        -0.10561315715312958,
        -0.08632997423410416,
        0.03529336303472519,
        -6.367419700836763e-05,
        0.029270317405462265,
        -0.021998338401317596,
        0.0572940893471241,
        -0.011264708824455738,
        0.0204108078032732,
        -0.0635860413312912,
        0.09505056589841843,
        -0.05174964666366577,
        0.04439415782690048,
        0.03993861377239227,
        -0.0446891114115715,
        0.09246215224266052,
        0.01108402106910944,
        0.03751228377223015,
        0.004902753978967667,
        0.06660114228725433,
        0.0009103678166866302,
        -0.06664787977933884,
        -0.048462770879268646,
        -0.04196150600910187,
        0.06296402215957642,
        -0.026131337508559227,
        -0.10084076225757599,
        0.0014987740432843566,
        0.040391705930233,
        0.012998990714550018,
        0.10560484230518341,
        -0.07179567962884903,
        -0.03235205262899399,
        0.00559462234377861,
        -0.05348549038171768,
        -0.005359604023396969,
        -0.03962838649749756,
        0.012954684905707836,
        0.03753018379211426,
        0.05647484213113785,
        -0.04415273666381836,
        -0.01633896492421627,
        0.02739405632019043,
        -0.02596612088382244,
        -0.05869372934103012,
        0.04917248338460922,
        0.0024252545554190874,
        -0.07939531654119492,
        -0.04155391454696655,
        -0.020232228562235832,
        -0.053820010274648666,
        -0.003840619930997491,
        -0.04784945398569107,
        0.01682778261601925,
        0.09966088831424713,
        -0.0696810856461525,
        -0.009717753157019615,
        -0.038152918219566345,
        0.027815869078040123,
        0.08017563819885254,
        -0.04764262214303017,
        0.11073432117700577,
        0.02632526494562626,
        -0.03157559409737587,
        -0.05083540081977844,
        -0.07480007410049438,
        0.06575547903776169,
        0.018730727955698967,
        0.15916959941387177,
        -0.03629174083471298,
        -0.04063839465379715,
        0.034325603395700455,
        -0.007308811414986849,
        0.02699349634349346,
        0.07475768774747849,
        0.037450555711984634,
        -0.019862407818436623,
        -0.007647446356713772,
        0.03053048811852932,
        -2.999063716507857e-33,
        -0.027823304757475853,
        0.08345349133014679,
        -0.012081102468073368,
        0.0038301891181617975,
        0.0516979955136776,
        -0.021045859903097153,
        -0.07595552504062653,
        -0.023278845474123955,
        0.022771205753087997,
        0.03879551216959953,
        -0.09625601023435593,
        0.03009961172938347,
        0.008052692748606205,
        -0.006806127727031708,
        0.03501847758889198,
        -0.06822042912244797,
        0.0018680131761357188,
        -0.05904219299554825,
        -0.002977816853672266,
        0.0045702806673944,
        -0.009982469491660595,
        0.09570543467998505,
        -0.005348553881049156,
        0.010339966043829918,
        0.10266242921352386,
        -0.0364939384162426,
        -0.00944795273244381,
        0.0032486962154507637,
        0.060774099081754684,
        0.028114117681980133,
        -0.06577775627374649,
        0.008022559806704521,
        0.03143805265426636,
        -0.013537449762225151,
        -0.015379698947072029,
        0.0351240448653698,
        0.04642018675804138,
        -0.02752581052482128,
        -0.010574855841696262,
        -0.042660728096961975,
        0.059251222759485245,
        -0.060713376849889755,
        -0.0452311635017395,
        -0.09637907892465591,
        -0.01681210845708847,
        -0.03153389319777489,
        -0.07824120670557022,
        0.04339133948087692,
        0.028893528506159782,
        0.08209526538848877,
        0.025116346776485443,
        0.0014578616246581078,
        -0.059258632361888885,
        0.04876864328980446,
        -0.010927299968898296,
        -0.08334633708000183,
        0.12686146795749664,
        0.07360067963600159,
        -0.08298423886299133,
        -0.016927681863307953,
        0.030456960201263428,
        0.042989909648895264,
        0.036882031708955765,
        -0.0041785649955272675,
        -0.02868867665529251,
        -0.13968884944915771,
        0.018629705533385277,
        -0.011086596176028252,
        -0.0024133515544235706,
        -0.0031676965299993753,
        -0.06467479467391968,
        -0.03149912506341934,
        -0.045067328959703445,
        -0.13197319209575653,
        -0.09128766506910324,
        0.03247414529323578,
        0.07337953895330429,
        -0.051334530115127563,
        0.03444131463766098,
        -0.1292792111635208,
        0.043516989797353745,
        0.059059545397758484,
        0.02797912433743477,
        -0.03379225730895996,
        0.019312331452965736,
        0.013182337395846844,
        -0.0198834091424942,
        -0.019725823774933815,
        0.002612705808132887,
        0.09970332682132721,
        -0.003862016135826707,
        -0.019873250275850296,
        -0.03393179178237915,
        0.07793466001749039,
        -0.03605170175433159,
        -5.5823125677534335e-08,
        -0.008833400905132294,
        0.09639458358287811,
        0.0006986150983721018,
        -0.008902939036488533,
        0.010008555836975574,
        -0.029706832021474838,
        -0.010523375123739243,
        -0.0015661093639209867,
        -0.0172980185598135,
        0.035870909690856934,
        0.03457089513540268,
        -0.014818011783063412,
        0.06665851175785065,
        0.034988731145858765,
        -0.016029249876737595,
        0.036130066961050034,
        -0.01564115472137928,
        0.021962786093354225,
        -0.08102022111415863,
        0.04150448739528656,
        0.026263732463121414,
        0.00901330728083849,
        -0.06322462856769562,
        0.09799148887395859,
        0.07467623054981232,
        -0.047017138451337814,
        -0.0016933297738432884,
        -0.00583198806270957,
        0.10446112602949142,
        -0.11381401121616364,
        -0.10949844121932983,
        -0.0014519629767164588,
        0.034845273941755295,
        -0.021469654515385628,
        -0.052196912467479706,
        -0.02881794236600399,
        -0.026196638122200966,
        -0.04836146533489227,
        -0.0016025402583181858,
        -0.0048502301797270775,
        0.02955756150186062,
        -0.12487925589084625,
        -0.014648900367319584,
        -0.027623716741800308,
        -0.09188941866159439,
        0.01519464049488306,
        -0.06167047098278999,
        -0.03946435824036598,
        -0.055320702493190765,
        0.09331828355789185,
        -0.05700517073273659,
        -0.08922501653432846,
        0.029199084267020226,
        0.028312742710113525,
        0.06789813190698624,
        0.06274183094501495,
        -0.030786165967583656,
        -0.016966309398412704,
        0.008433112874627113,
        0.00300662312656641,
        0.06262431293725967,
        0.015122310258448124,
        -0.026717249304056168,
        0.11226222664117813
    ]
}