{
    "id": "zbUcgMT8VKQ",
    "title": "GoPro Max review: the most accessible 360 camera",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-10-22T13:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=zbUcgMT8VKQ",
    "category": "Science & Technology",
    "tags": [
        "gopro max",
        "gopro",
        "gopro hero max",
        "gopro hero",
        "gopro max review",
        "gopro review",
        "review",
        "max",
        "gopro max camera",
        "gopro fusion",
        "gopro hero 8",
        "hero",
        "camera",
        "cam",
        "session",
        "launch",
        "release date",
        "go pro",
        "gopro 8",
        "features",
        "new gopro",
        "new camera",
        "new gopro camera",
        "rumors",
        "leaks",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 1267728,
    "likes": 15194,
    "comments_count": 607,
    "description": "The GoPro Max is a $499 durable 360 camera with dual 180-degree lenses that shoots both photos and videos. With the Max, GoPro borrowed from Insta360s playbook and made the most accessible 360 camera I have used.  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/32EaqKG",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(mellow piano music) (upbeat music) - This is the GoPro MAX. And it's GoPro's second attempt at a consumer level, 360 camera. (upbeat music) (camera whirring) Last year, Insta360 came out with the One X, and it totally revolutionized the idea of what a 360 camera could be used for. First off, footage shot with the One X was stitched in camera, and then you were able to edit it right on your phone and upload to social platforms almost instantly. Secondly, they market it not as a 360-degree camera but instead a camera that could shoot 360 degrees of possible angles. Now fast forward a year and we have the GoPro Max, which is the successor to the GoPro Fusion that came out in 2017, that was filled with all of the headaches of 360's past. It required two memory cards. You had to stitch the footage on a desktop. But they overhauled all of that with the Max, and they in turn made a really accessible 360 camera, which makes me believe I might continue to actually use this thing. We wag, we wag, we wag, we wag, we wag This is the widest angle GoPro's made This is the wide The GoPro MAX has dual 180-degree lenses that shoot 16.6-megapixel, 360-degree photos, 5.5-megapixel single lens, or GoPro is calling Max SuperView photos, and the super cool 6.2-megapixel panoramic photos called PowerPanos. Video-wise, you have 1440p60 video with a single lens and 5.6K30 spherical video, just like the Insta360. There are mics on all but one side and it shows the same super satisfying rubber buttons and button layout as the Hero8. On the bottom, you have these new stowable mounting prongs, which alas, you no longer need that housing, which I somehow always manage to forget anyways, and it also makes it compatible with all GoPro mounts. The touchscreen on the Max is a bit smaller than the touchscreen on the back of the Hero, but its menu system is identical. The big plus here is if you're vlogging or taking a selfie, you can see yourself much like on the DJI Osmo Action because, well, there's lenses on both sides. The Max is waterproof up to 16 feet. But that proofing is merely for protection at this point. GoPro claims that it's really difficult to stitch underwater footage, but they are promising some sort of waterproof housing in the future. The screen is super responsive, but you can't scroll around your frame in 360 mode since the screen has swiping gestures such as swiping down to reach the main menu. You can however switch between lenses but only while not recording. Once you hit that record button, the screen has no functionality other than just being a viewfinder to the lens that you chose before rolling. The image on the screen will however stay level with the horizon no matter which way you turn the camera. And it does so with almost no noticeable lag. If you lean into that warped, super fisheye look that only a 360 camera could give you, the footage is sick. Skin tones are true to life and it's not afraid to overexpose the highlights of it. I prefer this to the flatter color grade of the One X, especially for users who won't be color correcting. And how even if you are color correcting, I find that the Max and the One X have very little latitude in the coloring process. Now, if you're only gonna be showing these photos on social platforms that you're gonna look at on a phone, who cares, but for a camera that costs $500, I hope it's going a little further than that. (laughs). The Max's 360 video is stabilized in software. It bobs up and down as you'd expect from walking and it can be really jittery, especially at night. The stitching is most noticeable at the top and the bottom of the frame. And since most of GoPro's mounts typically have a wider base than the camera itself, there's almost always a bit of artifact from the mount in the footage. Over-all though, once you export the 360-degree footage, the stitch is pretty clean. The audio, however, is probably the best I've seen on a camera this size. The wind reduction can add a lot of compression, and enough wind can sound like, well this, (wind blowing) Guys, when I say it's windy out, it's like actually very windy out. I am about to blow over. This might make some really good footage as I fly away. But when you're not in 25-mile an hour wind, it actually reduces the sound of wind while prioritizing voices. So while hiking with Alex, I love that the GoPro picked up on the crickets and footsteps, while also keeping our voices at the forefront no matter where the camera was in space. Yeah, and I think it's gonna be a long, long time And then there are those PowerPano photos. I gotta be honest guys, I had a tough time not showing you these photos before this video dropped. I mean first and foremost, they make taking a panoramic photo a lot easier. And you don't have to stand there and slowly and robotically move your phone across the landscape. I was really surprised at how crisp these photos turned out to. Even on a desktop, they still look really cool. The time warp feature in 360 mode, which is when the Max just records the time lapse, is really cool, but it's a total battery killer. I saw my battery drop 15% off a fresh charge while shooting this time warp. And I let it record for all of 10 minutes. I think it would help if the screen would go off a bit sooner while shooting these to save some battery. Otherwise, the battery performance is on par with the Hero8. Even though it is a different battery. So yes, you will need to buy extra spares if you plan on heavy use. I was able to get through a full day of heavy use using two of these batteries. 360 cameras are only accessible though if you can do something with the footage. So the software has to be sound, and GoPro's app makes it really easy to edit this footage. Max uses the same GoPro app as the Heroes. Now, I'm no stranger to keyframes, but I think even a casual non-video director from the verge.com could edit the Max's 360 footage. And I actually enjoyed editing it on the app. GoPro also has a 360 desktop app called GoPro Player, which mirrors the mobile app experience with added codec options at export. You have H.264, ProRes, HUVC, and as far as 360 editing goes, I was blown away by its ease. Okay so there's this whole other mode on the Max called Hero mode. And it's basically just when the camera's using one lens as opposed to two. It has more mic controls and it even boasts GoPro's most stable video called Max HyperSmooth. And it also has the widest field of view called Max SuperView. But I gotta be honest, while it does sound good and the footage is stable, the fact that it maxes out at 1440p60 is noticeable. Especially in how much smoothing is being done when the subject is close to the camera. I also noticed the camera struggled to keep the footage level with the horizon, choosing to instead focus on keeping the footage stable. So when climbing down this trail, which to be fair, is a slanted surface, the horizon kept tilting further and further from level to almost a dizzying point. GoPro has become a household name. I mean they're specced out, durable, tiny, portable beasts of cameras. And the Max is no different. And while the Max has great features such as PowerPano, it also has great hardware and a really good touch screen. But for me, it came down to the ease of use of the app that made me wanna keep using this thing. 360 footage used to mean high-end equipment and tons of headaches and post, and that always pushed me away from using it. But when you put all of that into the form factor of a GoPro, a workflow I've been using for years, it's way more approachable. Now, is all of that enough to make this thing more than a novelty camera that will ultimately end up in my forgotten type bed in my basement? Time will truly tell. But it is the most fun and user-friendly 360 camera I have used today. And I'm excited to see this thing as specced out. (coughing) 4K Hero mode? (coughing) Please? All right, so for 499, you can pre-order a Max today. They start shipping on October 24th and will be on shelves October 27th. The 360 space is getting kinda nuts and the One X versus the Max deserves its whole own videos, so I guess I'll see you guys next time.",
    "transcript_keywords": [
        "MAX",
        "GoPro",
        "camera",
        "GoPro MAX",
        "footage",
        "called Max",
        "Max called Hero",
        "photos",
        "time",
        "Max SuperView",
        "screen",
        "video called Max",
        "app",
        "wag",
        "GoPro app",
        "Max SuperView photos",
        "video",
        "mode",
        "Max called",
        "battery"
    ],
    "transcript_entity_values": [
        "Max SuperView",
        "Hero",
        "PowerPano",
        "one",
        "The GoPro MAX",
        "GoPro",
        "15%",
        "October 24th",
        "GoPro Player",
        "a full day",
        "16.6-megapixel",
        "Time",
        "today",
        "PowerPanos",
        "360 degrees",
        "2017",
        "499",
        "the GoPro Fusion",
        "GoPro",
        "years",
        "K Hero",
        "a year",
        "16 feet",
        "GoPro",
        "Secondly",
        "25-mile",
        "Max HyperSmooth",
        "two",
        "5.6K30",
        "Last year",
        "One",
        "GoPro Max",
        "4",
        "ProRes",
        "5.5-megapixel",
        "Alex",
        "the DJI Osmo Action",
        "second",
        "180-degree",
        "1440p60",
        "10 minutes",
        "1440p60",
        "first",
        "Max",
        "up to",
        "6.2-megapixel",
        "500",
        "October 27th",
        "as far as 360",
        "First"
    ],
    "transcript_entity_types": [
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERCENT",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORDINAL"
    ],
    "vector": [
        -0.023329850286245346,
        -0.04491816461086273,
        -0.0684085562825203,
        -0.13834689557552338,
        0.1302211433649063,
        0.01994609273970127,
        -0.028933480381965637,
        0.10832558572292328,
        0.02889515832066536,
        0.06182025372982025,
        0.040636856108903885,
        0.05690063536167145,
        0.020966557785868645,
        0.05082302540540695,
        0.05648016929626465,
        -0.05562424659729004,
        0.10403774678707123,
        -0.051994044333696365,
        -0.0676036924123764,
        0.0202214065939188,
        -0.08585093915462494,
        -0.06963316351175308,
        0.043196529150009155,
        0.019963307306170464,
        -0.02954685501754284,
        0.09059832990169525,
        -0.05836331099271774,
        -0.08137750625610352,
        -0.013872286304831505,
        -0.0012722553219646215,
        -0.03486061468720436,
        0.03433255851268768,
        -0.0008352712029591203,
        -0.02964278869330883,
        -0.05112473666667938,
        -0.08609604090452194,
        -0.04104356840252876,
        -0.057642027735710144,
        -0.09195008873939514,
        -0.03588003292679787,
        -0.02185378596186638,
        0.00942558515816927,
        0.010128473863005638,
        -0.001181717379949987,
        0.029249140992760658,
        0.06423450261354446,
        0.015212382189929485,
        -0.09269727021455765,
        0.023046590387821198,
        0.040032800287008286,
        -0.08243437856435776,
        -0.0061649479903280735,
        0.035080090165138245,
        0.022602971643209457,
        -0.058241765946149826,
        -0.007088115904480219,
        -0.04091208428144455,
        -0.02809588797390461,
        0.06290000677108765,
        -0.03535547852516174,
        0.01752890832722187,
        -0.06959723681211472,
        0.006795968860387802,
        0.027862215414643288,
        -0.008934150449931622,
        -0.01092683244496584,
        -0.03206317871809006,
        -0.014679660089313984,
        0.018942011520266533,
        0.004947666544467211,
        -0.08016356080770493,
        0.07121005654335022,
        0.014867994002997875,
        -0.013069753535091877,
        0.005264728330075741,
        0.0017220586305484176,
        0.02002859115600586,
        0.018403954803943634,
        -0.038109876215457916,
        0.0029194485396146774,
        0.12118294090032578,
        -0.03261229023337364,
        -0.06260985881090164,
        -0.020718971267342567,
        0.019398760050535202,
        -0.0013839174062013626,
        -0.03229872137308121,
        0.08316842466592789,
        -0.01889835111796856,
        -0.032928623259067535,
        -0.061760902404785156,
        0.007518192753195763,
        0.004432138986885548,
        -0.061004672199487686,
        -0.04821392148733139,
        -0.018639681860804558,
        -0.05714402720332146,
        -0.09000834077596664,
        -0.010862677358090878,
        -0.002829074626788497,
        0.007092308718711138,
        -0.06020732969045639,
        0.06635329127311707,
        0.0005681960028596222,
        0.046144019812345505,
        -0.05994618311524391,
        -0.001206957153044641,
        0.049637094140052795,
        0.10729717463254929,
        0.04105740413069725,
        -0.031702056527137756,
        0.030417287722229958,
        -0.014538039453327656,
        -0.034981079399585724,
        0.049742236733436584,
        0.018273046240210533,
        -0.016782144084572792,
        0.07053422927856445,
        0.06228838860988617,
        -0.02614271081984043,
        0.10254877805709839,
        -0.07883168011903763,
        -0.0023911979515105486,
        0.017559228464961052,
        0.02553221583366394,
        -0.01682189665734768,
        -0.02366863563656807,
        2.890262714460631e-33,
        0.020649857819080353,
        0.13937509059906006,
        0.041919637471437454,
        -0.011242648586630821,
        -0.021205056458711624,
        -0.02400006167590618,
        0.020518869161605835,
        0.08129929006099701,
        -0.038583796471357346,
        0.009112927131354809,
        0.010703414678573608,
        0.034371864050626755,
        -0.010005105286836624,
        0.0944046601653099,
        0.026457814499735832,
        -0.012438091449439526,
        -0.038132261484861374,
        0.026542335748672485,
        -0.029242582619190216,
        0.04918164014816284,
        0.06437521427869797,
        -0.04729442670941353,
        0.05937863513827324,
        0.028753435239195824,
        0.05698325112462044,
        0.032097507268190384,
        0.05111253634095192,
        -0.0019137982744723558,
        0.045318081974983215,
        -0.014122703112661839,
        -0.05323062464594841,
        -0.013167914934456348,
        -0.004764712881296873,
        -0.00839328020811081,
        0.08420078456401825,
        -0.010090887546539307,
        -0.04396872594952583,
        -0.10397208482027054,
        -0.02912992797791958,
        0.01923016458749771,
        -0.03157741203904152,
        0.08716025203466415,
        -0.097487673163414,
        -0.057498443871736526,
        0.05262313038110733,
        0.04969441518187523,
        0.018091296777129173,
        0.14664973318576813,
        -0.10508421063423157,
        0.0038456041365861893,
        0.0315372571349144,
        0.006958892103284597,
        -0.09706488251686096,
        -0.017246348783373833,
        -0.07542934268712997,
        -0.0021752198226749897,
        -0.018325377255678177,
        -0.0007854769937694073,
        0.025697994977235794,
        -0.014302864670753479,
        0.046517107635736465,
        -0.009015612304210663,
        -0.032003868371248245,
        -0.017458155751228333,
        -0.09013750404119492,
        0.06449664384126663,
        0.03483337536454201,
        0.01832461915910244,
        0.021571753546595573,
        0.08805245161056519,
        -0.01641923561692238,
        0.010915140621364117,
        -0.009724591858685017,
        -0.09943413734436035,
        0.09224636107683182,
        0.021329380571842194,
        -0.09342597424983978,
        -0.016234440729022026,
        0.029041511937975883,
        0.08746194839477539,
        -0.10791029036045074,
        0.06460126489400864,
        -0.016167033463716507,
        0.06358174234628677,
        -0.05944041162729263,
        0.020854581147432327,
        -0.042857177555561066,
        0.00795389711856842,
        -0.078270323574543,
        -0.05320236459374428,
        0.01957724243402481,
        0.010331436060369015,
        0.038549043238162994,
        0.04120273143053055,
        -0.026393087580800056,
        -1.6374950384351325e-33,
        -0.001430736854672432,
        -0.0304862167686224,
        -0.016716724261641502,
        0.017848003655672073,
        0.10357770323753357,
        -0.06434045732021332,
        0.07981298118829727,
        0.0474105030298233,
        0.09735718369483948,
        -0.011309929192066193,
        0.044754508882761,
        -0.06997807323932648,
        -0.0162983238697052,
        0.03191661462187767,
        -0.00949039962142706,
        -0.018770700320601463,
        -0.031368717551231384,
        -0.08949387818574905,
        0.05177002027630806,
        -0.06416775286197662,
        0.07114850729703903,
        0.00525872316211462,
        0.07397633790969849,
        0.027890197932720184,
        0.023043926805257797,
        0.10060489177703857,
        0.05848461389541626,
        0.05525495111942291,
        0.0820220410823822,
        -0.029713304713368416,
        0.003315494628623128,
        -0.03433632478117943,
        -0.007578682154417038,
        -0.05056912079453468,
        0.01680341735482216,
        0.1113729476928711,
        -0.020753951743245125,
        0.0260575283318758,
        -0.021649979054927826,
        -0.026205748319625854,
        -0.014417647384107113,
        0.012248104438185692,
        0.08193084597587585,
        0.01677907258272171,
        0.06256590783596039,
        -0.052170298993587494,
        -0.016550661996006966,
        0.06237930804491043,
        0.05579240620136261,
        0.026464857161045074,
        -0.01173834316432476,
        0.0192499291151762,
        -0.007841994985938072,
        0.020161185413599014,
        -0.021468566730618477,
        -0.07995869964361191,
        -0.07188361138105392,
        -0.022355176508426666,
        -0.008954030461609364,
        -0.0001443922083126381,
        0.023280614987015724,
        0.04800310730934143,
        -0.12734492123126984,
        0.07689790427684784,
        -0.052984826266765594,
        0.024573182687163353,
        0.038133129477500916,
        0.014263303950428963,
        -0.08566819876432419,
        0.06105310469865799,
        0.004863062407821417,
        0.006352136377245188,
        0.06443148106336594,
        -0.013031157664954662,
        -0.005763887893408537,
        -0.005011854227632284,
        -0.01017043273895979,
        -0.007063516415655613,
        0.08191242069005966,
        0.02048588916659355,
        -0.023932917043566704,
        -0.0352385975420475,
        0.07138170301914215,
        0.03991849347949028,
        0.10718290507793427,
        0.03407847881317139,
        0.016002792865037918,
        -0.0019845536444336176,
        -0.03229665011167526,
        0.05732470750808716,
        -0.039327505975961685,
        -0.020475013181567192,
        -0.07395273447036743,
        0.08392848074436188,
        0.04392506927251816,
        -4.465206870918337e-08,
        0.011090248823165894,
        0.05364304408431053,
        -0.06211693584918976,
        -0.013967993669211864,
        0.0001570333115523681,
        -0.08726395666599274,
        0.03615136444568634,
        0.030649853870272636,
        0.0437420979142189,
        -0.03767651692032814,
        -0.014406905509531498,
        -0.05198712646961212,
        -0.03461764007806778,
        0.03474032133817673,
        -0.02833719551563263,
        0.009380006231367588,
        -0.04091285541653633,
        -0.015370596200227737,
        -0.0020835993345826864,
        0.020503781735897064,
        -0.005184098146855831,
        -0.056727319955825806,
        0.007269906345754862,
        -0.13282589614391327,
        -0.030765075236558914,
        0.00351932505145669,
        -0.03693202883005142,
        -0.057622067630290985,
        0.07591817528009415,
        -0.0799347385764122,
        -0.0962100476026535,
        -0.03653900697827339,
        0.01081275288015604,
        -0.0062348004430532455,
        0.02251283824443817,
        -0.09791091084480286,
        -0.03243449330329895,
        -0.014040181413292885,
        0.04264290630817413,
        0.007066515740007162,
        -0.022193003445863724,
        0.011841550469398499,
        -0.0010625673457980156,
        0.009547260589897633,
        -0.011400132440030575,
        0.01575588993728161,
        0.015956055372953415,
        -0.11711516231298447,
        -0.04109667241573334,
        0.012163476087152958,
        -0.06872926652431488,
        0.004264775663614273,
        0.0171346552670002,
        0.030417801812291145,
        0.06908614933490753,
        0.028937358409166336,
        0.06323546916246414,
        -0.04360051825642586,
        -0.06568977236747742,
        0.0744481012225151,
        0.03176675736904144,
        -0.08052121847867966,
        0.011495774611830711,
        0.10874728858470917
    ]
}