{
    "id": "zcchDu7KoYs",
    "title": "You Want This. - HOLY $H!T Threadripper Pro 5995WX",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-09-11T17:02:59Z",
    "video_url": "https://www.youtube.com/watch?v=zcchDu7KoYs",
    "category": "Science & Technology",
    "tags": [
        "Threadripper",
        "cput",
        "cpu",
        "computer",
        "amd",
        "intel",
        "ryzen",
        "zen3",
        "zen 3",
        "threardipper",
        "server cpu",
        "server",
        "workstation",
        "supermicro workstation",
        "supermicro",
        "fastest cpu",
        "worlds fastest cpu",
        "fastest computer"
    ],
    "views": 1840240,
    "likes": 62918,
    "comments_count": 2246,
    "description": "Power through work more efficiently and confidently with the help of Grammarly. Its free, why not?! Go to  to sign up for a FREE account and get 20% off Grammarly Premium!  Check out the CORSAIR VOYAGER - ORIGIN EDITION at   Before the launch of Ryzen 7000, AMD has slipped in one more Zen 3 product launch. Or at least, they are finally letting consumers buy it. The AMD Threadripper Pro 5995WX is a beast of a CPU that likely has Intel quaking in their boots. But with a massive price leap and the death of the non-pro lineup of Threadripper CPUs, has AMD turned to the greedy dark side? Of course they have, theyre a corporation.  Discuss on the forum:   Buy a SuperMicro SuperWorkstation 5014A-TT:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:45 Y tho?  2:23 Benchmarks 5:24 About that price... 8:55 Epyc 7773X 10:16 Socket Support 11:03 Overclocking Support 14:18 Outro",
    "description_links": [
        "https://grammarly.com/LTT",
        "https://bit.ly/3PNcvfr",
        "https://linustechtips.com/topic/1454654-you-want-this-holy-ht-amd-threadripper-pro-5995wx/",
        "https://lmg.gg/yffCh",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Inside this absolute monster of a computer is AMD's Threadripper PRO 5995WX. It packs a redonkulas 64 cores, 128 threads, and a quarter gigabyte of L3 cache. It runs at a whopping 2.7 gigahertz base, and turbos up to 4.5 gigahertz. Just look at it! It uses the same Zen 3 cores as AMD's Ryzen 5000 consumer chips, just four times as many of them, making it absolutely riptastically fast. Hello, new fastest CPU. What the actual hell is this? But what would you pay for the privilege of owning the fastest CPU in the world? AMD figures it's a lot, so much that instead of representing it in dollars, 'cause the number is far too high, we're gonna put it this way. The 5995WX costs 4.6 3090 Ti's, or 13 Xbox series X's, 15 iPhone SE's, or 216 high-quality, insulated, circuit board water bottles from lttstore.com. And the wildest part, they're not totally out to lunch on their pricing. I mean, don't get me wrong, I don't like it, but this CPU came out five months ago, and I'm only getting one now, which means that someone is buying them all. Let's talk about who, and why? And our sponsor. - Origin PC, the CORSAIR VOYAGER ORIGIN EDITION features built-in S-Keys, with Elgato Stream Deck software, and AMD Advantage tech. With the Origin PC edition, you can upgrade and customize the look with your favorite designs. So learn more, at the link below. - The most obvious reason to shell out for a Threadripper PRO 5000 is performance. We compared it to AMD's own EPYC Milan 7763, which also is 64 Zen 3 cores, and representing high end consumer CPUs, we included Intel's Core i9 12900K. And if it doesn't dunk all over both of them, AMD is gonna end up pretty embarrassed here. A quick note about our testing, we don't have some of these very expensive EPYC chips to test ourselves, so we've got Wendell over at Level1Techs to grab some results for us. Shout out Wendell, this video wouldn't have been possible without him, so subscribe, like his videos, buy his merch, the team over there is amazing. Anyway, benchmark time. In Cinebench, while single core performance is nothing to write home about compared with the 12900K, the multi-threaded performance is ridiculous. And compared to the EPYC 7763, our Threadripper PRO shows a 10% improvement on single core performance, with a 16% uplift in multi-threaded performance. And AMD continues to flex those rippling, bulging, rendering muscles. I mean, look at this Blender render. It's competitive with an RTX 3090, when we're talking raw compute. I repeat this CPU competes with a GPU. Now obviously once you start using things like Optix to render, that's no longer true, but the idea of a CPU even approaching a high-end GPU in rendering performance is nuts. And while the improvements over the EPYC 7763 don't seem that huge at first, when we zoom in and just compare the Zen 3 CPUs, that 20% improvement in gooseberry becomes much clearer. But we don't need to zoom in at all to see the massive 7zip performance uplift. Look at how this thing absolutely wipes the floor with its Zen 3 server sibling. And the 12900K? It's lucky to even show up on the graph. For context, the 5995WX puts out more MIPS than some dual socket EPYC configurations. The decompression rate on this thing is confounding. Literally, we looked at other outlets results and we don't really know why our results are so high, but clearly Threadripper PRO is making the most of Zen 3's improved memory controller. That's the extent of our EPYC data. Thanks again, Wendell. The rest of our results will just involve the 12900K and the new Threadripper. In our Mozilla compile, well, things don't really improve compared to the 12900K, only shortening the compile by a minute. Clearly, this compile doesn't take advantage of all the threads we have available, but you'd think, in creative workloads, this thing should slay, right? Paired with two GPUs and a Threadripper, this workstation should make easy work of the Adobe Suite PugetBench tests, which unfortunately actually ended up quite underwhelming. In all three programs, this $18,000 workstation actually performed worse than a 12900K and a 3090. And this is a great example of how not all workloads are necessarily gonna benefit from just throwing more money at the problem. Looking closely at our results for PugetBench for Premier Pro, we can see that Intel just destroys when working on h.264 files, thanks to their Quick Sync, which boosts performance, but then pretty much everywhere else, the Threadripper comes out ahead. However, when we replace the included dual GPUs with an RTX 3090, we see our behemoth pull ahead. The reason? Well, despite having two GPUs in the system, when you're editing, Adobe Premier only uses a single GPU with the second relegated to rendering only. So the more powerful single 3090 with its NVENC encoder provides our Threadripper PRO with more opportunities to stretch its 64 legs. Wait a second. Yeah, it's faster than a 12900K, but it's not 10 times faster. How does this make any sense? How does anybody buy this? Okay. No one sets pricing for their product in a vacuum. So the first thing you do is try to understand your customer. And since you know that nobody is gonna put one of these in a freaking bang for the buck gaming PC, because that would be stupid and unnecessary, AMD can rationalize this pricing by observing that, well, workstation customers are already used to spending 10, 20, even $30,000 on a single machine. I mean this one sent over by Supermicro, big, thanks, by the way guys, Supermicro is the only reason we're even able to cover this thing, 'cause AMD didn't send one, is worth about US$18,000. And only about a third of that is the CPU itself. It also packs closed-loop water cooling, 256 gigabytes of 3,200 mega transfer per second ECC DDR4 memory, three terabytes of high performance Kioxia Gen 4 NVMe SSDs in RAID 0, and two AMD, how does this come off? I'm sure it comes out somehow. Two AMD Radeon PRO W6800 workstation GPUs. I mean the things an absolute freaking tank. So it kind of makes sense that it would be priced like one. The second thing that you do then is you scope out the competition. I mean, odds are someone else is gonna be gunning for a piece of your customer's wallet, especially if the wallet is 10, 20, $30,000 big, except that in the workstation PC space that competition has all but dried up. Apple couldn't even be arched to update the Mac Pro from its 2019 era Xeon W's. And if they had, Intel's closest competitor to Threadripper PRO, which came out about a year ago, tops out at a mere 38 cores and costs a whopping US$4,500. So this utter lack of other viable options gives AMD effectively carte blanche to charge whatever they want. But I can hear you thinking, \"Hold on a second Linus, no it doesn't. I could just buy 16 core Ryzen or Core i9 chips for a fraction of the cost. I mean, you just showed that they're basically as fast for most things anyway.\" Yeah, that's true enough when the applications that you're focused on are multimedia or gaming, but look at the areas where the Threadripper PRO is a lot faster. It's professional applications, rendering, simulations, financial calculations, and in a professional setting, time is money. It really is, think about it. When the time of the engineer who's sitting at that station is worth, let's say, $50 an hour for the sake of argument. If they spend just 10 minutes a day doing this, sitting idle, waiting for a slow or an unstable machine, it easily costs more than if you had just shelled out for an absolute, beast spec, top of the line system in the first place. And that doesn't even factor in the quality of life improvements for your staff from having good computers and the opportunity cost of delaying whatever project that they've been working on. You gotta spend money to make money, right? Maybe if we'd given Kyle a Threadripper PRO, we'd have our screwdriver launched by now. Sign up for a notification, by the way. The launch is coming very soon, lttstore.com. If anything, I would say the price is kind of too low. No, don't, hold on. Let me explain. AMD's announced retail price for their top spec, 64 cores Zen 3 server CPU, the EPYC 7773X is about US$8,800. Now that CPU does have some benefits over this one. It uses 3D V-Cache to pack in a whopping 768 megabytes of cache. And it's compatible with dual socket motherboards, allowing data centers to pack a whopping 128 cores in a single system. But individually, in spite of all of that cache, it's performance is actually lower than the Threadripper PRO 5995WX. That means that if AMD drops the price of these workstation chips too much, they would risk competing with their own EPYC lineup, which they super do not want to do. According to their latest earnings call, EPYC has been largely responsible for the 83% growth that they've seen in workstation and server sales in Q2 2022. This is exactly what happens when a company has no competition. There's no incentive to compete if the only one you're competing with is yourself, which also appears to be the reason that enthusiast Threadripper, like the non-pro one, got absolutely scrapped this generation. Remember when AMD justified the socket change from Threadripper 2000 to Threadripper 3000 by saying, well, we really just need the updated design and more power for the extra cores? Fair enough, we said. And they promised to make it up to us by ensuring that TRX40 wouldn't be a dead platform with zero upgrade path. Well, I'm still waiting, AMD. I know it's a champagne problem, but it's very obvious that this was a business decision rather than an engineering decision, because the chips freaking exist. Here's some guy in Taiwan benchmarking the 5990 non-WX. Presumably it has some drawbacks, like fewer PCIe lanes, lower system memory limit, and no official support for ECC, but it's clearly functioning well enough to overclock the snot out of it and break world records. Rant aside, by the way, if you must over clock high spec chips, thankfully, AMD offers that on the workstation Threadripper PRO line up, or do they? AMD's website says that the 5995WX is not unlocked for overclocking, but then in a June blog post, they state that it will support CPU and memory overclocking. But the boards that are currently on the market don't allow for it. But then Dr. Ian Cutress received an ASRock board that allowed him to crank the CPU to a TDP of 400 Watts. So it seems like overclocking is on the table, which means we might see some pretty wild benchmark results out of this chip in the future, especially, if it means we can overcome the default boost behavior. While AMD reports a 4.5 gigahertz maximum boost, they are only talking about a single core, which, on a 64 core chip, is kind of of like saying that your car goes 350 miles an hour, but only if like most of it is over here and the wheel is rolling down the road. You know what I mean? So in our benchmarks, we noticed that once we started running a load on more than just one core, our boost was limited to just 4 gigahertz and then quickly declined to 3.1 as we loaded up more cores. I can only imagine how fast and how hot this thing will run with every core pegged at 4.5 gigahertz. For now though, we'll have to sit and wait, maybe watch some exclusive behind the scenes content on Floatplane to pass the time. Now I know that you high-end desktop nerds are chomping at the bit for something, anything to fill the void in this ever shrinking product segment in between workstation and consumer desktop. And I'm with you. Usually, I'd love to have something like this in my rig but it's just massive overkill and it costs way too much. And frankly, it's a little late to the party. I'm gonna do something I don't do that often. I'm gonna say guys, just wait. If the rumors are to be believed, the generation of CPUs coming at the end of this year from both AMD and from Intel are gonna bring some massive improvements. And since we still don't know when this Threadripper PRO chip is gonna hit retail, it might just be better to hang on and see what the future holds. Spoiler alert. One of the things it holds is a segue to our sponsor. Grammarly. So much time can be spent at work, trying to answer emails or draft proposals, and it can become overwhelming. But Grammarly is here to help. Grammarly provides comprehensive spelling and grammar suggestions that helps professionals save time. Simply install the free desktop app, log in and start typing. There's also Grammarly Premium, which provides more in depth feedback on your writing. Their advanced features help you feel more confident in your writing to help save you even more time. We recommend checking out the tone transformation and clarity full sentence rewrite to ensure that your writing is mistake free and easy to understand. They can help you reword phrases to make you sound more confident, and to help remove unnecessary jargon that helps you get your point across clearer. A couple of people here on the business team actually use Grammarly to help make their workflow more efficient. It helps them save time, proofreading important emails and documents, since Grammarly helps them get it right the first time. So work smarter, not harder by going to grammarly.com/ltt to sign up for a free account or get 20% off Grammarly Premium today to help you save time and work more efficiently. If you enjoyed this video, why not watch our video about the Comino GRANDO RM? It's basically the Intel Nvidia equivalent to this beast. And it's got some pretty interesting tricks up its sleeve as well.",
    "transcript_keywords": [
        "Threadripper PRO",
        "AMD Threadripper PRO",
        "AMD",
        "Threadripper",
        "PRO",
        "workstation Threadripper PRO",
        "Threadripper PRO chip",
        "CPU",
        "AMD Radeon PRO",
        "EPYC",
        "AMD Threadripper",
        "Threadripper PRO shows",
        "Threadripper PRO line",
        "Core",
        "single core performance",
        "performance",
        "cores",
        "time",
        "Zen",
        "workstation"
    ],
    "transcript_entity_values": [
        "ASRock",
        "one",
        "EPYC",
        "83%",
        "768 megabytes",
        "13",
        "only about a third",
        "5990",
        "Zen 3's",
        "One",
        "Floatplane",
        "Supermicro",
        "zero",
        "Adobe",
        "MIPS",
        "10%",
        "the 12900K",
        "7773X",
        "GPU",
        "the end of this year",
        "Quick Sync",
        "L3",
        "50",
        "64",
        "Cinebench",
        "Xbox",
        "AMD",
        "three",
        "Linus",
        "2.7 gigahertz",
        "3,200",
        "AMD Advantage",
        "4 gigahertz",
        "NVENC",
        "400",
        "iPhone SE's",
        "256 gigabytes",
        "30,000",
        "4.5 gigahertz",
        "Apple",
        "first",
        "Threadripper 2000",
        "2019",
        "five months ago",
        "20",
        "up to 4.5 gigahertz",
        "Blender",
        "a quarter gigabyte",
        "Ryzen 5000",
        "CPU",
        "Mozilla",
        "Grammarly Premium",
        "4.5 gigahertz",
        "5995WX",
        "VOYAGER ORIGIN EDITION",
        "Intel",
        "EPYC Milan",
        "four",
        "350 miles an hour",
        "Ryzen or Core",
        "7763",
        "ECC",
        "Xeon W's",
        "4.6",
        "Kioxia Gen 4",
        "16",
        "Threadripper",
        "Zen 3",
        "Adobe Suite PugetBench",
        "10",
        "3",
        "Wendell",
        "Intel Nvidia",
        "15",
        "20%",
        "Taiwan",
        "Optix",
        "about a year ago",
        "about US$18,000",
        "AMD Radeon PRO",
        "Threadripper PRO",
        "38",
        "two",
        "three terabytes",
        "CORSAIR",
        "just 10 minutes",
        "second",
        "128",
        "the Threadripper PRO",
        "3.1",
        "Two",
        "Ian Cutress",
        "216",
        "June",
        "4,500",
        "today",
        "18,000",
        "Grammarly",
        "7763",
        "3090",
        "16%",
        "Elgato Stream Deck",
        "AMD",
        "Kyle",
        "Q2 2022",
        "about US$8,800",
        "the Mac Pro",
        "a minute"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "ORG",
        "ORDINAL",
        "FAC",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "MONEY",
        "PRODUCT",
        "TIME"
    ],
    "vector": [
        -0.10325761139392853,
        -0.04857700318098068,
        0.02844594232738018,
        -0.01167521346360445,
        0.07433135062456131,
        0.0011900794925168157,
        0.007299737073481083,
        0.07135339826345444,
        -0.05505961924791336,
        -0.009691917337477207,
        -0.06131770834326744,
        0.035011809319257736,
        -0.01721310429275036,
        -0.023298529908061028,
        0.00022740982240065932,
        0.013395113870501518,
        0.0676482617855072,
        -0.09280228614807129,
        -0.014713783748447895,
        -0.00937982089817524,
        -0.012406195513904095,
        -0.07320540398359299,
        0.040396835654973984,
        0.008644179441034794,
        0.058094870299100876,
        0.004730126820504665,
        0.036305297166109085,
        -0.07839908450841904,
        0.010214867070317268,
        0.002144928090274334,
        0.013912727124989033,
        -0.004930019844323397,
        -0.014443531632423401,
        -0.031618501991033554,
        0.03630528971552849,
        -0.030192099511623383,
        0.044580671936273575,
        -0.04766688868403435,
        -0.025372877717018127,
        -0.029459021985530853,
        0.044698406010866165,
        -0.04124077036976814,
        -0.08605676889419556,
        0.016933562234044075,
        -0.030471257865428925,
        -0.003058583941310644,
        0.10368096828460693,
        -0.07481019198894501,
        -0.026951612904667854,
        -0.028158295899629593,
        -0.0483572818338871,
        -0.09606128185987473,
        0.040796082466840744,
        -0.05849464237689972,
        -0.088813915848732,
        0.08243703097105026,
        0.07285767793655396,
        -0.10308054834604263,
        0.006432714872062206,
        -0.0218864306807518,
        0.039782460778951645,
        -0.1267814338207245,
        0.01099966187030077,
        0.025630371645092964,
        0.1323617696762085,
        0.02036459743976593,
        0.027561578899621964,
        0.01401248574256897,
        0.02330765500664711,
        -0.009584106504917145,
        0.029580391943454742,
        -0.003486099187284708,
        0.035880301147699356,
        0.12706036865711212,
        0.020907068625092506,
        0.0668116882443428,
        0.04640691727399826,
        -0.10170724987983704,
        0.07529178261756897,
        -0.018152153119444847,
        -0.04040669649839401,
        -0.00864972174167633,
        0.05855799838900566,
        -0.06089195981621742,
        0.08442500233650208,
        0.014556678012013435,
        0.07884468883275986,
        0.03078342229127884,
        0.045231811702251434,
        -0.12168370187282562,
        -0.03595884516835213,
        0.03952982649207115,
        0.06520182639360428,
        -0.003599251853302121,
        0.034974899142980576,
        0.096084363758564,
        -0.005346531514078379,
        -0.017636535689234734,
        -0.07004955410957336,
        0.05691039562225342,
        0.0584382638335228,
        0.015717683359980583,
        0.029267027974128723,
        -0.045866962522268295,
        -0.04966249316930771,
        0.029803404584527016,
        -0.06208492070436478,
        0.09183882176876068,
        -0.06926809251308441,
        -0.060535140335559845,
        -0.03013065829873085,
        0.06859200447797775,
        -0.009479866363108158,
        -0.02727804332971573,
        0.044847264885902405,
        -0.04555869847536087,
        0.02044636942446232,
        0.014284293167293072,
        0.06971317529678345,
        0.05914042517542839,
        -0.010356664657592773,
        -0.0027487941551953554,
        -0.053608741611242294,
        0.0049170260317623615,
        0.04157942160964012,
        0.08273196965456009,
        -0.07640649378299713,
        5.858997023678342e-33,
        -0.006079613696783781,
        0.07743237912654877,
        -0.0625494122505188,
        -0.03895462676882744,
        -0.05352037027478218,
        0.011025171726942062,
        -0.027766698971390724,
        -0.03255942836403847,
        -0.006905851420015097,
        -0.002654845593497157,
        -0.006691638380289078,
        -0.06672617793083191,
        -0.007729759439826012,
        -0.017904462292790413,
        0.02068883739411831,
        -0.11110404133796692,
        0.03196495398879051,
        -0.007334115915000439,
        0.0494530014693737,
        -0.010761547833681107,
        0.009735532104969025,
        0.02179604023694992,
        -0.0019402517937123775,
        0.01152763981372118,
        0.03255385905504227,
        -0.07288051396608353,
        -0.006674095988273621,
        0.006288565695285797,
        0.00459116417914629,
        0.019678935408592224,
        0.025133060291409492,
        -0.07487751543521881,
        -0.032239388674497604,
        -0.011035465635359287,
        -0.03558628633618355,
        0.013187839649617672,
        -0.0679621621966362,
        -0.08306422084569931,
        0.017356570810079575,
        0.040677666664123535,
        -0.040099818259477615,
        0.07568315416574478,
        -0.05502166226506233,
        0.002471869345754385,
        -0.018864132463932037,
        0.0697411373257637,
        -0.04418681189417839,
        0.0059393225237727165,
        -0.000661628320813179,
        -0.09097565710544586,
        -0.024981025606393814,
        0.03623110428452492,
        -0.001529966713860631,
        -0.011148198507726192,
        0.06322354823350906,
        -0.04193232208490372,
        0.0340992733836174,
        -0.033422086387872696,
        0.15478430688381195,
        0.08350087702274323,
        -0.034996844828128815,
        -0.03098934330046177,
        -0.07610507309436798,
        0.03696417063474655,
        -0.026800591498613358,
        0.06528463214635849,
        0.025919394567608833,
        0.01913091354072094,
        -0.06247281655669212,
        0.05701008439064026,
        -0.04816243425011635,
        -0.015070494264364243,
        0.021258672699332237,
        0.007902191951870918,
        0.036525826901197433,
        0.07564620673656464,
        -0.0321403369307518,
        -0.06042863056063652,
        0.024264076724648476,
        -0.03292812779545784,
        -0.007792419753968716,
        0.06362408399581909,
        -0.014018655754625797,
        0.033395230770111084,
        0.05076702684164047,
        -0.00019641287508420646,
        -0.03963584452867508,
        -0.022966977208852768,
        0.0042151836678385735,
        -0.011331800371408463,
        0.08318407833576202,
        -0.011193144135177135,
        0.07356368005275726,
        0.06733668595552444,
        -0.09703923016786575,
        -4.635474912417333e-33,
        -0.08143504709005356,
        -0.028860779479146004,
        -0.06678631156682968,
        0.05853777751326561,
        -0.022971102967858315,
        0.0463714599609375,
        0.041558872908353806,
        -0.05193382129073143,
        -0.07678723335266113,
        -0.10331408679485321,
        0.050212662667036057,
        -0.051855143159627914,
        -0.007794409058988094,
        0.034877099096775055,
        0.011975858360528946,
        -0.01537952572107315,
        0.019635992124676704,
        -0.06832242757081985,
        0.09297125041484833,
        -0.009104610420763493,
        0.09827663004398346,
        0.051740795373916626,
        -0.05675928667187691,
        0.0404387041926384,
        0.0009364359430037439,
        0.001229507615789771,
        -0.04189607873558998,
        -0.026973875239491463,
        0.03731940686702728,
        0.02831743098795414,
        -0.031204449012875557,
        0.000539214292075485,
        0.03674779459834099,
        0.06965959072113037,
        -0.005131840240210295,
        0.02278135158121586,
        0.035517677664756775,
        0.028710968792438507,
        -0.030040767043828964,
        -0.01221686415374279,
        0.024161886423826218,
        0.02728673256933689,
        0.015227810479700565,
        -0.0034077439922839403,
        -0.05444832146167755,
        -0.002655694028362632,
        -0.01738704927265644,
        -0.07347552478313446,
        0.04362281784415245,
        0.05279485508799553,
        -0.07411463558673859,
        -0.08759085834026337,
        0.07888033986091614,
        -0.023077713325619698,
        -0.02691078372299671,
        -0.07118401676416397,
        0.003180423518642783,
        -0.022719332948327065,
        -0.030026674270629883,
        -0.0072110556066036224,
        0.004645554348826408,
        0.05723796412348747,
        0.08444458991289139,
        -0.0253332257270813,
        0.12516063451766968,
        -0.04688885807991028,
        0.05569062381982803,
        0.05009952560067177,
        -0.0608343780040741,
        -0.07774275541305542,
        0.017937254160642624,
        -0.047646742314100266,
        -0.026532156392931938,
        -0.047878798097372055,
        0.009885179810225964,
        0.0688495859503746,
        0.05540799722075462,
        0.014306209981441498,
        -0.04621237516403198,
        -0.025996005162596703,
        -0.047993943095207214,
        0.012879826128482819,
        0.0378333143889904,
        -0.04668135568499565,
        0.005670101381838322,
        -0.007346714846789837,
        0.037187907844781876,
        -0.04228895157575607,
        0.06717251986265182,
        -0.05445784330368042,
        -0.03592906892299652,
        -0.011320519261062145,
        -0.02481464482843876,
        0.020329199731349945,
        0.03974936902523041,
        -5.871924457778732e-08,
        0.06719284504652023,
        -0.03645120933651924,
        0.055170025676488876,
        0.062424104660749435,
        0.0970005914568901,
        -0.0861000046133995,
        -0.0057558403350412846,
        -0.06333667039871216,
        0.030193518847227097,
        0.07978209108114243,
        0.046613872051239014,
        -0.04227813705801964,
        0.041576504707336426,
        -0.0400664284825325,
        0.020239975303411484,
        0.021082699298858643,
        -0.0696699470281601,
        0.07084900885820389,
        -0.015364475548267365,
        -0.07719022780656815,
        -0.030821941792964935,
        0.02887418307363987,
        0.09905952215194702,
        -0.005432315170764923,
        -0.020914003252983093,
        0.01459494698792696,
        -0.015048782341182232,
        0.00980551727116108,
        0.09950810670852661,
        -0.02786225639283657,
        -0.1392839103937149,
        0.011367697268724442,
        0.05357661843299866,
        -0.011675737798213959,
        0.06951212882995605,
        -0.033084820955991745,
        0.009305059909820557,
        0.11156509816646576,
        0.06641998142004013,
        0.04695849493145943,
        -0.01704297959804535,
        -0.014471716247498989,
        0.03527017682790756,
        0.041410211473703384,
        0.04157830402255058,
        -0.0290200375020504,
        -0.087043397128582,
        -0.09203600138425827,
        -0.0052355495281517506,
        -0.006083146668970585,
        -0.004367203451693058,
        0.010370830073952675,
        0.03351791203022003,
        0.0679653137922287,
        -0.02202085591852665,
        0.01222147699445486,
        -0.09715542197227478,
        0.04403460770845413,
        -0.1030588448047638,
        0.010532477870583534,
        0.05486082285642624,
        -0.13105899095535278,
        0.0006429914501495659,
        -0.01882397010922432
    ]
}