{
    "id": "zDYp1DK3chY",
    "title": "Motorola RAZR Review: 2004 Is Back (For Better Or Worse)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-02-20T23:35:54Z",
    "video_url": "https://www.youtube.com/watch?v=zDYp1DK3chY",
    "category": "Science & Technology",
    "tags": [
        "motorazr review",
        "razor review",
        "motorola razor",
        "best flip phone 2020",
        "razr 2019 review",
        "razr 2020 review"
    ],
    "views": 140580,
    "likes": 7275,
    "comments_count": 509,
    "description": "In 2004, Motorola released a cellphone that was harder to use, less comfortable to hold, and more expensive than almost any cellphone that came before it. Yet, the Motorola Razr V3 became the best-selling clamshell flip phone of all time  mainly because no one had ever seen anything quite like it.  Fast-forward sixteen years  and its surprising just how much the Motorola Razr 2020 has in common with its progenitor. The new Moto Razr features the same aggressive lines; the same pronounced chin; theres even a retro mode that emulates the original (complete with Hello Moto ringtone!).   The trouble? This new Motorola Razr for 2020 is still not a very good phone.   The question: whether that will matter to the target audience.  Join me for MrMobiles Motorola Razr Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S MOTOROLA RAZR REVIEW]  MrMobile's Motorola Razr Review was produced following eight days with a Motorola Razr review sample provided by Motorola. Pre-production device tested on Verizon. MrMobile does not produce paid or sponsored reviews; no company featured in this video was offered copy approval, and no compensation was requested or provided in exchange for this coverage.    [LINKS]  Motorola Razr Review: As useful as a dull razor blade [Android Central]:   Motorola Razr Review Video [Engadget]:   Motorola Razr Review: More fashion statement than flagship [Engadget]:   Our Motorola Razrs display is already breaking and peeling at the fold [Input]:   Just one day after launch, Motorola Razr durability problems begin to pile up [Ars Technica]:   Red Sox win World Series for first time in 86 Years [Boston Globe]:   Tweet Demonstrating Motorola Razr Display / Hinge Creak [@nirave, @BStoly]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #motorolarazr #razr #motorazr #foldingphone #foldingscreen #flipphone #smartphone #tech",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.androidcentral.com/motorola-razr-review",
        "https://www.youtube.com/watch?v=HHEHukIhokU",
        "https://www.engadget.com/2020/02/14/motorola-razr-review-2020-foldable-fashion-statement/",
        "https://www.inputmag.com/tech/our-motorola-razrs-plastic-display-is-already-breaking-peeling-at-the-fold",
        "https://arstechnica.com/gadgets/2020/02/just-one-day-after-launch-moto-razr-durability-problems-begin-to-pile-up/",
        "https://www.bostonglobe.com/sports/2004/10/28/red-sox-win-world-series-for-first-time-years/uSZN70kzHNM3uyzlcmlUoO/story.html",
        "https://twitter.com/nirave/status/1228800090762022912?s=20",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- [Michael] The year is 2004, Facebook is launched at Harvard University. Across town, the Boston Red Sox win the World Series for the first time since 1918. Meanwhile I'm down in Virginia driving what Cake? A white Chrysler La Baron (record scratching) - [Michael] Also in 2004, Motorola releases a cell phone, it's harder to use, less comfortable to hold, and more expensive than almost any that came before it. Yet the Razr V3 becomes the best selling clamshell of all time. Because no one has ever seen anything quite like it. Flash forward 16 years and it's surprising just how much the new Motorola Razr has in common with it's progenitor. The aggressive lines, the pronounced chin, the single carrier exclusivity, there's even a retro mode that emulates the original. - [Phone Voice] Hello moto. - [Michael] The trouble is it's still not a very good phone. But the question is whether that will matter to the target audience. (driven tech music) Like it's forerunner, the Razr of 2020 is all about the look. Instead of a metallic keyboard and tiny plastic screen though, the chassis now supports a full sized display that deploys to 6.2 inches. And, well, it's still made of plastic, we'll come back to that. But this means that when it's open it's a little narrower, a little taller than what you're probably used to, otherwise the Razr feels like most Android phones. That includes performance, for years I've been pushing people to look beyond the spec sheet and judge a device on its whole package. But I guarantee you right now there are comments down below from people talking about how two-year-old processor is a deal breaker 'cause you shouldn't pay that much for old Silicon. Well, I've been using the Razr for eight days and I've never felt like I was waiting on it. I've never wished it was even a little bit faster, and look, I'm a nerd. For the type of customer the Razr is aimed at, the opposite of a nerd, the processors matters about as much as the bubble wrap the box comes in. As for design, this chin down at the bottom may be divisive, but it makes talking on the phone feel somehow more natural. And it offers a convenient platform for the single speaker, antenna array, and the finger print sensor. The finger print sensor is very good, it's quick and reliable. That single speaker, eh, it could be louder. Where the Razr stands out besides nostalgia is in how small it can become. Fold the flip down and the display curls into the hinge until it's fully enclosed within the steel frame. And just like that, the phone is literally half the size. It fits in chest pockets, sleeve pockets, even those little backpack compartments I use for business cards. And what's nice about the Razr in particular is you can still make a lot of use out of it when it's closed. Moto display, just as handy today as when it was released in 2013. It lets you read and respond to messages, control your music, talk to Google Assistant. While the Moto gestures jump you into the flashlight with a chop, or the camera with a twist. And the Razr's problems begin there, rather, where it follows the formula of its forebear too closely. The 2004 model had a terrible camera, even for its time, and um, so does this one. Slow to focus, drab color science, just a single focal length. Folks I'd take you through a whole roll of samples like usual but the simple fact is the camera is so lack luster that I preferred not to used it for the past week. There are special features like spot color and cinemagraph that are genuinely cool but with fundamentals this poor, they just don't matter. And speaking of fundamentals, in 2020 shipping the old Android 9 on a phone is not a great look for any manufacturer. Especially one with a spotty history of software updates. The compromises continue, the battery is small by modern standards and while I didn't have as much trouble making it to the end of the day as some of my fellow reviewers, I was still always scrapping single digits by bedtime. Motorola also wasn't able to find space for things like wireless charging and it even replicated the old Razr's terrible side keys. Which are too small to feel out and will frustrate you pretty much everyday. Lastly, there's that big durability question. Now look, some of this worry is overblown, yes, you could stick a fingernail beneath the display while you're closing the phone and rip it off if you wanted to. Or some dust could fly in there if you're opening it in a sandstorm. But I don't think those are credible concerns. You only spend a second opening or closing the thing and when it's shut, that display is pretty well protected. That's part of what made clamshells so popular the first time around in the early ons. What worries me are the issues Android Central's Nirave Gondhia and Engadget's Chris Valezco raised about the screen lifting or flexing in spots. Or Mashable's Brenda Stolyar calling out this truly awful squeaky screen door sound from her Razr's hinge. - [Brenda] Oh! - [Camera Man] Let's do that again. Just prove it. - [Brenda] Oh my God, that's the display! - [Camera Man] Oh, that's bad. - [Michael] And of course, now failure is so dramatic as Input's Raymond Wong's review devise display delaminating. Now my review devise has none of these problems with the exception of a slightly noisy hinge but there's no denying that Motorola has some quality control issues here. To say nothing of actually shipping devices to customers on time. Ultimately, the Razr's greatest challenge is that it's no longer alone. When it was announced it was the only clamshell folding phone, an entirely different take on the category than the Samsung Galaxy Fold and that gave it real power. Just like back in 2005, Samsung is right on Motorola's heals with a Razr competitor. I filmed a video comparing the two, please subscribe to the Mr. Mobil on YouTube if you missed it. But the upshot is that the Samsung Galaxy Z Flip is more fully featured, more future proof, better in almost every respect than the Motorola Razr. And as if that weren't enough, it's cheaper and available on more carriers, too. So, should you spend $1500 and possible switch to exclusive carrier Verizon for your chance to bata test a Razr. I'm obligated to say probably not. As I've told everyone who's ogled my Galaxy Fold in public, foldables are a great idea and personally, I love them. I'm in it with both feet because I love being on the bleed edge and it's part of my job. But you should probably wait for the next version before you spend your own money on it. The problem for Motorola is that, and I think most people will feel like that next version is the Samsung Galaxy Z Flip. And unless you were old enough to be around for the first Razr and you really crave that icon in your pocket once again, it's just a tough sell given all you have to put up with in exchange. This review was made possible by a Razr review sample provided by Motorola. But Mr. Mobile does not produce paid reviews, Motorola didn't receive an early preview of this video, nor was it granted copy approval. The company is seeing it for the first time right along side you. Please subscribe to the Mr. Mobile on YouTube so you don't miss my forthcoming review on the Galaxy Z Flip and of course, every foldable phone coming in 2020. Until next time, thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "Harvard University",
        "Boston Red Sox",
        "Razr",
        "Facebook is launched",
        "launched at Harvard",
        "Motorola Razr",
        "Red Sox win",
        "Motorola",
        "Samsung Galaxy",
        "Boston Red",
        "Red Sox",
        "World Series",
        "phone",
        "Samsung Galaxy Fold",
        "time",
        "display",
        "Galaxy",
        "Facebook",
        "University",
        "Harvard"
    ],
    "transcript_entity_values": [
        "the Boston Red Sox",
        "2020",
        "16 years",
        "the end of the day",
        "the World Series",
        "Galaxy Fold",
        "half",
        "Raymond Wong's",
        "Android Central's Nirave Gondhia",
        "Samsung",
        "Mashable",
        "2013",
        "Silicon",
        "Samsung Galaxy Fold",
        "YouTube",
        "Facebook",
        "the Motorola Razr",
        "Moto",
        "Mobile",
        "two-year-old",
        "Motorola",
        "today",
        "first",
        "2004",
        "the past week",
        "9",
        "Google",
        "Michael",
        "two",
        "Brenda Stolyar",
        "Input",
        "the Samsung Galaxy Z Flip",
        "Engadget",
        "2005",
        "Chrysler La Baron",
        "Brenda",
        "1500",
        "Virginia",
        "second",
        "Harvard University",
        "Galaxy Z Flip",
        "Verizon",
        "6.2 inches",
        "Chris Valezco",
        "1918",
        "Mobil",
        "Android",
        "eight days"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "PRODUCT",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "GPE",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.12133243680000305,
        0.03793613612651825,
        0.02528540790081024,
        -0.05779539421200752,
        -0.007169658318161964,
        -0.0892777219414711,
        -0.030369024723768234,
        0.0647815465927124,
        -0.08041738718748093,
        -0.010667689144611359,
        0.01909293793141842,
        0.10519397258758545,
        0.05373648181557655,
        -0.026083122938871384,
        0.01520128920674324,
        0.0732969418168068,
        0.10394615679979324,
        -0.02608373947441578,
        0.018886366859078407,
        0.03470678627490997,
        -0.04945746809244156,
        0.0016314417589455843,
        0.04209018498659134,
        -0.008486706763505936,
        0.020470930263400078,
        -0.008861885406076908,
        -0.04219479858875275,
        0.0871444046497345,
        0.01620965451002121,
        -0.05867210030555725,
        -0.0012465867912396789,
        0.16019970178604126,
        0.07556520402431488,
        -0.011953406035900116,
        -0.08178071677684784,
        -0.08063525706529617,
        0.034139588475227356,
        0.03291000798344612,
        -0.07229005545377731,
        -0.00185471773147583,
        -0.02955480106174946,
        -0.025636320933699608,
        0.034110043197870255,
        -0.019375940784811974,
        -0.010743916966021061,
        -0.05389539152383804,
        0.024630310013890266,
        -0.06892699748277664,
        -0.0441979244351387,
        -0.023441394791007042,
        0.05064133554697037,
        -0.06767605990171432,
        0.013009008020162582,
        -0.024409281089901924,
        -0.11892088502645493,
        0.10116227716207504,
        -0.06397418677806854,
        0.03393737971782684,
        0.010670566000044346,
        0.031844884157180786,
        0.014228693209588528,
        -0.028064025565981865,
        -0.06725205481052399,
        0.009985188953578472,
        0.012734023854136467,
        -0.016503354534506798,
        -0.025012629106640816,
        -0.08635339140892029,
        0.008980022743344307,
        0.039783526211977005,
        -0.014798578806221485,
        0.004104507155716419,
        0.025794176384806633,
        0.005250023677945137,
        -0.07338246703147888,
        0.036462169140577316,
        0.09868484735488892,
        0.02688688598573208,
        -0.053311433643102646,
        0.014623343013226986,
        0.0314985066652298,
        -0.08219651877880096,
        0.006982027553021908,
        -0.08608231693506241,
        0.08426668494939804,
        0.0159144327044487,
        -0.004947657231241465,
        0.01686885394155979,
        -0.08899357169866562,
        -0.01426855381578207,
        -0.02320643700659275,
        0.11475121229887009,
        0.002127533545717597,
        -0.010265357792377472,
        -0.06161091476678848,
        0.026163948699831963,
        0.017683863639831543,
        -0.03441555052995682,
        0.013641041703522205,
        0.02474355697631836,
        0.04615958407521248,
        -0.02341540716588497,
        0.06762231886386871,
        0.0001755109551595524,
        0.04491934925317764,
        -0.0478997603058815,
        0.030068015679717064,
        -0.017873741686344147,
        -0.09887650609016418,
        0.08337599039077759,
        -0.05766943842172623,
        0.05016310513019562,
        -0.001690263394266367,
        -0.021881986409425735,
        -0.045103199779987335,
        -0.04223686456680298,
        -0.06317416578531265,
        0.04265480488538742,
        0.13567261397838593,
        -0.016271373257040977,
        -0.026792757213115692,
        0.0009003157611005008,
        -0.05952334776520729,
        -0.11389275640249252,
        0.027615495026111603,
        0.008992915973067284,
        -0.03914957493543625,
        5.7762429560644224e-33,
        -0.05359598249197006,
        0.14302198588848114,
        -0.06464280933141708,
        0.019565517082810402,
        -0.04831956699490547,
        0.0759430080652237,
        0.015090741217136383,
        0.03254462033510208,
        -0.027131671085953712,
        0.012600855901837349,
        0.020793022587895393,
        -0.006824216805398464,
        0.016775008291006088,
        -0.0017745565855875611,
        0.027087626978754997,
        -0.05919088050723076,
        -0.05668184161186218,
        -0.04449838772416115,
        -0.10683010518550873,
        -0.03495055064558983,
        -0.009719581343233585,
        0.005944208707660437,
        -0.04849471151828766,
        -0.033268071711063385,
        -0.023272493854165077,
        0.006628723815083504,
        0.09561224281787872,
        -0.07738514989614487,
        -0.016459980979561806,
        0.006995304021984339,
        -0.03667761757969856,
        0.03294387832283974,
        0.04515800252556801,
        -0.00819256342947483,
        -0.019748926162719727,
        0.09057527035474777,
        -0.027652902528643608,
        -0.08215135335922241,
        -0.002628181129693985,
        -0.055207785218954086,
        -0.02258056402206421,
        -0.0011618764838203788,
        -0.10718031227588654,
        0.032537635415792465,
        0.04757799580693245,
        -0.008440976962447166,
        0.012485881336033344,
        0.028291869908571243,
        -0.037368252873420715,
        -0.016262201592326164,
        -0.0013726610923185945,
        -0.03978411853313446,
        -0.07322915643453598,
        0.04715339094400406,
        -0.028406335040926933,
        -0.01228839810937643,
        0.04068206250667572,
        -0.03535335138440132,
        0.01820717565715313,
        0.03835035860538483,
        0.02524089254438877,
        0.06105674430727959,
        -0.060587383806705475,
        -0.0030190791003406048,
        -0.028454754501581192,
        0.00802620593458414,
        -0.021727902814745903,
        -0.09040971845388412,
        -0.052263472229242325,
        0.050360389053821564,
        0.08678914606571198,
        -0.04581811651587486,
        -0.024472177028656006,
        0.0005974784144200385,
        0.04717395827174187,
        0.0027213157154619694,
        0.019686469808220863,
        0.034653741866350174,
        0.040564559400081635,
        -0.0012818945106118917,
        0.050399214029312134,
        0.05500234290957451,
        -0.018920570611953735,
        -0.00286452891305089,
        0.06875017285346985,
        -0.023048076778650284,
        -0.008585269562900066,
        -0.0841924175620079,
        0.08521315455436707,
        0.09503673017024994,
        0.057911939918994904,
        -0.06488874554634094,
        -0.035472944378852844,
        0.036028530448675156,
        0.004301985260099173,
        -5.521539778864126e-33,
        -0.04064485430717468,
        0.038211315870285034,
        0.053280215710401535,
        0.09563835710287094,
        0.016144568100571632,
        -0.026424620300531387,
        0.06046895310282707,
        0.049551088362932205,
        -0.031766459345817566,
        -0.15229374170303345,
        0.05463258549571037,
        0.01537211611866951,
        0.0311907771974802,
        -0.03134288638830185,
        0.0468812957406044,
        -0.025289567187428474,
        -0.0018004579469561577,
        -0.09710948169231415,
        0.061443962156772614,
        0.027735786512494087,
        0.012041941285133362,
        0.04889790713787079,
        -0.015751786530017853,
        0.08207178860902786,
        -0.10182926803827286,
        -0.03384032100439072,
        0.008294141851365566,
        -0.02416791021823883,
        0.023068228736519814,
        0.027889780700206757,
        -0.05166328325867653,
        -0.014606709592044353,
        0.02775680646300316,
        0.03786748647689819,
        0.07712815701961517,
        0.0124807795509696,
        -0.025145551189780235,
        0.04753195866942406,
        0.04177141189575195,
        -0.06025364249944687,
        -0.024731114506721497,
        0.03742991015315056,
        -0.012210315093398094,
        -0.017056191340088844,
        0.016069987788796425,
        -0.05646985396742821,
        -0.030421655625104904,
        -0.037413693964481354,
        0.012605324387550354,
        0.015554765239357948,
        0.026772286742925644,
        -0.042024072259664536,
        -0.0006717356154695153,
        -0.0077000027522444725,
        -0.06833670288324356,
        0.0014128594193607569,
        -0.015295685268938541,
        -0.12516890466213226,
        0.058657899498939514,
        0.04745199531316757,
        0.08383183181285858,
        0.03615403175354004,
        -0.00011264408385613933,
        -0.06415775418281555,
        -0.006483722012490034,
        0.039250362664461136,
        0.06470131874084473,
        -0.01839616149663925,
        0.015914633870124817,
        0.013105688616633415,
        -0.04801759868860245,
        0.057318225502967834,
        -0.004461220465600491,
        -0.03894376382231712,
        0.05079876258969307,
        0.056843649595975876,
        -0.07189866900444031,
        0.003934022970497608,
        -0.10514048486948013,
        -0.016085145995020866,
        0.018078962340950966,
        0.055599913001060486,
        0.02722233347594738,
        -0.0039800978265702724,
        0.0144068393856287,
        0.039334457367658615,
        -0.04549098014831543,
        -0.03648429363965988,
        -0.0537511445581913,
        0.011729595251381397,
        0.0032179513946175575,
        0.03670401871204376,
        -0.09117121249437332,
        0.10750208795070648,
        0.09130275994539261,
        -4.740599379715604e-08,
        0.016952291131019592,
        -0.0030792425386607647,
        0.03744368255138397,
        -0.024135828018188477,
        0.034356068819761276,
        0.018099701032042503,
        -0.028318559750914574,
        -0.0755215659737587,
        0.09764035791158676,
        0.033986836671829224,
        -0.0485050342977047,
        0.011567431502044201,
        -0.060619160532951355,
        0.0765969380736351,
        -0.01048752199858427,
        0.11959656327962875,
        -0.0024236293975263834,
        0.009912367910146713,
        -0.000405982049414888,
        0.042931780219078064,
        0.023059215396642685,
        0.07100464403629303,
        0.06680745631456375,
        -0.00354706309735775,
        0.04518658295273781,
        0.04285049811005592,
        -0.07116693258285522,
        0.019973041489720345,
        0.05300576239824295,
        -0.06021370738744736,
        0.020557675510644913,
        0.021058330312371254,
        0.05168301239609718,
        0.008166521787643433,
        -0.03229023143649101,
        -0.061178211122751236,
        0.002854115329682827,
        -0.038980577141046524,
        0.04843241721391678,
        -0.060601554811000824,
        0.120909184217453,
        -0.006930152885615826,
        -0.018237212672829628,
        0.06192653998732567,
        -0.0405435785651207,
        -0.09813963621854782,
        -0.004426686093211174,
        -0.1272631585597992,
        -0.06618544459342957,
        -0.050801124423742294,
        0.005959664471447468,
        -0.0049978094175457954,
        -0.01584901660680771,
        -0.04139849171042442,
        0.09332698583602905,
        -0.03532426804304123,
        -0.012371541000902653,
        0.018409838899970055,
        -0.05662207677960396,
        0.037031300365924835,
        0.010604842565953732,
        -0.07777856290340424,
        0.03462100401520729,
        0.06020408868789673
    ]
}