{
    "id": "ZEfFc559qdQ",
    "title": "This Mystery Tech Goes TOO Far.",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-12-29T19:04:06Z",
    "video_url": "https://www.youtube.com/watch?v=ZEfFc559qdQ",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "mystery",
        "tech",
        "unboxing",
        "wish",
        "lamarr",
        "lamar",
        "lamarr wilson",
        "amazon",
        "how to waste",
        "austin",
        "austin evans",
        "audio",
        "forza",
        "xbox"
    ],
    "views": 936763,
    "likes": 36616,
    "comments_count": 895,
    "description": "Follow @LamarrWilson on TikTok!  The last episode of Mystery Tech:  I should stop wasting money on Wish:   My podcast @TheBackmarkers!  Subscribe!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://www.tiktok.com/@lamarrwilson",
        "https://youtu.be/P63tFSLIPAg",
        "https://youtu.be/C33qjpP3siM",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today for \"Mystery Tech,\" we have a very special guest. The one and only Lamarr Wilson, CEO of Unboxings. And the first time that you've been on \"Mystery Tech,\" since 2019, 2018? - I think. It's been a while. And you're the first person that I've touched in years, thank you. - It's okay. I'm glad I can be your first, all right. - [Ken] So, since then you've become the king of Unboxings on TikTok. So we got you the perfect thing for TikTok. - [Austin] Oh, okay. So basically Ken's fired and this is going to replace him. - I'm done. - [Ken] Wait the last time I got one, you said I still needed to work. - [Austin] So we've got a fill in light. I'm not sure why that's, it's a fill light, I don't think the fill in light it's a little bit different. - Fill in, yeah. - [Austin] So I'm guessing you put your phone on the, like the mounts, - [Lamarr] Right. - [Austin] Rotation auto face, body track, eight hour working time. - Oh, so as I move around? Now it's going to have to be a really wide lens to get me like to track. 'Cause they have to know where I end, it takes a while for me to end in the camera. - [Austin] It's got a lens on it and then you put your phone. - But it better be a really good lens. - I mean, it's probably not. - Let's find out. - Hold on, hold on. The fill in the light, red, white or black? Is this a black light or is that just an light it's off? - [Ken] Well, what's filled in right now is white. So I think it's a white light. - But what's a black light. It's just all actually like a black light? - My people for thousands of years, have had lights in this world and how dare you? How dare you question what our light is supposed to be, okay? All right? - I walked into that one I'm not sure why I did. Let's go over this right now. (Austin groans) It's bright. Oh. - Oh. - It looks pleasant. - Yeah. - That's like pink? - [Ken] It added pigment to Austin's skin, that's great. (Lamarr chuckles) - All right. So it basically has three colors. So it's like pinkish, it's white, - Like a mini ring light, right? - Yeah. Yeah. Yeah. Which is great for glasses. I've heard that. - [Ken] Oh yeah. You are the worst person for this honestly. - There's a rotation shaft. So that's probably the most important thing I've seen. - Okay. The shaft is important. - Press and hold power on for three seconds and you'll see a blue indicator. Then it needs to do a self test. So it's going to rotate all the way around to calibrate. So you want to clip this to the side of the phone, or something. - [Lamarr] No. I have an actual real ring light like a man, so like this is weird. - [Ken] Oh. There's a call. - We've all been there. - [Ken] You need to get? - No, that's a lady friend. - [Ken] Oh. Lamarr. - Now theoretically, it's going to rotate by itself. It has the torque for it. - The twerk? - Yeah. - I mean, you are literally in position. I thought you were about to. Nope. The other way, the other way. Oh. Okay. Seek help - Oh wait. - It found me. It found me, wait. - [Lamarr] Let's get started for this thing dies. - Hi. Hello. Wait if I come over, oh, okay. It's got following. Wait, what happens if, wait, here cross, cross. See if it grabs you or not? - Hey yo. (Lamarr and Austin laugh) - It grabs you. - Yeah, it has me. - [Ken] Oh, that's kind of cool. - Woo. Ouch. (Lamarr and Ken laugh) That was a good idea. - Turn the light off. I'm curious how it will look. Can you still, it said, \"Where is this guy?\" No, no, it's following. - [Ken] Oh, wow. - That tracking, that is impressive. - Hi, welcome, - Everybody will leave your live show, the moment you did that. - Instagram. I'm an influencer. - [Lamarr] That is not how we act. - So theoretically, if you were recording, you need to be really good for probably like a live stream. - [Lamarr] Live stream be better 'cause it's not very smooth as I'm moving, it's jerking. - [Austin] Yeah. - It's like you said that I wouldn't be great for video. - [Austin] But it'll always keep you in shot, generally speaking. - Wait, This is the first time I can hide behind you? - Yeah. - Wow. - It likes me. I think it's because I got a brighter shirt on. - Let's go with the brighter shirt part. (Ken chuckles) - You know my favorite part of this, we didn't have to download some stupid app, it just works. - It just works without an app. I'm legit impressed with this. This is as the kids say, \"Homey, dope to the end zone, yo.\" - [Matt] I'm sorry, what? (upbeat music) - See, you might be the CEO of Unboxings, I'm the CEO of catching things. - [Matt] That's the first one you've ever caught. - [Austin] How dare you? How dare you? The wrist cam, for Apple Watch. Size 42/44. I got a 45, so. (Austin laughs) - [Ken] Which is a 42/44. So yeah. - I just think about the places that my watch and my wrists go and I'm not sure I want that. (gentle music) - Wait, what have you being doing? - I keep this on 24/7. - Okay. So like, - I mean. - Is there a moment when your wrist is, - Potentially in compromising positions. In fact regularly. - Aren't you married? - Welcome to \"Mystery Tech.\" Thank you very much for subscribing and ringing and ringing the ding-a-ling bell. And thanks for following the CEO of questionable jokes on TikTok. - Speaking of ding-a-ling, so what do you think? - [Lamarr] I mean. It has to have some use for some people. You want a spy that (beep). You can't do that, wait. - [Matt] What? - I mean (beep). - When you see a beautiful sunset, and you want to just take a quick shot, Really, really good for that. - Thank you. - No problem, no problem. Look at this. Wait, is that a watch? - Wait, is it not a real watch? - Wait - I mean, it's not a real Apple Watch? - Wait. - This is some creepy stuff right here. - Hold on. - Yeah. - [Ken] So this is a $300 Apple MFI certified watchband. - 300? like United States freedom dollars? - [Jared] Available for free shipping on Amazon. - So eight megapixel camera plus a two megapixel, 4K photo and 1080p video. Eight gigs of storage with Wi-Fi and Bluetooth for some reason. - [Ken] But there's a watch on it. - No. - Oh, okay. - It's a holder. Oh, Okay. - I mean, - [Ken] What? - He does it too. I'm not the only one who has to sniff things. Acceptable, right? - Yeah. - Immediately that looks a little strange. - Oh yeah, this is inconspicuous, no one would ever. (Austin chuckles) So it's not that it's uncomfortable, but it gave me this mark. - Whoa, are you serious? - No, no, no. I might have had that already I don't know. (Austin and Lamarr laugh) I'm like, why do I have, I don't remember this earlier. So already, I'm going to die. - [Austin] A whole new world is about to begin for you. Oh, oh, functional. We have a watch that works. - Okay. Before it goes, before it dies. - I'm recording. So this is the front facing watch footage. What do you think? - It's terrible. It's like one P. - I get that all the time. I'll immediately say it is incredibly uncomfortable to hold your watch like this like, \"Hey, what's up. Vlog time.\" All right. I am now recording on the rear facing camera. - [Lamarr] Yeah. Now that's the creep camera. - [Austin] \"Attention. Your wrist cam battery is low.\" I don't care. All right. This is creep cam, so speaking of creep cam, \"What's up?\" - How's the time. What time is it right now? - [Austin] Creep o'clock. - [Lamarr] He doesn't know. (all laugh) (Austin yawns) - [Austin] How's it going friends? I got a cramp. I'm just going to get a cramp right now. So I'm just gonna, - [Jared] Why do you keep holding your arm like that? - You know what, I pulled my shoulder muscles, so I'm just gonna walk like this. - [Ken] Are you walking your imaginary dog? - Sir. Please. I'm in a public bathroom. (Ken and Lamarr laugh) Can you not. - We should get a little POV real quick. - [Ken] Wait, wait, wait, whoa. Hey. (upbeat music) - So, okay. So it would normally just sync over. - It should automatically sync over, but it's just stuck. It's said it had 40% battery and now it's just dead. It's not comfortable to wear. Like it's big and there's no scenario in which recording something on your watch is convenient at all. 'Cause I'm like, you have to hold your hand in a very specific angle. - Okay. There are many scenarios where it's useful. They're not legal. - [Ken] And they're not for us. - Yeah. I would never condone something like that. I would not use that. Not me. Nope, (upbeat music) - Wow. The wing wrist rest. - Now I was just looking for, actually I just bought a new wrist rest recently, but I wonder if the wing will fly better for me. - Oh my God. That was beautiful. Oh no. No. I hate split keyboards. It breaks my brain. Oh, it's actually worse that I thought it was gonna look. (Austin laughs) - I'm already getting stressed out. - Do it yourself. (beeping sound) Oh my God. What's on fire? Mini USB. (Austin groans) - Mini. - Yeah. Mini not micro, not USB-C. I take Lightning over mini. - Wasn't that around for like a year? That's my day every day. You gotta make sure it's awake sometimes. Yep. There we go. And why are you white? But, you know. (Austin, Lamarr and Ken laugh) - It's a weird curve shape. It went to the side. (Lamarr laughs) - [Lamarr] Should I stop doing this? - [Austin] I don't know. You live your best life. Do we have a laptop or something we can plug this keyboard into, so we can break Lamarr's brain? RGB. Okay. - Okay. And then. (Lamarr chuckles) - Ken, where do you find, like what kind of weirdos on the internet do you hang out with to find this kind of stuff? - [Ken] Programmers. - Yeah. You're right. - That's a good answer. My name is Lamarr. And I hate this place. - I mean, I hate it too actually, I'm not even gonna lie. - [Ken] That makes five of us. (Austin laughs) - Let's investigate the website real quick. - Okay. - What is it? - What is this two girls one, - [Austin] Oh Gosh, easy. - Do we have the information? Why am I using Edge right now? Who uses Edge? - People who like to Edge. - World's most powerful ergonomic keyboard. Lets you customize anything even your key switches. So apparently it's a keyboard for the pros. So you can completely change everything. - Okay. - That's great and amazing. There's a Linus Tech Tips video. \"A no compromises ergonomic keyboard that's actually looks as good as it feels.\" Linus Tech Tips. - Really Linus, really? - I don't trust anything that Linus Tech Tips say. - Yeah. Who is this guy? - Oh wow. It starts at 354. - Okay. - All right. So we're gonna see who can type slowest, I mean fastest. 10 words, ready, set, go. - Okay. Oh God. Okay. Base. - You're on the wrong word now. - I'm not leave me alone. - Okay. A Y and done. Okay. - [Austin] Nine words per minute, 50%. - [Ken] 9 words? - And, (upbeat music) 18 words per minute. Double speed. - Well here's the real question. - Yeah. - Is the ergonomics worth it? 'Cause that's what the whole point of this is. - [Austin] I mean, you are probably sitting a little bit more natural sort of a typing angle. For me though the split keyboard splits my brain. - That sounds like a you problem. Thumbs down on this one. Wait do we do ratings here? - Next item, please. - That was not necessary. (upbeat music) - Alright. I totally thought I heard a noise. I heard a noise. I thought he's about to smash me straight in the head with that huge box. - [Ken] This is what we call conditioning. How you feel about \"Mystery Tech\" so far? He's winding up over here. I look like a crazy person. - I'm just getting ready. - You're gonna smash me in that side of the head. - I am liking \"Mystery Tech.\" It's got some weird, stupid, ridiculous things, but that's what \"Mystery Tech\" all about. - That is exactly it? - Back when I was a child, we didn't have technology. We had books and things and so, and like corded phones. - Seems like dangerous. - And magazines with ladies and not the video. (Lamarr laughs) Cut that. (all laugh) Wow. Hello - [Austin] Okay. - You caught it. - I did. - It was a nice catch. - Well, I cushioned the fall. So it's a box. It says, \"Let's go!\" - Why are there keys? Why are there keys? This is Forza. - [Lamarr] Look at this. - [Austin] Wait a minute. - Imma let you unbox this. - [Austin] You already did this. - [Lamarr] I did this, but now I get to see your reaction though. 'Cause you don't watch my videos. - [Ken] Wow. - I saw the thumbnail. I saw the thumbnail. - Like I said, did I mention I got 7 million views of this on TikTok. - Excuse me. - Yeah. - [Ken] That's like more views than we've had in like the past four months. - That is like legit metal. So this is a Danish fuel tank. - So I made a really bad joke in my video with this. - I said, \"Why did they send me a gas can, 'cause I have a Tesla.\" (Ken laughs) And that's why I got 7 million views. That's not the reason, it's the content inside. - This is meant to be like a jerry can, but it's got a door on it. - [Ken] Who's Jerry? - Rig everything. - [Lamarr] Open the thing. - [Austin] Okay. I almost dropped it. - [Ken] What is wrong with you? - [Austin] It doesn't stay up. It doesn't stay up. - You should be used to this. (all laugh) - So at this point, hopefully you've already seen, we did an entire video on a custom PC for the celebration of the Forza Horizon 5 launch that we gave to the one only Sergio Perez. We went all the way to Mexico, we delivered it. It was a very good time. - Are you promoting one of your old videos in here? - Yeah. - Okay. Just checking. - It's Forza I got like, - I know. I know. - [Austin] Is this a license plate? - [Ken] That's so cool. - Look it's like my license plate in Forza. austinnotduncan, my gamertag. I mean not my gamertag, don't friend me on Xbox. - [Lamarr] I want to see you get this one out in one take. Don't cut the camera. - [Ken] Yes, yes. - [Austin] I got it now. - [Austin] The velcro exists for a reason. - It's still not going to happen. It's still not going to happen. Trust me. No one has done it in one take. Except you. - I did it. I did it. I did it. So this is the custom limited edition, Forza Horizon 5 Xbox controller. - [Lamarr] Isn't it nice? - So I briefly saw this. So actually when we were playing with Checo, we had one of these. So I actually got to briefly see it. This is probably my favorite Xbox controller they've ever done, with the clear, but also have like the sort of like the paint splatter. I mean obviously yellow, pink. I mean, it's almost like it matches my outfit right now. (Austin mumbles) And then we've got road trip. - [Lamarr] Oh yeah. Okay. Do you know what this is before you open it? Just by the feel, don't look at that. This is now my \"Mystery Tech.\" (Austin sniffs) Really? - Oh, the candle. - So you actually did the right thing. Are you trying to tell me that my years of sniffing things actually finally paid off? - [Lamarr] Yeah. - [Austin] It's a candle that smells like, - A road trip. - Road trip, well, - [Matt] Does it smell like Mountain Dew and gas stations? (all laugh) - And tears. - A car full of farts. (upbeat music) You feel like you've been teched out? - Well, not quite, but, - Oh God. What's that, a speaker? - I feel like we've done, no we did a speaker a couple of years ago. - [Austin] There was a Sony speaker... - [Ken] Oh wait, that was with you. I didn't realize that was with you. - [Lamarr] But it wasn't black. So that's different. (Lamarr groans) - What was that scream? (Austin groans) (groans) (Austin groans) Are these two, do these two, - Wait he almost, what? - I guess he didn't yeet that one. - Anything that they gave me you promised I get to take home. - I don't think so that doesn't sound like something I said. - Woojer vest edge. - It's a vibrating thing. - That doesn't make me feel better. - [Matt] That is not true at all. - [Ken] That looks fancy. Wow. - Woo her? I don't even know her. (all laugh) - [Austin] Haptic vest for games and music, #allthatfeels. So we've got a charger here and a headphone jack. What does this plug into? - Looks like there's a speaker right there. - Like incredibly like bulbous, to me it feels like. - I could totally walk out with these you all would never see them. I'm looking at the camera now. This is great. Yeah. - [Matt] Like you could hide that under your collar. - Okay. But how's does it look now? - [Austin] Thanks for the thumbnail. (all laugh) I'm sorry, honey. You that had to see it like this but this is the way that work went today. - I don't know what I'm doing but this is, - We rarely do but sometimes, - on other platforms, you got to pay for this. - Things are happening now. Apparently the microphone is being broadcast. Right now. - Yeah. - The Xbox we're playing Forza Horizon 5, it's going to the controller, which going up via headphone jack into my Vest-o-Matic 9000, which then going back out via headphone jack to my Neck-o-Matic 7000. Would you like to give me the oral bliss that I've been waiting for? (all laugh) I'm feeling things. Oh, I'm feeling things. I felt that. Oh, yep. - That felt good? - It's like you have an Xbox controller that you're sitting inside of. It's about that level of like vibration. It's like you're sitting inside the Xbox controller. Like it's about like the same, - Is Xbox controller inside you or you inside the controller? - I'm inside the controller. - Okay. - I was really hoping for the other way. - I don't know. I guess I was expecting more. - Here let me, you don't feel this now, doesn't feel intense? - Let me, well, I don't know, keep going and we'll find out. - [Lamarr] Okay. 'Cause you you should be really feeling that. - [Austin] Ah, no. I'm running into things that feels so strange. I wanna try something. Let's listen to music with it. I wanna listen to something with like a drum beat or something. - Oh wait, are you doing it on purpose? - I will not move. Feel it. - Wow. - [Ken] Oh, you kind of hear it in the headphones just a little bit. - I mean, it's definitely strong. - Here's the microphone. - Wow. - And that's on his back. From back here without knowing the causes of music, he just sounds like he had a little too much tacos today. - Yeah. - I mean Taco Bell, this might be cool if you're playing in VR. Might be cool playing a first person shooter. - [Lamarr] I'd say shooter for sure. - [Austin] The thing that I kind of struggle with is it doesn't really feel like it gives me the full body aural experience that I'm looking for, which is really the, I mean. - [Ken] Austin there are many places in California that can do that for you. You don't need to buy a vest for that. - Well, the problem is that it doesn't work. Like the more it vibrates, the less I feel like it's actually doing something for me. So I think one of the things I really want to try to explore, - Go on. - was that. (Austin giggles) You okay there? - I'm fine. It just, one of my breasts is a little cold in here. Thank you very much for watching this episode of \"Mystery Tech.\" Make sure to go and subscribe and follow to the wonderful Lamarr Wilson on every social platform that you can get your hands on. Apparently, he's got... - What? What's going on? Can we finish the video please? Is there a problem? - You know what? - So all of a sudden the black guy gets accused. (all laugh) - Thank you very much for watching, please subscribe. Please subscribe, ringing and ringing the ding-a-ling button, and hopefully we don't get demonetized 'cause I. - How dare you? - Is it a boy or girl? - Both.",
    "transcript_keywords": [
        "yeah",
        "Mystery Tech",
        "Wait",
        "Tech",
        "Linus Tech Tips",
        "Watch",
        "Mystery",
        "things",
        "Xbox controller",
        "Linus Tech",
        "Tech Tips",
        "feel",
        "light",
        "Xbox",
        "wow",
        "time",
        "thing",
        "Forza",
        "good",
        "CEO of Unboxings"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "Ken] Wait",
        "Forza Horizon 5",
        "three",
        "TikTok",
        "three seconds",
        "Mexico",
        "50%",
        "VR",
        "first",
        "10",
        "42/44",
        "Amazon",
        "Edge",
        "a couple of years ago",
        "Ken",
        "jack",
        "Austin",
        "RGB",
        "Eight",
        "two",
        "Sergio Perez",
        "Matt",
        "Danish",
        "Xbox",
        "Y",
        "Wi-Fi",
        "Tesla",
        "California",
        "Lamarr",
        "4",
        "Austin",
        "Sony",
        "one",
        "years",
        "the past four months",
        "a Linus Tech Tips",
        "7 million",
        "2019, 2018",
        "Nine",
        "18",
        "Mini USB",
        "five",
        "Unboxings",
        "United States",
        "Jerry",
        "Taco Bell",
        "eight hour",
        "1080p",
        "Vlog",
        "354",
        "eight megapixel",
        "Forza",
        "$300",
        "40%",
        "Linus",
        "45",
        "a minute",
        "Unboxings",
        "Forza",
        "austinnotduncan",
        "Ken] Austin",
        "Lamarr Wilson",
        "thousands of years",
        "Edge",
        "Mystery Tech",
        "Linus Tech Tips",
        "Checo",
        "24/7",
        "Apple Watch",
        "Apple MFI",
        "Linus Tech Tips",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "GPE",
        "PERCENT",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "TIME",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE"
    ],
    "vector": [
        -0.20773901045322418,
        0.010764568112790585,
        0.10342767834663391,
        -0.015260810032486916,
        0.03802045062184334,
        -0.036752257496118546,
        0.12429418414831161,
        -0.03701405972242355,
        0.0038075633347034454,
        -0.038656655699014664,
        -0.0451640747487545,
        -0.011751817539334297,
        0.03908056020736694,
        -0.03581397607922554,
        -0.039352238178253174,
        -0.035472575575113297,
        0.033878326416015625,
        -0.05155858397483826,
        -0.08543715626001358,
        -0.020647846162319183,
        -0.013135600835084915,
        -0.03861330822110176,
        -0.014011045917868614,
        -0.047234244644641876,
        0.008232506923377514,
        -0.013886298052966595,
        0.031200842931866646,
        -0.10408458113670349,
        -0.09381456673145294,
        -0.07302503287792206,
        -0.07074581831693649,
        0.036284759640693665,
        -0.032308369874954224,
        -0.0007389169186353683,
        0.040017180144786835,
        0.04318781569600105,
        -0.07218106836080551,
        -0.010182308033108711,
        0.003383986186236143,
        0.012874468229711056,
        -0.04997164383530617,
        -0.06830330938100815,
        0.016594883054494858,
        0.0485515259206295,
        -0.0665660873055458,
        -0.005647711455821991,
        0.04472900927066803,
        -0.12143357843160629,
        0.03497330844402313,
        -0.03399272263050079,
        -0.029000280424952507,
        -0.013883440755307674,
        0.048989616334438324,
        0.047658078372478485,
        0.07905431091785431,
        0.01385657861828804,
        0.10581360757350922,
        0.01357837300747633,
        0.0038593595381826162,
        -0.045742589980363846,
        0.015185009688138962,
        -0.06555897742509842,
        0.00781446136534214,
        0.05039743334054947,
        0.033696938306093216,
        0.04134504497051239,
        -0.08433262258768082,
        0.049028873443603516,
        -0.013333451002836227,
        0.00939746480435133,
        -0.002683888887986541,
        0.026712117716670036,
        -0.055661026388406754,
        0.06782857328653336,
        0.10102803260087967,
        0.045502305030822754,
        0.07347089797258377,
        0.022262269631028175,
        0.06057779863476753,
        0.039456989616155624,
        -0.034984469413757324,
        -0.09422030299901962,
        -0.029109744355082512,
        -0.031195972114801407,
        -0.028510985895991325,
        -0.012134520336985588,
        -0.02138109877705574,
        0.043319784104824066,
        0.028846153989434242,
        0.008784486912190914,
        0.008154560811817646,
        0.05573649704456329,
        0.02159108594059944,
        -0.00022499749320559204,
        0.09254033118486404,
        -0.030465058982372284,
        -0.024205615743994713,
        0.04412296786904335,
        -0.09200797975063324,
        0.062155645340681076,
        0.036441005766391754,
        0.04603775590658188,
        0.01012518908828497,
        -0.005136602558195591,
        0.036829423159360886,
        -0.041126836091279984,
        -0.050946831703186035,
        -0.026170819997787476,
        0.10253877192735672,
        0.0223242100328207,
        0.04778742417693138,
        -0.08470286428928375,
        0.02743140608072281,
        0.07071322947740555,
        0.012224458158016205,
        0.03292800113558769,
        -0.03502173721790314,
        0.06916845589876175,
        0.023363804444670677,
        0.02312704734504223,
        0.07204775512218475,
        0.06471461057662964,
        -0.13996997475624084,
        0.016902485862374306,
        -0.004610008094459772,
        0.03362198546528816,
        -0.010910579934716225,
        -2.9543804211682172e-33,
        -0.003185922047123313,
        0.0786610096693039,
        0.031514253467321396,
        0.11326786130666733,
        0.07433956116437912,
        -0.03331577405333519,
        -0.05730411410331726,
        0.02035093680024147,
        -0.05141660198569298,
        0.05627528578042984,
        -0.07542052865028381,
        0.10158754140138626,
        -0.04095996916294098,
        -0.04351382702589035,
        -0.05526827648282051,
        -0.04698726534843445,
        -0.06320099532604218,
        -0.06225574389100075,
        -0.01637902297079563,
        -0.022683950141072273,
        0.030826114118099213,
        0.020776038989424706,
        -0.024832183495163918,
        -0.044890496879816055,
        0.004704667255282402,
        -0.042989738285541534,
        -0.012163994833827019,
        -0.05118319392204285,
        0.029860444366931915,
        0.027304833754897118,
        -0.14305342733860016,
        -0.015380813740193844,
        0.04268687218427658,
        0.05500940978527069,
        -0.07736904919147491,
        -0.07748812437057495,
        0.020435228943824768,
        -0.10076189786195755,
        0.01979045942425728,
        0.007338677998632193,
        -0.029474927112460136,
        0.04154103249311447,
        -0.04760643094778061,
        0.014714756980538368,
        -0.020927419885993004,
        -0.05583328381180763,
        0.05470748618245125,
        0.06324928998947144,
        0.06512269377708435,
        0.01180677954107523,
        -0.03562931716442108,
        -0.009942377917468548,
        0.048095785081386566,
        -0.08649558573961258,
        0.04724976420402527,
        -0.0390443429350853,
        -0.00566818006336689,
        -0.004238426219671965,
        0.09951630979776382,
        0.027735469862818718,
        0.0809623971581459,
        0.06930693984031677,
        0.046077877283096313,
        0.028981121256947517,
        -0.021797941997647285,
        0.013273091055452824,
        -0.023303430527448654,
        0.005978154018521309,
        0.013525465503334999,
        0.03565575182437897,
        -0.06421229243278503,
        -0.017832888290286064,
        -0.04120620712637901,
        -0.052296366542577744,
        0.024988144636154175,
        0.0351712629199028,
        -0.03986421227455139,
        -0.03878972679376602,
        -0.08057238906621933,
        0.032729826867580414,
        -0.026905490085482597,
        -0.024448445066809654,
        -0.031345099210739136,
        -0.04325157031416893,
        -0.005347032565623522,
        -0.060254648327827454,
        0.02020467072725296,
        -0.0662311241030693,
        -0.005624725949019194,
        0.07228130102157593,
        0.016852622851729393,
        0.0016393570695072412,
        -0.043621767312288284,
        0.04354635998606682,
        -0.027856608852744102,
        3.348041632479597e-34,
        0.0034953749272972345,
        -0.007359448820352554,
        -0.053818684071302414,
        0.017886918038129807,
        0.09822551161050797,
        -0.08545101433992386,
        0.019057219848036766,
        -0.026777856051921844,
        0.05834890902042389,
        -0.0004138927615713328,
        0.040857087820768356,
        0.024323591962456703,
        -0.009746789000928402,
        -0.06438487768173218,
        -0.03255603834986687,
        -0.013193052262067795,
        0.0002914199430961162,
        -0.009828672744333744,
        -0.09168028086423874,
        0.02122621424496174,
        0.01601077988743782,
        0.009534149430692196,
        -0.12973035871982574,
        0.004327889997512102,
        -0.012868997640907764,
        0.030301544815301895,
        0.0324820913374424,
        0.08308939635753632,
        -0.05848800018429756,
        0.02348845638334751,
        -0.0022488802205771208,
        -0.08496710658073425,
        -0.02741922438144684,
        0.07980100810527802,
        0.023342642933130264,
        0.06328786909580231,
        0.06656158715486526,
        -0.06248825788497925,
        0.011420125141739845,
        -0.004939347039908171,
        0.05530061200261116,
        -0.03125635161995888,
        -0.05311087518930435,
        0.04617952182888985,
        -0.05981602519750595,
        -0.013805944472551346,
        -0.061767302453517914,
        0.01859900914132595,
        -0.046642694622278214,
        -0.03282278776168823,
        0.033886879682540894,
        -0.04740658402442932,
        -0.0257104504853487,
        -0.014903951436281204,
        -0.06541427969932556,
        0.0774838775396347,
        -0.0032446468248963356,
        0.04489314928650856,
        0.0013503881637006998,
        0.042496904730796814,
        0.0186067633330822,
        0.024173693731427193,
        0.0635455846786499,
        -0.016760993748903275,
        -0.07376237213611603,
        -0.009919242933392525,
        0.09967312961816788,
        0.034456152468919754,
        -0.04977629706263542,
        -0.033321917057037354,
        0.06254059076309204,
        0.04337933659553528,
        -0.08905439078807831,
        -0.09056150168180466,
        0.04581768438220024,
        0.09900318086147308,
        0.01079513132572174,
        -0.046964507550001144,
        -0.07166068255901337,
        -0.04399220272898674,
        -0.05935078114271164,
        0.02381863258779049,
        0.012669987976551056,
        0.042051829397678375,
        0.06871027499437332,
        0.11578992754220963,
        0.029474947601556778,
        0.07049748301506042,
        -0.029071375727653503,
        0.017683519050478935,
        -0.03890322148799896,
        -0.021226437762379646,
        0.015615623444318771,
        0.06316092610359192,
        0.03247954696416855,
        -6.285790021820503e-08,
        -0.019214360043406487,
        0.05563453584909439,
        -0.05111490935087204,
        -0.08753800392150879,
        0.057341866195201874,
        -0.004673233721405268,
        -0.006884934846311808,
        0.055533427745103836,
        -0.08475454896688461,
        -0.014612016268074512,
        0.030426528304815292,
        -0.020772818475961685,
        -0.034056637436151505,
        -0.0015351367183029652,
        0.13900496065616608,
        0.09261813014745712,
        -0.045405615121126175,
        0.04757063835859299,
        -0.03493208810687065,
        -0.0937652662396431,
        -0.003765430301427841,
        0.02490510605275631,
        0.009214933961629868,
        -0.054569099098443985,
        -0.03892063722014427,
        0.05958428606390953,
        0.01734272949397564,
        0.011418035253882408,
        0.05233931913971901,
        0.012657573446631432,
        -0.05250343680381775,
        -0.038990847766399384,
        -0.04987608268857002,
        -0.0032114742789417505,
        -0.01085987500846386,
        -0.03177276626229286,
        -0.017879437655210495,
        0.004696978256106377,
        0.039557911455631256,
        0.02169787324965,
        -0.0192953459918499,
        0.0273741465061903,
        0.019067738205194473,
        0.04274138808250427,
        -0.10477526485919952,
        -0.02248859405517578,
        -0.013675503432750702,
        -0.03652556613087654,
        -0.006063466891646385,
        0.011239244602620602,
        0.05004091560840607,
        -0.06720645725727081,
        -0.011654263362288475,
        0.050988856703042984,
        0.08019356429576874,
        0.03404004126787186,
        -0.018475009128451347,
        0.0029070498421788216,
        -0.08361818641424179,
        0.06087315082550049,
        0.04119959846138954,
        0.08649273961782455,
        0.012486496940255165,
        0.012104760855436325
    ]
}