{
    "id": "ZesA-Iqju4U",
    "title": "The wild power of aggregation theory",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-12-02T14:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=ZesA-Iqju4U",
    "category": "Science & Technology",
    "tags": [
        "google",
        "facebook",
        "amazon",
        "aggregation theory",
        "the verge",
        "why google is so big",
        "antitrust",
        "mark zuckerberg",
        "jeff bezos",
        "sundar pichai",
        "the big picture",
        "big tech",
        "tech news",
        "antitrust hearing",
        "google search",
        "2020"
    ],
    "views": 159913,
    "likes": 7838,
    "comments_count": 285,
    "description": "How did Google, Amazon, and Facebook get so big so fast? The best answer we have is an idea called Aggregation Theory. This is how it works.  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3fZquy9",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Amazon runs the largest online marketplace in America, capturing 70% of all online marketplace sales. - Google, Amazon, Facebook, they're growing at this rapid speed. - There's a common thread connecting every billion dollar company online. You might think that Amazon, Facebook, and Google are in different businesses, but they're all powered by the same basic trick, a kind of business superpower that's let them take over advertising, commerce, and basically the entire economy. It's not an exaggeration to say this one trick has reshaped the world over the last 20 years. But to see how that trick works, you have to look at the big picture. (upbeat instrumental music) So, the name for this is aggregation theory. And one of the clearest examples is Uber. Before Uber, if you wanted to call a car, you had to go through a dispatcher. Those dispatchers controlled the market because they controlled the supply, and you couldn't get through to a driver without going through their system. Uber changed that. Now anyone can be a driver and the limiting factor is access to Uber's huge pool of customers and ride requests. Uber maintains that pool of customers by giving them a good experience, in this case a good app. Now, you might look at this and say Uber's a middleman, and you'd be right. But the dispatchers were middlemen too. The difference is that Uber keeps its hold on the market by controlling the consumers instead of the suppliers. Locking down the supply of drivers is now just impossible. But as long as Uber has the best service, it'll have the most ride requests, which gives it control over drivers and basically the whole market. And if Lyft wants to edge in on that market, it has to do it by building a better service. The key thing is there's a lot of money to be made in connecting drivers with passengers. That middleman role is arguably the most profitable part of the entire chain. It used to go to whoever could control the supply of drivers, but now it goes to whoever can aggregate all of the customers in one place. Hence aggregation theory. - So what I'm gonna do is I'm gonna walk through the idea of aggregation theory. - The analyst Ben Thompson came up with this theory and it's the best answer we have for how companies like Google, Amazon, and Facebook got so big so fast. For today's businesses, the hardest problem is customer discovery. There's so much stuff on the internet that customers need help finding it. So if you can build a relationship with the end user, everything else takes care of itself. - And you had this overwhelming amount of data available or articles available on the internet and Google comes along and it's a way to find it. The hard problem is finding stuff. And so Google solved the new hardest problem, and what happened is Google could scale basically infinitely so they could basically bring together all of the consumers, aggregate them all together. - Thompson's idea is that for any business you have this chain from suppliers to consumers, with distributors in the middle. And for most of the 20th century, distributors we're integrated with suppliers. So, Ford not only builds the car, it franchises the dealership that sells it to you. But the internet changes that. Instead of locking down the suppliers, distributors are now getting ahead by locking down consumers. So, you see services like Cars.com or Expedia that focus on aggregating customers together by putting all the options in one place. You see it with menu aggregators that wanna be the single source for takeout orders, a kind of aggregator between you and your local Thai place. You've also probably experienced some version of this with Facebook. Even if you don't use the site or even like it, you've probably invited people to a party through a Facebook event, just because it's easier than rounding up everyone's emails. It's where everyone is. And if you're a business, you might end up paying Facebook to get into the news feeds of people who already follow you. Facebook has successfully positioned itself between you and the people you wanna talk to just by being too big to avoid. Then there's Google which is just aggregating the entire internet. How many times have you navigated to a site by Googling it instead of using a bookmark or typing in the URL? If you wanna know where a restaurant is or when a historical figure was born, it seems archaic to look it up direct from a source. Just Google it. This one company has become the aggregator of all of the internet-accessible information in the world. And the bigger that pool of facts becomes, the more powerful Google is. - As the internet got larger, Google got better. It linked its quality to the scale of the internet. - The idea of aggregation theory has become really popular in the tech world and there's a growing argument about what it means for antitrust law. The story of aggregation theory is all about competition. In some ways it's even more competitive because instead of locking down suppliers, you're competing for consumers. But there are also all of these winner-take-all effects on the internet specifically that combine with aggregation theory in really scary ways. There isn't a lot of reason to use the second best search engine or the second best e-commerce platform or the second best social network. So as soon as one company gets a lead, they end up controlling all of the users, which makes them even more powerful and harder to compete with. - Open markets are predicated on the idea that if a company harms people, consumers, workers, and business partners will choose another option. We're here today because that choice is no longer possible. - To see how the internet makes this stuff weird, imagine a strip mall. There's a big Walmart and lots of little stores next to it. People go to the Walmart for most things, but if you're selling candles, you still might be able to carve out a niche for a candle store. You'll make a better margin that way than selling wholesale to Walmart, and Walmart can only stock so much. Physical retail makes it hard to do everything at once, just because there's only so much space and only so many customers you can draw in. But the internet lets you build an infinite Walmart, extending beyond time and space, unbounded by the laws of physics. Instead of shopping around through different stores, everyone just goes to the infinite Walmart. Because it's infinitely large, customers know it will have whatever they're looking for. And because it can contain an infinite number of people, businesses know they'll get more sales inside the infinite Walmart then making a go of it on their own. Now, think about the boss of the infinite Walmart. Regular boss stuff like choosing inventory and selecting shelf placement gives them almost God-like power. It's not just that they control the biggest store. They control access to all the customers and as long as they hold that power, it's hard to imagine any infinite Targets popping up to challenge them. Pretty soon, people are launching businesses entirely to succeed within the walls of the infinite Walmart, basing their entire concept of retail around the boss's arcane rules. This is basically the tech dream. Don't just capture the sales, capture the entire marketplace, and then use that vantage to jump into more and more lines of business. Aggregation theory shows us how that works and why the internet keeps producing these huge unstoppable businesses. Once you've aggregated all of the customers in one place, you can jump into almost any market. Amazon started by selling books, but now it's selling groceries, dog food, prescription drugs, security cameras, voice assistance, and tons of other things. The basic logic of aggregation theory lets the company expand and expand until it incorporates almost everything. The internet doesn't have to be like this. We used to have a more decentralized web and some products like streaming video and cloud hosting have resisted the winner-take-all dynamic. But if you're wondering how tech companies got so big and so aggressive, this is basically why. Most founders and tech investors don't wanna solve problems or figure out better ways to do things. They just wanna use the internet as a place to build their own infinite Walmart and make themselves the boss. Thanks for watching. Let us know what you think in the comments. And if you like this video, check out this other one about how Amazon ended up taking over the entire internet.",
    "transcript_keywords": [
        "infinite Walmart",
        "Google",
        "Walmart",
        "aggregation theory",
        "internet",
        "Uber",
        "Facebook",
        "customers",
        "theory",
        "Amazon",
        "aggregation",
        "infinite",
        "runs the largest",
        "people",
        "largest online marketplace",
        "America",
        "Amazon runs",
        "basically",
        "consumers",
        "largest online"
    ],
    "transcript_entity_values": [
        "Ben Thompson",
        "Ford",
        "one",
        "today",
        "Google",
        "the last 20 years",
        "Lyft",
        "Cars.com",
        "70%",
        "Expedia",
        "America",
        "Uber",
        "billion dollar",
        "Walmart",
        "Amazon",
        "Facebook",
        "Thompson",
        "second",
        "Thai",
        "the 20th century"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "GPE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "NORP",
        "DATE"
    ],
    "vector": [
        -0.021362850442528725,
        -0.1045318990945816,
        -0.009304053150117397,
        0.03278149291872978,
        0.0506339892745018,
        -0.042398449033498764,
        -0.08160096406936646,
        0.021665522828698158,
        0.05937312915921211,
        -6.927162758074701e-05,
        -0.016135256737470627,
        0.07288377732038498,
        0.03959072753787041,
        0.002096429467201233,
        0.013456159271299839,
        -0.022963620722293854,
        -0.0038673654198646545,
        -0.0383593775331974,
        -0.11796192079782486,
        -0.09868581593036652,
        -0.06182822957634926,
        -0.07274346053600311,
        -0.0265802089124918,
        -0.018069257959723473,
        -0.03656965121626854,
        0.026469388976693153,
        -0.07473199814558029,
        -0.08221009373664856,
        0.028361763805150986,
        -0.07472224533557892,
        0.010991917923092842,
        0.09910287708044052,
        0.060186807066202164,
        0.06859905272722244,
        -0.0930325910449028,
        -0.03976689279079437,
        -0.011986760422587395,
        -0.011517578735947609,
        0.0403129905462265,
        0.010430381633341312,
        0.06381955742835999,
        -0.06484843790531158,
        -0.04933948814868927,
        -0.03923057019710541,
        0.012570947408676147,
        0.014285525307059288,
        0.01247947197407484,
        0.05196065455675125,
        0.000590450712479651,
        -0.031953115016222,
        -0.055060673505067825,
        -0.031007034704089165,
        -0.023233944550156593,
        0.01437254436314106,
        -0.02473934181034565,
        0.024017296731472015,
        -0.0330919474363327,
        0.008502974174916744,
        0.020100921392440796,
        -0.014265577308833599,
        0.036054451018571854,
        -0.10211604833602905,
        0.03172668442130089,
        0.031092673540115356,
        0.06175120547413826,
        0.02265983074903488,
        0.010515985079109669,
        0.09129099547863007,
        -0.09574149549007416,
        0.002232643775641918,
        0.05706138163805008,
        -0.026904093101620674,
        -0.04928494617342949,
        0.0688248947262764,
        0.07977621257305145,
        -0.038949694484472275,
        0.05750589072704315,
        0.02262263558804989,
        -0.004057202488183975,
        0.058358583599328995,
        0.006010087672621012,
        -0.016260217875242233,
        -0.03445729613304138,
        0.01901007443666458,
        -0.01858859695494175,
        -0.052853502333164215,
        -0.008797548711299896,
        -0.051666248589754105,
        0.004074926022440195,
        -0.029573559761047363,
        -0.06313462555408478,
        0.00012186505773570389,
        -0.0026242153253406286,
        0.014414757490158081,
        0.027339689433574677,
        -0.027042053639888763,
        -0.078728586435318,
        -0.08636108785867691,
        0.06669953465461731,
        0.005483971443027258,
        -0.0076453667134046555,
        0.04977692291140556,
        0.08596840500831604,
        -0.09896647185087204,
        -0.018433867022395134,
        -0.05642397701740265,
        -0.02674887515604496,
        0.1261313110589981,
        0.07825694978237152,
        0.0353875495493412,
        -0.044289350509643555,
        0.015012199990451336,
        0.05432766675949097,
        0.019337866455316544,
        -0.014149883762001991,
        -0.07977912575006485,
        0.010806810110807419,
        0.040828362107276917,
        0.09362072497606277,
        0.0046919845044612885,
        0.04470202326774597,
        0.11746671795845032,
        0.04660613462328911,
        -0.06800409406423569,
        0.04562804102897644,
        0.07139632850885391,
        -0.09109719842672348,
        2.6728618301027645e-33,
        -0.0030201238114386797,
        0.018387101590633392,
        0.04356316849589348,
        -0.022211255505681038,
        -0.0356532447040081,
        0.04665375128388405,
        -0.07657327502965927,
        0.03341734781861305,
        -0.05976622551679611,
        0.04856089502573013,
        0.009936908259987831,
        0.16453003883361816,
        0.039506420493125916,
        0.06323555111885071,
        0.07825791090726852,
        -0.02627486176788807,
        0.004331142641603947,
        0.0074387104250490665,
        0.04280387982726097,
        -0.04249042272567749,
        0.10652356594800949,
        -0.004956942517310381,
        0.007415018510073423,
        0.008187725208699703,
        0.0003185798996128142,
        -0.013309785164892673,
        -0.02968544512987137,
        0.08441971242427826,
        0.09001903235912323,
        0.007315665949136019,
        0.004612957593053579,
        0.03790484741330147,
        -0.0811956450343132,
        0.013156157918274403,
        -0.025554312393069267,
        -0.037833329290151596,
        0.008913946337997913,
        -0.0855504646897316,
        0.03336853161454201,
        -0.051092274487018585,
        -0.09880997985601425,
        0.05553971603512764,
        -0.11006724834442139,
        -0.038265492767095566,
        -0.07572135329246521,
        0.09052222967147827,
        -0.015447854995727539,
        -0.006551805883646011,
        0.042981456965208054,
        0.033459149301052094,
        -0.007867586798965931,
        0.0023432227317243814,
        0.022697586566209793,
        0.020451335236430168,
        0.03240624815225601,
        0.03427014872431755,
        -0.0393204540014267,
        -0.05463502183556557,
        -0.008173733949661255,
        -0.02037985436618328,
        -0.022946620360016823,
        -0.0179282259196043,
        -0.04105221480131149,
        0.0762515664100647,
        -0.028160229325294495,
        0.07070392370223999,
        0.08553549647331238,
        0.07333412766456604,
        -0.01683308184146881,
        0.043941326439380646,
        0.03847610950469971,
        0.06094096228480339,
        -0.05395646393299103,
        -0.040221717208623886,
        -0.01287533063441515,
        -0.02033352293074131,
        0.018380243331193924,
        0.00013438667519949377,
        -0.028216606006026268,
        0.056081872433423996,
        -0.01126039307564497,
        -0.015737278386950493,
        0.09515629708766937,
        -0.04932528734207153,
        -0.021894359961152077,
        0.02482079528272152,
        0.0709785521030426,
        0.037686537951231,
        0.01136687770485878,
        -0.058663155883550644,
        -0.12048350274562836,
        0.015909209847450256,
        0.027225395664572716,
        0.053160689771175385,
        -0.001910101855173707,
        -3.468574894667495e-33,
        -0.07361317425966263,
        -0.030772965401411057,
        0.0028749185148626566,
        0.08763158321380615,
        0.007894542999565601,
        -0.07108304649591446,
        0.013658832758665085,
        -0.07807052880525589,
        -0.030147384852170944,
        -0.004514720756560564,
        -0.08483192324638367,
        0.00046104323701001704,
        0.006004627328366041,
        -0.02066018618643284,
        0.008083275519311428,
        -0.03572063893079758,
        0.099917471408844,
        -0.10354240983724594,
        -0.011778733693063259,
        -0.05243995785713196,
        0.0214742049574852,
        0.006338976323604584,
        -0.03476698324084282,
        0.006099931430071592,
        0.04978325963020325,
        0.016129717230796814,
        -0.02707054652273655,
        0.0013205218128859997,
        0.011238839477300644,
        0.04608410969376564,
        0.002250201301649213,
        -0.03939441964030266,
        0.004727785475552082,
        0.016862444579601288,
        -0.03732486814260483,
        0.04503006488084793,
        -0.04607376828789711,
        -0.0029183903243392706,
        0.0022589247673749924,
        -0.09768813103437424,
        -0.0459379144012928,
        -0.03621657192707062,
        -0.0055672298185527325,
        -0.07437177002429962,
        -0.02628450095653534,
        0.058925043791532516,
        -0.0212540365755558,
        0.0489572212100029,
        -0.024740733206272125,
        -0.023581380024552345,
        0.031256843358278275,
        0.07700583338737488,
        0.022109542042016983,
        -0.030131639912724495,
        -0.051073867827653885,
        0.0053969440050423145,
        0.03573569655418396,
        0.03832954540848732,
        -0.018060501664876938,
        0.0390637069940567,
        -0.004589934833347797,
        -0.017569659277796745,
        -0.045084141194820404,
        0.062381867319345474,
        -0.07823833078145981,
        -0.0110925929620862,
        0.055755142122507095,
        -0.021639611572027206,
        -0.03973250463604927,
        -0.016821805387735367,
        0.03382062166929245,
        0.042888157069683075,
        -0.0047913771122694016,
        -0.025514351204037666,
        -0.12110987305641174,
        0.13186587393283844,
        0.031002802774310112,
        -0.04107879102230072,
        -0.03438182547688484,
        -0.026205455884337425,
        -0.007884610444307327,
        0.032598916441202164,
        0.1566208153963089,
        -0.049095358699560165,
        0.004426228813827038,
        -0.002224880503490567,
        -0.03607931733131409,
        0.027996070683002472,
        -0.02054673433303833,
        0.00583579670637846,
        -0.1037992611527443,
        -0.07519691437482834,
        -0.06695801764726639,
        0.037082087248563766,
        -0.027247769758105278,
        -5.3954654077870146e-08,
        -0.021768564358353615,
        -0.02898349240422249,
        0.010306712239980698,
        0.06947998702526093,
        0.10506513714790344,
        -0.04199250414967537,
        0.08111055195331573,
        0.09509459882974625,
        -0.015176991000771523,
        0.03389173001050949,
        -0.02664707973599434,
        -0.013967970386147499,
        -0.09598033875226974,
        0.11823604255914688,
        0.08277790993452072,
        -0.005455594044178724,
        -0.049173977226018906,
        -0.0702974870800972,
        0.020101185888051987,
        -0.01193571463227272,
        -0.027642475441098213,
        -0.011460421606898308,
        0.06136617437005043,
        -0.10179535299539566,
        0.04700811207294464,
        0.04842795804142952,
        -0.021034469828009605,
        0.017817296087741852,
        -0.024082625284790993,
        -0.008987043052911758,
        -0.0059091211296617985,
        -0.0552142858505249,
        -0.02103637531399727,
        -0.021621672436594963,
        0.025032876059412956,
        -0.023340748623013496,
        0.0023319378960877657,
        0.03385844826698303,
        -0.005796709563583136,
        -0.041925519704818726,
        0.022923074662685394,
        0.07116153091192245,
        0.051000263541936874,
        0.024517174810171127,
        0.010567222721874714,
        -0.03413572907447815,
        -0.0987180694937706,
        0.01572212390601635,
        0.10287100821733475,
        -0.004683417733758688,
        0.018539821729063988,
        -0.03953956440091133,
        0.017924802377820015,
        0.007529574912041426,
        0.04791543632745743,
        -0.07259993255138397,
        -0.025240441784262657,
        -0.05715681239962578,
        0.0004836959997192025,
        0.10396569967269897,
        0.027589494362473488,
        -0.12153896689414978,
        0.004902662243694067,
        0.017769791185855865
    ]
}