{
    "id": "zjv0RHRfqvE",
    "title": "I built a Laptop",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-02-09T21:05:29Z",
    "video_url": "https://www.youtube.com/watch?v=zjv0RHRfqvE",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "pc",
        "laptop",
        "intel",
        "amd",
        "apple",
        "microsoft",
        "windows",
        "how to build a pc",
        "build a laptop",
        "kano",
        "laptop kit",
        "gaming",
        "gadgets",
        "tech",
        "technology"
    ],
    "views": 702234,
    "likes": 20060,
    "comments_count": 719,
    "description": "Who needs Apple or Razer when you can build your OWN laptop Why the PS5 is LOSING Money:  Fast Food Tier List:  I sold my body on Amazon.com:  The Pocket Gaming PC - GPD Win3:   Reddit is Killing GameStop    Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/zjv0RHRfqvE",
        "https://youtu.be/uOtEOcBAxys",
        "https://youtu.be/ayPHtwncuGU",
        "https://youtu.be/XldRhq0rz-g",
        "https://youtu.be/s5BfSwLa1T4",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "(upbeat music plays) - Hello, and welcome to 'This Is' Austin. - Yes. Kano you build your own laptop? - So this is a 'Build your own laptop kit'. We have had many, many, many comments over the years saying \"You build a lot of game PCs. Why don't you build a laptop?\" Well, fun fact. You can! Until now. - I mean, yeah, we just proved you a liar because we have one right here. So we were browsing our local Best Buy as Austin pronounces it, which I hate. - Best Buy ? wait, wait, wait, time out, time out. (music stops) What's wrong with saying 'Best Buy'? - It's Best Buy, - like Best Buy, - Best buy there's a T in there. - Best buy - It's the pause in the middle that I hate. Its just Best Buy. (beep) So this is roughly $300 or so ? - Something like that. Is 100% meant for kids. So let's, let's get that out of the way first. This is - As you pull out your melon baller. - This is not going to be an i9 gaming laptop. This is not going to be whatever, it's. - Yeah. So - It's almost like a glorified Raspberry PI in a lot of ways. - Yes. And that's about as . That's about all I know about it. \"How to make a personal computer\", let's go. - I'm going to learn how to make a personal computer. - You are the last, like the last person who should be using that. So we have the, - What looks like the main motherboard. Yeah. It was actually more than that. It looks like it's also the screen. - Yes, because this is, not only is this a laptop. It's a tablet. So basically you're building a Microsoft surface tablet. - So I guess what we're missing here. So it shows obviously a lot of our stuff is already underneath this heat sink. Right? So flash storage, memory processor, power management. So you're not actually like installing the CPU or anything like that, but we're missing things like the battery. I assume maybe this is like a speaker or something. What else is in the box? - Yeah , let's find out. - This is also very thick. I will just say, we do have like those kinds of like pogo pin style connectors. For what I assume is like the, yeah. The tablet kind of keyboard, but it feels, it very much feels like this is a thick boy surface. - All right. Well, first off a cool looking red power brick - USB-C - USB-C took how many years for Microsoft to give you that - But they actually still didn't give you that. They still give you the Surface connector. - But it can charge the PCA It. Doesn't have it. It doesn't come with it though. - So matching and the box. - I think it's cool. - I like just, I like colored products that. Everything's just black or like the glossy white. I like when companies do this. - Little, a little flare, perhaps? - Yeah. And then so a us plug. Kind of hard to show this here. - Oh, it's all attached. Oh, wait, - So we've got to kind of take this whole thing out. Yeah. Yeah. - Oh, this is actually really cool. So we have our back chassis for the laptop - Clear. So you can be, show off all the work you did. - And then we have what is really just like a surface style keyboard. Right? So you actually have a track pad. You have a keyboard with real physical buttons and then you have like the back little like panel which I guess you can - Can put a hand strap. Oh, like lock it. - I guess, we'll have to finish building it. - I first, first thing I'll say, I like the color scheme. I really liked the orange and the gray. Again, I like color in my products. Yeah. I'm happy they did that. He does. - So to be clear, this runs Windows this is not just like a toy, right. This runs a full version of Windows. Now it just says Intel processor and like what four gigs of Ram or something. So I don't imagine it's anything more than like an atom or a Celeron or something, but still, so that's the speaker. - This is a speaker with so headphone Jack. So are you look there? - Oh yeah. Look at that - So when you're building it, it's clear like there's a couple like the pins here. So you're just connecting cables, which I mean is fine. - So it looks like it's got a micro SD card. Yeah. But actually has an internal speaker port. So you literally just plug that in. And it also has the battery connects not via some proprietary pen out, but like I actually just USB-C so I bet you that's. Yeah. That's just a USBC battery. - Alright. - Interesting. - So even if you end up hating this thing. - Yeah. Battery bank ! - This is actually really cool right Now obviously as a seasoned PC building professional I will have no problems whatsoever building this laptop. All right. This is a Wow, only a 45 watt hour battery. So essentially this is far larger than a normal laptop battery probably because they put it in such a big case. - Yeah. - Alright. - Interesting. - Go, go right ahead. - Although that should, for something like this which is very low spec that should still give you plenty of battery life. - That feels nice. - Okay. - So we're gonna plug in right here. - Okay. - Alright. - Then we got two little pegs. Well, I mean, I guess I can be disappointed because it's only a mono speaker, but - Sure. But you installed the speaker yourself. I will say, look, I'm sure this is great for kids. And this actually would be I'm sure a good kid's system but I wish they made it a little bit more challenging. Like why couldn't I have dropped like the board in or something? Like, I'm sure they would get a lot of returns because kids would like break it or whatever. I just wish there was maybe a little bit more to it than just plugging two components and snapping a back on. So let's put it in the actual carrying case. - Yeah. - Also I didn't read the how to build a personal computer. - I know you didn't. That's why - I don't know why you went and grabbed the, the instructions because - But we weren't supposed to do that yet. - It comes with a handy little magnifying glass. I'm gonna take a look at the individual components. Oh, you know what? That's actually kind of cool. So each port is actually individually labeled. So it says USB, HDMI, you have like your charging integrated circuits, battery. I mean, that's actually really cool. - Which isn't actually that on con like most components on a board have some sort of labeling like this, but they are small. And a lot of people just kind of glance over them because they can't see them. So I think that's actually a decent inclusion to have a magnifying glass. - And now we say that you've never been able to build a laptop before . That's not strictly true. There have been some one-off kits. There are certainly some crazy like gaming laptops that actually have like socketed processors. The problem is, is that as technology advances things get smaller things get more integrated. And generally speaking, you don't expect to use a device which is what like two inches thick, right? I mean, that's, that's massive by today's standards. It's possible. I would bet that most companies have done the research and go, that's not gonna make money. That's not gonna, no one's gonna actually buy it. - You're right. - But this is cool because it does give you something different. I really want to fire this up. I really want to see, because I mean, it is heavy, right? And one of the problems with this, I will say if this is for kids, it doesn't feel massively durable. It's huge and thick, but it's also very heavy. Like I think a kid may actually have a problem. Like a, kid's not gonna want to leave this in their backpack all day. - Where's the power button ? - Oh no. It's it's right here. - What's this power button ? - Oh, there's another, what is this power button ? - This is also a power button. - Oh look we actually have goes up a little light on the keyboard. I'm not sure you can see this. There's a light on the keyboard. There we go. All right. We are up and running. So this is a 1366 x 768 display which is code for not good. But again, kids, kind of understandable. So there you go. We've got - Windows pre-installed. - Yeah. Pretty standard version of windows. - I'm a little shocked that they installed, that the windows comes pre-installed if the whole idea is to learn about, you know building a PC or, you know, doing all the things. I wouldn't be surprised if they said \"here's how you install the OS on.\" I mean, that's just part of the complete package. I mean, I also get that. They want to sell this for a kid. It is nice that you go through the whole thing here, but yeah. - And you know, I am kind of surprised It doesn't have a Linux on it. Oh, Hey. I feel like everyone's been staring at this the whole time. Look this all there's all these lights in the back. Oh, look at that. So actually wait, so battery shows that it's battering speaker is active. That's actually kind of cool. - I don't hate that keyboard. - It's fine. If you're a child it's fine. - I don't think it's any worse than like the surface one. - Oh - Okay. No, just, Oh wait, hang on. Something's happening? Kano's happening. - Okay. Activate. - [Computer Voiceover] Welcome to your Kano PC, Thanks for building me . Together You can control computers using code, Let's write your first line. type print Hello World and press return on your keyboard. - I'll be the computer voice. You go through. You're supposed. Nope. Nope. Nope. Matt, you already. You already - Oh, print. - You're supposed to type print. - Hey guys. - This is for children. - Guys, \"I'm so old that we didn't. When I went to like computer classes it was not for this.\" - Hello world. (upbeat music plays) (Matt gasps) - Whoa - [Computer Voice] You just wrote your first line of code. - So this is actually pretty cool. - And this is teaching you exactly how like a very basic level of coding works - Bam. Look at that. - Whoa. - Raced up the rest of of our computer. - We just locked DOS and we are now back into real UI world. Whoa, Kano World, Kano Code create art using typed code. Do it. - Yeah. Got it. Make art. - All right. Make some art Matt. He's on the site. It's just a web wrapper! Look, we're really trying hard to show you the viewing angle on this screen. - Yeah. I, I can't, I can't do it. I can't do it. I need like - It's still Oh, Oh, you know, we need to do, We need to go, we need to back out your garbage - (Matt chuckles) cause you're still yelling at me that I spelled the wrong thing. - There we go. All right. I'm I'm I'm gonna code like a cool person. (hosts exclaim) Hey, look at that ! - I did it. - We're all back to the, I wrote code. I'm such a coder. - Thanks Kano. - Actually. That's cool though. It's basically exactly tells you how to do something, right? - Yeah. - That is very, very cool. I mean, this is obviously very early, right? Because it literally just tells you type this in, but as you type it, you see how it's making a difference in it. And it kind of sets up like, okay you need to create the syntax in a correct way. You also need to make sure that you're not just like adding lines randomly. Cause like my initial instinct was just like type a line and then it's going to like move to the next thing. But you're actually like drawing or you're building out the whole code base from start to finish. You're not just like doing one line. Then it moves you to the next lesson or something. - So it is explaining to you as you go. - The first number is the width and the second is the height. All right, this is cool. Now of course, as we built our own laptop let's take a look to see what the specs are. We got, we got to look at some specs. - Yeah I want to see if it's in Celeron or - It is, in fact, yes, it is a dual core Celeron processor four gigs of Ram. And we're running on a generic SD card as our operating system, which of course is a full version of Windows 10. Now, it's only 64 gigs or 57 gigs of actual space, which means that out of the box, we have 20 gigs. So, the only thing is. I'm actually curious. So it says, that's running on a SD card. - That's one thing I'm going to dock it for is you can't access that SD card easily. - Well, not only that, you wouldn't want to because that's your operating system. Right? - Right. - So like if you take that out, you don't have windows anymore because unless there's another, which I don't think there is, unless there's another operating system or like an internal SD card. I think the issue is unless - No, as far as I can tell, that's the only one. - But the, even like with the Raspberry PI you shut it down. You can easily swap, pull the card out to put up, you know I guess you don't really need to do that though because you have full windows. I'd like - I want to see is there actually a SD card in there. Actually can't tell, there actually, maybe a second one because it does say flash storage inside. So I wouldn't be surprised if underneath this heat sink is a micro SD card already. And that's the one you add to expand. That's my assumption on this. So you don't have to take it apart to install but you could install a micro SD card here. You also have a two USB 3.0 ports and HDMI. So you could also use that to expand your storage. You, know the problem is: if a kid is used to an iPad this is going to feel ancient and slow. - Yeah. I that's what I'm thinking. Just thinking about that. - Like they cut corners big time on the spec of this, obviously, you know, for coding and stuff it's going to be fine, but this Celeron is about the cheapest processor you could possibly buy in 2021. - Bring it back around. Do I think, are we recommending this for anyone over the age of six or seven? I don't think so. - I don't think so. - And even then, it's kind of a hard sell of like this is great for a school. It's like, we'll tear it apart. We'll, you know, like put it in your cabby, whatever. I think it's great, but I love the idea of it. And I just wish that there was more adult versions of these where you could customize it, pull out pull out pieces, you know, change up the SSD change up the, the, the CPU. I personally would would easily be okay with this thickness. You know. Cause if you switch this to like magnesium suddenly this is a a fairly lightweight thing in this chassis. - The thing is that this was $300, right? Which is a $300 device. That really is for kids , right. It has all the Kano stuff, which to be fair, Kano make other devices. And so you can do like the little like Raspberry PI style kits that they sell. The fact that you can build your own laptop is cool but I think they might be slightly overselling it. To be fair. I don't actually know if they position it as build your own laptop. I think 'how to like make' is probably, yeah, it's a kit. I mean, you plug two things in and snap it back on. - When I, when I first saw this, I was I really was hoping that we would get to, you know pull off like actually like install the heat sink, you know maybe install some of the Ram. Hell I would, I would love it if they had, you know found a way to make any of the ports like clickable. So like you're almost building the, the motherboard. - He didn't really rely on you taking out your little magnifying glass and looking at it. Which is cool. And the fact that it's clear definitely gives you a sense of like, Oh, I built that, but I mean, it's fine if you're a little kid and you can build it. I mean, that's obviously very simple, but it's certainly not building a laptop in any kind of traditional sense. That being said though. It's cool, man. It's pretty cool. Let us know what you think about the Kano laptop in the comments below and whether or not you would actually ever want to build your own laptop. Other than that, please make sure to ring a ling the ding-a-ling bell. Subscribe to this is and we will catch you next time. When we try to build I don't know, a PS-X, probably our next click bait video. - Sold by Kano. (music fades out)",
    "transcript_keywords": [
        "yeah",
        "Buy",
        "cool",
        "laptop",
        "Kano",
        "build",
        "kind",
        "thing",
        "Windows",
        "building",
        "make",
        "battery",
        "card",
        "back",
        "code",
        "kids",
        "kid",
        "speaker",
        "keyboard",
        "things"
    ],
    "transcript_entity_values": [
        "45 watt hour",
        "USBC",
        "Windows 10",
        "one",
        "roughly $300",
        "Kano World",
        "four",
        "Jack",
        "Windows",
        "USB",
        "Kano",
        "today",
        "Ram",
        "57",
        "two inches",
        "Matt",
        "CPU",
        "300",
        "the years",
        "iPad",
        "Raspberry PI",
        "20",
        "100%",
        "Austin",
        "UI",
        "two",
        "the age of",
        "all day",
        "SD",
        "USB-C",
        "second",
        "PCA",
        "Celeron",
        "the Raspberry PI",
        "Microsoft",
        "first",
        "Hello World",
        "SSD",
        "Intel",
        "1366 x 768",
        "Kano",
        "only 64",
        "PS-X",
        "seven",
        "Linux",
        "HDMI",
        "2021",
        "Celeron",
        "Kano"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON"
    ],
    "vector": [
        -0.0302552692592144,
        -0.01127958856523037,
        0.07836519181728363,
        -0.046715449541807175,
        0.07340598106384277,
        -0.013991259969770908,
        0.06109276041388512,
        0.03366699442267418,
        0.011433843523263931,
        0.061012137681245804,
        0.01630428247153759,
        0.019213752821087837,
        0.04980829358100891,
        -0.0709381103515625,
        0.07669838517904282,
        -0.02062985859811306,
        0.06316981464624405,
        -0.07629942148923874,
        -0.03508375212550163,
        -0.012109827250242233,
        -0.030403539538383484,
        -0.03473734110593796,
        -0.02696502022445202,
        0.025718361139297485,
        0.040588557720184326,
        0.0678354799747467,
        0.03941823169589043,
        0.04519957676529884,
        -0.08920080959796906,
        0.04132344201207161,
        -0.03007972612977028,
        0.029637537896633148,
        -0.0182088240981102,
        0.009098045527935028,
        0.05698911473155022,
        -0.05372060090303421,
        0.010690449737012386,
        -0.047869421541690826,
        -0.061960481107234955,
        -0.11954601854085922,
        -0.03196264058351517,
        -0.05723242089152336,
        0.012598756700754166,
        0.06648348271846771,
        0.0505744032561779,
        -0.031123684719204903,
        0.005262385588139296,
        -0.047621119767427444,
        0.05540274456143379,
        -0.03653114289045334,
        -0.08598503470420837,
        -0.055833518505096436,
        0.038340013474226,
        -0.11058855056762695,
        -0.07400673627853394,
        0.05250285565853119,
        0.03674353286623955,
        0.023200061172246933,
        0.046946149319410324,
        0.015107897110283375,
        0.03978786617517471,
        -0.15232238173484802,
        -0.033410802483558655,
        0.026628991588950157,
        0.022834334522485733,
        -0.03536999598145485,
        0.0080240024253726,
        0.037907958030700684,
        -0.027284838259220123,
        0.11324921250343323,
        0.03572303429245949,
        -0.008906738832592964,
        0.09622126072645187,
        0.09792748093605042,
        -0.028753045946359634,
        -0.006407454609870911,
        0.08277394622564316,
        -0.012851606123149395,
        0.04455967992544174,
        0.06010777875781059,
        -0.054813820868730545,
        0.05477319657802582,
        -0.042335331439971924,
        -0.03904716670513153,
        -0.04545971378684044,
        0.009649249725043774,
        0.02505021169781685,
        0.03423868492245674,
        -0.013574915006756783,
        -0.0672241747379303,
        -0.03443668782711029,
        0.0012864219024777412,
        0.03003394417464733,
        0.0087153110653162,
        -0.006757090333849192,
        -0.0036283705849200487,
        0.00029723887564614415,
        -0.07708849757909775,
        -0.08160015195608139,
        0.011808264069259167,
        0.0047914013266563416,
        0.0528210811316967,
        0.12933072447776794,
        0.019375303760170937,
        -0.02162061259150505,
        -0.040346309542655945,
        -0.12509162724018097,
        0.07117563486099243,
        0.01583901047706604,
        -0.0014739211183041334,
        -0.0881054624915123,
        -0.03597239777445793,
        -0.04983052238821983,
        -0.004163042176514864,
        0.06321489810943604,
        0.06330139935016632,
        -0.04977603629231453,
        0.015467078424990177,
        0.0628950372338295,
        0.03120156191289425,
        -0.01784481294453144,
        0.037433236837387085,
        -0.046204205602407455,
        0.013838019222021103,
        0.06702370941638947,
        -0.006292117293924093,
        -0.07218354195356369,
        3.2058041528007115e-33,
        0.016548702493309975,
        0.03616412356495857,
        0.04366706684231758,
        0.06703130900859833,
        0.019242070615291595,
        -0.03614015877246857,
        0.013862635008990765,
        0.05246935039758682,
        -0.05436166003346443,
        0.05189700052142143,
        -0.010606186464428902,
        -0.003234819509088993,
        -0.07330110669136047,
        0.06098606064915657,
        0.1444999724626541,
        -0.008911680430173874,
        -0.07233311980962753,
        -0.03654316067695618,
        0.013793286867439747,
        -0.02144736424088478,
        0.003653469029814005,
        -0.018762318417429924,
        0.05526845529675484,
        -0.05976582691073418,
        0.006244312506169081,
        -0.004179815761744976,
        -0.015299646183848381,
        -0.0768505409359932,
        0.02925795316696167,
        0.03308967500925064,
        -0.08518707007169724,
        -0.024803869426250458,
        0.011585931293666363,
        -0.05066634342074394,
        -0.04272618144750595,
        -0.05263696238398552,
        -0.03454355150461197,
        -0.06882369518280029,
        0.01173882745206356,
        0.01525349635630846,
        -0.06500478833913803,
        0.07529813796281815,
        -0.05212824046611786,
        -0.02177625522017479,
        0.04573902115225792,
        -0.002832008060067892,
        -0.04484497755765915,
        -0.035687606781721115,
        -0.06569161266088486,
        0.034185945987701416,
        -0.08374069631099701,
        0.029881229624152184,
        0.12549959123134613,
        0.011560105718672276,
        -0.04259081929922104,
        -0.07083214819431305,
        0.050902046263217926,
        -0.042473483830690384,
        0.097012460231781,
        0.007885470986366272,
        0.018165351822972298,
        0.02457277663052082,
        -0.025772318243980408,
        0.04105639457702637,
        -0.10003308951854706,
        0.06318807601928711,
        0.14613130688667297,
        0.03968429192900658,
        0.0014522082637995481,
        0.03010856732726097,
        0.004852142184972763,
        -0.02572578191757202,
        -0.057301297783851624,
        -0.04157300293445587,
        0.035952258855104446,
        -0.0023145736195147038,
        -0.10571742802858353,
        0.06656152009963989,
        -0.07602577656507492,
        -0.011430718936026096,
        0.018145957961678505,
        -0.0003459154686424881,
        -0.061104342341423035,
        0.0269527118653059,
        0.029852846637368202,
        0.0904783234000206,
        -0.00846271961927414,
        -0.11273923516273499,
        0.005021183751523495,
        0.0019366599153727293,
        -0.09579293429851532,
        -0.012758336029946804,
        0.011021088808774948,
        0.046927496790885925,
        -0.0440332405269146,
        -4.618119473011411e-33,
        -0.02571686916053295,
        -0.12785595655441284,
        -0.005498709622770548,
        0.059437625110149384,
        -0.005025708582252264,
        -0.042287491261959076,
        -0.012953371740877628,
        -0.06896629929542542,
        0.02625168114900589,
        -0.019174514338374138,
        -0.05082087963819504,
        0.03788210079073906,
        0.011453072540462017,
        -0.0015141451731324196,
        -0.024310162290930748,
        -0.05759501829743385,
        -0.009278650395572186,
        -0.06392454355955124,
        0.036109618842601776,
        -0.04487821087241173,
        0.015841541811823845,
        0.033155761659145355,
        -0.024866696447134018,
        0.03695051372051239,
        -0.03385956957936287,
        -0.04107367992401123,
        -0.04649115726351738,
        0.015134376473724842,
        0.01130149606615305,
        -0.016961537301540375,
        -0.0009543792111799121,
        -0.01765149086713791,
        0.007863357663154602,
        0.024248136207461357,
        0.09831332415342331,
        -0.017893465235829353,
        -0.053288836032152176,
        0.013858023099601269,
        -0.0031424625776708126,
        -0.0060372245498001575,
        0.07613341510295868,
        0.02067701518535614,
        -0.05694808065891266,
        -0.011827990412712097,
        0.01061918679624796,
        -0.06524807214736938,
        -0.004629447590559721,
        -0.08749326318502426,
        0.06746017187833786,
        -0.01932329498231411,
        0.06273932754993439,
        -0.04036508873105049,
        -0.008649188093841076,
        -0.05930078774690628,
        -0.0665002092719078,
        -0.07296905666589737,
        -0.0051842862740159035,
        0.05466533452272415,
        0.046958066523075104,
        -0.026520412415266037,
        0.02214934676885605,
        -0.021170157939195633,
        0.011186078190803528,
        0.005487183574587107,
        0.013259748928248882,
        0.009151148609817028,
        0.09923388063907623,
        0.056866057217121124,
        0.004175151698291302,
        -0.07827115058898926,
        -0.05688241124153137,
        0.02376692369580269,
        -0.06548316031694412,
        -0.01563579961657524,
        -0.09570696949958801,
        0.07370491325855255,
        -0.007882115431129932,
        0.0018195115262642503,
        -0.023012707009911537,
        0.012032130733132362,
        0.0451449416577816,
        -0.007017029915004969,
        0.034998949617147446,
        0.023589376360177994,
        0.03557818755507469,
        -0.004984136670827866,
        0.016177039593458176,
        0.07274991273880005,
        -0.04065684974193573,
        -0.012106784619390965,
        0.025904837995767593,
        0.03138885274529457,
        -0.08652472496032715,
        0.09558400511741638,
        -0.023149799555540085,
        -5.871941866075758e-08,
        0.04575037211179733,
        -0.0002738842158578336,
        0.028678594157099724,
        0.06575699895620346,
        0.0614902637898922,
        -0.040935587137937546,
        0.06253013759851456,
        -0.016354860737919807,
        0.11377296596765518,
        0.06729225069284439,
        0.03652117773890495,
        -0.07790007442235947,
        -0.0388265922665596,
        0.06437792629003525,
        -0.030276574194431305,
        0.12881359457969666,
        -0.05317088961601257,
        0.09564293920993805,
        -0.016680512577295303,
        -0.04808555915951729,
        -0.017150690779089928,
        0.06596217304468155,
        0.06469245254993439,
        -0.020436014980077744,
        -0.01794908381998539,
        -0.03324640542268753,
        -0.0012054280377924442,
        -0.031939804553985596,
        0.032912012189626694,
        -0.001163410022854805,
        -0.049242060631513596,
        -0.047596972435712814,
        -0.016931572929024696,
        0.029138166457414627,
        0.017863262444734573,
        -0.08258073031902313,
        0.041935622692108154,
        0.06047889217734337,
        0.07092088460922241,
        -0.017801731824874878,
        -0.09601210057735443,
        -0.04964536800980568,
        -0.006209489423781633,
        -0.023952947929501534,
        -0.03989863023161888,
        0.04085526242852211,
        -0.11776618659496307,
        -0.07560645788908005,
        -0.07441888004541397,
        0.020666589960455894,
        -0.0026850553695112467,
        -0.01595783419907093,
        0.049336034804582596,
        0.008978050202131271,
        0.07308609038591385,
        -0.015573297627270222,
        -0.023175453767180443,
        0.0153680220246315,
        0.014519274234771729,
        -0.01891961507499218,
        0.09195036441087723,
        -0.04807797819375992,
        -0.003991568926721811,
        0.08233697712421417
    ]
}