{
    "id": "Zkfp9YD3H60",
    "title": "Fixing a Viewer's BROKEN Gaming PC? - Fix or Flop S1:E20",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2021-12-07T22:55:06Z",
    "video_url": "https://www.youtube.com/watch?v=Zkfp9YD3H60",
    "category": "Science & Technology",
    "tags": [
        "fixing",
        "broken pc",
        "how to troubleshoot",
        "troubleshoot pc",
        "dead pc",
        "broken computer",
        "broken gaming pc",
        "no post",
        "tech",
        "no picture but sound on tv",
        "pc won't post",
        "pc gaming",
        "how to build a pc",
        "pc problem",
        "computer",
        "gaming pc",
        "how to",
        "computer cleaning",
        "computer hardware",
        "cable management",
        "how to cable manage",
        "how to fix a pc that wont turn on",
        "how to fix a pc that wont boot up",
        "computer repair",
        "gaming computer",
        "fix or flop",
        "how to fix a pc",
        "Pc no post",
        "season finale"
    ],
    "views": 397375,
    "likes": 22792,
    "comments_count": 1356,
    "description": "SPONSOR: Get started with SignalRGB for FREE today:   This is it! Episode 20 of season 1 of Fix or Flop. We've come a long way - and we've saved one of the most broken PC for last. Hope you enjoy! By the way, if you live in the Orlando, FL area and have an issue with your rig, apply to have it (possibly) fixed for free today!    Consider supporting us on Patreon!   SPONSOR: Snag an OEM Windows 10 Pro key and use code 'SKGS' for a 25% discount:    My troubleshooting gear: FLIR C5 Thermal Camera:  Skybasic Digital Microscope:  YIHUA Soldering Station:  Helping Hand Soldering Board:  Xool 80 Precision Tool Set:    My cleaning gear:  SYINE Respirator Mask:  Scott Shop Towels:  Electric Air Duster:  ONSON Cordless Vacuum:  Medical Grade 99.9% Isopropyl Alcohol:  Q-tips Cotton Swabs:  Xool 80 Precision Tool Set:  Hizek Black Disposable Gloves:    My studio gear: Sony a6600 (Primary):  Sony a6400 (Secondary):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #FixOrFlop",
    "description_links": [
        "https://bit.ly/3pcPMhq",
        "https://gregsalazar.com/fix-or-flop",
        "https://www.patreon.com/gregsalazar",
        "https://bit.ly/3nfdVmg",
        "https://geni.us/3ALEI",
        "https://geni.us/6zurf",
        "https://geni.us/DbjS",
        "https://geni.us/7DDrL",
        "https://geni.us/1IfxDSw",
        "https://geni.us/V4uA",
        "https://geni.us/rIy5O6Y",
        "https://geni.us/RALt4",
        "https://geni.us/aABrFWE",
        "https://geni.us/tBVQ",
        "https://geni.us/nQhVVQm",
        "https://geni.us/1IfxDSw",
        "https://geni.us/MBCJaf",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "This was another viewer's broken gaming PC. And when I say broken, I mean proper broken. This thing wouldn't stay on for longer than a few milliseconds. And no, I am not exaggerating. The process that we went through to get this thing working again, and it is now working again, was long and arduous. And I'm excited to bring you along for the ride. This is episode 20, the first season finale of \"Fix or Flop,\" and I am super thankful for your support in this playlist. I'm also grateful to our sponsors who've allowed us to continue doing this free of charge to folks in and around the Orlando, Florida area. Are you ready? You might wanna buckle up for this one, stay with me. If you're struggling with running multiple RGB software suites at the same time, we all know how annoying that can be. Check out SignalRGB and control and sync your favorite RGB devices with one free application. It supports many popular devices from leading brands like Razer, Corsair, Logitech and more. And it's packed full of lighting effects and presets. There is a huge library of custom ones to choose from. One of my favorite attributes is SignalRGB's on-screen action detection, which can replicate effects across multiple RGB devices. \"Minecraft,\" \"GTA V,\" \"COD:Warzone,\" and many other games are already supported, and much like the remainder of the app, the support list is growing every single day. And perhaps best of all, it's super easy to set up. Get started with SignalRGB for free today by clicking the link below and consider going Pro to help continue product development. Now for those who are new to the \"Fix or Flop\" playlist, the premise here is simple. We offer to fix viewer systems in and around the Orlando, Florida area for free. We do not charge a dime for the service so long as the owner in question is okay with us taking on their system for a few days and filming the troubleshooting process. We can monetize these videos on our end and we don't feel like offloading any of that cost to the viewer, who again is already gracious enough to loan us his or her system. Maybe I should try to fix this, there we go. I'm gonna read you a bit of the original email for some context, he says, \"I'm new to building PCs and on this one, I just switched out the motherboard, but it turns on and off so quick and I don't have anyone to test the power supply with. So I'm asking you to help, plus I think it'd be cool for you to have a viewer fix a crazy looking case.\" Well, the case itself doesn't need to be fixed, but it definitely is a statement. It's making a statement right now and it's definitely proving that my room is way too small because I can barely fit this in the shot, so thank you for that. \"Also in the picture I sent, the PC does not have the GPU in it because I was trying to fix it myself.\" He's got it in here now, this card is a GTX 1060 6GB, an ASUS Strix, ROG Strix card. It's a really nice one, one of the more expensive 1060s when they were brand new. So we're gonna try to fix this. I guess it turns on and off super fast, that is the symptom. And we're gonna try to replicate it here. It's important that we turn on the system before touching anything and verify that what the owner says is happening is what's actually happening here in the office. Because if it's not, it's possible that something else might've happened in transport or maybe the owner is outright lying. And that could also bring about a bunch of issues later on. I don't expect that's the case here 'cause we're doing this for this essentially free service, but anyway, we need to check it. So let's see what we've got here. The power supply is like, oh, it's way under here in these awkward cases. Okay, there we go. Oh my gosh, where's the power button on this thing? It'll be somewhere near the front. Okay, it's up top here, all right. (pushes power button) *click* Huh. (disappointment) Let's try it, oh okay, I didn't have to push it that time. It's turning on and off. Wow, this is a new one. We haven't had this kind of symptom before. It keeps trying to turn on and it turns off almost as quickly. This looks like a short. I don't know what else could be causing this. It just keeps going, it's not stopping. What the heck! (Grumpy Greg needs Chicken Nuggets) Okay, so let's kill power and check connections first just because it does seem like a short right off the bat. So these two upper-most right pins are good for the power switch and yeah, it's actually correct. So it's not resetting itself based on how the owner would have wired this, interesting. So now what I've done is disconnected all nonvital cables. That includes the fans, that includes the pump, the USB 2.0 cable down here, the HD audio cable, front IO, basically everything except for the 24 pin APDPS and supplemental PCI-E power. At this point, we're gonna need to jump the PC. I just flipped the switch at the rear power supply, we're gonna see if we still get the same issue. Wow! (I hope Lisa bought Chicken Nuggets) Same thing. ( a 9-5 sounds great right now) That's really weird. And there is quite a bit of cabling happening at the rear of this, so if he did miswire something back here, potentially that could also cause an issue. And I just realized that when I disconnected nonvital things, I still had SATA power running to his RGB box, I believe that's for RGB, and just controlling fans. He's got some Thermaltake fans in here. So we need to disconnect that as well if we wanna stay true to keeping things as simple, in terms of wiring, as possible. If the box is causing the short or preventing the system from fully powering on, we wouldn't know that if we didn't disconnect power. A few moments later. And still nothing, it's still power cycling over and over. I'm starting to think that a very serious component in this rig is bad, probably his power supply, which that's gonna require disconnecting everything, rewiring this entire build, but so be it, if it means getting a system back to working order. Also this is slightly off topic, but can I just say that really doesn't look stable. When you're relying on tempered glass to keep your chassis from bending like this, I don't feel too good about it. So I'm gonna try not to touch this much anymore without the glass installed. After swapping power supplies, we'll be using our Nightjar 450 watt, this is a fanless SilverStone power supply. And while it might not have enough wattage to run the system under load, just for booting up for the first time, it should be just fine. I expect this will fix the issue. Actually, the more I look at this build and the symptom it's exhibiting, it doesn't seem like a short because if it was a short, usually what would happen is the system would power on and off very quickly, but then it wouldn't attempt to power back on over and over and over again like we're seeing here. If there's a short to ground or something, the power supply will notice that right away and just shut off entirely. So I'm more inclined to think that this is the power supply itself, maybe just something internally is tripping. And if it's not the power supply, if this doesn't fix the issue, then maybe the motherboard? I mean at that point, your guess is gonna be as good as mine. I'm crossing everything I got here in hopes that this is gonna work. I think it will. I am fairly confident. (I should just send this guy a new PC) Wow. (Our Computer it's Brokennn) Well there you go. Just on and off. This thing just doesn't wanna stay powered on! I don't get it. Are we getting a short somewhere on the case? Does he like, maybe he's missing standoffs or something? No, everything looks okay, I'm looking at the cutout behind the motherboard tray. Oh my gosh, I'm very confused by this. We're gonna have to start pulling major hardware components one at a time because I don't know where else to go with this. We could check RAM seeding and clearing the CMOS. I should've done that earlier, I always say to. But we'll check those two things right now. So I've got the JBAT one header right here, and with the power completely shut off on the system we're gonna hold our screwdriver across these two pins for about 15 to 20 seconds. And after also confirming that RAM is seeded correctly, we still get the same power cycling over and over. It just doesn't stop. So we're gonna be pulling apart the system piece by piece, starting first with the graphics card, it's one of the easiest things to remove. We'll try taking the card out first and seeing if that fixes the issue and if it doesn't then I guess we could also try just slotting in a GT 710, although if it's not gonna work without a card installed and it doesn't work with the card installed, I doubt that it's card-related. We'll just rule out that possibility, the very slight one, just to be safe. (sighs) And still nothing. Same flickering on and off, over and over again. Even with this 1060 removed and even with a GT 710 installed. You know, if we recall from his email, he said he swapped out his motherboard, I think he said that. Maybe it's the motherboard. I don't know if this is a new board or if it's a used one from another system or what, but at this point I'm starting to think it's the board. And again, I doubt CPU would be causing an issue like this, and I doubt DRAM will be causing an issue like this. I suppose we could isolate DRAM fairly quickly. I'll take care of that off-camera, and assuming that doesn't fix the issue, we're gonna have to swap this board out. The problem is this is an older Intel board, it looks like. It might be a newer one, I can't really tell. So I don't know if I have a replacement, at least in stock anyway, might have to order one. So it's definitely not memory, I've tried just one stick that I know works in every single slot to avoid the possibility of having one of these channels be dead, and that would be the reason why this boot cycles, but that's usually not the symptom of a dead channel anyway, usually DDR4 issues don't result in, yeah, what you're seeing here. So I did it just to be on the safe side before we swap out the motherboard, because that's gonna be one of the more labor intensive tasks in this troubleshooting process. So this board is an MPG Z390 Gaming Pro Carbon from MSI, definitely an Intel platform, and would ya look at this, I actually have an extra Z390 motherboard, one of the only ones I have left. This is an N7 Z390 ATX from NZXT that we know works. I've tested this, actually built with it, a few times and it's just been sitting in the closet since then. So this will make for a great swap. The only bad thing being we have to disconnect literally everything from this board to get it out, of course, and that takes a bit of time, it makes things a bit messy. We're gonna have to re-cable manage pretty much this entire build. I'm curious what CP he's got in here, obviously it's an Intel chip, it looks like it's a Core, okay, Core I7-8700 K, nice. I have actually used several of these in the past, they are excellent CPUs. I honestly wasn't intentionally trying to save the best for last, because this is what, episode 20 of \"Fix or Flop?\" We're gonna be ending the season with this episode and yeah, this one is really taking a toll. We're completely disassembling this build to fix it. We'll take this, thank ya very much. We'll also need this M.2, it shouldn't be a problem transferring this drive to the new motherboard because they are of the same chip set again. Now this is literally like a multiple organ transplant here, CPU and motherboard coming in and out. Of course the CPU is staying the same, but we are having to remove it and re-install it in a new board. And we'll also get the Samsung NVMe installed. Mounting gear is installed. RAM is installed, and this motherboard is almost ready to go. Everything's a bit tight here, we're gonna have to reroute a lot of these cables. We're gonna give her some fresh thermal compound. And I think we are ready to give this another shot. And I'm hoping this is the only other shot we have to take, because I'm hoping that the motherboard swap fixed this issue, if not, it's probably the CPU, 'cause that's literally the only other thing we haven't tried yet. So let's see, we need to jump it. I haven't reconnected all of the small connectors yet, I wanted to keep it simple just in case the motherboard swap didn't fix anything. And we'll jump the power pins. (machine hums) There we go! That'll do it. Motherboard, it was the motherboard. Never seen that happen before with any motherboard. I wish I had more of an explanation for it. We'll take a closer look at it in a second to see if there's anything obvious, maybe a physical defect, but I've never seen the kind of symptom we just saw where the motherboard is the thing that is causing a system to restart over and over and over again. That is so strange. So we've gotta POST now, and I think it's trying to load into the operating system. The boot volume in the NVME drive, that's good stuff. This system is ready to go, apart from the cable management and connecting smaller components, we need to take care of that. We also need to clean it up a bit, so I'm gonna take it outside and dust it. I've been looking at this motherboard for several minutes now. I don't see any obvious physical blemishes, things that would be obvious warning signs for what we were seeing with the resets. I suppose we should also check the socket. We could also take this heat sink off and check VRMs underneath. I think that if we had an issue with VRMs, we wouldn't get power at all. So yeah, the fact that we're just getting a hard reset over and over and over, I'm not really sure. I'm gonna check the socket because that's already exposed. So let's get on under here. Looks good, he had this all, oh, hold on a second. This here is definitely a bent pin. That does not look right. I can't tell if it's missing or if it's... It looks like it's just been pressed down a little too far. We might be able to save that, I'm gonna get a safety pin and see if I can pull it back up. I'm not sure if that alone would cause the system to continuously reset, but it's worth a shot because that definitely shouldn't be like that. And again, I don't see any other issue with this board, at least physically. You almost needs surgeon hands for this. I'm trying very carefully to not touch any of the other pins, it's kind of impossible. I'm not sure if this pin is gonna detach once I bend it back. It looks like it might already have. It was bent the other direction so all these pins are bending this way, and the one that was bent wasn't just pushed down, it was actually bent backwards. So I'm not sure when I bend this all the way back if it's gonna snap or not. I think it might already have, because I can't even see it anymore. I think maybe it's pressed... Okay, I see it, it's still there. Ugh, just barely. This is a very touchy procedure. Yep, it's broken. Hundred percent, I see it. It's just sitting in there now. And whatever that pin was... Oh man that sucks. I mean there's really nothing you can do when it's bent that hard in one direction, I mean you've already kinda compromised the material because when you try to bend it back it's just gonna get thinner and it's gonna wanna snap just like it just did. There's nothing I can do at this point if it's broken. Yeah, it's just, the socket is way too fine for me to take any of my tools to this to try to fix it. At this point, I would just go ahead and try to RMA it if I could and if I couldn't... Yeah, I don't know of any local repair shop that's gonna wanna tackle something like this. The pin is out right now missing and this isn't as simple to fix as PGA where the CPU has the pins. It's all very finely meshed in here. I'm trying to see if I can dig that broken pin out, but I can't. Yeah, that really sucks, there was really nothing I could do there. I'm willing to bet though, that that is the reason why his system was resetting over and over again. That is so strange, maybe just that one particular pin was responsible for it, of all the pins here that would have caused different issues, that one pin was the one that was causing the hard reset. So yeah, I guess we have to conclude this motherboard is dead because of that missing pin now. And well, I guess it's a good thing we already swapped out motherboards, right? So at this point, I guess it's just cable management and then a dusting. After that, this system will be good to go with the new motherboard. I'm gonna be rerouting a bunch of stuff at the front here, just to make his cable management look a lot cleaner. The back I won't touch too much because there are so many cables behind the motherboard tray. But we want the front to look clean because that's what most people will end up seeing, especially with a case this ostentatious, dare I say. Tighten the graphics card down. You can actually remove this ridiculous WiFi antenna at the top of this case here because the new motherboard we gave him has an integrated WiFi adapter, so that's nice. All right and I think cable runs look much, much cleaner now. Obviously we still need to clean the dust, but the cables look a lot better in my opinion. And we cleaned up a lot of stuff, like he had some cables running down here, he had his WiFi cable, as well as his power cable running along the top of this back foot here and I just thought it looked strange. So we're gonna have the power cable route behind the motherboard tray from here on out, just to keep as many cables out of sight as possible for that cleaner look. So let's take this thing outside, we're gonna dust it and then I'm also gonna clean the tempered glass, left and right panels, and then the system should be good to go. (motor whirs) Well, another build that arrives broken gets to leave fully functional. What a way to end season 1 of \"Fix or Flop.\" I'm so grateful for the feedback you guys have given us in this playlist, and for just the support outright, the click-through rate, everything. The analytics in these videos is just phenomenal. And it just motivates me to wanna do more, wanna do bigger and crazier things here on the channel. So thank you so much for that support. The fact that we can do this for free because of your viewership and the monetization that we can throw into these videos with external ads from sponsors and from YouTube directly via AdSense, it's just the icing on the cake. I can bring this back to the viewer and say, \"You owe me nothing, thank my viewers for watching the videos that I make.\" That's literally why I can do this for free. So that's just awesome, so thank you all so much for that. I am still a bit curious about the board that we swapped out. I wonder if it'll work now that that pin is completely removed. Because the way it was bent all the way back before, it might've been shorting, if that was like a ground pin. Maybe that whole socket was just shorting to ground and that's why it was resetting over and over. It's a possibility, so if we put a CPU in it now, and that pin ends up being just a ground pin, it might work, which would be pretty funny. Funny turn of events. I know the system still looks a bit dirty, if I had the time I would deep clean it. We have so many of these systems in the queue right now that I really don't wanna spend any more time on it because our goal ultimately was to get this thing to POST and to function fully, I should say. And it is doing that now. So if I have a bit of time, I will clean it up, dust it a bit, but there's just not enough time in the day, unfortunately to deep clean this rig. And it probably does deserve that because it came in here looking extremely dusty. And the fact that this case is an open air chassis, so to speak, is not really doing it any favors. That said, we did clean up a lot of the surface dust. I can see a bit more that I missed now that we're in better light here in the office, but I might tackle that off camera. That said, I think the viewer will be super happy with the fact that it is now fully functional and that he no longer has a motherboard with a broken socket pin. That is never news that you wanna hear. So we are prepping for season 2 of \"Fix or Flop,\" which will be coming in early 2022. And we've already got several people lined up in the queue. Every day it seems like I get emails from folks in the local area who have issues with their systems. And while it is great to have that kind of pool, right, to kinda sample from, it's also a bit unfortunate this many people are running into issues. And I know that there are some who are always thinking that people come in with the worst intentions, \"Oh, he intentionally sabotaged his rig so that he gets free stuff.\" Well, that's why I don't usually outright replace things that don't need to be replaced. If you intentionally sabotage your graphics card, I can tell you right away I'm not gonna have a replacement for you. And I tell folks this up front when I meet them in person, if it ends up being a graphics card, there's nothing I can do. The most I can do in that instance is tell you that it's your card, so that you know what to replace, so you don't have to part swap yourself. 'Cause a lot of folks don't have extra components to just throw in while troubleshooting and that's why they reach out to folks like me. Fortunately, we can do this again for free, thanks to your viewership. And so it's a bit less of a hassle and it doesn't really hurt anyone monetarily apart from maybe the gas needed to drive out. But other than that, the fact that we can do this as a free service is just the icing on the cake for me. And it really does make me feel really good about what we're able to do for this community here at the end of the day. So if you have appreciated the \"Fix or Flop\" series so far smash that like button, you have no idea how much that means to us, that feedback is so vital, it really is. Honestly, the comments, especially in the beginning when these videos are published and the like to dislike ratio, I care more about those than I do the sub count to be honest with you. It's why we never really celebrated when we passed 600,000 subs, we didn't celebrate when we just passed 700,000 subs a few days ago. It doesn't really mean as much to me. And look, I appreciate the subscriptions and I do encourage them, but at the end of the day, I know how easy it is to manipulate that number. I mean, there's so many channels out there who have botted subs. And you can tell, either their channels were doing really well at one point and now they've completely died, and so they have like a million subs but they pull a thousand views a video. Or they never were able to pull high viewership to begin with because all of their subscribers, or most of them I should say, were bots or just botted, right, they were purchased. We've never done anything like that, and I've taken pride in that because then I can look back at that number and say, \"Yeah, I actually earned those, I actually was able to to earn that number on my own and through my own merit.\" So that's why recently I haven't really cared too much about it because I know that that's what goes on. I'm not saying that other channels in this space do that, they might, I don't know. But I've just never really cared. At the end of the day I care more about viewership and the number of views a video gets, and again, that feedback, the like to dislike ratio and the comments. So if you have enjoyed this playlist so far, leave that feedback, and if you haven't as well, I don't wanna discourage folks from leaving negative comments. I mean, as long as it's constructive, you're not just being a dick, leave negative feedback if that's what you feel like you need to do. All of that is appreciated at the end of the day. So with that, thank you guys for watching this far into the video. And again, stay tuned for season 2 coming in early, early, early, early 2022. We have several builds already in the queue. That's all for this one, my name's Greg, thanks for fixing another system with me.",
    "transcript_keywords": [
        "power",
        "motherboard",
        "Fix",
        "system",
        "power supply",
        "pin",
        "thing",
        "bit",
        "issue",
        "back",
        "Fix or Flop",
        "things",
        "cable",
        "pins",
        "free",
        "card",
        "yeah",
        "time",
        "fix viewer systems",
        "RGB"
    ],
    "transcript_entity_values": [
        "first",
        "the end of the day",
        "ROG Strix",
        "GTA",
        "9",
        "PGA",
        "Orlando",
        "Corsair",
        "AdSense",
        "the season",
        "Samsung",
        "the day",
        "Hundred percent",
        "Minecraft",
        "GTX",
        "SilverStone",
        "RMA",
        "USB 2.0",
        "Core",
        "700,000",
        "SATA",
        "One",
        "two",
        "every single day",
        "600,000",
        "several minutes",
        "1060 6",
        "APDPS",
        "Core I7-8700 K",
        "CPU",
        "second",
        "Florida",
        "Gaming Pro Carbon",
        "YouTube",
        "today",
        "20",
        "a few days ago",
        "RGB",
        "Razer",
        "Chicken Nuggets",
        "IO",
        "N7",
        "early 2022",
        "one",
        "GPU",
        "A few moments later",
        "a few milliseconds",
        "NVME",
        "ASUS Strix",
        "RAM",
        "thousand",
        "Logitech",
        "GB",
        "Nightjar",
        "about 15 to 20 seconds",
        "Intel",
        "ATX",
        "Greg",
        "24",
        "Z390",
        "1060",
        "Brokennn",
        "CMOS",
        "Thermaltake",
        "season 2",
        "GT 710",
        "million",
        "Fix or Flop",
        "Lisa",
        "Every day",
        "POST",
        "a few days",
        "Grumpy Greg",
        "20",
        "NZXT",
        "MSI"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.12632642686367035,
        -0.0660787895321846,
        0.03870353102684021,
        -0.0678851529955864,
        0.09489025920629501,
        0.0037962186615914106,
        0.06710904091596603,
        0.02182110585272312,
        -0.09160412847995758,
        -0.0028889477252960205,
        0.08678033202886581,
        0.0678630918264389,
        -0.07161660492420197,
        0.03577820211648941,
        0.012391144409775734,
        0.027000442147254944,
        -0.004724978934973478,
        -0.02880185656249523,
        -0.023970628157258034,
        0.038920409977436066,
        -0.051458243280649185,
        -0.07153945416212082,
        -0.02818634919822216,
        -0.016538165509700775,
        -0.03995773568749428,
        -0.017318489030003548,
        -0.03300429880619049,
        0.011851228773593903,
        -0.08361858874559402,
        -0.023981565609574318,
        0.005183067638427019,
        0.031624685972929,
        -0.027610819786787033,
        0.04983845725655556,
        0.13597357273101807,
        -0.03619774803519249,
        0.013222062960267067,
        -0.016473406925797462,
        -0.12417514622211456,
        -0.02723684161901474,
        -0.041144177317619324,
        -0.02101694978773594,
        -0.017179185524582863,
        0.028953706845641136,
        0.07850219309329987,
        -0.0035082735121250153,
        0.027020465582609177,
        0.0062412056140601635,
        0.021959388628602028,
        0.04873679578304291,
        -0.06667576730251312,
        -0.0011818886268883944,
        0.06897096335887909,
        -0.05342252552509308,
        -0.03792550787329674,
        -0.015100634656846523,
        0.00964398868381977,
        -0.02770649641752243,
        0.013597855344414711,
        -0.07235518097877502,
        0.07346261292695999,
        -0.02722376026213169,
        -0.05335808917880058,
        0.06257364898920059,
        -0.03787299245595932,
        0.05853109061717987,
        0.07947540283203125,
        -0.07362425327301025,
        0.023519417271018028,
        0.027310242876410484,
        -0.10882814973592758,
        -0.039483387023210526,
        -0.04323473945260048,
        0.05336664617061615,
        -0.0031331507489085197,
        0.06480546295642853,
        -0.023815440014004707,
        -0.08979161083698273,
        0.05557536333799362,
        -0.010327696800231934,
        0.021412575617432594,
        -0.05741589143872261,
        -0.008036271668970585,
        0.029159823432564735,
        0.05135336518287659,
        0.02772521786391735,
        0.010936490260064602,
        0.007399287540465593,
        0.01513031404465437,
        -0.02777252532541752,
        -0.08425246179103851,
        0.03462783992290497,
        0.07430723309516907,
        -0.014690461568534374,
        0.051701780408620834,
        0.017684191465377808,
        0.0592733658850193,
        -0.020425764843821526,
        -0.09538384526968002,
        0.06084982678294182,
        -0.022490311414003372,
        -0.021755317226052284,
        0.08391042798757553,
        -0.07499568909406662,
        0.004067367874085903,
        -0.05340990424156189,
        -0.02513100579380989,
        0.014378631487488747,
        -0.04381555691361427,
        -0.028301555663347244,
        -0.003993818070739508,
        0.05446528270840645,
        -0.026149673387408257,
        -0.02677622064948082,
        0.10553476214408875,
        0.004989953711628914,
        -0.049685001373291016,
        0.07511371374130249,
        0.014521478675305843,
        -0.026450999081134796,
        -0.003045463701710105,
        -0.022355996072292328,
        -0.02304544486105442,
        -0.018816912546753883,
        0.05803711339831352,
        0.023444954305887222,
        -0.008746624924242496,
        6.278709118349363e-33,
        0.011317042633891106,
        0.05711527168750763,
        -0.020214298740029335,
        -0.037522751837968826,
        -0.019695673137903214,
        -0.0052342489361763,
        0.09177058935165405,
        0.03731894493103027,
        -0.010125030763447285,
        0.11505234986543655,
        0.008962585590779781,
        -0.017535274848341942,
        -0.04657479748129845,
        -0.037392474710941315,
        0.00705525791272521,
        -0.018489034846425056,
        -0.005222409963607788,
        0.023148884996771812,
        -0.1198737621307373,
        0.012106860056519508,
        -0.0474979393184185,
        -0.0385514497756958,
        0.025347847491502762,
        0.009646638296544552,
        0.02572842501103878,
        0.05249921604990959,
        -0.099664606153965,
        0.04616321995854378,
        0.11472447961568832,
        0.027379222214221954,
        -0.021671859547495842,
        -0.007039734162390232,
        -0.006658155936747789,
        -0.022160079330205917,
        -0.06474040448665619,
        -0.05931248143315315,
        -0.041684914380311966,
        -0.06704162806272507,
        -0.004103895276784897,
        0.013493756763637066,
        -0.04092806950211525,
        0.022072849795222282,
        -0.01142957340925932,
        -0.06202587112784386,
        0.035494402050971985,
        -0.023161375895142555,
        -0.006885499693453312,
        0.08147281408309937,
        0.03815757483243942,
        0.007081056945025921,
        -0.08524199575185776,
        0.015560535714030266,
        0.006659314036369324,
        0.006432036869227886,
        -0.09893961995840073,
        -0.0183244775980711,
        0.04204026237130165,
        0.0028472421690821648,
        0.032725609838962555,
        0.0667685717344284,
        0.07852937281131744,
        0.007488018833100796,
        0.04506887495517731,
        -0.032149869948625565,
        -0.006609771866351366,
        -0.02301911823451519,
        0.09655588865280151,
        0.023510346189141273,
        -0.028839103877544403,
        -0.030438866466283798,
        -0.011922583915293217,
        0.017468595877289772,
        -0.01962834596633911,
        -0.007243955507874489,
        0.05055796727538109,
        0.011942748911678791,
        -0.043690524995326996,
        0.006080341059714556,
        -0.05342806875705719,
        0.02094767428934574,
        -0.0025536012835800648,
        0.03127950429916382,
        0.0262521393597126,
        0.006434480659663677,
        -0.048752907663583755,
        -0.04320789873600006,
        -0.02634507231414318,
        0.022707777097821236,
        -0.0362185463309288,
        -0.0024973296094685793,
        -0.015817107632756233,
        -0.06265382468700409,
        -0.02355434000492096,
        0.009096802212297916,
        -0.008226883597671986,
        -6.100567357586061e-33,
        -0.022547679021954536,
        -0.09220969676971436,
        0.028061233460903168,
        0.04394185543060303,
        -0.04133205860853195,
        -0.0291957575827837,
        0.0384092777967453,
        0.002062906976789236,
        0.06114053726196289,
        -0.06683073937892914,
        -0.02490255795419216,
        0.036803558468818665,
        -0.09006047993898392,
        -0.03210049122571945,
        0.0007500121719203889,
        0.023144662380218506,
        -0.0803552195429802,
        -0.020169949159026146,
        0.036188628524541855,
        0.0471864752471447,
        0.10603898763656616,
        0.059620387852191925,
        0.04643263667821884,
        0.0636538714170456,
        -0.005001191981136799,
        0.08437541872262955,
        0.04403284937143326,
        0.004399653524160385,
        0.04407607018947601,
        0.04695620387792587,
        0.05706992745399475,
        0.07846090942621231,
        0.002971834037452936,
        0.053010713309049606,
        0.05134274438023567,
        -0.04253791272640228,
        0.05063391104340553,
        -0.020838750526309013,
        -0.061658766120672226,
        -0.08652131259441376,
        0.03621876984834671,
        0.07463224232196808,
        -0.04762052372097969,
        0.07775024324655533,
        0.029427651315927505,
        -0.0017696066061034799,
        -0.02203838899731636,
        -0.08190064132213593,
        -0.0028854815755039454,
        0.010528101585805416,
        -0.05770613253116608,
        -0.020084040239453316,
        -0.02433587610721588,
        -0.003947882913053036,
        -0.029508225619792938,
        0.06411229074001312,
        -0.04702622443437576,
        -0.016109047457575798,
        -0.0969499722123146,
        -0.0415135994553566,
        0.010752169415354729,
        0.031623441725969315,
        -0.039958227425813675,
        -0.045791078358888626,
        0.06535413861274719,
        0.05955754593014717,
        0.13040165603160858,
        0.08504268527030945,
        -0.0365184023976326,
        -0.04353232681751251,
        -0.056941937655210495,
        0.044012490659952164,
        0.015445156954228878,
        -0.1054735854268074,
        0.04638528451323509,
        0.06457173079252243,
        -0.05429011955857277,
        -0.017777778208255768,
        0.034848932176828384,
        0.018208665773272514,
        0.009664947167038918,
        -0.14144156873226166,
        -0.034954868257045746,
        0.0791829377412796,
        0.05616885796189308,
        -0.0034034934360533953,
        0.019272439181804657,
        0.06306824833154678,
        -0.002951783360913396,
        -0.06086651608347893,
        -0.051277898252010345,
        0.030574560165405273,
        0.04540064558386803,
        0.051946528255939484,
        0.017820175737142563,
        -6.39305142158264e-08,
        0.03005833923816681,
        0.07881662249565125,
        0.02274134010076523,
        0.009267719462513924,
        0.004576366860419512,
        -0.039125505834817886,
        -0.020800748839974403,
        0.05144999921321869,
        -0.009396787732839584,
        -0.035648446530103683,
        -0.019255291670560837,
        -0.06845644116401672,
        -0.018464287742972374,
        -0.003132243873551488,
        0.0393519252538681,
        -0.05624032020568848,
        -0.13210859894752502,
        0.15613272786140442,
        -0.07690874487161636,
        -0.0758124515414238,
        -0.005473270080983639,
        0.03611750528216362,
        0.13088908791542053,
        -0.03848767653107643,
        -0.009389009326696396,
        0.00828396063297987,
        -0.03431585803627968,
        0.03503118455410004,
        0.08822774142026901,
        -0.022216254845261574,
        -0.06451751291751862,
        -0.06905750185251236,
        0.0586702860891819,
        -0.003196310717612505,
        0.020731238648295403,
        -0.05040855333209038,
        0.02630573697388172,
        0.043128542602062225,
        0.1337788999080658,
        0.04102957993745804,
        -0.0375809520483017,
        -0.10699682682752609,
        -0.07172554731369019,
        0.007588373497128487,
        -0.03366357088088989,
        -0.03487148880958557,
        -0.02602539211511612,
        -0.05933377146720886,
        -0.03743233159184456,
        -0.05432341247797012,
        -0.040856026113033295,
        0.052605949342250824,
        -0.07002584636211395,
        0.056869182735681534,
        0.000334292883053422,
        0.00030655277078039944,
        0.02740379236638546,
        0.024323293939232826,
        0.060942236334085464,
        0.10791971534490585,
        -0.04959786683320999,
        -0.05110962688922882,
        -0.10560602694749832,
        0.051051266491413116
    ]
}