{
    "id": "zm5o8exbQN0",
    "title": "Samsung Galaxy Note 9 event in 11 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-09T17:39:51Z",
    "video_url": "https://www.youtube.com/watch?v=zm5o8exbQN0",
    "category": "Science & Technology",
    "tags": [
        "samsung",
        "samsung galaxy",
        "samsung mobile",
        "samsung galaxy smartwatch",
        "galaxy note 9",
        "note 9 samsung",
        "note9",
        "note 9",
        "the verge",
        "tech news",
        "samsung galaxy s9",
        "galaxy s9",
        "samsung galaxy unpacked",
        "samsung galaxy watch",
        "galaxy watch",
        "review",
        "hands-on",
        "smartphone",
        "first look",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "how to make",
        "diy",
        "mkbhd",
        "marques brownlee",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "smartwatch"
    ],
    "views": 546926,
    "likes": 7315,
    "comments_count": 1086,
    "description": "Samsung officially unveiled the Galaxy Note 9 with an all-new S Pen today alongside the long-rumored Galaxy Home smart speaker with Bixby built in. A new Galaxy Watch has also been announced, alongside a new Spotify partnership.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hello everyone, I'm so happy to be here today. So much has changed since I took the stage three and a half years ago. It is my great pleasure to present the all new Galaxy Note 9. (cheering and clapping) - For people who pack a ton into every moment, Note lets you do more. That's why we made the screen 6.4 inches, the largest ever on a Note. On the back of the device we centered the fingerprint scanner below the camera so that it's easier to reach. When it comes to color this year we went big and bold. We also added a flashy color to one of Note users' favorite features, and one that I use all the time, Screen Optimus. You shouldn't have to plan your day around your phone's battery life. That's why we created an all-day battery, the largest ever on a Note. You can power through your entire day with just the phone in your pocket. So Note 9 starts at a minimum of 128 gigabytes. You can also get a 512-gig version. Just like its predecessors, Note 9 also comes with expandable storage. And get this, soon with Samsung's upcoming 512-gig Micro SD card, you'll be able to get as much as one terabyte of memory. We wanted to make sure Note users could maximize performance so we gave Note 9 a cutting-edge 10 nanometer processor. It also supports super fast network speeds, up to a staggering 1.2 gigabits per second. So you can stream smoother and download faster. To get a truly great gaming experience on a smartphone, you need a device that packs a serious punch. Don't take it from me. Let's hear from someone who created one of the most popular games on the market today. - We're going to be launching the Fortnite Beta on Android this week. And players with Samsung Galaxy devices are the first to be invited, starting right now. Also gamers who play Fortnite on a Note 9 or Tab S4 will also get access to a special skin, Galaxy. - When it comes to games we know that people want to be able to see and hear every single detail, so Note 9 comes with AKG tuned stereo speakers, the loudest ever on a Note. For serious gamers, speed is everything. When your processor heats up, your gameplay slows down. Well Note 9 comes with our industry-leading, water-carbon cooling system. And a smart performance adjuster algorithm. Really, that just means that everything's gonna run smoothly even in the most intense gaming sessions. So we started with one of the most powerful smartphone cameras in the world and now we're building on that foundation with Note 9's brand new, intelligent camera. Now, we all know, when it comes to taking great pictures some things are always going to be out of our control. Well now whenever Note 9's camera detects a flaw, like closed eyes or image blur, it will automatically notify you. So you can take another shot before the moment's gone. Note 9's camera also uses scene recognition to identify different subjects like flowers, food, and a variety of landscapes, and then based on a scene, it optimizes the color tones. No matter how powerful your camera is, one thing it can't do is take a picture for you. Well what if you could take a better photo without all that hassle? Here, let me show you what I'm talking about. Let's get in here, alright, one two three. Alright there we go. I took those photos without even touching the phone. I used this. - The new S Pen has some pretty cool new functions. That's because now, it supports Bluetooth low energy to turn it into the ultimate remote control. So I don't smudge the screen with my greasy pizza hands. Take your selfie game to the next level. Or flip through some slides in Microsoft PowerPoint. While working the room. I've been controlling this presentation with my S Pen. Right now we're working with a handful of partners. Soon, we'll open up the SCK to everyone. To charge the S Pen, just put it back in your phone. A full charge takes less than a minute and lasts a whole half hour. Even better, you don't have to charge it to use all the other S Pen features you already know and love. DeX is designed for the work anywhere generation, and now it's simpler and more convenient than ever. Because the only thing you need to start DeX is this. It's a single HTMI adapter. And now, it's my pleasure to introduce another device to the Samsung ecosystem. Our all new Samsung smartwatch. - The Galaxy Watch is here. You can choose between two different sizes, any number of straps, and over 60 thousand watch faces. The Galaxy Watch has a high-res, AMOLED display with an integrated touch function. It has military grade durability, and Corning Gorilla DX Plus glass for added strength and scratch resistance. And it's water resistant, which means it's swim ready. It works perfectly with the new Note 9. Or you can use it by itself with standalone LTE connectivity. We're working with carriers around the world so you can stay connected no matter where you go. We built low power architecture and next generation panel level package technology into the processor created specifically for smartwatches. You can use the Galaxy Watch for several days on a single charge. You can even charge it as the same time as the Note 9 with our new wireless charger duo. The Galaxy Watch can monitor your heart rate, and establish a personal baseline. And when it senses a big change, like presenting at Unpacked, it can offer you a breathing guide to calm you down. You can choose from 39 different exercises. And it even detects six of the most common exercises automatically. The watch keeps track of your sleep patterns. It can tell you how long you were asleep and how much quality rest you got. With the new MyDay watch face, the watch syncs with my calendar so I can see when I'm free or busy with just a glance. - We are continuously refining Bixby so now on Note 9 it is more conversational, more personal, and useful. I need concerts in Brooklyn over Labor Day weekend. Oh, it's live for demo. - [Bixby] I didn't understand that. - You shouldn't. I need a concert in Brooklyn over Labor Day weekend. - [Bixby] I found these concerts in Brooklyn, New York during the Friday, August 31 weekend. - How about the first weekend in October? - [Bixby] I found these concerts in Brooklyn, New York during the Friday, October 5 weekend. - I need good restaurants in New York. - [Bixby] Here are some restaurants in New yOrk, New York. - Wala, Bixby knows that I like French food, so it listed a French restaurant at the top. - [Bixby] Should I make the reservation? - As you can see, Bixby has already filled in the number of people in my party, and the reservation time based on my previous bookings. All I have to do is tap the Reserve Table button. - [Bixby] Reservation details sent to email. - That's it. So far, you've seen what Bixby can do on Note 9, but what if everything I just showed you was also brought inside of your home? Well today for the first time, we are unveiling a brand new product that brings together Bixby, amazing sound, and elegant design. Are you ready? (Cheering and clapping) Listen. - [Woman] Hi Bixby. (dramatic music) Play music. (upbeat music) - All the sound you just heard came from these. 160 Galaxy Homes. It has elegant, circular form factor with six meter high range speakers that send a sound in every direction. And it has a subwoofer that provide deep, rich base as well. We've also integrated home and sound studio technologies which detects your location and optimizes sound based on where you are in the room. Just say, Hi Bixby, sounds to here. And the music is directed right at you. The Galaxy Home also has Bixby and the SmartThings hub built right in. So it gives you instant access to the largest open ecosystem of smart devices. We are excited to share more details about it soon. - We are so excited to introduce our go-to music partner for our multi-device ecosystem. (exciting music) - We are super excited about today's announcement. And it's just the start of things to come. Galaxy Note 9 will be available beginning on August 24. There's no one like you and there's nothing like the Note. Thank you. (cheering and clapping) - Please give a warm welcome to our special guest, Mr. Doodle. (clapping, cheering, and pop music) - Wait a minute. - What do you think? - That looks a lot like me, I don't know.",
    "transcript_keywords": [
        "Note",
        "Galaxy Note",
        "Galaxy Watch",
        "Galaxy",
        "Bixby",
        "Watch",
        "Samsung Galaxy devices",
        "York",
        "concerts in Brooklyn",
        "Samsung",
        "Pen",
        "Brooklyn",
        "Samsung Galaxy",
        "camera",
        "Labor Day weekend",
        "charge",
        "sound",
        "day",
        "weekend",
        "Labor Day"
    ],
    "transcript_entity_values": [
        "DeX",
        "New York",
        "several days",
        "this week",
        "one",
        "Bixby",
        "all-day",
        "Friday, August 31 weekend",
        "my S Pen",
        "Wala",
        "60 thousand",
        "LTE",
        "today",
        "Bixby",
        "Galaxy Homes",
        "Galaxy Note 9",
        "39",
        "October",
        "six meter",
        "SmartThings",
        "1.2 gigabits",
        "128 gigabytes",
        "between two",
        "six",
        "Samsung Galaxy",
        "the S Pen",
        "as much as one",
        "512",
        "AKG",
        "6.4 inches",
        "August 24",
        "10 nanometer",
        "Labor Day weekend",
        "Corning Gorilla DX Plus",
        "The Galaxy Watch",
        "Friday, October 5 weekend",
        "the Galaxy Watch",
        "the first weekend",
        "Samsung",
        "Galaxy",
        "French",
        "Note 9",
        "Micro SD",
        "MyDay",
        "three and a half years ago",
        "9",
        "this year",
        "The Galaxy Home",
        "Brooklyn",
        "HTMI",
        "the Fortnite Beta on Android",
        "SCK",
        "less than a minute",
        "Microsoft",
        "first",
        "Fortnite on a Note 9",
        "PowerPoint",
        "a whole half hour",
        "160",
        "New yOrk",
        "Doodle",
        "S Pen",
        "a ton",
        "a minute",
        "Tab S4"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "LAW",
        "ORG",
        "FAC",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "GPE",
        "PERSON",
        "EVENT",
        "QUANTITY",
        "TIME",
        "PERSON"
    ],
    "vector": [
        -0.09552468359470367,
        -0.0005816081538796425,
        0.08886327594518661,
        -0.04716647043824196,
        0.07679029554128647,
        0.036055248230695724,
        0.022733693942427635,
        0.08811420202255249,
        0.0031952986028045416,
        -0.0670149102807045,
        -0.013372502289712429,
        0.04822021350264549,
        -0.017430827021598816,
        0.02369461953639984,
        0.0435907207429409,
        -0.057837292551994324,
        0.04529252275824547,
        -0.13367967307567596,
        -0.036620769649744034,
        0.02815621718764305,
        -0.005058730952441692,
        -0.053877003490924835,
        0.06653832644224167,
        -0.02833726443350315,
        0.023613914847373962,
        0.020460618659853935,
        -0.008095514960587025,
        -0.06184808537364006,
        0.00580406142398715,
        -0.019035637378692627,
        -0.010157855227589607,
        0.07922372221946716,
        0.07266995310783386,
        0.03620403632521629,
        -0.058471519500017166,
        -0.10048652440309525,
        0.03844780474901199,
        -0.008590072393417358,
        -0.002504922915250063,
        -0.015626221895217896,
        -0.008463181555271149,
        -0.02978328801691532,
        0.07859739661216736,
        0.013499167747795582,
        -0.009895607829093933,
        -0.028788283467292786,
        0.05205167084932327,
        -0.00775477709248662,
        -0.04223519563674927,
        0.008097660727798939,
        -0.011998418718576431,
        -0.0692054033279419,
        -0.00041467745904810727,
        -0.0697956532239914,
        -0.0031685044523328543,
        0.014102342538535595,
        0.057780921459198,
        -0.031218085438013077,
        0.07615339756011963,
        -0.04219704121351242,
        0.066920205950737,
        0.0035341689363121986,
        0.008070139214396477,
        0.000875479425303638,
        -0.03696098178625107,
        0.04284871369600296,
        0.0345848873257637,
        -0.0380217507481575,
        0.0324048288166523,
        -0.020382538437843323,
        0.06818166375160217,
        0.04380819573998451,
        0.06484528630971909,
        -0.047207754105329514,
        0.03691128268837929,
        0.03925570473074913,
        0.026452690362930298,
        -0.017081502825021744,
        -0.09427561610937119,
        -0.05205176770687103,
        0.014027067460119724,
        -0.060043640434741974,
        -0.02710789628326893,
        0.05148916691541672,
        0.06136317923665047,
        -0.023192571476101875,
        -0.02212115190923214,
        0.040010012686252594,
        -0.12459579855203629,
        -0.028087209910154343,
        0.011555779725313187,
        0.09372539818286896,
        -0.10075128823518753,
        -0.0462297759950161,
        -0.04797916114330292,
        0.003428051481023431,
        -0.0768955647945404,
        -0.05648193135857582,
        0.0034172057639807463,
        0.03199271857738495,
        0.07986791431903839,
        0.08513854444026947,
        0.05573432892560959,
        0.05448981747031212,
        0.07267125695943832,
        -0.06672970950603485,
        -0.03899996727705002,
        0.022778475657105446,
        0.006311613135039806,
        -0.01110483705997467,
        0.08456327021121979,
        0.0329006128013134,
        0.024705419316887856,
        0.0342971533536911,
        -0.05859388783574104,
        -0.02989770472049713,
        -0.030729807913303375,
        0.05310073494911194,
        0.07243725657463074,
        0.12787127494812012,
        0.09324425458908081,
        0.029672497883439064,
        -0.1203155592083931,
        -0.08360235393047333,
        -0.021544141694903374,
        0.06620583683252335,
        -0.028033871203660965,
        2.8625247212010712e-33,
        0.029352646321058273,
        0.08603992313146591,
        -0.04134117811918259,
        -0.03328489512205124,
        0.037673890590667725,
        0.029072023928165436,
        -0.10591166466474533,
        0.022919615730643272,
        -0.06536829471588135,
        -0.06499070674180984,
        0.02460065297782421,
        0.008859761990606785,
        0.016155485063791275,
        0.08514972776174545,
        0.018459821119904518,
        -0.09188126772642136,
        -0.04271180182695389,
        0.04962488263845444,
        -0.049787506461143494,
        -0.011197068728506565,
        -0.01614522747695446,
        -0.06561587750911713,
        0.010328591801226139,
        -0.027340466156601906,
        0.06475670635700226,
        0.08339977264404297,
        0.07081999629735947,
        0.08098465949296951,
        0.01803690567612648,
        -0.03017783723771572,
        -0.08478523790836334,
        0.002765991725027561,
        0.05571145564317703,
        -0.03410762920975685,
        -0.002328623319044709,
        -0.045456498861312866,
        0.03273637220263481,
        -0.1080232784152031,
        0.035861559212207794,
        -0.07513466477394104,
        -0.015540627762675285,
        0.06604117155075073,
        -0.0790710523724556,
        -0.01743437349796295,
        0.011115067638456821,
        0.0830746442079544,
        -0.008027885109186172,
        0.007467812858521938,
        0.06704813987016678,
        -0.02482859045267105,
        -0.015738021582365036,
        -0.07176019996404648,
        -0.014030304737389088,
        -0.00030633495771326125,
        -0.028217462822794914,
        -0.06628389656543732,
        0.05571993440389633,
        -0.05982059985399246,
        -0.004174171481281519,
        -0.015520104207098484,
        0.03436322137713432,
        0.05249407887458801,
        -0.006809869781136513,
        0.036793190985918045,
        -0.1028270423412323,
        0.05432484298944473,
        -0.000311687879730016,
        0.003210473572835326,
        -0.017465725541114807,
        0.0007041131029836833,
        -0.01092718355357647,
        -0.030440261587500572,
        -0.005549520719796419,
        -0.04169170930981636,
        -0.0023888968862593174,
        -0.0030937560368329287,
        0.04749329015612602,
        -0.012636752799153328,
        0.05204048007726669,
        -0.05833517387509346,
        -0.02704600803554058,
        -0.05069565773010254,
        0.044330306351184845,
        -0.030712706968188286,
        -0.006335696205496788,
        -0.0030408785678446293,
        -0.026396378874778748,
        -0.10865657776594162,
        -0.03437892347574234,
        -0.04087821766734123,
        -0.02399035356938839,
        -0.016076939180493355,
        0.02108835056424141,
        -0.013439061120152473,
        -0.1358489841222763,
        -3.580652403546646e-33,
        -0.027853287756443024,
        -0.003306141821667552,
        -0.03922632709145546,
        -0.005507635418325663,
        -0.006499876733869314,
        -0.007034723646938801,
        0.04932185262441635,
        0.05139763280749321,
        -0.02768010087311268,
        -0.009172259829938412,
        0.027668790891766548,
        0.044658221304416656,
        0.0075652929954230785,
        -0.04090652987360954,
        -0.03123035468161106,
        -0.016987066715955734,
        0.06140986829996109,
        0.05123516172170639,
        -0.017633438110351562,
        -0.004020146559923887,
        0.02876206487417221,
        -0.023120766505599022,
        0.007835621945559978,
        0.0446002371609211,
        0.013360584154725075,
        0.03338523581624031,
        0.04995683953166008,
        -0.03882176801562309,
        0.00426462572067976,
        -0.05576489493250847,
        -0.018688566982746124,
        -0.06391681730747223,
        -0.07763676345348358,
        0.02667214535176754,
        0.06138281896710396,
        0.034548986703157425,
        0.08755447715520859,
        -0.06679803133010864,
        -0.005976902320981026,
        0.03600185364484787,
        0.03922121971845627,
        0.04839196801185608,
        -0.008442811667919159,
        0.011722882278263569,
        -0.047723256051540375,
        0.02208194136619568,
        -0.009126593358814716,
        0.09068074077367783,
        -0.1144951581954956,
        0.0077774785459041595,
        0.01899961568415165,
        -0.023466506972908974,
        0.0223830733448267,
        -0.0436328686773777,
        -0.09482047706842422,
        0.04086460545659065,
        0.06372885406017303,
        -0.007276554126292467,
        0.013779951259493828,
        0.026225034147500992,
        0.0009867546614259481,
        0.07571414113044739,
        -0.08843661099672318,
        -0.07458983361721039,
        -0.012097667902708054,
        0.020434487611055374,
        0.09030197560787201,
        0.05430141091346741,
        -0.01854637637734413,
        0.04638553783297539,
        -0.011098433285951614,
        0.02443569153547287,
        -0.07713690400123596,
        -0.05618203431367874,
        0.0012153302086517215,
        0.03891076147556305,
        -0.020811179652810097,
        -0.08438980579376221,
        -0.05729180946946144,
        -0.03901813179254532,
        0.00294873327948153,
        0.012444993481040001,
        0.062164872884750366,
        -0.024942250922322273,
        0.06537292152643204,
        0.03804105520248413,
        -0.024664247408509254,
        0.04076490178704262,
        -0.0321616604924202,
        0.07116473466157913,
        -0.06262174993753433,
        0.06369668245315552,
        -0.019835272803902626,
        0.0457116961479187,
        0.037674158811569214,
        -5.3801976207523694e-08,
        0.0010768300853669643,
        0.041326142847537994,
        0.01325426995754242,
        -0.06719843298196793,
        0.04302557185292244,
        -0.11060784012079239,
        0.040207475423812866,
        -0.042065881192684174,
        0.05438389629125595,
        0.011583060026168823,
        0.013731676153838634,
        -0.1309097409248352,
        -0.1175680011510849,
        -0.026726942509412766,
        0.06161703169345856,
        0.029977118596434593,
        -0.026070892810821533,
        -0.007844914682209492,
        -0.0525362566113472,
        -0.01660717837512493,
        -0.003973796963691711,
        0.056615959852933884,
        0.018724560737609863,
        -0.047447510063648224,
        0.021340737119317055,
        0.010148121044039726,
        -0.04673118144273758,
        0.1236150786280632,
        0.062443919479846954,
        -0.009073778986930847,
        0.014397664926946163,
        0.006899822968989611,
        -0.04687557741999626,
        -0.04555497691035271,
        -0.005002586171030998,
        -0.058857180178165436,
        0.019783612340688705,
        0.01399836502969265,
        0.13029207289218903,
        0.10438389331102371,
        -0.03629767522215843,
        -0.012149393558502197,
        -0.11612996459007263,
        0.06894315779209137,
        -0.05695202574133873,
        -0.100042924284935,
        0.0014324659714475274,
        -0.06301652640104294,
        -0.01446824986487627,
        0.06064777448773384,
        -0.03099588304758072,
        -0.05957530438899994,
        -0.050065893679857254,
        0.05054886266589165,
        0.026365041732788086,
        -0.021710466593503952,
        -0.0014304282376542687,
        0.05169285461306572,
        -0.01778608374297619,
        0.07770907133817673,
        0.09229738265275955,
        -0.025629766285419464,
        -0.033436186611652374,
        0.09368487447500229
    ]
}