{
    "id": "ZmFR8rvOsOY",
    "title": "ROG Phone 3 Teardown! - Is the 'Cooling'  Inside Real?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-08-19T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=ZmFR8rvOsOY",
    "category": "Howto & Style",
    "tags": [
        "ROG phone 3",
        "ROG phone",
        "Asus ROG",
        "ROG phone 3 teardown",
        "gaming phone",
        "smartphone",
        "best gaming phone",
        "mobile game",
        "android",
        "best flagship 2020"
    ],
    "views": 1729230,
    "likes": 69855,
    "comments_count": 3541,
    "description": "Its time to Teardown the ROG phone 3. Get your first audiobook and access to a monthly selection of Audible Originals for free when you try Audible for 30 days visit   or text \"jerryrig\" to 500 500! Gaming smartphones are some of the most fun to take apart. And this ROG Phone 3 is one of the coolest. Literally. Asus took their ROG phone design and made a functional cooling system with a solid metal heat sync right there under the glass. Super awesome. I'm impressed.   Watch the ROG Phone 3 durability test here:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.audible.com/jerryrig",
        "https://youtu.be/46cliWE9tHY",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So here we are face to face with one of the world's most powerful gaming smartphones: the ROG Phone 3. And judging by the looks of it, there are some secrets inside that need telling. Is this window actually looking into something useful, or is it all just decoration...for the third time in a row? There's only one way to find out. This video is sponsored by Audible. Let's get started. [Intro] Opening up the ROG 3 is a bit easier this time around. Without the exterior metal protrusion, the glass is just a single slab like other smartphones these days. There is no IP rating this time around either, and the glue isn't super excessive so the glass is easier to remove. You can see the tip of my razor blade through the transparent glass. Turns out though that the adhesive isn't just around the edge of the glass, it's also a little deeper into the phone surrounding that heat sink. But with a deeper slice it's still not too hard to reach and cut away. The back glass can start to peel off, exposing the white LED pad for the rear RGBs, as well as giving us a better look at that clear window of the phone. It's got a rainbow-like reflection over the glass and does give a realistic look into what's underneath it. At first touch the heatsink really does feel like real metal hard and cold...like Apple's heart while dealing with Fortnite in the app store. But cold thick metal also means it might actually be useful for removing heat this time. Keeping the powerful processors inside the phone cool while under load from extreme gaming or scrolling through the internet really fast. One app that actually won't need to use a lot of processing power is Audible. Thanks to Audible for sponsoring this video. I've personally gone through a few audio books during the last couple months. But the one that sticks out to me most is called Earth Abides. It's about a theoretical global pandemic that wiped out most of the population and how one guy survived. He details what happens to civilization, the roads, crops, and animals after humans are gone. And even more interesting, the novel was first written in 1949 so it gives a unique look into the past and how life was lived 70 years ago. You can get your first audio book for free going to audible.com/jerryrig or texting jerryrig to 500-500. And you can also get two free Audible Originals. Audible.com/jerryrig or text jerryrig to 500-500. One last little side note, Audible has an entirely free website set up for kids where they can listen to a massive selection of entertaining and educational stories to keep their minds active while schools are in limbo. Stories.audible.com. So if you know of any young-ins who need constructive entertainment for free, Audible has you covered. Now let's get back to this self-proclaimed aerodynamic system. It really is all metal. There are 11 little black screws holding the rear plastics in place and instead of the plastic backing coming off in two pieces, it's just one giant piece with the NFC pad attached as well. Let's take a closer look at the glass thermal vent. There is a hole in the glass supposedly to let heat escape out of the phone, and it does have water resistant mesh on the underside, which will also double to help keep dust and stuff out of the circuits as well. Kind of smart. There is a strange little raised board sticking out from the motherboard with its own builtin Lego-style connector. It's got 4 little pins on the back probably used for communicating with the RGB LEDs on that back glass. I'll start unplugging all the little ribbon cables down by the top of the battery. None of them look like the battery plug, but I'll just disconnect all of them to be safe. There is one more long extension ribbon going around the metal heat sink. And then finally we can remove the heat sink itself. It's held in place by two t4 screws. A little more decorative than the Phillips head. Since the whole thing is visible from the outside, it's got to look good. Take a look at that thermal paste galore. ROG really is using that slab of metal as a heat sink this time around, which is a substantial improvement over last year's decoration. Major thumbs up for that design upgrade. Oh, there's the battery connector. I'll just disconnect that really quick...like a little Lego. The flash also has its own little board, just like that smaller RGB board down at the bottom we lifted off earlier. Then I can remove the two motherboard screws, along with two more screws holding down the camera units. And I can take out the SIM card tray. This step is interchangeable with step number one if you're into that kind of thing. I'll unlatch the last ribbon cable plugged in between the copper pads, and pop off the front facing 24 megapixel camera. This guy films in 1080p. Then, with a little persuasion, the whole motherboard can come out of the phone, exposing even more thermal paste and copper below it. We'll explore that copper more thoroughly in just a second. But first let's remove the three rear cameras. The 64 megapixel main camera capable of filming in 8k, along with the 13 megapixel ultra wide camera in the center, and the 5 megapixel macro camera on the edge. None of which have optical image stabilization. The bottom loud speaker can come out next. This looks like it's downward firing but the frame of the phone redirects the sound out the front. And it does have some water resistant mesh on the opening. So while the ROG 3 doesn't have an official IP rating, it does have some liquid protection installed which is nice to see. There are no foam balls inside the speaker though. The one top loudspeaker is a bit smaller but still forward firing. And then we have the haptic vibration motor down here at the bottom. In the past ROG has installed two vibrators since it's a gaming phone. But this time around there is only one. And speaking of only one, there is only one magical battery pull tab under the left side of the battery. And it's rather quiet. Since it's only on one side of the battery I still do have to pry up the other side. But it's still better than nothing. Pulling the mammoth battery out of the frame and flipping it right side up, we can see that the battery is a 6,000 milliamp hour capacity. Pretty insane. For reference, the large iPhone 11 Pro Max has a 3969 milliamp hour battery. And the Samsung Galaxy Note 10 Plus has a 4300 milliamp hour capacity. Now that the battery is out we get to see another little secret the ROG's been hiding. Or I guess we could say large secret. There is an extreme amount of copper in here, spilling out from behind the battery all the way to the edge of the phone. Now normally I really do like to reassemble my phones into working devices after I'm finished with the tear down. But I think this vapor chamber is worth a look. Which means that we'll have to sacrifice the screen. I'll take out the tiny charging port first which actually doesn't have a rubber ring around the tip. So maybe the phone is not as water resistant as we thought. But it's interesting that each of the 4 microphones do have cute little water screens over the inside shaft openings. There are 4 microphones surrounding the sides of this phone for the noise canceling. Now for the screen. I'll use a little heat to help my razor get between the screen and the frame. And then a little brute force to finish off the separation. You can see that the surface of the glass is still intact. It's just the super fragile AMOLED screen underneath that is not intact. Either way though, mission accomplished. The screen folds open like a book and we get our first look at the flat non-camera lens first generation style fingerprint reader. It's rather large but it didn't end up working out very well for me. The screen is almost transparent enough to see my Teardown Skin through the pixels. Kind of cool. I'll peel off the layer of black tape and underneath that is more tape. But this time around it's made with more copper. Copper tape is covering the largest copper vapor chamber we've ever seen in a cell phone. I would even go as far to say that it's number 1. Smooth move Asus. Subtle. If you listen really carefully when I slice open the vapor chamber, you can hear the vacuum release. I'll open up the vapor chamber and slice through the mesh wicking layer inside and we can see the liquid slowly start to evaporate. The heat from the processor warms up the liquid inside of the vapor chamber and the mesh is there to wick the cooler liquid from the edges back into the chamber's center to help keep the processor cool. It's an interesting little cycle. Overall I'm impressed with the ROG Phone 3. They've improved their design quite a bit from last year's version. Instead of an aesthetic gimmick, it's turned into the most functional heat dissipation system we've ever come across inside of a cell phone. And they've even let us get a glimpse of all that coolness from outside with their little window. I'm always a fan of that. This is definitely the best ROG phone yet. And I'm already looking forward to seeing what they come up with next. Don't forget to grab your free audio book with the link in the description. If you have any questions, leave them down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Phone",
        "ROG Phone",
        "glass",
        "ROG",
        "battery",
        "heat",
        "Audible",
        "time",
        "heat sink",
        "copper",
        "inside",
        "vapor chamber",
        "face",
        "metal",
        "screen",
        "back glass",
        "face to face",
        "chamber",
        "free Audible Originals",
        "camera"
    ],
    "transcript_entity_values": [
        "Audible Originals",
        "70 years ago",
        "Twitter",
        "Lego",
        "1080p",
        "Instagram",
        "two",
        "1949",
        "3969 milliamp hour",
        "Pro Max",
        "three",
        "4300 milliamp hour",
        "1",
        "RGB",
        "ROG",
        "only one",
        "4",
        "Phillips",
        "SIM",
        "11",
        "last year's",
        "5",
        "Apple",
        "NFC",
        "24 megapixel",
        "Asus",
        "64",
        "first",
        "500-500",
        "second",
        "6,000 milliamp hour",
        "Earth",
        "13 megapixel",
        "these days",
        "third",
        "number one",
        "One",
        "ROG",
        "the last couple months",
        "Audible",
        "one",
        "8k",
        "Fortnite",
        "IP",
        "the Samsung Galaxy Note 10 Plus"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "LOC",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.15378621220588684,
        0.013091983273625374,
        0.026157358661293983,
        0.0006452497909776866,
        0.0683693215250969,
        -0.11123374849557877,
        0.03844885528087616,
        0.04403606429696083,
        -0.01748223416507244,
        0.014623758383095264,
        0.030985990539193153,
        0.03678630292415619,
        0.021045982837677002,
        -0.039204418659210205,
        0.029829222708940506,
        -0.06358128041028976,
        0.08566631376743317,
        -0.048952896147966385,
        -0.10388641059398651,
        0.022358279675245285,
        0.05633903294801712,
        -0.015024248510599136,
        0.0019572426099330187,
        -0.004800325259566307,
        0.07066039741039276,
        0.006022982764989138,
        -0.006959825754165649,
        0.030349209904670715,
        -0.0560799315571785,
        -0.0037024125922471285,
        0.0451335534453392,
        0.08694755285978317,
        -0.059034716337919235,
        -0.004276582971215248,
        0.02327866479754448,
        -0.03636574745178223,
        0.03952832892537117,
        -0.07536464929580688,
        -0.11209998279809952,
        -0.013882077299058437,
        -0.06302597373723984,
        -0.007392351981252432,
        0.08912535011768341,
        0.008419666439294815,
        0.010515394620597363,
        0.01315151434391737,
        0.032147735357284546,
        -0.07077993452548981,
        0.025635434314608574,
        -0.03595319390296936,
        -0.04025156423449516,
        -0.004862357396632433,
        0.03047858737409115,
        0.049990370869636536,
        -0.10608037561178207,
        0.11320395767688751,
        -0.04406636953353882,
        -0.06299568712711334,
        0.028205590322613716,
        0.011642878875136375,
        0.08922726660966873,
        0.043692152947187424,
        -0.08470255881547928,
        0.05595680698752403,
        0.02731814607977867,
        0.03990550711750984,
        -0.01770065911114216,
        -0.08154068887233734,
        0.03988104686141014,
        0.02802092581987381,
        -0.03157861530780792,
        0.00898216012865305,
        0.00239882105961442,
        0.027938973158597946,
        0.021429987624287605,
        0.07233745604753494,
        0.04192518815398216,
        -0.037029508501291275,
        -0.028276992961764336,
        0.023022880777716637,
        0.09599939733743668,
        -0.08717960119247437,
        0.03598214313387871,
        -0.030547110363841057,
        -0.0029998610261827707,
        0.0024017125833779573,
        0.07187072932720184,
        0.04344853013753891,
        -0.07331306487321854,
        -0.014654447324573994,
        -0.016900373622775078,
        0.07843972742557526,
        -0.0004106542037334293,
        -0.03744448348879814,
        -0.02462017349898815,
        -0.04630222171545029,
        -0.08928976207971573,
        -0.06794271618127823,
        -0.04133652150630951,
        0.03768317773938179,
        0.00420099962502718,
        -0.01082395575940609,
        0.06900425255298615,
        -0.0005101381102576852,
        0.05691331624984741,
        -0.04855851083993912,
        -0.11288104951381683,
        -0.008985435590147972,
        -0.040525466203689575,
        0.004521788097918034,
        -0.09111422300338745,
        0.012190240435302258,
        -0.005281335674226284,
        -0.027477959170937538,
        0.04543202742934227,
        0.0054659415036439896,
        -0.09634089469909668,
        0.06730885058641434,
        0.07305524498224258,
        0.013304664753377438,
        0.0450180284678936,
        0.0400790199637413,
        -0.05073123425245285,
        -0.0006469361251220107,
        0.11248910427093506,
        -0.005478690844029188,
        -0.023602385073900223,
        4.682754397233359e-33,
        0.0358743742108345,
        0.11808336526155472,
        0.013105149380862713,
        -0.005222138017416,
        -0.02329372800886631,
        0.006551881320774555,
        0.01384397130459547,
        0.0067402697168290615,
        -0.0057676928117871284,
        0.07280600070953369,
        0.0541502870619297,
        0.06108469516038895,
        -0.03189916908740997,
        7.846701191738248e-05,
        0.062421802431344986,
        -0.015991071239113808,
        -0.08607978373765945,
        -0.06497244536876678,
        -0.07552056759595871,
        0.038207054138183594,
        -0.02657845802605152,
        0.01311672106385231,
        0.024454455822706223,
        0.06561245024204254,
        0.06048917397856712,
        0.06625550240278244,
        0.0521511547267437,
        -0.002001324202865362,
        0.05012280121445656,
        0.02428348734974861,
        -0.04783700779080391,
        -0.04422759637236595,
        -0.02884656749665737,
        0.016737880185246468,
        -0.06881926208734512,
        0.041856613010168076,
        -0.12204340845346451,
        -0.1506785750389099,
        -0.011515982449054718,
        0.007690483704209328,
        0.01246242132037878,
        -0.004165418446063995,
        -0.012171421200037003,
        0.019261375069618225,
        0.004893508739769459,
        -0.03559568524360657,
        -0.0581359826028347,
        0.03924296423792839,
        -0.02612350881099701,
        -0.02350086160004139,
        -0.0035332010593265295,
        -0.03389687091112137,
        -0.005957499612122774,
        0.009483443573117256,
        -0.07087158411741257,
        -0.04050874710083008,
        0.052435003221035004,
        0.011630294844508171,
        0.06457705795764923,
        0.02355540171265602,
        0.05079110711812973,
        -0.04319773614406586,
        -0.02034442313015461,
        0.023686597123742104,
        -0.040351152420043945,
        0.025000177323818207,
        0.021709712222218513,
        -0.00829453393816948,
        -0.06825613975524902,
        -0.020883936434984207,
        -0.017375992611050606,
        -0.019307143986225128,
        0.0008867403375916183,
        -0.041651058942079544,
        0.045139748603105545,
        0.01839659921824932,
        -0.013587962836027145,
        -0.00998023059219122,
        -0.057258713990449905,
        -0.016347751021385193,
        -0.09128596633672714,
        -0.002185432706028223,
        0.059723131358623505,
        -0.01004782784730196,
        -0.01153340470045805,
        -0.11674722284078598,
        -0.000683097867295146,
        -0.10069795697927475,
        0.0008579689310863614,
        0.051396992057561874,
        -0.03746864199638367,
        -0.06693869829177856,
        -0.04255594313144684,
        0.04576006531715393,
        -0.013503319583833218,
        -4.942181225014038e-33,
        -0.0641816034913063,
        -0.05241968482732773,
        0.04345960170030594,
        0.05792213976383209,
        0.002681753132492304,
        -0.044249601662158966,
        0.07266131788492203,
        0.11909430474042892,
        0.01630536839365959,
        -0.10458450019359589,
        0.039659492671489716,
        0.03978601098060608,
        -0.026470862329006195,
        -0.084016814827919,
        0.08901438862085342,
        -0.08267243951559067,
        0.026594795286655426,
        -0.12313780188560486,
        0.037580691277980804,
        0.08758293837308884,
        0.029889076948165894,
        0.06596208363771439,
        0.0812804102897644,
        0.09793400764465332,
        0.00038637834950350225,
        -0.008481164462864399,
        0.04998917505145073,
        -0.08396981656551361,
        0.04654878377914429,
        -0.0021226119715720415,
        0.02781284786760807,
        -0.001884719356894493,
        -0.00377147039398551,
        0.05508354678750038,
        -0.00417792983353138,
        0.061885733157396317,
        0.0952058956027031,
        0.015428079292178154,
        -0.018246525898575783,
        -0.09819653630256653,
        0.047003693878650665,
        0.06226355955004692,
        -0.004794365260750055,
        -0.009780285879969597,
        -0.020560624077916145,
        -0.019422411918640137,
        -0.020758410915732384,
        -0.037551864981651306,
        -0.035834021866321564,
        -0.006724358536303043,
        0.04778124392032623,
        -0.05324593186378479,
        -0.019179606810212135,
        -7.761942555362111e-08,
        -0.0022164778783917427,
        -0.012449369765818119,
        0.027883455157279968,
        -0.07895267754793167,
        0.012753697112202644,
        -0.009929263032972813,
        0.13291721045970917,
        0.012734604999423027,
        -0.007508996874094009,
        -0.04624013230204582,
        -0.017082838341593742,
        0.022052275016903877,
        0.04578341543674469,
        0.010202904231846333,
        0.0024998863227665424,
        0.026918508112430573,
        0.03126801177859306,
        0.030651355162262917,
        -0.008428987115621567,
        -0.045562759041786194,
        0.05206141993403435,
        0.024447286501526833,
        -0.08399315923452377,
        0.010492483153939247,
        -0.06343547254800797,
        0.011143280193209648,
        -0.010083312168717384,
        -0.035950176417827606,
        0.015081757679581642,
        0.07545000314712524,
        0.1019977480173111,
        -0.0818866640329361,
        0.0006094574346207082,
        0.044409699738025665,
        -0.054751064628362656,
        -0.01862550713121891,
        -0.059392716735601425,
        -0.007167952135205269,
        0.004361114464700222,
        0.10518636554479599,
        0.003911647014319897,
        -5.1546155788173564e-08,
        0.04266244173049927,
        0.026091448962688446,
        0.05156293883919716,
        -0.00983122456818819,
        -0.016455955803394318,
        -0.02394505962729454,
        0.021829333156347275,
        -0.05094868689775467,
        0.019612055271863937,
        -0.005547239910811186,
        -0.01697522960603237,
        -0.06198221817612648,
        0.009698398411273956,
        0.061616405844688416,
        -0.05331425368785858,
        0.059608813375234604,
        -0.03748045116662979,
        0.08048190921545029,
        0.008539331145584583,
        -0.01682092994451523,
        -0.005087915807962418,
        0.0016434640856459737,
        0.07454854995012283,
        -0.0053259278647601604,
        0.07249889522790909,
        0.10286318510770798,
        -0.07760640978813171,
        -0.0008725720690563321,
        0.10868039727210999,
        0.014285828918218613,
        -0.054089222103357315,
        -0.049369025975465775,
        0.06392502039670944,
        0.0050720032304525375,
        -0.028846561908721924,
        -0.06387762725353241,
        0.01290743425488472,
        0.01410611905157566,
        0.08205682039260864,
        -0.027693478390574455,
        0.014331089332699776,
        -0.039524566382169724,
        -0.03133983537554741,
        0.05693751573562622,
        -0.014737006276845932,
        -0.07273264229297638,
        0.015321658924221992,
        -0.1492404043674469,
        -0.061708077788352966,
        0.023023314774036407,
        0.016945187002420425,
        -0.015317927114665508,
        -0.08934272825717926,
        0.0029939047526568174,
        -0.008278691209852695,
        -0.02170162834227085,
        0.04443269968032837,
        -0.03686011955142021,
        -0.01560173463076353,
        0.04410715773701668,
        -0.06437689810991287,
        -0.037029292434453964,
        -0.045414045453071594,
        0.08848696947097778
    ]
}