{
    "id": "ZmKPAVV6AIU",
    "title": "I haven't done this in YEARS - Lenovo Yoga Pro 9i",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-03-28T13:05:25Z",
    "video_url": "https://www.youtube.com/watch?v=ZmKPAVV6AIU",
    "category": "Science & Technology",
    "tags": [
        "lenovo",
        "lenovo yoga",
        "yoga pro 9i",
        "pro 9i",
        "slim pro 9i",
        "lenovo slim pro 9i",
        "i9",
        "laptop",
        "creator",
        "editing",
        "gaming",
        "austin",
        "austin evans"
    ],
    "views": 286695,
    "likes": 6845,
    "comments_count": 262,
    "description": "To learn more about the Yoga Pro 9i click:   Subscribe for more!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://www.lenovo.com/yoga",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today it is just me. So my friends over at Lenovo reached out and wanted to sponsor a video. I knew I couldn't just do a regular video. This is the Yoga Pro 9i, although here in North America, it's known as the Lenovo Slim Pro 9i. So when I started working on this video I had a call with Lenovo and they were kind of telling me about the Pro 9i and you know, some of the features and you know, obviously this is a very powerful laptop that is designed for creators. But for me, it got me thinking. It has been a long time since I have done a video solo. For some context, I have been making videos, by the time you watch this, for 14 years. This is the city where I shot videos for years. (train horn toots) I don't miss that at all. The amount of videos that have been shot right where I'm standing is incredible. Like, this is the place where I went from being a solo YouTuber to, by the time we left, having a team of over 10 people and multiple channels. It was like I came in one person and I left a very different one. While I love where we're at right now there was a really happy point in my life where I did all of this by myself. I'll be honest, some days it feels like I'm more of a business person than a YouTuber. And while I absolutely love the fact that I have an amazing team to help me do that, sometimes I just wanna do it on my own. When I had this opportunity from Lenovo to make this video on the Pro 9, it really made sense to me to come back, in a lot of ways, home, to talk about this laptop and make this video using the laptop. So I am actually using the Pro 9i to edit this video, to now only have a better appreciation for the power of this device, but also to have a little bit more appreciation for how far things have come. So lemme tell you a little bit about the Lenovo Yoga lines because things have evolved a lot over the last couple of years. So while traditionally Yogas have been convertibles, instead, one of the main things you'll see here that are actually a number of lines that are not convertibles. So you've got the All in ones, you've got these Slim line, as well as you've got the Pro line. And that's what I've got here today. It's something which is very much designed for professionals. When you think about what the Pro 9i is all about, it really is focused on delivering an incredibly high level of performance in a very slim and easy to carry chassis. While there is both a 14.5 and a 16 inch version of this laptop, for me it's not even a close competition. The 14.5 is absolutely the move for me. Now if you value a larger screen size, by all means the 16 is available. They're largely the same. It's a couple of minor advantages on the 16, like you've got a little bit better performance thanks to it's improved, you know, cooling assembly is physically larger. But there is a time where I dailied, 15 and 16 inch laptops. I did that though because I had to do that. Going down to a small laptop meant massively sacrificing the performance. But now you got a 4070, an RTX 4070 inside, Core i9. I've got 64 gigs of RAM in this laptop and it fits in a bag without even having to give it a second thought. So I've been editing the video you're watching so far on the Yoga Pro 9i today, and I have a few takeaways. First and foremost is the performance. So the Yoga Pro 9i comes in a wide variety of configurations. So this is pretty much the absolute max spec. It's outfitted with a Core i9 13905H which is a 14 core CPU. But importantly, Lenovo have also gotten a smaller overall package for the CPU, which basically means there's more room on the motherboard, you have larger fans inside, there's less internal space being taken up by that CPU. And on top of that there's also a performance advantage. Because the RAM can be so close to the actual CPU it means that we were actually getting even higher speeds, 6,400 megahertz with an RTX 4070 on board. Clearly there's a lot of GPU horsepower on tap. Now, don't get me wrong, this is not a gaming laptop. Now it does have a very nice 165 hertz display. I'll talk about that in a second, but it's meant much more so as a creative device. You can certainly game on this, and you know, I may or may not do a little bit on the side but it really is meant more for creative tasks. And through squirrels who are apparently very much happy to hang out. My dude, I don't have anything. One area where you were not sacrificing performance is with the display. So this is using what Lenovo call their PureSight Pro panels, 3K resolution, 165 hertz. I like the color accuracy and I also appreciate the fact that it does get really quite bright even when I'm outside trying to edit. Then there's the premium suite, which encompasses a number of different options. So, (beep). So I was editing this part of the video when I realized that it was not exactly a great idea to do an audio demo outside where there's wind and squirrels. So why don't I show you the premium suite in the studio. The webcam, as well as the IR sensor for Windows Hello facial recognition live above the display in a little sort of notch that allows you to easily not only open the laptop, but importantly has space for a high quality webcam. Also, this Pro 9i does have a little switch on the side of the laptop, which will immediately turn off the webcam. Now you're probably not supposed to do this while it's recording, but... I don't know what happens. Oh, it just shuts it off entirely. Okay, so if I turn it off, the webcam is completely disconnected and then if I flip it back on, it still works. Boy, I hope that didn't just ruin my recording. (chuckles) And to give you just a little sample, right now you are listening to these four microphones that are built into the Pro 9i. (upbeat music) The four speakers built into the Pro 9i are also really quite high quality. (upbeat music) The inputs here are also quite nice. You've got yourself a generously sized touch pad as well as a keyboard with 1.5 millimeters of key travel. I usually type somewhere in the neighborhood of 90 ish words per minute. All right, ready, and... Woo, okay, 80 words per minute. I choked there. I'm gonna do one more. I'm gonna do one more, just, you know. Boom, 102 words per minute, perfect accuracy. That's what I'm talking about. This is such a good keyboard. Obviously, laptop keyboards can be a variety of different types of okay to decent to pretty solid. And I would say this is absolutely on the top tier. I'm glad I did the second time. (laughs) On top of that, there's also a full two month subscription to the Adobe Creative Cloud. And importantly, it's not just a trial. Even if you already have a subscription to Adobe, all it'll do when you buy this laptop, you activate it, it'll give you two months off which is like $100 in legitimate value. And then there's the sustainability aspect to consider. So this laptop is using Tidal Teal as the color, which I absolutely love. On top of that it's using recycled aluminum, and you know, the packaging is eco-friendly. But when you combine that with the excellent port selection including dual USB-C / Thunderbolts, you've got a full size SD card reader, HDMI, you have two USB-As. It is so, so nice to have all the ports I need. Like, look, I completely understand that this is a sponsored video by Lenovo, right? There is no question about that. But if you ask me what is my ideal creator laptop, this is basically it. I love the look, I love the display, I love the performance, the port selection. There's not really a whole lot more that you can ask for, for a device, which is specifically designed for creatives. At the end of the day, there are of course a huge variety of different devices that can help you create the creative tasks that you want to. There's no right answer for everyone. But the fact that Lenovo have made a device, which is this competent in, essentially, every single way that I could possibly ask for, is incredibly impressive. So if you wanna know more, definitely be sure to go check it out at the link of the description. And big thank you to Lenovo for not only sponsoring this video but really giving me the incentive to get out here and make an old school video, come back to some of the old school spots we used to shoot. (sighs) Feels good, man. It really feels good.",
    "transcript_keywords": [
        "Pro",
        "Yoga Pro",
        "Lenovo Slim Pro",
        "video",
        "Lenovo",
        "laptop",
        "Lenovo Yoga lines",
        "Lenovo Yoga",
        "performance",
        "Yoga",
        "love",
        "Slim Pro",
        "CPU",
        "time",
        "videos",
        "Lenovo Slim",
        "Pro line",
        "North America",
        "creative",
        "bit"
    ],
    "transcript_entity_values": [
        "15",
        "the Yoga Pro",
        "90 ish",
        "over 10",
        "14.5",
        "Lenovo Yoga",
        "102",
        "YouTuber",
        "Slim",
        "RAM",
        "Core",
        "PureSight Pro",
        "hertz",
        "USB",
        "64",
        "1.5 millimeters",
        "6,400 megahertz",
        "North America",
        "two months",
        "USB-C / Thunderbolts",
        "two",
        "the end of the day",
        "like $100",
        "80",
        "four",
        "16 inch",
        "one",
        "165",
        "Windows",
        "second",
        "years",
        "IR",
        "4070",
        "Lenovo",
        "the Yoga Pro",
        "16",
        "the last couple of years",
        "14 years",
        "CPU",
        "SD",
        "the Adobe Creative Cloud",
        "some days",
        "Tidal Teal",
        "Adobe",
        "One",
        "14",
        "GPU",
        "today",
        "First",
        "the Pro 9",
        "3"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "LAW",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "EVENT",
        "CARDINAL"
    ],
    "vector": [
        0.003422820009291172,
        -0.09538053721189499,
        0.0011861316161230206,
        -0.07648725807666779,
        0.10715387761592865,
        0.06674898415803909,
        -0.004895102232694626,
        0.07675906270742416,
        0.0032382775098085403,
        -0.03312920406460762,
        0.04624708369374275,
        0.012715520337224007,
        -0.0037178187631070614,
        0.040597863495349884,
        0.03426668420433998,
        -0.037524767220020294,
        0.08548034727573395,
        -0.08472175151109695,
        -0.08480574190616608,
        0.01030691061168909,
        0.040229085832834244,
        -0.06994412839412689,
        0.08091668784618378,
        -0.00625382037833333,
        0.022815946489572525,
        0.02027757465839386,
        0.029862599447369576,
        -0.011036336421966553,
        -0.02322586625814438,
        -0.008042311295866966,
        0.029371289536356926,
        0.00722273625433445,
        -0.007068438921123743,
        0.0035935891792178154,
        0.009717858396470547,
        -0.012940538115799427,
        -0.018219204619526863,
        -0.01719851605594158,
        -0.07104722410440445,
        -0.040779147297143936,
        -0.001748897833749652,
        -0.03470724821090698,
        0.08955306559801102,
        -0.035097166895866394,
        0.013960832729935646,
        0.01595839112997055,
        0.11960077285766602,
        -0.08940297365188599,
        0.03489428758621216,
        -0.04673967882990837,
        -0.06343647837638855,
        -0.05785833299160004,
        0.052950020879507065,
        -0.02574586123228073,
        -0.01269473135471344,
        -0.031488385051488876,
        0.056370653212070465,
        -0.03701089322566986,
        0.0015912347007542849,
        -0.007893621921539307,
        0.0826541930437088,
        -0.05990727245807648,
        0.01115136407315731,
        0.03391579911112785,
        0.014771753922104836,
        -0.010921075940132141,
        0.06751689314842224,
        -0.005190728697925806,
        0.06052185967564583,
        -0.015151151455938816,
        -0.048699188977479935,
        0.06250660121440887,
        -0.044365596026182175,
        0.026521001011133194,
        -0.04560234397649765,
        -0.03992306813597679,
        0.026811018586158752,
        -0.04161534085869789,
        0.0015202481299638748,
        0.03414260223507881,
        0.08251838386058807,
        0.04897795990109444,
        0.045714784413576126,
        -0.03983527794480324,
        -0.0011686348589137197,
        0.005983265582472086,
        0.07612506300210953,
        0.07639781385660172,
        -0.010936891660094261,
        -0.06995843350887299,
        -0.08138466626405716,
        0.09276148676872253,
        -0.054914526641368866,
        -0.05249325558543205,
        -0.006148819345980883,
        -0.04939469322562218,
        -0.08064249902963638,
        -0.07416853308677673,
        -0.04659529775381088,
        0.060202669352293015,
        0.003439286956563592,
        -0.016862815245985985,
        0.07303470373153687,
        -0.00556353060528636,
        -0.030569124966859818,
        -0.0015295494813472033,
        0.02063622698187828,
        0.07762326300144196,
        -0.004432455636560917,
        0.08048500865697861,
        -0.029018312692642212,
        0.022695569321513176,
        -0.05631066858768463,
        0.060616910457611084,
        0.024052945896983147,
        0.04781593009829521,
        -0.09198925644159317,
        0.06473008543252945,
        -0.013512259349226952,
        0.08481036126613617,
        0.002922912361100316,
        -0.0750708132982254,
        0.034301161766052246,
        -0.041056644171476364,
        -0.014999755658209324,
        0.018834855407476425,
        -0.06993518769741058,
        2.8466608739237475e-33,
        0.038450099527835846,
        0.026170432567596436,
        -0.01391708292067051,
        0.025602741166949272,
        0.024060344323515892,
        -0.03914813697338104,
        -0.08316884189844131,
        0.02443927526473999,
        0.014341084286570549,
        -0.0030216823797672987,
        0.016176801174879074,
        -0.09338526427745819,
        -0.015403673984110355,
        0.03006373904645443,
        0.07519213855266571,
        -0.08472291380167007,
        -0.06085307151079178,
        0.00565711734816432,
        0.02240936830639839,
        -0.0014354268787428737,
        0.045045021921396255,
        -0.01945183053612709,
        -0.01027530524879694,
        -0.06697068363428116,
        -0.04951541870832443,
        0.0092331413179636,
        0.06298045068979263,
        0.03119897097349167,
        0.048199620097875595,
        -0.01095549575984478,
        -0.08933164179325104,
        -0.03323681280016899,
        -0.06189361587166786,
        -0.10383621603250504,
        0.08390635997056961,
        0.008084830828011036,
        -0.0011898489901795983,
        -0.064470574259758,
        0.042615436017513275,
        0.016233356669545174,
        -0.04868239164352417,
        0.05795569345355034,
        -0.03257846459746361,
        -0.10482309013605118,
        0.05244506150484085,
        0.03554922342300415,
        0.08204521983861923,
        0.018409404903650284,
        -0.07041099667549133,
        -0.019859833642840385,
        -0.01838119514286518,
        0.02787412516772747,
        0.0390157476067543,
        -0.09253556281328201,
        -0.05034231022000313,
        -0.0004975214833393693,
        0.07214070856571198,
        -0.024557437747716904,
        0.09285415709018707,
        0.06292583793401718,
        -0.0006588464602828026,
        -0.06243681162595749,
        -0.08291234076023102,
        0.035942599177360535,
        -0.13555291295051575,
        0.021572276949882507,
        0.04390788823366165,
        0.010167998261749744,
        0.09219790995121002,
        0.02061116322875023,
        -0.001322051277384162,
        -0.027826733887195587,
        -0.014422859996557236,
        -0.08514494448900223,
        0.04105263948440552,
        0.008475776761770248,
        -0.005562791135162115,
        0.02544453740119934,
        -0.0330289825797081,
        0.09170104563236237,
        0.009058341383934021,
        0.025309748947620392,
        -0.014738193713128567,
        0.052925147116184235,
        0.03897307440638542,
        0.023059433326125145,
        -0.06106318160891533,
        -0.08994705975055695,
        -0.039969541132450104,
        0.008786634542047977,
        -0.0011808755807578564,
        -0.014416983351111412,
        -0.018634464591741562,
        -0.022082077339291573,
        0.010211195796728134,
        -2.617647391076703e-33,
        -0.0009866110049188137,
        0.011184756644070148,
        0.03461023047566414,
        -0.047494132071733475,
        0.09240925312042236,
        -0.014223066158592701,
        0.03555038943886757,
        0.03343468904495239,
        -0.01899993233382702,
        -0.08203914761543274,
        -0.03919168934226036,
        -0.06977188587188721,
        -0.04258856177330017,
        -0.03748592734336853,
        -0.053676944226026535,
        -0.02084837667644024,
        -0.012391390278935432,
        -0.05875319615006447,
        -0.05695395544171333,
        -0.00482485955581069,
        0.09116863459348679,
        0.058329954743385315,
        0.05742243677377701,
        -0.08740876615047455,
        -0.028170805424451828,
        0.03301391005516052,
        -0.020199093967676163,
        0.11752855777740479,
        0.05641875043511391,
        -0.0035416276659816504,
        0.06406101584434509,
        -0.1075109988451004,
        -0.08893734961748123,
        0.016412854194641113,
        0.017957821488380432,
        0.009820112027227879,
        0.039964709430933,
        -0.002343063009902835,
        -0.04225511848926544,
        -0.0032997617963701487,
        0.11548329144716263,
        0.06388093531131744,
        -0.0438830740749836,
        -0.06694286316633224,
        -0.013772131875157356,
        0.0049330913461744785,
        -0.09255128353834152,
        -0.028142977505922318,
        -0.04482971876859665,
        -0.04521885886788368,
        -0.04793516546487808,
        0.05700370669364929,
        -0.07632052898406982,
        -0.06951995193958282,
        -0.0019684405997395515,
        -0.06820960342884064,
        0.050234608352184296,
        0.0156226372346282,
        0.006949881091713905,
        0.02206830494105816,
        -0.025531040504574776,
        0.027676010504364967,
        -0.04954778403043747,
        0.01639641262590885,
        -0.025526760146021843,
        0.0470467135310173,
        0.0739135593175888,
        0.04635234922170639,
        -0.0356261245906353,
        -0.018275119364261627,
        -0.006810396909713745,
        -0.028071679174900055,
        -0.04142940044403076,
        -0.01360398717224598,
        -0.022210123017430305,
        0.006367634981870651,
        0.02557912841439247,
        0.002118987962603569,
        0.03218073770403862,
        -0.0316305011510849,
        -0.04757115989923477,
        -0.14510777592658997,
        0.018767014145851135,
        -0.0034125586971640587,
        0.1127447783946991,
        0.12667106091976166,
        0.06581572443246841,
        -0.04435739666223526,
        0.016872664913535118,
        0.05072631686925888,
        0.028614884242415428,
        0.11241385340690613,
        -0.02014102414250374,
        0.07993465662002563,
        0.033586353063583374,
        -4.8021430387734654e-08,
        -0.023079287260770798,
        -0.018285997211933136,
        0.06991390883922577,
        0.05981748551130295,
        -0.03337988629937172,
        -0.05676836892962456,
        0.03616926819086075,
        -0.03004356659948826,
        0.06358619034290314,
        -0.03379247337579727,
        0.017933115363121033,
        -0.07755492627620697,
        -0.022037789225578308,
        0.05261661857366562,
        0.004767099395394325,
        0.04407332092523575,
        0.047714076936244965,
        0.08895757049322128,
        -0.03266163542866707,
        0.05451176315546036,
        -0.025031959637999535,
        -0.0504097081720829,
        0.10220900177955627,
        -0.031859032809734344,
        -0.04981118440628052,
        0.03095780871808529,
        -0.018851207569241524,
        0.042534418404102325,
        0.012141522951424122,
        -0.05168337747454643,
        -0.04413601756095886,
        0.027290813624858856,
        -0.04855626821517944,
        -0.07620525360107422,
        -0.00584001000970602,
        -0.08602456748485565,
        0.0509958453476429,
        0.026127874851226807,
        -0.010099604725837708,
        0.0708765760064125,
        -0.03630584478378296,
        -0.03544562682509422,
        0.03804812207818031,
        0.04548279941082001,
        0.031256504356861115,
        0.060679126530885696,
        -0.034712836146354675,
        -0.0791681632399559,
        -0.00025637500220909715,
        0.06894668936729431,
        0.005243956111371517,
        0.023236015811562538,
        0.017853787168860435,
        0.08154164999723434,
        0.02833973430097103,
        0.037338998168706894,
        0.01975368894636631,
        0.032364316284656525,
        -0.078133225440979,
        0.09655535221099854,
        0.10188868641853333,
        -0.06860718876123428,
        -0.039901696145534515,
        -0.020895425230264664
    ]
}