{
    "id": "zPUEh4DKsZk",
    "title": "iPhone XS Max Review: The Phone I Hate To Love",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-09-29T23:58:17Z",
    "video_url": "https://www.youtube.com/watch?v=zPUEh4DKsZk",
    "category": "Science & Technology",
    "tags": [
        "iphone xs review",
        "iPhone xs max review",
        "iPhone vs galaxy",
        "iPhone xs max vs galaxy note 9",
        "iPhone vs note",
        "iPhone vs android",
        "iphone xs max",
        "iphone xr",
        "iphone xs hands-on",
        "apple watch series 4",
        "apple event 2018",
        "mrmobile",
        "michael fisher",
        "imore"
    ],
    "views": 2905510,
    "likes": 30446,
    "comments_count": 3723,
    "description": "A long video for a big phone: the iPhone XS Max Review is here! Sponsored by Tech21. Use code MRMOBILE-15 for 15% off cases (  ) and screen protection ( )      [iPHONE XS MAX REVIEW]  The iPhone XS Max does everything Apple set out to do. It crams a colossal screen into a manageable casing; gives it a battery big enough to last all day despite that display; and it brings improvements in everything from the camera to Face ID to iOS itself to fashion a worth competitor to that other gigantic phone across the Android aisle: Samsungs Galaxy Note 9. But the iPhone XS Max also carries a price tag starting at $1099, and despite how many people will buy it at that price  I cant say Ill be one of them. Join me for the iPhone XS Max Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT THIS VIDEO]  MrMobiles iPhone XS Max Review was produced following eight days using an iPhone XS Max review device purchased by Mobile Nations. Retail device running final software. Tested on Project Fi / T-Mobile US in Greater Boston, MA and New York City, NY.   [LINKS]  iPhone XS / iPhone XS Max Review [iMore]:   iPhone XS / iPhone XS Max Review [Rene Ritchie]:    [MUSIC]  Neon Lights by Max Brodie, available at Premium Beat:   Ultra Boost by Cymatix, available at Premium Beat:   True Persistence by Cymatix, available at Premium Beat:      [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #iphoneXS #iphoneXSmax #iphoneXR #iphone2018 #iphone #apple #galaxynote9",
    "description_links": [
        "http://bit.ly/mrmob_ipxs",
        "http://bit.ly/iphonexs_screen",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.imore.com/iphone-xs-review",
        "https://www.youtube.com/watch?v=5Z1YSZh51uY",
        "https://www.premiumbeat.com/royalty-free-tracks/neon-lights",
        "https://www.premiumbeat.com/royalty-free-tracks/ultra-boost",
        "https://www.premiumbeat.com/royalty-free-tracks/true-persistence",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "(techno pop music) - When Apple announced to the world that the price tag on it's iPhone XS Max would start at $1100, my reaction went like this. Now that's not because I'm inherently averse to four-figure smartphones. As I said in my latest Samsung review, the Galaxy Note9 packs in enough capability to justify it's price. But when Apple does it, it's different. Because, let's get right into it, this is the company that continues to ship these top-end phones with the very slowest charger you can find. You wanna a faster top-up, that'll be $50 for the charger, please. Oh, and don't forget the $19 cable, either, which is also the only way you can connect to a new MacBook without a dongle. This is the company that, more than any other, is responsible for the inconvenient omission of the headphone jack on phones. Until now, it's offered the convenience of an adapter in the box, so you can still use your own headphones. Well, no more. That'll be $9. And while everyone else is standardizing around USB-C for their charging ports, Apple stubbornly sticks with it's own lightning port. That means, when I go on a trip, I can charge my Android phone, Bluetooth headphones, laptop and gaming console, all using a single cable. When I toss in an iPhone, not so much. And so the question then becomes, how, despite all of this, is Apple still a trillion dollar company? Or maybe, more directly, why do people keep buying iPhones? (rock music) You don't need to look any further than my own comment section to see the reflexive answer to that question, that the company's customers are sheep who will buy anything with an Apple logo on it. Obviously, that's garbage. The truth is tougher for some to swallow. This, right here, really is one of the best smartphones you can buy. And even as someone who prefers Android, I'm here to tell ya, it's better, in some ways, than your Android phone. Take the screen. DisplayMate says the OLED panel on the iPhone XS Max has close to textbook perfect calibration and performance. But that's not really all that special. You can also get a nearly perfect display on the aforementioned Galaxy Note 9. Where Apple stands out is in how it builds that display into the phone. Almost everyone has a notch in their phones thee days, but Apple is one of the only companies I've seen that doesn't also introduce an unsightly chin below the display. That's because Apple's design folds the OLED panel back on itself giving more room for the display controller which, no doubt, increases the cost of manufacture. Also driving up those costs is the reason the notch is there in the first place. An improved cluster of cameras and sensors for Face ID, which lets you unlock the phone just by looking at it. This is the first year Apple is replacing fingerprint sensors with Face ID across the whole lineup. Well I kinda ranted about that when the news first broke, a week with the phone has gotten me used to it. Watching all my waiting messages unlock as the phone recognizes my face still feels like wizard magic. And while I still think fingerprint sensors are more convenient, Face ID is now fast and reliable enough that, if you told me I had to use it exclusively, I could live with it. Also faster and more reliable, wireless charging, which I had to use in a hotel room recently because I'd forgotten to pack a lightning cable. (slow upbeat music) The iPhone XS Max scores another win with iOS 12. Gestures were introduced in last year's iPhone X, but they've been honed here. It's now much easier to trigger reachability with a swipe down on the gesture bar which brings notifications within range of your thumb. Those notifications are also now grouped into batches by app, making them much easier to deal with. I've really gotten into the swing of fast app switching by swiping on the gesture bar. And it's just as handy today as it was when palm first introduced it back in 2009. And, while iOS's system-wide back gesture isn't new, it's especially handy on a phone as big as the Max. You just swipe from the left side to go back in basically any app. It's great. I'm also seeing what others have reported since iOS 12 dropped. Performance is very fast, in particular with respect to launching the camera, which we'll come to in a second. Battery life is also quite good. The XS Max usually got me to bed after a 14-hour day, with about 20% remaining. In my kind of usage, which is heavy on streaming audio over Bluetooth, that endurance puts this iPhone behind Huawei and Blackberry and slightly ahead of the Galaxy Note9. I still have all my usual issues with iOS. The boring grid of apps. The lack of customizability. The confusing button assignments and the strangely unbalanced looking power screen. It's like they didn't finish it. And Siri continues to kind of wallow along as a sometimes helpful, but usually not, sidekick. But making up for all that is a catalog of higher quality apps that are almost always more fully-featured to use than their Android counterparts. The exceptions tend to be Google apps like YouTube Studio, which stutter more on the iPhone. As I say, that's all familiar stuff but the silicon driving the experience is brand new. Apple's new A12 processor is built on a seven nanometer process, which is technically, very interesting, but we're tight on time, so I'm gonna skip past it and just tell you that it powers everything from the dialer app to the enhanced camera features. The former produces the very same crisp quality voice calls as the prior model, while the latter, well, take a look. (techno music) To give the iPhone XS Max the full credit it deserves, this is a camera I'd trust with almost any task I usually come upon. And, as you saw before, that includes filming a walk and talk on a suburban sidewalk. The ad spot you'll see at the end of this video has some excellent slow motion clips from the XS Max to go along with this one. And if you need more features than the simple camera app offers, there are plenty of options in the app store. But by now, you've probably heard of the strange beautification effects the new HDR mode has on selfies. More annoying to me is that this phone still doesn't do portrait shots any better than most, glasses or headphone wearers be forewarned. And even though the lighting effects are now, apparently, out of beta, well, it doesn't always seem like it. ( ) Anecdotally, in some side-by-side shooting with the Galaxy Note9, I found colors more accurate and appealing from the Samsung device, a sentiment many of you agreed with on Instagram. And I found Google's Pixel 2 still gave me the more visually-satisfying shots on the whole, even if it's using heavy processing to do it. (techno music) There's so much more to say about the iPhone XS Max. And, if you want a true deep dive by the very epitome of an Apple connoisseur, I learned a ton from Renee Ritchie's 26-minute video over at Vector, which I'll link you to in the description, along with the written review at iMore. But as happy as the iPhone XS Max will make the devout Apple user, I just can't get past that price tag. Look, there are great arguments for the Apple ecosystem, from the awesome backup and restore, to the focus on privacy, and, more shallowly, this phone just looks and feel so good. But we used to be able to buy these benefits for like half of what the iPhone XS costs. And we used to enjoy more attention to detail in return. Those portrait errors I talked about, the curious asymmetry of the bottom speaker grilles, the way you can barely feel the joint between the steel rail and the glass back on your palm. Those are tiny little quibbles, yeah, but they're exactly the kind of details that Apple of old used to obsess over to justify its prices. Forgive the generalization, but the new Apple just seems to be happy charging you more, while, in some ways, offering you less. While I'm sure the company is right that many people are already plunking down the dollars for that privilege, it's not for me. Not when there are phones across the aisle in the Android world, that cost almost universally less, offer a much wider array of exciting diversity, and which, most importantly, let you live your mobile life your way. And, just like I said on the Galaxy Note 9 review, a glass phone is still a glass phone. So protect it with a special case from today's sponsor, Tech 21, at a special price for Mr. Mobile viewers. Tech 21's EVO Check cases come in fun new colors and the pure soda trims even have built-in bubbles. Bubbles, because, soda, get it? More importantly, Tech 21 cases pack impact-absorbing materials called flex shock and bullet shield, that are as tough as they sound. They're drop-tested 20 times to keep your phone protected from drops over 10 feet, and they don't interfere with wireless charging either. Get 15% off your Tech21 case for the iPhone XS, or almost any phone, at the link in the description below. And thanks to Tech21 for sponsoring this video. As always, folks, there was a lot to cover in this video, and I didn't get to cover nearly half of what I wanted to. So hit me up in the comments, or, on these social channels, with questions I may not have gotten to in the video. And if you're a XS Max owner, I especially wanna hear from you. Let me know how you feel about the biggest iPhone yet. Until next time, thanks for watching. And stay mobile, my friends. (electronic music)",
    "transcript_keywords": [
        "Apple",
        "phone",
        "Max",
        "iPhone XS Max",
        "iPhone",
        "Apple announced",
        "Android phone",
        "Android",
        "Galaxy",
        "app",
        "phones",
        "Galaxy Note",
        "company",
        "Face",
        "glass phone",
        "back",
        "video",
        "year Apple",
        "camera",
        "price"
    ],
    "transcript_entity_values": [
        "Huawei",
        "DisplayMate",
        "iPhone X",
        "1100",
        "nearly half",
        "the XS Max",
        "last year's",
        "Instagram",
        "26-minute",
        "9",
        "2009",
        "15%",
        "USB-C",
        "Samsung",
        "the first year",
        "iMore",
        "Apple",
        "A12",
        "a week",
        "Pixel 2",
        "OLED",
        "YouTube Studio",
        "Apple of old",
        "four",
        "about 20%",
        "EVO",
        "Bluetooth",
        "trillion dollar",
        "Face ID",
        "Mobile",
        "MacBook",
        "19",
        "today",
        "like half",
        "iPhone",
        "20",
        "first",
        "seven nanometer",
        "jack",
        "Google",
        "iOS 12",
        "Galaxy Note 9",
        "Vector",
        "iPhone XS Max",
        "Siri",
        "Galaxy Note9",
        "second",
        "iPhones",
        "XS Max",
        "iOS 12",
        "14-hour",
        "Blackberry",
        "Renee Ritchie's",
        "Tech 21",
        "iOS",
        "the iPhone XS",
        "over 10 feet",
        "one",
        "Android",
        "50",
        "Max"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "TIME",
        "MONEY",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "FAC",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "LAW",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON"
    ],
    "vector": [
        -0.08419334888458252,
        0.05149627476930618,
        0.059320174157619476,
        -0.060213495045900345,
        0.04675644263625145,
        -0.004977086093276739,
        0.0056283436715602875,
        0.12567773461341858,
        0.00867643766105175,
        0.038803257048130035,
        0.02129216119647026,
        0.05640094354748726,
        0.07064031809568405,
        0.05852628871798515,
        -0.00609504384920001,
        0.02306102216243744,
        0.12275216728448868,
        -0.09713341295719147,
        -0.05206892266869545,
        0.05962872505187988,
        0.04521745443344116,
        -0.051588911563158035,
        0.037947047501802444,
        -0.04893266409635544,
        0.038976725190877914,
        0.0408792681992054,
        -0.09816773235797882,
        -0.061901990324258804,
        0.01982412301003933,
        -0.006354121491312981,
        -0.02055213786661625,
        0.06833451986312866,
        0.030862662941217422,
        0.02862643450498581,
        -0.007918061688542366,
        -0.09694106876850128,
        0.008385196328163147,
        -0.003498242236673832,
        -0.020725999027490616,
        -0.0458357110619545,
        -0.08610495179891586,
        0.007959049195051193,
        -0.03791980445384979,
        0.04498552903532982,
        0.02699980139732361,
        -0.02723231352865696,
        0.06334005296230316,
        0.01679372787475586,
        0.0010168125154450536,
        0.040199290961027145,
        -0.004631651099771261,
        0.02735510654747486,
        0.025744326412677765,
        0.043487340211868286,
        -0.0523870550096035,
        -0.00919885654002428,
        -0.030872832983732224,
        -0.05273507535457611,
        0.06834202259778976,
        -0.006811178755015135,
        0.008103622123599052,
        0.032932866364717484,
        0.0370207279920578,
        0.0349406935274601,
        0.0019324892200529575,
        0.00564845185726881,
        -0.09779138118028641,
        -0.07044081389904022,
        -0.03825654089450836,
        0.04872070625424385,
        0.054098308086395264,
        0.0231881495565176,
        0.05678131431341171,
        -0.010172798298299313,
        0.0027874791994690895,
        0.055419936776161194,
        0.06147955730557442,
        -0.04015582054853439,
        -0.056388311088085175,
        -0.0029194701928645372,
        0.014476011507213116,
        -0.0363146997988224,
        -0.007230295334011316,
        -0.06125860661268234,
        0.056234024465084076,
        -0.008997020311653614,
        -0.013508046977221966,
        0.0718410462141037,
        -0.0329802967607975,
        0.006303410977125168,
        -1.4112232747720554e-05,
        0.10609810799360275,
        -0.047143515199422836,
        -0.01471164170652628,
        -0.030855579301714897,
        -0.01114840991795063,
        -0.06985420733690262,
        -0.018495991826057434,
        -0.0257678534835577,
        -0.006722013466060162,
        0.06405669450759888,
        0.003014551242813468,
        0.0667804628610611,
        0.02718401700258255,
        0.037900298833847046,
        -0.09817839413881302,
        -0.05742901191115379,
        0.0035642499569803476,
        -0.025947630405426025,
        0.02436085045337677,
        -0.009294047020375729,
        0.01145685650408268,
        -0.031671103090047836,
        -0.008837812580168247,
        -0.03814262896776199,
        0.010426611639559269,
        0.015516594052314758,
        0.046235132962465286,
        0.12275421619415283,
        0.010104591958224773,
        0.019055817276239395,
        -0.010594542138278484,
        -0.10095667839050293,
        -0.07178666442632675,
        -4.80218805023469e-05,
        0.046343185007572174,
        -0.023515328764915466,
        7.261791206989366e-33,
        -0.08096551895141602,
        0.08588455617427826,
        -0.03436288237571716,
        -0.07618398219347,
        -0.04121989384293556,
        -0.03266698494553566,
        0.04069589823484421,
        0.07846172153949738,
        -0.005905523430556059,
        0.07741616666316986,
        -0.05239230766892433,
        -0.01645083725452423,
        -0.01584618352353573,
        0.04632677510380745,
        0.04932696744799614,
        -0.05244326591491699,
        -0.030824802815914154,
        -0.046205852180719376,
        -0.023351449519395828,
        -0.014680077321827412,
        3.184459637850523e-05,
        -0.10499036312103271,
        0.0031693093478679657,
        0.007908806204795837,
        -0.04231642559170723,
        0.06938886642456055,
        0.11942631006240845,
        -0.009603329002857208,
        0.050874825567007065,
        0.005402940325438976,
        -0.11480530351400375,
        -0.005290528293699026,
        0.06666788458824158,
        0.012414056807756424,
        -0.039690274745225906,
        0.06597863882780075,
        0.04945340007543564,
        -0.08132756501436234,
        0.03694114461541176,
        -0.028116289526224136,
        -0.11594539135694504,
        0.023114178329706192,
        -0.05270882323384285,
        -0.024080790579319,
        0.03357532620429993,
        0.045808255672454834,
        -0.08003786206245422,
        -0.029643002897500992,
        -0.04699515923857689,
        -0.0491226464509964,
        -0.0547865629196167,
        -0.06026184558868408,
        -0.02469673566520214,
        0.0016270780470222235,
        -0.07959569245576859,
        -0.03913580998778343,
        0.01722160540521145,
        -0.06680608540773392,
        -0.0015042450977489352,
        0.09999705106019974,
        -0.028603583574295044,
        -0.03385629132390022,
        -0.04818408563733101,
        0.06340842694044113,
        -0.09996653348207474,
        0.0369095616042614,
        0.027377765625715256,
        -0.05686844512820244,
        -0.06525426357984543,
        0.10117136687040329,
        0.019515642896294594,
        -0.02658720687031746,
        0.06911811232566833,
        -0.07971655577421188,
        0.09342531114816666,
        -0.01753142476081848,
        0.0542605035007,
        0.06571846455335617,
        0.048137910664081573,
        -0.01695546694099903,
        -0.043946798890829086,
        0.003045086283236742,
        0.07554635405540466,
        0.006184721831232309,
        0.00555509002879262,
        -0.04691236838698387,
        -0.10728129744529724,
        -0.018992537632584572,
        0.01449375506490469,
        0.054454389959573746,
        -0.05177288129925728,
        -0.023598486557602882,
        -0.02711455151438713,
        0.015159349888563156,
        -0.00111678137909621,
        -7.270251827579409e-33,
        -0.05856570228934288,
        -0.04166971519589424,
        0.00042290889541618526,
        -0.02515031024813652,
        -0.040372639894485474,
        -0.032895833253860474,
        -0.033896658569574356,
        0.084205761551857,
        -0.0037663185503333807,
        -0.05444074794650078,
        -0.04633035883307457,
        0.04371071979403496,
        0.009764784015715122,
        0.03940620645880699,
        -0.03734226152300835,
        -0.04901331663131714,
        -0.00641049537807703,
        -0.08795040845870972,
        0.09048314392566681,
        0.0006016093539074063,
        0.021062666550278664,
        0.11229784786701202,
        -0.0019567764829844236,
        0.10406483709812164,
        0.011841338127851486,
        0.001389121636748314,
        -0.007621090859174728,
        -0.0011561284773051739,
        0.10805893689393997,
        -0.053485605865716934,
        -0.03266237676143646,
        -0.10851903259754181,
        -0.014345667324960232,
        0.07487497478723526,
        0.02586701139807701,
        -0.009435907006263733,
        0.013912459835410118,
        0.0050077056512236595,
        0.06685201823711395,
        0.02514214627444744,
        0.042106352746486664,
        0.05003952234983444,
        0.03925012797117233,
        0.008842183277010918,
        0.0710708275437355,
        -0.02526116743683815,
        -0.022467972710728645,
        -0.04369143396615982,
        0.02354818396270275,
        0.03061661683022976,
        -0.005948688369244337,
        -0.022959478199481964,
        -0.014426661655306816,
        0.0505661740899086,
        -0.13738445937633514,
        -0.016272155568003654,
        0.028502320870757103,
        -0.004647379275411367,
        0.02054031752049923,
        -0.058152440935373306,
        0.1126171201467514,
        0.0649072453379631,
        -0.04564603790640831,
        -0.027940545231103897,
        -0.06923370808362961,
        -0.028980106115341187,
        0.07581484317779541,
        -0.027101876214146614,
        0.013969573192298412,
        0.006789563223719597,
        -0.07186369597911835,
        -0.033171430230140686,
        -0.012613971717655659,
        -0.04828912764787674,
        -0.015536993741989136,
        0.0609154999256134,
        -0.06952312588691711,
        -0.01907893642783165,
        0.001037228968925774,
        -0.06578223407268524,
        0.05931095778942108,
        0.05838604271411896,
        0.07681728899478912,
        -0.007900936529040337,
        0.09654475748538971,
        0.01020236685872078,
        0.008010710589587688,
        0.033994246274232864,
        -0.02161799557507038,
        0.01849900558590889,
        -0.0609874501824379,
        -0.018475303426384926,
        -0.0860995352268219,
        -0.013359875418245792,
        -0.012252199463546276,
        -5.524641721876833e-08,
        0.010686821304261684,
        0.0053280252031981945,
        -0.008196921087801456,
        -0.0426335446536541,
        0.01280628889799118,
        -0.04391910880804062,
        0.012513343244791031,
        0.008866536431014538,
        0.1164202019572258,
        0.01733401045203209,
        0.031124167144298553,
        -0.10266432166099548,
        -0.08712336421012878,
        0.006504275370389223,
        -0.0731106549501419,
        0.003024500561878085,
        0.026937298476696014,
        0.04700089991092682,
        0.02233273722231388,
        0.03540252521634102,
        -0.07383733242750168,
        0.08078978955745697,
        -0.003094140440225601,
        -0.054654378443956375,
        0.07979874312877655,
        0.037881460040807724,
        -0.058457888662815094,
        -0.034600500017404556,
        0.04431741684675217,
        -0.008831116370856762,
        -0.046363018453121185,
        0.010937930084764957,
        -0.04035467281937599,
        0.0022253619972616434,
        0.0051446217112243176,
        -0.057854875922203064,
        -0.03072044812142849,
        -0.03753740340471268,
        0.13185547292232513,
        -0.031001748517155647,
        0.0024378604721277952,
        -0.07040709257125854,
        -0.033204659819602966,
        0.005864371545612812,
        0.0314319021999836,
        -0.04800059646368027,
        -0.07299945503473282,
        -0.12033230066299438,
        -0.004256023559719324,
        0.07231947779655457,
        0.027977043762803078,
        -0.07941807806491852,
        -0.018438264727592468,
        -0.06449226289987564,
        0.03661687672138214,
        -0.03221646696329117,
        0.04268645867705345,
        -0.005887037143111229,
        -0.015411878935992718,
        0.049778565764427185,
        0.09582457691431046,
        -0.07820218801498413,
        0.02645258419215679,
        0.06765702366828918
    ]
}