{
    "id": "ZPv9XPHMYfg",
    "title": "Is the CRAZY Flip Camera Fragile? - Zenfone 6 Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-06-19T12:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=ZPv9XPHMYfg",
    "category": "Howto & Style",
    "tags": [
        "Zenfone 6",
        "Asus Zenfone 6",
        "zenphone 6",
        "Swivel camera",
        "flip camera",
        "Zenfone 6 durability test",
        "Motorized camera",
        "smartphone",
        "best smartphone",
        "budget phone",
        "Asus",
        "iPhone",
        "android",
        "swivle camera",
        "technology",
        "best camera"
    ],
    "views": 3107442,
    "likes": 80699,
    "comments_count": 6724,
    "description": "The Zenfone 6 has one of the craziest motorized cameras that ive ever seen! Instead of the Zenfone 6 having a pop up camera, it FLIPS up from the back side of the phone and turns itself into a front facing camera. Brilliant. The Asus Zenfone 6 is definitely a fantastic engineering marvel. BUT is it durable? Can that flippy camera stand up to some abuse? what happens if you drop the zenfone 6 when the motorized camera is in the flipped up  position? We'll find the answers to all these questions and more with a durability test of the Zenfone 6.   Current Amazon Pricing for the Zenfone 6:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/2IVliLC",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Asus Zenfone 6. Asus has been flying under the radar for a while now, but the Zenfone 6 is doing something so different I couldn't resist buying one of my own to test out. The Zenfone 6 has a motorized camera, but not a pop up. It's a flip up. And today we're going to find out how durable that flip up camera really is. Let's get started. [Intro] Right off the bat this thing is absolutely crazy. The amount of engineering involved to make this action happen is incredibly impressive. Smartphones with motors are awesome. The Zenfone 6 is rated for 100,000 flips, which is 100 times a day every day for 3 whole years. It can also be motorized to any point along that flip arch with the side volume buttons. Impressive. Trying to activate the camera with my finger blocking the way yields some interesting noises. The camera motor isn't very gutsy. But manipulating it directly with my fingers doesn't seem to affect it negatively. There isn't any grinding of the gears or cracking sounds. Manually flipping out the camera is possible, if you can get a grip on it. But the phone does not like the camera to be up top when the camera app is not open. So I'll put it back down into the phone body. It's naturally in there pretty tight, and it'll never be flip flopping around on it's own. Asus even has the same auto accidental drop retract feature that we saw in the OnePlus 7 Pro, where if the phone is dropped with the camera in the open position, it'll retract the camera...and actually retracts much faster than normal into the closed position. You can hear the motor squeal into over drive to get the camera retracted faster. Not too shabby. If, you know, for whatever reason you wanted to hold onto only the camera and then try to flip the camera closed, the internal motor does not have enough guts to move the phone. The greater strain on the motor is sensed as an obstacle, and it just says to make sure nothing is obstructing the camera. If I say fake news, does the obstruction just go away? I was having so much fun with the flippy camera, I forgot we still have a whole durability test to perform on the rest of the phone. We'll get back to the camera again in just a second. The Zenfone 6 claims to be using Gorilla Glass 6 on it's 6 inch screen, which scratches at a level 6 with deeper grooves at a level 7. With the flippy camera design, there is no water resistance, but protective cases are still an option. Asus included a clear plastic case in the box with a large cut out opening in the top for the camera. Interesting, and nice of them to include. I always have a case on my own phone because protection is a good thing. The ear piece of the Zenfone 6 is a little guy covered in black plastic mesh. The motorized camera has two lenses: one 48 megapixel main camera, and a 13 megapixel wide angle camera. Both of these cameras, of course, dual function as the front and rear cameras since it can flip back and forth between both sides. A flippy camera accomplishes two things: the first is always being able to use the good camera instead of a lower quality front facing sensor, and the second is to keep the display notch free. The sides of the phone are made from metal, along with the light blue accented metal power button. The volume rockers are metal, and the little Google Assistant button way up here at the top...also metal. The top of the phone where the motorized camera is located actually sparks with my razor blade. Super weird. I can pry open the flippy camera. It does struggle with me for a second since the camera app isn't open...but eventually gives up. We can see that the large rectangle camera housing is made from metal, along with the camera cavity...both metal. The left side of the phone is completely empty, except for the SIM card tray, which impressively has dual SIM slots and an SD card tray. Can't go wrong with the expandable memory. You also can't go wrong with a headphone jack. This phone has all the features, which once again just proves the point that if you want features, all you have to do is spend less money on your phone. Since the Zenfone 6 is at the $500 mark at launch, and the phones that tend to be losing the headphone jack and SD card slot usually cost around $1,000. The fingerprint scanner can be scratched but still senses my fingerprint and unlocks the phone every single time. Let's see how much weight this camera can lift. It's going to be a negative on the large instruction booklet, but a positive on the metal pry tool. And again, another negative on this random screwdriver. When we break out the flames, the 6.4 inch IPS LCD lasted about 8 seconds under the heat from my lighter before the pixels go black and turn off, but then fully recover, turning back on and looking like normal again after the heat's removed. Up to this point, we've put some pressure on the camera motor and seen how much stress it can handle, and so far it's done a great job. But the motor doesn't matter very much if the hinge itself is weak. When the phone is laying flat on it's back, the camera motor doesn't have enough guts to lift the phone up and hold the camera shut underneath. If I grab the camera unit, and do a little hokey pokey and shake it all about, the phone gets mad at me for obstructing again. But the camera unit really does feel much stronger than I thought it would. Twisting the camera block side to side, forward and back, leaves the camera still intact and not coming off on it's own. There's definitely a very strong hinge of some sort inside the phone. We'll have to get a close up look at the inside during the teardown. I'm impressed. This thing is solid and still moving like a flipping champion. The phone itself is pretty thick, with a 5,000 milliamp hour battery inside. There is zero flex to the phone during the bend test when bent from any direction. No damage is done to the frame or the screen externally or internally. The Asus Zenfone 6 passes my durability test, with all the features, power, and motorized conversation starting gimmicks a tech nerd could ask for, the Zenfone 6 gets a thumbs up from me. It's an interesting phone and I like where things are headed. Would you buy a phone with a motorized camera? Let me know down in the comments. Like I've said before, motorized cameras probably aren't the long term permanent solution to notch-less displays, but I'm sure going to enjoy the hardware while it's here. Hit that subscribe button if you haven't already so you don't miss the teardown, seeing the motor contraption from the inside. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "camera",
        "phone",
        "Zenfone",
        "motorized camera",
        "camera motor",
        "flippy camera",
        "Asus Zenfone",
        "motor",
        "flip",
        "motorized",
        "metal",
        "cameras",
        "Asus",
        "back",
        "camera app",
        "camera unit",
        "side",
        "flippy",
        "top",
        "open"
    ],
    "transcript_entity_values": [
        "Google",
        "3 whole years",
        "5,000 milliamp hour",
        "6.4 inch",
        "around $1,000",
        "6",
        "about 8 seconds",
        "SD",
        "the Zenfone 6",
        "two",
        "100,000",
        "100",
        "jack",
        "6 inch",
        "The Asus Zenfone 6",
        "the Zenfone 6",
        "SIM",
        "zero",
        "The Zenfone 6",
        "first",
        "second",
        "Asus",
        "500",
        "The Zenfone 6",
        "13 megapixel",
        "today",
        "48 megapixel",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "TIME",
        "ORG",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.12293099611997604,
        0.007217311300337315,
        -0.011446556076407433,
        -0.03872895613312721,
        0.02238253690302372,
        -0.06924036890268326,
        0.042251475155353546,
        0.09023790061473846,
        -0.05483788251876831,
        0.03904051333665848,
        0.042843207716941833,
        0.10077309608459473,
        -0.013455869629979134,
        0.026273105293512344,
        0.0029387441463768482,
        -0.05157392844557762,
        -0.00685462262481451,
        -0.057425253093242645,
        -0.02633446455001831,
        0.1425064653158188,
        -0.03854721039533615,
        -0.07061658799648285,
        0.06553012132644653,
        -0.030472910031676292,
        -0.004454572685062885,
        -0.016573850065469742,
        0.012618615292012691,
        -0.03558511659502983,
        -0.03939299285411835,
        -0.014795616269111633,
        0.003374058986082673,
        0.11789830774068832,
        -0.08964812010526657,
        0.03615574166178703,
        0.011838044039905071,
        -0.03483166545629501,
        0.05580342188477516,
        -1.6541947843506932e-05,
        -0.036514509469270706,
        0.006051153875887394,
        -0.05345015600323677,
        0.001420227694325149,
        -0.011371618136763573,
        -0.04132213816046715,
        0.03782036900520325,
        0.0014843788230791688,
        0.12308240681886673,
        -0.06752704828977585,
        0.03934815526008606,
        -0.052469875663518906,
        -0.05386270210146904,
        -0.005911205429583788,
        0.06634639948606491,
        0.03487633168697357,
        -0.07623264938592911,
        0.08934812247753143,
        -0.03037935681641102,
        -0.07377475500106812,
        -0.03410806879401207,
        0.005762595683336258,
        0.085093654692173,
        0.017993472516536713,
        -0.019577305763959885,
        0.08478446304798126,
        0.07354912906885147,
        0.004896602127701044,
        -0.0006961495382711291,
        -0.11560124158859253,
        0.03763892501592636,
        0.036274299025535583,
        -0.09276218712329865,
        0.0066177379339933395,
        -0.017607523128390312,
        0.012213251553475857,
        -0.0013308614725247025,
        0.019665027037262917,
        -0.007315818686038256,
        -0.027682969346642494,
        -0.005215563345700502,
        -0.04467159882187843,
        0.09406432509422302,
        -0.0408039316534996,
        0.016442259773612022,
        0.0002588625065982342,
        0.06468499451875687,
        0.011644032783806324,
        0.04609115421772003,
        0.10463462024927139,
        0.016466613858938217,
        -0.048453379422426224,
        -0.00561675988137722,
        0.06765308976173401,
        0.0003712930774781853,
        -0.04965372011065483,
        0.020859265699982643,
        -0.07063533365726471,
        -0.007768206298351288,
        -0.09591151028871536,
        0.001844286103732884,
        0.020405754446983337,
        0.04766911640763283,
        -0.028127754107117653,
        0.056749749928712845,
        0.043258968740701675,
        0.02690960466861725,
        -0.03507649898529053,
        -0.062149085104465485,
        -0.045359618961811066,
        -0.03820561617612839,
        0.040185559540987015,
        -0.05333634838461876,
        0.05058952420949936,
        0.05599285662174225,
        -0.022199466824531555,
        0.007057143375277519,
        -0.004803040064871311,
        -0.06439021229743958,
        0.06174352765083313,
        0.004641243256628513,
        0.0027584321796894073,
        0.0065427920781075954,
        -0.06705772131681442,
        -0.03255512937903404,
        -0.001283794641494751,
        0.062067024409770966,
        0.028013871982693672,
        -0.022787397727370262,
        2.534694224107113e-33,
        0.0013249670155346394,
        0.1100088432431221,
        0.019436318427324295,
        -0.04606340453028679,
        -0.07409965246915817,
        0.012745426036417484,
        0.07983475178480148,
        0.0504528172314167,
        -0.07582075148820877,
        -0.006403101142495871,
        0.05701032280921936,
        -0.021243946626782417,
        -0.018639367073774338,
        0.020678600296378136,
        0.045684460550546646,
        0.06157560646533966,
        -0.01654387079179287,
        -0.02140100486576557,
        -0.045057766139507294,
        -0.0005643084296025336,
        0.024457773193717003,
        -0.029841385781764984,
        -0.0417257584631443,
        0.012392554432153702,
        0.0262165404856205,
        0.026428284123539925,
        0.029716195538640022,
        0.0419832207262516,
        -0.028198784217238426,
        0.013322601094841957,
        -0.09084197878837585,
        -0.031220389530062675,
        -0.038906581699848175,
        -0.050861623138189316,
        -0.004535791929811239,
        0.03357166796922684,
        -0.09742201864719391,
        -0.07432989031076431,
        -0.02603863552212715,
        -0.040511466562747955,
        -0.045912034809589386,
        0.03359544277191162,
        -0.09095834940671921,
        0.05514173209667206,
        0.02444949559867382,
        -0.011148450896143913,
        0.0032927345018833876,
        0.01736391708254814,
        -0.08271609991788864,
        -0.0215261522680521,
        -0.05549069866538048,
        -0.07838865369558334,
        -0.05137503519654274,
        -0.008862965740263462,
        -0.07730042189359665,
        0.024135416373610497,
        0.051759250462055206,
        -0.028047842904925346,
        0.06818661093711853,
        0.05242953449487686,
        0.027615368366241455,
        -0.0348968505859375,
        -0.09031430631875992,
        0.013268604874610901,
        -0.06961214542388916,
        0.03178783133625984,
        0.024718770757317543,
        0.04660884290933609,
        -0.0735088437795639,
        0.07662396132946014,
        -0.006765240803360939,
        -0.02382042072713375,
        -0.10232119262218475,
        -0.05035807564854622,
        0.05467904731631279,
        0.03507016971707344,
        -0.021568477153778076,
        -0.0641743540763855,
        0.017519142478704453,
        0.004324575886130333,
        -0.026510778814554214,
        0.04470527917146683,
        0.09087545424699783,
        0.024350306019186974,
        -0.03872459754347801,
        -0.029966261237859726,
        0.031852107495069504,
        -0.12463649362325668,
        -0.024918386712670326,
        0.05106194689869881,
        0.10255776345729828,
        -0.047492895275354385,
        -0.004101587925106287,
        -0.026063289493322372,
        -0.014358761720359325,
        -1.7334475198858865e-33,
        -0.04174879193305969,
        0.02464625984430313,
        -0.06265756487846375,
        0.00488148583099246,
        -0.02143521048128605,
        -0.07778604328632355,
        0.10151665657758713,
        0.13078027963638306,
        0.018442101776599884,
        -0.12413555383682251,
        -0.0193026103079319,
        -0.004827362485229969,
        -0.0099997753277421,
        0.038090772926807404,
        0.01488068699836731,
        -0.014612168073654175,
        -0.0007478597108274698,
        -0.09641627967357635,
        0.08223926275968552,
        0.030345434322953224,
        0.0954623892903328,
        0.011214069090783596,
        0.04337143525481224,
        0.06659866869449615,
        -0.05783745273947716,
        0.04827484115958214,
        0.05451385676860809,
        -0.022014830261468887,
        0.0698704645037651,
        -0.07127046585083008,
        0.059798095375299454,
        -0.0707060918211937,
        0.036094795912504196,
        0.05075519531965256,
        0.08475048094987869,
        0.0745060071349144,
        -0.01274173054844141,
        -0.009071864187717438,
        -0.016375144943594933,
        -0.04194236174225807,
        -0.01081722229719162,
        0.04166935011744499,
        0.061399009078741074,
        -0.01553388498723507,
        0.01870623789727688,
        -0.11905784904956818,
        0.009754259139299393,
        0.06075255572795868,
        -0.0145615478977561,
        -0.002742641605436802,
        -0.02289825864136219,
        0.005743206012994051,
        -0.03616902232170105,
        0.01866537518799305,
        0.038252636790275574,
        0.020804444327950478,
        0.06421903520822525,
        -0.04982047900557518,
        0.004482206888496876,
        0.029884018003940582,
        0.05785331875085831,
        0.050975505262613297,
        -0.030645404011011124,
        -0.03028399497270584,
        -0.013688329607248306,
        -0.027066407725214958,
        0.06681840121746063,
        0.08446076512336731,
        -0.02681349404156208,
        0.01282331719994545,
        0.049198612570762634,
        0.02229677140712738,
        0.06580281257629395,
        -0.08517475426197052,
        0.04337063804268837,
        0.060764674097299576,
        0.0170001033693552,
        0.06294514238834381,
        0.040918756276369095,
        -0.0019652454648166895,
        -0.016629032790660858,
        -0.07015145570039749,
        -0.007174581754952669,
        0.07252130657434464,
        -0.022224416956305504,
        0.009401018731296062,
        0.0011114707449451089,
        -0.014074078761041164,
        -0.008706602267920971,
        0.04220160096883774,
        0.0031034783460199833,
        -0.006340580992400646,
        -0.056499093770980835,
        0.06467469781637192,
        0.03261891379952431,
        -4.260356689655964e-08,
        -0.01035221852362156,
        -0.033093616366386414,
        0.04377751797437668,
        0.01979595422744751,
        -0.010997794568538666,
        -0.07699955999851227,
        0.11950839310884476,
        -0.027349714189767838,
        -0.009548835456371307,
        -0.07092441618442535,
        -0.02800174243748188,
        -0.05353580042719841,
        0.032863229513168335,
        0.052255406975746155,
        -0.07988502085208893,
        0.10756722837686539,
        -0.06587742269039154,
        0.06783938407897949,
        -0.032668113708496094,
        0.02659468539059162,
        -6.331720942398533e-05,
        -0.025995947420597076,
        0.04464802145957947,
        -0.03104429319500923,
        -0.012980571016669273,
        0.04869840666651726,
        -0.11786196380853653,
        -0.01888212189078331,
        0.01905742846429348,
        -0.055501703172922134,
        -0.05194120481610298,
        -0.06516377627849579,
        0.03895564377307892,
        0.0881369411945343,
        -0.025593332946300507,
        -0.054245591163635254,
        -0.08776696771383286,
        -0.03230416774749756,
        0.029274286702275276,
        0.009223325178027153,
        0.045954689383506775,
        -0.033895935863256454,
        -0.0036978451535105705,
        0.06407791376113892,
        -0.0005896998336538672,
        0.005991410929709673,
        0.07144835591316223,
        -0.10297635197639465,
        0.0029574339278042316,
        0.011060375720262527,
        -0.06538624316453934,
        -0.03601759299635887,
        -0.0037338368128985167,
        0.03770628198981285,
        0.04833754152059555,
        0.022810932248830795,
        0.10371223092079163,
        -0.006639115046709776,
        -0.035920754075050354,
        0.036408208310604095,
        -0.041615694761276245,
        -0.07551681250333786,
        0.03356454521417618,
        0.11299848556518555
    ]
}