{
    "id": "Zq5Ns7e68ns",
    "title": "This is literally e-waste - Porsche Mouse",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-05-17T19:11:47Z",
    "video_url": "https://www.youtube.com/watch?v=Zq5Ns7e68ns",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "porsche",
        "mouse",
        "ewaste",
        "garbage",
        "gimmick",
        "rgb",
        "car",
        "auto",
        "luxury",
        "dealership"
    ],
    "views": 207910,
    "likes": 10935,
    "comments_count": 759,
    "description": "Check out Cities Skylines totally FREE this weekend at:   Porsche is known for their fast cars... and their monitors, speakers, and mice? David is here to check out the Porsche Mouse to see if it lives up to the high standards of their cars or if this is bound for the recycle. (Spoiler alert: This is probably not your next gaming mouse)  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Not a good first impression 1:09 Checking out the accessories and mouse pad 2:06 Back to design/build quality impressions 3:50 Sponsor - Paradox Interactive: Cities Skylines 4:25 The RGB (well, just R) 4:57 Using the mouse 7:18 Trying to game with it 8:23 Teardown 9:08 Pricing and overall thoughts 10:34 Outro",
    "description_links": [
        "https://lmg.gg/CitySC",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I can't believe it. I never thought I could afford a Porsche but today that all changes. I got it, it's a Porsche mouse. This beautiful little car is made by Porsche. How long do short circuits have to be? (laughing) This is one of the cheapest feeling pieces of trash I've ever held in my life. This is like a a $4 child's toy. The plastic is crappy. The paint might not be as rub-off-able as I thought. But overall, the build quality on this thing is kind of embarrassing. I'm surprised Porsche releases this and has this on their website. I thought this would've been like an AliExpress knockoff thing but that's the Porsche logo. They have three different colors, there's a white one with blue and red racing stripes. There's a black basic one. And then there's this one that's sort of colored after the Porsche that won the Le Mans in 1970. I looked up what that Porsche looks like. Looks a lot cooler than this one. (laughing) This doesn't look anything like it. That one is a much more angular, almost like a Ferrari looking car. This is more of a classic Porsche shape and it's a (bleep) mouse. All right, what else is in the box? A quick start guide two AAs. Porsche was also generous enough to send us over this mouse pad. Did we pay for this? Even if they sent it for free, it's a waste of money. (man in background laughs) This is a terrible feeling mouse pad. Recently, I unboxed the pointer instrument from lunar artifacts and that had a similarly sized, almost exact same shape mouse pad and that was a very premium looking full grain leather with stitching. And this feels like pleather. I'm not even gonna give it the vegan leather upgrade. It feels like cardboard. It feels like 90% of this is cardboard with like a crappy foam in the middle. Let's see how it looks all together. Yeah, it looks like your six year old hit your mouse and put a little hot wheels on your mouse pad. Can I break it? (laughs) I want to, I feel like it'll be so therapeutic. - [Sven] I just got confirmation that we did buy this. - Oh, what's the return policy? I'll keep this mouse pad around. Let's get back to the mouse. On the top it has a car roof and two buttons that might be the worst buttons I've ever pressed in my entire life. These are mushy. It takes a lot of force to get it down but even then I'm not like a hundred percent sure if I've pressed. It feels like there's rubber being compressed and it's kind of hitting a little button at the bottom. They claim that this is an ergonomic design and you could use this for work all day. To be fair, it's light enough that it's not so bad and the shape isn't the worst shape I've ever held. It's not super comfortable for my grip. I get no palm naturally touching. I kind of have to choke up a little bit and where my fingers would naturally want to go, the buttons feel especially terrible there. So it's certainly not the worst ergonomics of a mouse I've ever felt but it is not great. I'd give it a C minus. Then when you put it with the cheap plastics, it just feels like you're holding a toy. That's not a good time. Elsewhere on the mouse, there's no buttons. Just the printed Porsche with the 23 and taillights that are actually gonna light up when I turn on the mouse. Cool. On the bottom we have our battery compartment, we have our USB dongle storage. I think that's a totally okay spot to store it. We have our on off switch. We have our sensor that they do not advertise the specs for anywhere on their website. Could not find anything. My guess is that this is a very cheap older style optical mouse and I don't expect it to perform super well. We also have these three small glide pads. It's actually not that bad from terms of smoothness. I've definitely had a worse gliding experience. That's actually not so bad. How fast do you think this thing can go? Just like Ka-chow. Wow I can't believe I almost forgot to tell you about our partnership with Paradox. It was super cool of them to reach out and want to sponsor this video. They're letting everyone play their hit game \"City Skyline\" for free this weekend. Starting May 18th, you can download the game and jump right in. Design a city, grow out its suburbs. Try to solve the ever-growing traffic dilemma. Or prove you can do a better job than your own mayor. After designing a few spaghetti junctions of your own, City Skylines will have you looking at the roads in your own city differently. Again, City Skyline is going free to play on May 18th so check 'em out on the link below or right on Steam. Now that we have the mouse on, you can see this beautiful taillight. Incredible. Wow. Okay. From the angle I'm looking at it from which I'll show you here, it actually looks like that's simulating the look of a taillight. It has little sectioned off parts, almost, it's simulating what a car would look like and then you flip it more vertical and it's totally misaligned. So the ones on this side are fully visible. And the ones on this side are kind of squeezed down a little bit. That's embarrassing. (laughs) The input latency on this is insane. It's like a sling shot. So I move the mouse and then it takes like a second for the mouse to track behind it. I think I could get used to it if I was someone at a car dealership and all I was doing was filling out sales forms and I'd just have to click things or you get used to using keyboard shortcuts. For anything else this is a terrible experience. It feels like the mouse is defaulting at 1600 dpi. There's no software or anything that Porsche includes. Not that I'm surprised. 1600's fine. I'll probably just have to turn down sensitivity in windows. I didn't even talk about the scroll wheel. It's tiny and it's really far up on the mouse. If I'm doing the full palm, it's okay. My fingers rest right beside it. But where I want to hold it, it's a bit of a stretch. Not ideal, especially when there's no other buttons on the side of the mouse. Also, why didn't they include a sound? If they're gonna go for like a full stupid product, it should vroom, vroom every time I turn it on. Oh, what am I doing? I'm not even using the Porsche mouse pad. I guess at 1600 DPIs, the small of a mouse pad makes a little more sense. The leather feels very rough against my hands. Like I'm catching. It's not sticky but it's definitely not a good experience. Having like 20% of the mousepad be this text means that this already tiny mouse pad is even smaller. This is really for people that love Porsche, that rep Porsche or people that have never used a proper mouse? I don't know. I don't think I've ever used a mouse that I want to use less than this one. This is horrible. Obviously no liftoff sensor. It's when you kinda land, it's gonna move. Every time you lift off, it's, this is terrible. My hand's already hurting on this corner taillight spot. There's like a hard ridge where the taillight is, just for aesthetics. But my palm right below my fourth finger is resting there and I can already feel it rubbing and getting tired. Even in terms of details, this is a poor effort. A Tesla level effort, you might say. The gap between the shell plastic and the base plastic here is small and then where the buttons are you can see that it's got an angle out. You could say yeah, so it can click down but there's ways they can mitigate it and there's still a gap that is about right if I press on it. Oh, oh, oh, you see that? Oh no, that's bad. The tracking is like, feels so inconsistent. Like sometimes I have to move far to make the cursor go and sometimes it's so sensitive. And it's not this desk pad, this beautiful desk pad from lttstore.com. I know that. I've let the mouse sit for a minute or so and it takes a second for it to wake up. Not a huge deal. They also say you're gonna wanna manually turn off the switch on the mouse. So I'm guessing that it doesn't really have a good standby and it'll just chew through batteries. Oh, it's all Rocket Launcher. That's so fun. I don't know if this game mode's the best testing precision but I mean, to be fair this mouse isn't the most precise one either. In a pinch, if you're trying to get away with getting in a couple games of Halo in between clients at the Porsche dealership, I guess this is fine. This sensor is clearly a underwhelming sensor. Sometimes I move a little bit and it just keeps going. Almost like when it's a bad Bluetooth device and it loses signal so it keeps sending the input and then once it finally gets there, it's done it a hundred times. There's not much else to say. This mouse sucks. Let's open it up and see if we can see why. (box clanks) This mouse doesn't look super hard to pull apart. There's only the one visible screw. I don't think there's any more under the glide pad. It was designed to go together very cheaply. Oh, there might be another one. Oh, it's probably under this. Is it okay if I destroy the manufacturer label thingy? Oh, it wasn't. I screwed up. No. (bleep) I really don't wanna take a glide pad off but it seems like I'm gonna have to. Is it okay if I take the glide pads off? Okay, these are switches. It felt very much like rubber but it has little switches, so, yay. Mouse is pretty easy to disassemble. There's this little daughterboard I'm guessing just for the LEDs and the main board is here with the sensor. Looks like it's not impossible to replace. Overall, Don't get this mouse unless Porsche gives it to you for free. It's a complete waste of your time and money. It's a little more than a toy, it's a bad mouse. It doesn't even look good. If you are making an aesthetic expensive product it has to at the very least not look like a (bleep) $2 children's toy and this does not succeed at doing that. And so this is probably the product that I've hated the most on this entire run of short circuits. How much does it cost? $120. You can buy so much with $120. You can buy so many other mice. You can buy a good mouse. Gou can get a G Pro for 120 bucks. You can get like 24 lattes. I would highly recommend getting 24 all at once. Chugging them, throwing up, feeling sick for week and still having a better time than using this mouse. How much is the mouse pad? - [Sven] $100. - No. Are you (bleep) kidding me? - [Sven] I'm dead serious. - So combined, if you want the full Porsche mouse experience, it's $220. That is so much (bleep) money. What are they thinking? I guess they know who their audience is. They know that this is a niche product. There's gonna be people there that just want it for the collectability of it. Don't get it. It sucks. It looks bad, it feels bad. It's a terrible mouse. It's a piece of garbage and it's literally e-waste even before you've taken it outta the box. Thank you for watching Short Circuit. Like and subscribe. You should also check out our recent unboxing of the lunar artifacts pointer instrument for another aesthetics focused mouse but one that didn't make me quite as mad. And after this, maybe I like it a lot more than I thought.",
    "transcript_keywords": [
        "mouse",
        "Porsche",
        "mouse pad",
        "Porsche mouse",
        "Porsche mouse pad",
        "pad",
        "Porsche mouse experience",
        "full Porsche mouse",
        "feels",
        "bad",
        "shape mouse pad",
        "City",
        "buttons",
        "feeling mouse pad",
        "City Skyline",
        "Porsche shape",
        "mouse pad makes",
        "car",
        "kind",
        "time"
    ],
    "transcript_entity_values": [
        "120",
        "24",
        "1970",
        "May 18th",
        "City Skyline",
        "1600",
        "all day",
        "three",
        "this weekend",
        "week",
        "Tesla",
        "20%",
        "USB",
        "one",
        "2",
        "220",
        "Porsche",
        "Porsche",
        "second",
        "4",
        "City Skyline",
        "six year old",
        "100",
        "City Skylines",
        "90%",
        "Mouse",
        "the Le Mans",
        "two",
        "Gou",
        "hundred",
        "AliExpress",
        "120 bucks",
        "Short Circuit",
        "a hundred percent",
        "23",
        "Ferrari",
        "a minute",
        "today",
        "fourth",
        "1600"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "FAC",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERCENT",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "ORDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.06393410265445709,
        -0.009811771102249622,
        0.04919503256678581,
        -0.07261746376752853,
        0.10402694344520569,
        0.05132914334535599,
        0.019914409145712852,
        -0.03208547085523605,
        0.012348590418696404,
        0.003353962441906333,
        0.03669615462422371,
        0.017100218683481216,
        -0.0027822533156722784,
        -0.01104886643588543,
        -0.03114006668329239,
        -0.06214658543467522,
        0.08020781725645065,
        -0.036936335265636444,
        -0.049710504710674286,
        -0.02969280816614628,
        -0.04602479189634323,
        -0.10807793587446213,
        -0.007931760512292385,
        0.0477951280772686,
        -0.06046431139111519,
        -0.034805890172719955,
        -0.011123662814497948,
        0.003607763210311532,
        -0.013975914567708969,
        -0.004428372718393803,
        0.0006095004500821233,
        0.07062549889087677,
        -0.01657409593462944,
        -0.014438232406973839,
        -0.049810104072093964,
        -0.04464526101946831,
        -0.03090028092265129,
        -0.0902811735868454,
        -0.06108822301030159,
        -0.05315703526139259,
        -0.016734540462493896,
        -0.07593188434839249,
        0.0029831097926944494,
        0.0894240289926529,
        0.027961289510130882,
        -0.013819441199302673,
        -0.005968715064227581,
        -0.035469379276037216,
        -0.0027730900328606367,
        0.004025852773338556,
        0.04447935149073601,
        -0.035094257444143295,
        0.02295016683638096,
        -0.025805125012993813,
        -0.028942111879587173,
        0.040849488228559494,
        -0.034062959253787994,
        0.02865871787071228,
        0.017281271517276764,
        0.023588018491864204,
        0.08194950968027115,
        -0.06071553751826286,
        -0.04107886552810669,
        0.007118783425539732,
        0.020697733387351036,
        -0.022835325449705124,
        -0.09488726407289505,
        0.15311864018440247,
        -0.08460479974746704,
        0.06029548496007919,
        0.04155535250902176,
        0.0015061382437124848,
        0.03388993814587593,
        0.09318085014820099,
        0.04171903803944588,
        -0.06765395402908325,
        0.02583545446395874,
        -0.021429436281323433,
        0.03380543738603592,
        -0.03585917502641678,
        0.0196114182472229,
        -0.0764847993850708,
        -0.041987303644418716,
        -0.0003224884276278317,
        0.06706483662128448,
        -0.0067288936115801334,
        0.0028251672629266977,
        -0.0012374063953757286,
        -0.04533311724662781,
        -0.03458923473954201,
        -0.09697883576154709,
        0.05350368097424507,
        0.046647150069475174,
        -0.018195345997810364,
        -0.0813223272562027,
        0.005867963191121817,
        0.002848660806193948,
        -0.01714649237692356,
        -0.01048903726041317,
        0.06445927172899246,
        0.036632511764764786,
        0.10816236585378647,
        0.05044414475560188,
        -0.008550130762159824,
        -0.08425196260213852,
        -0.036285046488046646,
        -0.027722010388970375,
        0.07912719249725342,
        0.013848512433469296,
        -0.0005131381913088262,
        -0.09176116436719894,
        0.020194457843899727,
        -0.07210754603147507,
        -0.013011392205953598,
        -0.08571959286928177,
        -0.0023796744644641876,
        -0.03379705920815468,
        0.0008101267158053815,
        0.1527576595544815,
        -0.036597784608602524,
        0.007855795323848724,
        0.038076698780059814,
        0.005772010423243046,
        0.03083386830985546,
        0.04983915761113167,
        -0.015177018009126186,
        -0.02248351275920868,
        -3.244941869869355e-33,
        -0.05533982440829277,
        0.0013906279345974326,
        -0.039215121418237686,
        -0.03924388810992241,
        0.06993541121482849,
        0.04227800667285919,
        -0.037619106471538544,
        0.01672995463013649,
        -0.07297275215387344,
        0.04041669890284538,
        0.0012167954118922353,
        -0.025001464411616325,
        -0.06533870100975037,
        0.04026716575026512,
        0.06144338846206665,
        -0.08798515051603317,
        0.007422220427542925,
        0.052943840622901917,
        -0.09282384812831879,
        -0.06262899935245514,
        -0.022151079028844833,
        0.01617640070617199,
        -0.03744054213166237,
        -0.04417846351861954,
        0.09465285390615463,
        -2.3920660169096664e-05,
        -0.015291471965610981,
        -0.03258448839187622,
        0.029956012964248657,
        0.04725056141614914,
        -0.0690491572022438,
        0.09735763818025589,
        -0.046573713421821594,
        -0.05909189581871033,
        -0.023502875119447708,
        -0.01925836317241192,
        -0.06080805882811546,
        -0.10557279735803604,
        0.06353726238012314,
        0.06049533188343048,
        0.020380476489663124,
        -0.06825650483369827,
        -0.09396767616271973,
        -0.11509370803833008,
        -0.07166709005832672,
        0.04323561117053032,
        0.0391501821577549,
        -0.022604282945394516,
        0.06587450206279755,
        -0.019137000665068626,
        0.0018097612773999572,
        -0.0034401563461869955,
        -0.11356177181005478,
        -0.08015651255846024,
        -0.009285013191401958,
        -0.06970841437578201,
        -0.019821053370833397,
        -0.02318045310676098,
        0.04190589115023613,
        0.0006554241990670562,
        -0.015779441222548485,
        0.0763564184308052,
        0.006167644634842873,
        -0.008889598771929741,
        -0.00800861045718193,
        0.07883483171463013,
        -0.020941894501447678,
        0.00669334689155221,
        -0.03890368714928627,
        0.023058321326971054,
        0.008332040160894394,
        -0.034965112805366516,
        0.03298617899417877,
        -0.06628214567899704,
        0.04684365913271904,
        0.03863230720162392,
        -0.08774746209383011,
        -0.0220012404024601,
        0.0017945236759260297,
        -0.0009040669538080692,
        -0.05567585304379463,
        -0.013275288976728916,
        -0.006502682808786631,
        0.0223665963858366,
        0.05484314635396004,
        -0.027821995317935944,
        -0.005350420717149973,
        -0.06667941808700562,
        -0.017850179225206375,
        0.03409719467163086,
        -0.05680995434522629,
        -0.03349383547902107,
        -0.06814076751470566,
        -0.03995571285486221,
        -0.092616006731987,
        -2.2419386417317684e-33,
        0.01005876436829567,
        0.027367839589715004,
        -0.00627001142129302,
        0.02799825184047222,
        0.016120944172143936,
        0.04926126450300217,
        -0.031254056841135025,
        0.04444761201739311,
        0.06595072895288467,
        0.027957255020737648,
        -0.03579180687665939,
        0.03788478299975395,
        -0.08696358650922775,
        -0.02082030288875103,
        0.04907633364200592,
        -0.018571503460407257,
        0.08094476908445358,
        -0.06711932271718979,
        -0.08661264926195145,
        -0.1156984269618988,
        0.07748551666736603,
        -0.034625183790922165,
        -0.020936844870448112,
        0.1116974726319313,
        -0.007338790688663721,
        -0.013938777148723602,
        0.11449258029460907,
        0.0573686882853508,
        0.014814314432442188,
        -0.020485924556851387,
        -0.07182254642248154,
        -0.07815434038639069,
        -0.007937750779092312,
        0.018286338075995445,
        0.0709981694817543,
        0.001259945915080607,
        0.011791693978011608,
        0.0015515430131927133,
        -0.08406364172697067,
        -0.005802817642688751,
        0.011423343792557716,
        -0.08383956551551819,
        -0.002179296687245369,
        0.07590729743242264,
        -0.05172157287597656,
        -0.04983334243297577,
        -0.07563111931085587,
        0.023843055590987206,
        0.0782971903681755,
        0.055397529155015945,
        0.045423850417137146,
        -0.05133768916130066,
        0.0051939706318080425,
        -0.011248870752751827,
        -0.08056600391864777,
        0.020976472645998,
        -0.011883278377354145,
        0.016933562234044075,
        0.04577430710196495,
        -0.013923080638051033,
        0.04647303372621536,
        0.03132602199912071,
        -0.08680552244186401,
        -0.004307680297642946,
        0.03952162340283394,
        -0.12546075880527496,
        0.0227518230676651,
        0.046903301030397415,
        0.021428989246487617,
        -0.012869969941675663,
        0.05824505537748337,
        0.041582174599170685,
        -0.04619677737355232,
        -0.08599944412708282,
        -0.050087619572877884,
        0.02775714173913002,
        0.11157950758934021,
        0.05211354047060013,
        0.06993037462234497,
        -0.06027515232563019,
        0.03445186838507652,
        0.011446489952504635,
        0.1158820390701294,
        0.0009220495703630149,
        0.0665334016084671,
        0.004710180684924126,
        -0.10941677540540695,
        0.028325585648417473,
        0.03342898562550545,
        0.023186111822724342,
        0.014153539203107357,
        0.07378610223531723,
        -0.05795470252633095,
        0.08028965443372726,
        -0.026951519772410393,
        -6.250832029763842e-08,
        -0.029726704582571983,
        0.0009239473729394376,
        -0.0401921421289444,
        -0.0007255109376274049,
        -0.012524018064141273,
        -0.0186483021825552,
        0.05243886634707451,
        0.041904665529727936,
        -0.018349185585975647,
        0.011193902231752872,
        0.01239749789237976,
        -0.03352215886116028,
        -0.016428470611572266,
        0.047956518828868866,
        -0.012715231627225876,
        -0.0023649747017771006,
        -0.03903263062238693,
        0.005786128807812929,
        -0.0512140654027462,
        0.021839840337634087,
        -0.061885666102170944,
        0.05563898757100105,
        0.049692556262016296,
        -0.03663421422243118,
        -0.04885353893041611,
        0.005631512030959129,
        -0.04704057425260544,
        0.09770159423351288,
        0.13107158243656158,
        -0.05999865382909775,
        -0.03272399678826332,
        0.014993441291153431,
        0.03766550123691559,
        0.011872745119035244,
        0.02327679842710495,
        -0.028734328225255013,
        -0.05565473064780235,
        0.07160746306180954,
        -0.014563978649675846,
        -0.043400149792432785,
        0.020982978865504265,
        -0.046068985015153885,
        -0.0006943722837604582,
        0.04435759410262108,
        0.005601245444267988,
        -0.019723044708371162,
        -0.0018065435579046607,
        -0.0695914551615715,
        -0.006449914537370205,
        -0.03871070221066475,
        -0.10275555402040482,
        -0.007088677491992712,
        -0.04388118535280228,
        0.0784587636590004,
        0.013586425222456455,
        -0.01721157319843769,
        -0.07974716275930405,
        0.005951601546257734,
        0.052875932306051254,
        0.03031531535089016,
        0.05733773112297058,
        -0.03708379715681076,
        -0.014898452907800674,
        0.12604694068431854
    ]
}