{
    "id": "ZrJmXvxXjD0",
    "title": "The Time-Lapse VCR",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-02-04T14:59:53Z",
    "video_url": "https://www.youtube.com/watch?v=ZrJmXvxXjD0",
    "category": "Science & Technology",
    "tags": [
        "VCR",
        "VHS",
        "security cameras",
        "surveillance cameras",
        "time-lapse",
        "time-lapse VCR",
        "video tape",
        "analog video"
    ],
    "views": 876351,
    "likes": 26541,
    "comments_count": 1309,
    "description": "You can support this channel on Patreon! Link below       Analog video and frame-by-frame review dont usually go nicely together (unless of course youve got a CAV Laserdisc onhand). So how did security camera systems stretch the normal recording time of VHS from a couple of hours to upwards of a week? Why, with ingenuity of course! Watch this video and find out the juicy secrets!  Links n stuff  This is a great resource, provided by a Patron (Thanks!!), which explains the difference between 2 and 4 head VCRs (as well as other great stuff!):   This book result had a great section on time-lapse recording:   Heres the manual to the SVT-3050P if youre curious about some of the other stuff this can do:   And, heres some info on quads, multiplexers, and switchers:    Technology Connections on Twitter:   The TC Subreddit   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel grow, please check out my Patreon page. Thank you for your consideration!   And thank you to the following Patrons! Steve Salecan, Jason Spriggs, Danny S., Gregory Kumpula, Chris Zaremba, Tom Burns, Andrew Eslick, The Mechanical Philosopher, Dean Winger, Jonathan Austin, Daniel Pf, Mark, Martin Note, Yung Kim, Sam Bennett, John W Campbell, Grazer, Matthew Holloway, Zach Komon, Slappy826, Steven Ingles, Kevin Tessner, Matthew Beckwell, Robert Howcroft, Bobby Young, Jesse Kempf, Troy King, Some Random, Mikhail Lavrentyev, Jeremy Heiden, MrVestek, Alexander Feld, Garrick Kwan, Toygar Karadeniz, Peter Sarossy, Leigh Beattie, Favian (pronounced Fay-Vee-En), Matt Allaire, Michael Scheliga, John Kieran, Aaron Hurd, Dave Mausner, Scott Cameron, Guy, Eli Krumholz, Mike Burkman, John Hickey, Benjamin Gott, Ryan Hardy, Marco Arment, Owen Walpole, Luke, James McMillan, Vladi Ivanov, Zachary Le, Gord Allott, Fredrik strem, Greg Hodgdon, Anil Dash, Simon Safar, Michael Wileczka, Thomas J DuVally,  Justin Bull, John Ehler, Bobby Vickery, William Matthews, Fred Leckie, Julian Zielke, John Rogers, Pavel otkovsk, Kenneth Morenz Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next three videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "http://www.ronaldsnoeck.com/vcr.htm",
        "https://books.google.com/books?id=ysg7w5aGDzEC",
        "https://pro.sony/s3/cms-static-content/operation-manual/3193023022.pdf",
        "https://www.videoexperts.com/faq/quads-vs-multiplexers/",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "These days, if you want to install some sort of security camera system, you can just run to your favorite big box store or wholesale club, buy a kit with 4 cameras and a DVR, and within hours have a working CCTV system capable of recording days or weeks or even months worth of HD, or sometimes 4K security footage. Now we can even access them remotely over the Internet, or put them in doorbells, or backup the footage to the cloud, or any number of things which, depending on your point of view, you may find interesting or concerning. But Not that long ago, we only had the world of analog video. Sure, videocassette recorders were widely available, but even with the most generous of tape lengths and the slowest of recording times, youre not going to be able to get more than 10 hours or so out of a tape. Thats not great for security cameras, particularly if you want to be able to record footage over a weekend when no one is at the office. But this video is running at 30 frames per second and for surveillance footage, thats probably more than we need. If there were a way that we could reduce the frame rate, we could get more time out of one tape. If we recorded, maybe, only two frames per second, wed still have a pretty good record of what happened, and we could get 15 times as much footage. Well, that idea did come to fruition in the form of the time-lapse VCR. Ive known about these things for years, but there have always been some nagging questions in my mind about how they work. For example, most VCRs just kinda suck at showing a still image. If you hit pause on this one, youll inevitably get some sort of snowy garbage at the top or the bottom. In later years, a digital frame buffer would grab a snapshot of whatever you were playing so that there could be a nice clean still frame, but a time lapse VCR thats RECORDING footage, how does that work? Now I could do some research and try to find out exactly how a time lapse VCR is doing all the magic stuff it does, but it sure would be great to just have one that I could poke around with. Oh right! This is a Sony SVT-3050. You can tell that this is a legitimate piece of A/V equipment because of its two-tone beige and brightly colored transport buttons. Oh yeah. Matte black? Heh, this is where its at. Seriously, why was so much professional A/V equipment from the this time period made in this particular color scheme? Its like its trying its best to be plain. From the front, this looks like any normal VCR save for its relatively few buttons (most are hidden behind the door) and surprising omission of the VHS logo even though this uses VHS cassettes. Are we bitter about something, Sony? Well get to that in a minute because there is some mystery as to why the labels missing, but what gets weirder is when you come round to the back. For starters, you wont find standard coaxial jacks for a television tuner. Nor will you find standard RCA jacks for composite video. Instead, youll find BNC connections, which were and are to this day very common in security camera applications. Youll also find a bunch of screw terminals for various things like timers and alarms. For example, the unit can send out an alarm signal if the tape becomes jammed or it runs out of tape. And it can also accept an alarm input to start recording. When I got my hands on this, the first thing I did (as would anyone, I presume) was to open the case. I wanted to see just whats inside this thing! Oh. Theres a circuit board in the way. No matter, well just pop that up, and look at that! There are little pegs made specifically for holding the board up and out of the way for servicing. Thats neat. Under the board was a completely normal looking VHS transport. Real talk, if you are into old VCRs like I am, you actually should open them up before you test them to make sure nothing is stuck which might cause it to eat a tape. This one indeed had something preventing the take-up spool from turning, and after exercising it a bit the problem went away. But, had I not checked, it may have ruined a tape. These are the sorts of life changing tips you can find only here on Technology Connections! One of the more curious things in here is the use of a modular power supply. You probably noticed the standard IEC C13/14 connector on the back, and its clear that it wouldnt be very difficult to swap out this power supply for another. This not only makes repair easier, but it also means that the same chassis could be used in many markets. OK, so with it operational, I popped a tape in and starting messing with the playback. On any speed but the normal 2 hours, the tape simply juddered forward one step at a time. Is that really it? I had imagined that maybe the head drum would spin at a slower speed, or that the machine would behave in some other strange way, but it appeared that this was simply stepping forward one frame at a time. Lots of VCRs can do that so what makes this special? Well, keen eyes may notice that the quality of that still frame is perfect. Theres no snow, theres no jitter, and there isnt even any sign that thats a digital frame buffer. To be sure that this wasnt playing tricks on me, I touched the spinning head drum while watching the screen of the TV, and sure enough the picture was distorted along with my touch. So, this picture is coming live from that tape. That alone isnt so surprising, as many high-end VCRs with four heads can do that. But what is a little more interesting is that it not only has to do that when playing a tape, but it also has to do it when recording. After much searching, I found a great source describing how time-lapse VCRs work, and one of the more remarkable things about them is how precisely they can move the tape itself. See, in normal recording and playback, the tape is continuously moving at a rate of about 1.3 inches per second, or 3.3 centimeters per second. This means that with each sweep of the recording or playback heads, which happens 60 times a second on an NTSC machine, the tape has actually moved roughly half a millimeter. That means that the end point of the sweep is about half a millimeter to the right of the beginning, imparting a slight angle to the track. Thats why a two-head VCR cant display a nice still frame. Without getting too deep into explaining analog video, each head is responsible for one half of the frame, or one field. With a two head VCR, if the tape stops, then the heads are suddenly misaligned a little bit. One head will start showing the correct thing, but it will drift into the adjacent track. The same thing happens when the next head sweeps. In essence its always reading the wrong thing for at least some part of the frame, and the result is a noisy, incomplete picture But a 4 head VCR actually has two heads passing by with each sweep. Its capable of reading either the odd or even fields at any time, and can switch between them on the fly. This allows it to perfectly display either the odd or even field without noise bars. Theres a great link in the description if youd like to learn a little more about the specifics here. Anyway, thats all fine and good, but whats most interesting here is how the machine records onto the tape. It needs to get that correct angle otherwise the signals will be completely out of spec from VHS, and it wont be able to play them in fast motion for the purpose of searching for the moment that your restaurant was robbed. Or whatever. And that is what makes this more advanced than your average 4 head VCR. When recording, the heads are completely inactive except for when they write that single field onto the tape. Most of the time theyre simply spinning for the fun of it. And heres the kicker. The writing action is perfectly synchronized so that it happens just as the tape is being advanced to the next position. This means that the machine actually is recording in a completely normal fashion. But, it is able to start and stop the tape with such precision that although its recording up to 86 times slower than normal, the signals on the tape are unaffected. Take a look at this slow motion footage. Ive placed a marker on the tape so that we can see it advance. The tape is completely stationary, but the moment that head is aligned with it, it moves. And as soon as the next head is in position, it stops. This extremely precise control of the tapes movement, along with the idling of the recording heads until the moment that next frame is to be recorded, enables the machine to make intermittent, single-field recordings onto the tape. Pretty neat. Now heres where things get a little weird. Keen viewers will have noticed that there is an audio input on here. If youre familiar with how audio is stored on a non-HiFi VHS tape, youll know that its recorded linearly on the edge of the tape, just like a normal audio cassette. How would audio work if the tape is moving in steps? Well, the machine can only record audio in the normal 2 hour mode, and the 12 and 24 hour time lapse modes. It cant record audio in the slower speeds. But, this means that when recording in the 12 and 24 hour modes, the tape isnt advancing in steps. Instead, its continuously moving very slowly. The images are still stored in a reduced frame rate, but the continuous motion of the tape enables sound, albeit very very terrible sounding sound. So, the same thing happens. The heads only write in individual bursts for each frame, but we get an odd consequence now. See, if I want to play the tape back with sound, it cant play the tape back very well. Its certainly not awful, but there are noise bars and other anomalies. If we want perfect quality, we need to switch the sound off, and then it returns to the stepping mode that it was using before. And this may give us a clue as to why the machine is missing a VHS badge. Technically, the format specifications arent being broken if it is recording in steps like this. It is recording a normal SP signal on the tape, its just doing it intermittently, one field at a time. But this weird extra super duper slow speed doesnt conform to that standard. Is this THE reason? I cant say for certain. The S-VHS variant of this machine, the Sony SVT-3050P, does have an S-VHS badge on the front, and it, too can record audio in 12 and 24 hour modes. So the missing logo may remain a mystery. But were not done yet. Did you notice that Faroudja laboratories mark on the back? Yeah, that got me curious. Who are they and what do they want with my VCR? Well, Faroudja Labs was quite famous for analog video processing technologies, in particular devices called line doublers. These could take a low resolution image, and double the number of horizontal lines of resolution, to give it an apparent resolution bump. This device would really benefit from a line doubler, because it records just one field at a time. Each still frame is only half the resolution of a normal television signal, and for something like security cameras where you might want to be able to identify who is stealing your stuff, thats not good. Now Ill admit, you cant get more detail out of an image than was already there, so the extent to which a line doubler may help with tasks like identifiability is up for debate, but its clear that this technology is helping. Part of why these still frames seem remarkably clear may simply be due to Faroudjas video processing prowess. Now I cant say for certain that there is a line doubler in here, but knowing what Faroudja had done in the past, it seems very likely. At the very least, something of theirs is making this a very sharp picture for what the raw signal is. So, that pretty much wraps up how a time-lapse VCR works. Its a lot less magical than I thought it might be. More or less its just a standard VCR. There were some special considerations to using it, however. With a normal video tape, the tape is only touching the spinning head drum for a few seconds at a time. But with this machine, on the slower recording speeds, it might be touching that drum for a few minutes at a time, and this could quickly wear out the tape. For this reason, manufacturers would recommend that you discard your tapes after a certain number of uses. Some would say to only use a tape twice if it was recorded with the slowest speed. When these were in common use, youd need to balance the desired detail of the recording with your business hours and when the tapes could be changed, and how long of an archive you need to keep (for legal purposes, usually at least a month of recordings). So, youd need to have something like 10 tapes on hand, use them in a rotation, and discard them after theyd been used perhaps a dozen times. For a 72 hour recording, this would let you use 10 tapes for perhaps a year before needing to replace them. And of course, a 24/7 duty cycle for a VCR isnt the kindest thing. It was recommended that you replace the video heads on this at least every 10,000 hours (which works out to pretty much every year). You can still find the drum, the 2N4N-Q, for sale from people who specialize in security equipment. And it looks like this machine has had its heads changed at least once. Poking through the menu shows that its been powered on for 25,716 hours, but the video heads only have 314 hours on them. Now, it could be that this machine was set up to only record in an alarm condition. This may be the original head, and it was simply idle the vast majority of the time. There doesnt seem to be a way to determine if that counter has been reset, so I suppose Ill never know for sure. But before I go, I havent answered one particular question about these things. What happens when you have multiple cameras? Well, thats a fairly deep rabbit hole so Ill be brief. One option was to use whats called a quad. This splits the incoming signal of four cameras into a single display showing all four at one time. The major disadvantage here was the very poor resolution of the recorded video, as each camera only got one quarter of the screen. Another option was a switcher. This would simply cycle through each of your cameras one at a time, showing Cam 1, then Cam 2, then Cam 3 and so on. Youd get a full resolution image, but you couldnt see what was happening on any of the other cameras when one was being shown. It also makes reviewing recorded footage a little nauseating. The coolest solution, albeit the most expensive one, was a multiplexer. These would combine the signals from all of the cameras, and send them over a single wire by rapidly switching between them, and using the vertical blanking interval to signal which camera is which. When you want to see just one, the multiplexer would use a frame buffer to show only that one camera at a reduced frame rate. The beautiful thing was that this also worked with a time-lapse VCR like this one. But, youd have to synchronize the multiplexer with the VCR (using the switch out terminal), and youd also have to deal with an effective frame rate thats even worse than what the VCR is natively recording. See, if the VCR is recording 4 cameras, and its recording at a rate of 4 frames per second, those four frames are split between the four cameras, meaning that each camera only gets a recording once per second. So, while you did get to record four cameras on one tape with the full resolution, you would get a seriously reduced update frequency. That was a significant trade-off, but it was cheaper than having a dedicated VCR for each camera. If I ever get my hands on a multiplexer, Ill revisit this video because Id love to see how it all works. Id be curious to know what exactly it stores in the blanking interval, and it may be fun to set up a CCTV system using vintage equipment like this. But for now, I hope you enjoyed this video on the time-lapse VCR. Its a lot simpler than I thought it might be, although it ended up being far more mysterious than at first it seemed. As Im sure you know by now, I end my videos with a thank you to my amazing patrons, but this time I have more than one reason to thank them, and someone else to thank, too. This video topic was a viewer suggestion! A friendly gecko named Torrance reached out to me and wanted to know a little bit about these time-lapse VCRs. Ive always been curious myself, and thanks to the people who support the channel on Patreon, I was able to go and buy one and poke around with it. And in addition to their generous financial support, this time around the Patreon crew came to my rescue by helping me figure something out about this machine. I was under a very mistaken assumption about how this thing was making such a great still-frame, and thankfully you sent me some great resources (including one linked below) that made me realize I was really overthinking this! So, if youd like to send in a video topic suggestion, please do! You can leave them here in the comments, you can reach me on Twitter @TechConnectify, or you can check out the Technology Connections subreddit linked below. Down there youll also find a link to my Patreon page. With direct viewer support, this channel has really taken off and there are very exciting changes coming pretty soon. If youd like to make a pledge of your own and get perks like early video access, occasional behind the scenes footage, and general updates before anyone else, please check out my Patreon page. Thanks for your consideration, and Ill see you next time! violently smooth jazz ...because of its two-tone beige and brightly colored transport (unintelligible babbling) Hu huh! Huh huh! [And other weird noises] ...to make sure nothing is stuck and might cause it to eat a pa (laughs) Eat a pastry! Did you notice that Faroudja Laboratories mark on that back? Well that got me Is it laboratories or technologies? Its both! OK With a normal videotape, the tape (pauses) Yeah, dang it that was right. Mmhmm! Say the lines as written, please. Its a lot simpler than I thought it might be, although it ended up. (sigh) [very high pitched squeaky sounds]",
    "transcript_keywords": [
        "tape",
        "VCR",
        "recording",
        "time",
        "head VCR",
        "frame",
        "time lapse VCR",
        "video",
        "head",
        "VCRs",
        "heads",
        "cameras",
        "normal",
        "machine",
        "thing",
        "tapes",
        "favorite big box",
        "find",
        "footage",
        "camera"
    ],
    "transcript_entity_values": [
        "Hu",
        "3.3 centimeters per second",
        "one quarter",
        "Faroudja",
        "a few minutes",
        "2 hours",
        "SP",
        "only half",
        "one half",
        "Faroudja Labs",
        "BNC",
        "30",
        "roughly half a millimeter",
        "a minute",
        "Sony",
        "years",
        "Faroudjas",
        "314 hours",
        "two",
        "12 and 24 hour",
        "S-VHS",
        "24/7",
        "more than one",
        "later years",
        "Faroudja",
        "a few seconds",
        "These days",
        "only two",
        "a weekend",
        "weeks",
        "CCTV",
        "Patreon",
        "RCA",
        "Cam 3",
        "86",
        "DVR",
        "months",
        "more than 10 hours",
        "just one",
        "VHS",
        "this day",
        "first",
        "4",
        "HD",
        "one",
        "four",
        "NTSC",
        "Technology Connections",
        "2 hour",
        "at least a month",
        "10",
        "dozen",
        "Torrance",
        "Cam 2",
        "One",
        "about half a millimeter",
        "72 hour",
        "Cam 1",
        "15",
        "2N4N",
        "hours",
        "Twitter",
        "non-HiFi VHS",
        "Faroudja Laboratories",
        "second",
        "about 1.3 inches",
        "60",
        "days",
        "25,716 hours"
    ],
    "transcript_entity_types": [
        "PERSON",
        "QUANTITY",
        "DATE",
        "GPE",
        "TIME",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "LAW",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME"
    ],
    "vector": [
        -0.0449991412460804,
        -0.031184470281004906,
        -0.011152063496410847,
        -0.10565949976444244,
        -0.0001920756621984765,
        0.003393185557797551,
        -0.03490641713142395,
        0.052272502332925797,
        0.05510848015546799,
        -0.06953694671392441,
        -0.02601352520287037,
        0.009865260683000088,
        -0.045093391090631485,
        -0.0135756591334939,
        -0.03318798542022705,
        -0.10739505290985107,
        0.03880233317613602,
        -0.04724438115954399,
        -0.018175223842263222,
        -0.04277082905173302,
        0.007838101126253605,
        -0.11405820399522781,
        0.022792454808950424,
        -0.004407471511512995,
        -0.030686456710100174,
        0.009045074693858624,
        -0.06914708018302917,
        0.004573201760649681,
        0.0035583400167524815,
        -0.027617592364549637,
        -0.04832790419459343,
        0.05141891911625862,
        -0.008017269894480705,
        -0.008601661771535873,
        -0.018037376925349236,
        -0.01691778376698494,
        0.09303627163171768,
        -0.007922793738543987,
        -0.07143354415893555,
        0.02883789874613285,
        0.023972246795892715,
        -0.013509267009794712,
        0.03054426982998848,
        0.015409301035106182,
        -0.0647144466638565,
        0.058501068502664566,
        0.11045131832361221,
        -0.08222006261348724,
        -0.031165819615125656,
        -0.05583366006612778,
        -0.032259099185466766,
        0.0382801853120327,
        0.07222722470760345,
        -0.004792350810021162,
        -0.06418059766292572,
        0.04046323895454407,
        -0.010444855317473412,
        0.048687856644392014,
        0.00895737111568451,
        -0.01658313348889351,
        0.04389224201440811,
        -0.00830430444329977,
        -0.07275194674730301,
        0.0236411951482296,
        -0.04142507538199425,
        -0.005441558547317982,
        0.0376708060503006,
        0.06894680857658386,
        0.03997062146663666,
        -0.045021142810583115,
        -0.1318979114294052,
        0.07922226935625076,
        -0.00688162911683321,
        0.026856541633605957,
        -0.009393014013767242,
        -0.06329520791769028,
        0.08056981861591339,
        0.008236912079155445,
        0.05763068422675133,
        -0.1016465276479721,
        0.11429274082183838,
        -0.013845596462488174,
        -0.03664953261613846,
        -0.011523334309458733,
        -0.002885102527216077,
        0.022088270634412766,
        0.03836913779377937,
        0.07470826059579849,
        0.04687337949872017,
        -0.0033278607297688723,
        -0.07890935242176056,
        0.004954079631716013,
        0.06054365262389183,
        -0.09694330394268036,
        0.007358754985034466,
        -0.03341309353709221,
        -0.009395403787493706,
        -0.01226742472499609,
        0.0792069286108017,
        0.034056469798088074,
        0.06626434624195099,
        -0.07606863975524902,
        -0.007137790787965059,
        -0.0010262156138196588,
        0.0036571265663951635,
        0.004858821164816618,
        -0.019065624102950096,
        0.10442059487104416,
        0.02826850675046444,
        0.029088648036122322,
        -0.04095161333680153,
        0.12565173208713531,
        -0.027827274054288864,
        -0.058145277202129364,
        0.032332129776477814,
        0.0748525857925415,
        -0.09670942276716232,
        0.01212867721915245,
        0.04926925152540207,
        -0.03890121728181839,
        0.0005387825658544898,
        -0.0825839713215828,
        -0.0030123312026262283,
        -0.03399244695901871,
        0.07875947654247284,
        -0.003778791753575206,
        0.08007370680570602,
        1.6319450520603205e-33,
        -0.03529581055045128,
        0.13687585294246674,
        -0.0858461856842041,
        0.022564347833395004,
        0.05070902779698372,
        0.08752935379743576,
        -0.03871997073292732,
        0.036781225353479385,
        -0.0307654719799757,
        0.018682878464460373,
        0.04048570990562439,
        -0.06701181828975677,
        -0.041962623596191406,
        0.018724484369158745,
        0.03977832570672035,
        -0.011068063788115978,
        -0.10431680083274841,
        -0.024751534685492516,
        0.005047359969466925,
        -0.0011371365981176496,
        0.028322752565145493,
        -0.043053243309259415,
        0.03297196701169014,
        0.06554141640663147,
        0.08865419775247574,
        -0.08556979894638062,
        -0.007999744266271591,
        0.013060024939477444,
        0.055787209421396255,
        -0.014728007838129997,
        -0.016716858372092247,
        0.01511735375970602,
        0.0015785786090418696,
        -0.07575041800737381,
        0.13966210186481476,
        0.025496210902929306,
        0.003341601463034749,
        -0.0925137847661972,
        -0.021701406687498093,
        0.06707605719566345,
        0.043555159121751785,
        0.04407544806599617,
        -0.0474872849881649,
        -0.07096607983112335,
        0.00167206977494061,
        -0.043964482843875885,
        0.06294362246990204,
        0.03711458295583725,
        -0.05438656732439995,
        0.07444503903388977,
        -0.006909113377332687,
        0.059871528297662735,
        -0.06583291292190552,
        -0.09185264259576797,
        0.014618339017033577,
        0.07776380330324173,
        0.03257717192173004,
        -0.03408156707882881,
        -0.02007065713405609,
        0.04250403866171837,
        0.027521532028913498,
        -0.023705782368779182,
        -0.003132415935397148,
        -0.06881800293922424,
        -0.09108322113752365,
        -0.019144494086503983,
        0.06305230408906937,
        0.022773995995521545,
        -0.005693027749657631,
        0.04029087722301483,
        -0.052244633436203,
        -0.015446617268025875,
        -0.006100547965615988,
        -0.1575707048177719,
        0.039213042706251144,
        0.08298449218273163,
        -0.07816499471664429,
        0.05496183782815933,
        0.007813230156898499,
        0.04936164990067482,
        -0.057852596044540405,
        -0.03759440779685974,
        0.030952101573348045,
        0.013724538497626781,
        0.020249735563993454,
        0.0348508246243,
        0.03431994095444679,
        0.002394866431131959,
        -0.027454176917672157,
        -0.017657017335295677,
        0.02356046438217163,
        -0.009960857219994068,
        0.05134586617350578,
        0.009778833948075771,
        -0.020445043221116066,
        -2.8519316803902393e-33,
        0.029097728431224823,
        0.01224491186439991,
        0.04709318280220032,
        0.037316713482141495,
        0.01692044734954834,
        -0.08505995571613312,
        -0.022695153951644897,
        0.06739059835672379,
        0.015577424317598343,
        -0.08881615102291107,
        -0.0011671833926811814,
        -0.05942919850349426,
        -0.005055596586316824,
        -0.004435897804796696,
        -0.04177003726363182,
        -0.03421257436275482,
        0.046044304966926575,
        -0.03284495696425438,
        -0.017019551247358322,
        -0.06780767440795898,
        0.15382510423660278,
        0.013651984743773937,
        0.01807098090648651,
        -0.0019491615239530802,
        0.041587404906749725,
        0.003784881206229329,
        0.025072509422898293,
        0.0437648743391037,
        0.07280804216861725,
        -0.03099103644490242,
        -0.0075362385250627995,
        -0.06962984800338745,
        0.06760130822658539,
        -0.010494228452444077,
        0.01549253985285759,
        0.07030253112316132,
        0.13077783584594727,
        0.0463356077671051,
        -0.048368994146585464,
        -0.04739849269390106,
        0.01865222491323948,
        0.05118488892912865,
        -0.03233814612030983,
        -0.07752402126789093,
        -0.06928914040327072,
        0.04286092892289162,
        -0.08216757327318192,
        0.033321574330329895,
        -0.06452158093452454,
        0.023093383759260178,
        0.011673972941935062,
        -0.07054783403873444,
        0.02232998237013817,
        0.011132398620247841,
        0.019913936033844948,
        0.008931147865951061,
        -0.0036908152978867292,
        0.039526358246803284,
        0.010138461366295815,
        0.03830920159816742,
        0.012217920273542404,
        -0.008198840543627739,
        -0.035131342709064484,
        -0.004224114120006561,
        0.04639910161495209,
        -0.018852612003684044,
        0.048025209456682205,
        -0.0014222441241145134,
        -0.07627971470355988,
        -0.0015318350633606315,
        0.0036286404356360435,
        0.006722078192979097,
        -0.00849292054772377,
        -0.07251647859811783,
        -0.02295507863163948,
        -0.038272179663181305,
        -0.012866711243987083,
        -0.07489366829395294,
        -0.02877376228570938,
        0.018903857097029686,
        -0.13495652377605438,
        -0.02987215854227543,
        0.016792649403214455,
        0.01098549459129572,
        -0.01764332316815853,
        0.10410784184932709,
        0.039285946637392044,
        -0.00597824901342392,
        0.047300778329372406,
        -0.03596554696559906,
        -0.021192248910665512,
        0.026387760415673256,
        0.005332688335329294,
        0.0672861710190773,
        0.0484185665845871,
        -4.765874095369327e-08,
        0.0032312581315636635,
        0.029115404933691025,
        -0.10611113905906677,
        -0.018245898187160492,
        -0.040477316826581955,
        -0.09649992734193802,
        0.054423265159130096,
        -0.003982215188443661,
        0.03159443289041519,
        -0.03144398704171181,
        0.04169720038771629,
        0.0005347530823200941,
        -0.01572585664689541,
        0.026808137074112892,
        0.09670581668615341,
        0.0017875535413622856,
        -0.030488379299640656,
        -0.03600158169865608,
        -0.058676671236753464,
        -0.03120042197406292,
        0.034742385149002075,
        -0.0452023521065712,
        0.09954153746366501,
        -0.014452043920755386,
        -0.028156939893960953,
        0.06460145115852356,
        0.007662900723516941,
        0.05102851614356041,
        0.04738449305295944,
        -0.07356327027082443,
        -0.06255637109279633,
        0.039063822478055954,
        -0.05762631073594093,
        -0.06349677592515945,
        0.02321637235581875,
        -0.07690830528736115,
        -0.06488512456417084,
        0.010456155985593796,
        0.07138053327798843,
        0.10823781043291092,
        0.02201247029006481,
        -0.10955819487571716,
        -0.03599594905972481,
        0.07416871935129166,
        0.040524303913116455,
        0.045904889702796936,
        -0.05132452771067619,
        -0.04423832148313522,
        -0.03235427290201187,
        -0.028685549274086952,
        0.05567721277475357,
        0.04656268656253815,
        0.01916668750345707,
        0.02078101970255375,
        0.02156531624495983,
        0.027101906016469002,
        0.09348370879888535,
        -0.018802255392074585,
        0.027877086773514748,
        0.021850982680916786,
        -0.0250807274132967,
        0.005578980315476656,
        -0.06080126017332077,
        0.011617107316851616
    ]
}