{
    "id": "ZTRBWYVGIbc",
    "title": "macOS Mojave Installation Sensation - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-11-08T21:00:53Z",
    "video_url": "https://www.youtube.com/watch?v=ZTRBWYVGIbc",
    "category": "Science & Technology",
    "tags": [
        "macOS Mojave Installation Sensation - Krazy Ken's Tech Misadventures",
        "macOS Mojave",
        "macOS 10.14",
        "Apple",
        "Mac",
        "MacBook Pro",
        "Computer",
        "Tech",
        "Software",
        "Demo",
        "Comedy",
        "Funny",
        "Humor",
        "KKTM",
        "Krazy Ken",
        "Krazy Ken's Tech Misadventures"
    ],
    "views": 32970,
    "likes": 859,
    "comments_count": 174,
    "description": "macOS Mojave brings many new features to the Mac, and it's up to Krazy Ken to install them on his computer. It's all about that DARK MODE!  Support the show and get in the credits   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #74 - macOS Mojave Installation Sensation  Krazy Ken is now on Patreon! Pledge now to help support the show and get an opportunity to be in the show's credits!   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "http://patreon.com/krazyken",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://patreon.com/krazyken",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] You gotta entertain yourself somehow while the installation is commencing. And an error occurred! That's great. Well, we're already off to a great start! (beeping) (typing) (electronica) Hey guys, how're you all doin'? Really? That's just great. You know what, I'm doing pretty great today, too because we're here for this. It's a very dark day because we're getting macOS Mojave (sci-fi typing) with Dark Mode. But it is actually a little too dark. Gaston, please (claps) would you be a dear and turn on the lights? Ah yes, thank you. Let's have a look here. Details. I did not upgrade to Mojave right when it came out simply because of the issues I had with High Sierra. And Sierra. If you wanna check out all of those great misadventures, feel free to. However, this time around Apple seems to be doing a good job with QA, quality assurance for people keeping score at home. But just to be safe, I waited for the .1 update. I no longer want to upgrade on .0 updates anymore! So in addition to all of the new features that Mojave has, 10.14.1 adds support for group FaceTime up to 32 friends and enemies, and over seven new emoji. You know if Apple put as much energy as they do into emojis, they'd probably have, I don't know, a new Mac Pro by now. But at least they updated the Mac mini and the MacBook Air. That was really nice. So those are some of the new things and I'm sure some other maintenance things were done as well. I just want to have a bugless experience, please! So macOS Mojave was smart enough to download in the background so we don't need to wait for the magical internet signals to travel 10 stories underground and download the software. Simply, it downloaded itself automagically! We're gonna continue and agree. So after I do the installation sensation, I will absolutely test-ride the new features, because I have used macOS Mojave aside from the beta, I used the beta a little bit, just the first beta, I never updated it. Aside from that, I used macOS Mojave for maybe five minutes in my entire life so I haven't used the features yet. A lot of it is new to me so this should be fun. We're gonna install it on the macOS partition. Sounds reasonable. And we're not connected to a power source because we are rebels. Now I don't know why these are called helpers, if anyone could tell me, that would be great. Hamburger Helper I guess. Let's do that. Here we go, about 10 minutes remaining, check it out. It's gonna then reboot and do the thing and keep going, it's gonna be longer than 10 minutes overall but at least we're off to a good star-- Oh 17 now, okay, well. That's disappointing. We're making real strides now, a whole minute has passed. I'm looking forward to this one, this should be much more steady than the High Sierra debacle. And I think that was mainly because High Sierra had a lot of under-the-hood changes but macOS Mojave is more of a feature focus release? So while that's doing its thing in the backgr-- Wait, what? Did it seriously just. What! Oh! Well that wasn't 10 minutes at all. Whatever. Well, I was gonna go through some of the features while it was freakin' doing its thing but I guess it's already done. But, quickly. There's a lotta things I wanna try. But Dark Mode is the thing I am most excited about. And for those who know me, you know I have like a dark mode fetish. I don't know why, I just do. And I'm guessing a lot of other people do, too. And it seems like a lot of things are moving with, you know, toward that direction of being dark, so yeah I'm excited for that. Desktop Stacks looks pretty cool too, I try to keep my desktop clean, but I'm kind of excited to have that just in case because sometimes it can get a tad messy and having the things just pile up on the desktop will be very noice. We'll dive into more of that stuff later when we do the test drive but for now it looks like this guy is early to the party. And the macOS Mojave is ready to install. Restart. (click) And here we go. And our installation has commenced. Oh, and I have a mouse cursor. Oh, and now I don't. And now there's a fruit. Don't know if that was supposed to happen or not but, I trust it, and there we go, there's our ETA, that's what I was waiting for. 36 minutes. The last estimate was 17 minutes and it took like three. So maybe it'll go faster, maybe not, so. You gotta entertain yourself somehow while the installation is commencing. So I'm having a bit of an E.T. moment. (ringtone) (censored) you! You beeped in the background, you ruined my moment! (SMPTE beep) So I'm having a bit of an E.T. moment. I'll be right heeere. And oh my gosh I'm already in love with this new lock screen (laughs) Yeah the last 10 minutes were like fake minutes, it went like: ten nine eight seven six five four three two one, boom! Done. Alright. Let's take a look here first. As we can see, it no longer Gaussian blurs out the background which looks pretty cool. Photo's now, you know, more visible, that looks cool. This is clearly the dynamic wallpaper because it's later in the day so we have kind of a sunset-y thing going on. That's pretty cool. And it looks like user icons are bigger. I'm already lovin' some of the visual tweaks here. iCloud Keychain, I do not save passwords into the cloud. I like to keep those just local. And I will keep all that stuff off, why not? And here we go. Ah yes, of course, choose your look. Light mode is kinda cool but dark mode's where it's at. I love dark mode. I cannot wait to just use dark mode, I'm so freakin' excited, ohh! Oh gosh. You shut down your computer because of a problem? I did? What! Well, we're already off to a great start! Is Mojave the problem? What did it do? Oh my gosh, well. Cancel, I guess. Okay. So it just wiped out the wallpaper I had set. Thank you very much, lads. Oh, there it goes (laughs). I mean, honestly the Mojave one is beautiful. But I like using my own photography. Okay. Now that the installation sensation is done, which by the way, that was effortless (chuckles). Good job, Apple. Now that the installation sensation is done, we will now take the features for a test drive. Yes, fabulous. Starting with appearance stuff. Oh, but wait. We have News in ze dock. That is a news feature, hah hah hah. But I don't give a shit! Okay. So now that that's taken care of. I just wanna immediately address the dark mode does affect the folder icons, those look like darker blue, that's cool. And we have a dark trash can. And I'm also noticing with the dark mode some like window design element, oh my gosh, that looks so f-- Oh shit, that looks so good (chuckles). I'm noticing like if we zoom in here, we do have like that bevel-y kinda look going on here. It seems to be more pronounced with the dark mode enabled which, you know, I'm not against that. Wow, this looks so good. Oh, chee, aye! Wow! Shit, like this could be the only feature they added and I would be okay with it. Yes, we're gonna explore more features, don't you worry. But holy cow, just this feature by itself, especially with like the blue texts there that gives me the item information, that ohh dude. Oh man. Just the dark windows and the dark menus and the dark dock and I am, oh, it's gettin' hot in here. Ho gosh. Hoo. Well, I want to try the Desktop Stacks feature but, like I said, I usually keep a pretty clean desktop sooo we may have to simulate something later. Yeah that feature is still gonna be cool using the Stacks. But it's kind of useless to me just because I try to keep my shit organized but-- Oh. Get back up there, you, what the sh--? Yo, w-what did you just? You just jumped around, okay well I'm gonna have to fix you. Sort by name. Let's go to System Preferences and fiddle with the appearance because I know there's new accent colors. Oh, that's hawt. We have purple! Oh yes, very good. We have pink! Pretty pretty. And separate highlight colors like usual. We have red. Oh-range! Ye-llow! Green! And graphite. I don't know, I'm so used to blue. Oh man, even the fill color is changing a little bit. Wait, what? Yeah, even the fill color kinda changes a little bit when you go graphite. I think there's a little bit of blue in this dark mode. There's actually a fun way to figure that out. Yes, there is a bit more blue in there than green and red. So yes, there is a little bit of a blue tint or blue shade in this dark mode gray, but if we switch it all to graphite, then it's just gray-gray. Cool, well I'm gonna keep that, I mean I like blue. I'm so used to the aqua look, I like the blue. So we got that, cool new features there. Now, let's go to the App Store which I never use. Not System Preferences, you a-hole! App Store. So, this is it. I mean it does look beautiful. This looks really good but again, I just don't have a huge use for it 'cause I don't really browse apps a lot. But maybe I will now with this new design. It does look really pretty. So I can see why people would use this. I don't know if I will, but I do like this layout. This is really pretty. Let's take a look at an app page. Ooh dats nice. Ooh dats very nice. New app store. Fantastic. Okay, so here's something I am kind of excited about because screenshots on the Macintosh have been around forever, and the way Grab works, is just so perfect. I love it. But I know they updated it. In fact, I don't think Grab even exists anymore. I think, yeah, it's just called Screenshot now. Let's open 'er up. And here's the new interface for taking screenshots. We have the marquee, and it looks like we can do Capture Entire Screen, Capture Selected Window, Record Entire Screen, Record Selected Portion. Now screen recording has been built into QuickTime for years since Snow Leopard, but now it's built into the Screenshot app, maybe it's still built into QuickTime, I should actually take a look at that. And let's see here. Save to desktop, documents, clipboard, mail, messages. Timer, nice. Yeah, show mouse pointer, remember last selection, show and capture. Wow, very nice. Very elegant. Very very nice. And the floating thumbnail thing I will show you in a bit. I don't remember if I demoed that in the beta system. Let's escape outta that. I wanna see if the shortcuts are still there. Awesome. So I can still do my classic macOS shortcut: shift-command-four, hold down the space bar, move around, or like shift-command-four, space bar, select individual elements. So it looks like those classic Screenshot shortcuts are still there, which makes me happier than a pig in shit. But we still get the awesome new thumbnail down here so I can click on that. And this is very meta, but yeah, now we have these new, looks like a Markup features which is really nice. So I can do Markup right inside of here without having to open up the Screenshot inside of the Preview application. Markup is now built in to the Screenshots, or I can say trash. Very cool. So let's try that with something else. Let's just say, heyyy. I really like this icon, it reminds me of Smosh. Let's have a look. Berp-pa-durp-pa-derp, take a screenshot like this, and boom, there it is. We can do Markup, text, shapes, everything, share it, trash it. And let's take a look at QuickTime here. I don't know what just happened, but launchpad just took a shit, okay. So we go file, it looks like we can still do screen recording from here. QuickTime, you know, I'm curious, would QuickTime get light in light mode? Probably not, 'cause QuickTime is like a dark application, typically, let's take a look. I'm curious. Yup, it stays dark. As it should! Very good, Screenshot. Helps if I spell screen correctly. And let's do Record Entire Screen, options, we'll just do no microphone for now, save to the desktop, show mouse clicks, and r-- I don't know what that is. Oh, click to stop recording. Oh. Very handy. Alright, and let's do it. Hey yo, this is my new tutorial. I'm gonna show you how to drag a window around. So what you do is you put your mouse cursor on the window. You click and hold down on the trackpad but not too hard, you don't wanna hurt it. And then you move your finger around like this. And that is how you drag a window around. Alright. So now our little recording goes down here. Click on that. I mean, I don't know about you but I do screenshots like a lot so having more of this stuff just automatic is really cool, and it looks so elegant especially with the dark mode, and it looks like we can trim right inside of here, too. Again, Markup and trimming, we can just do it right inside of freakin' like Quick Look windows and stuff. We don't even have to open things up in Preview or in QuickTime anymore. That's cool, oh. I just, oh! Shit. I just did a thing, I just saved it, I wasn't even like trying to do that, it just happened. Let's have a look. It recorded at 52.4 frames per second, so yeah, it probably dropped a few frames and it averaged out. But yeah, let's look at playback. I mean, I'm looking at it, it's definitely not a perfect 60 but yeah, smoother than 30 though. Cool, and look at that down here, we have a new section in ze dock, and I immediately don't like it. I'm guessing that's for recent applications, so I'm gonna turn that shit off. Yup, goodbye. There we go. So in Quick Look now which again, is a feature I use all the freakin' time, yes, just as I remembered from the original demo from Craig Federighi, you can do things like rotation and trimming right inside of Quick Look now without having to open up files inside of QuickTime. And an error occurred! That's great! I think that feature might need a little bit of work, I'll just put you in the garbage, okay. Safari dark mode. It still looks good. Ooh, our rainbow thing looks like really good at the top of that, oh. Oh, that's good, just that nice frosted glass with the dark on it, that looks really good. Oh yeah, did you follow me, camera guy? We need an instant replay of this. Just, hoo, look at that. Look at Brent's face, just gauzy and blur right there, that is beautiful. Okay. That was fun. Dark mode Safari looks very cool, too. Just everything in dark mode looks so freakin' cool. Now I know there's some new Safari features as well but I actually already had those in High Sierra because, Safari 12 I think we're on now, was compatible on High Sierra, 12, yes indeedy. Alright, let's see what else we can do here. Group FaceTime, you have to have friends for that feature to work though, so I'm just gonna scroll right by that. So, let's take a look at some of those new apps. Voice Memos. Welcome to Voice Memos! More devices now runs on the Mac. Syncs with iCloud, redesigned. Continue. Current location, yes. Oh, that's cool, so it will yeah name your files based on where you are. That's cool. I'm a little picky about location features though. But that is really cool. So I'm guessing, I don't know where my, I'm on iOS 12 on my phone but I guess I just haven't turned on the iCloud sync for those features yet inside of the Voice Memos application. But I'm guessing those would show up here. So let's do a recording. Ooh, that looks pretty. Check, check, microphone check, we're checking. It looks like it's really getting loud, it's probably clipping, my audio's probably like overmodulating. Oh yeah, that's horrible. We're gonna bring it down now just a little bit so we're not clipping like crazy. This interface is really cool. Pause, resume, done. Rewind, scrub. (playback) Oh yeah, that's horrible. We're gonna bring it down now just a little bit so we're not clipping l-- And done. Beautiful, and I can just scroll right through this. Wow, that is really convenient, and we have, oh! Okay. This is like a very iOS-ish interface element, this popover here. I've never seen those in macOS, I mean I've seen popovers in macOS before but never stylized like this, are we gonna be seeing more of that? That's interesting. See now, this is what I'm more used to. For like a standard like macOS UI menu. That's interesting. I was not expecting that, I'm kinda weirded out. Also, the like little stem of the bubble here is like not centered and it is driving my CDO insane. It's not center--oh my gosh, ohhh. Oh, Craig Federighi, fix that please. (shuddering) Okay, hang on, it's okay. Deep breaths, deep breaths, okay, we can ignore that, everything else looks pretty good so far. Let's take a look at Home even though I have zero Home devices. And you have to have iCloud Keychain on for it. Which I guess I could turn on but again, I don't have any Home devices. Again, another new feature I really can't use but oh well. Stocks, I will tell you this. I don't have stocks anymore. But I still like to look at fancy sparklines. Now that looks nice, it's cool to have this built-in. This interface is like really pretty though. Like you can see ranges there. Alright, I am going to lock my screen here. Oh, that's hot, behbeh. I like it. Yeah, it doesn't blur out the wallpaper anymore. Aw, that looks beautiful. Wow, that looks really good. Let's take a look at Notification Center. Ah, no notifications, status quo, perfect. But it does look nice in the dark mode again. Desktop Stacks, that's right. My desk is too clean. But let's just pretend, and boom. Boom! Shuh! Nice and pretty. So if my desktop does get messy, it can now default to this. And it just kinda stacks things up, and I can still preview things, yup, that looks good, and I can close 'em. Can I slow-mo this? Ohh. I can slow-mo that. Let's, wachoo. Let me play you this in slow-mo. Good old Steve Jobs moments. Okay, yeah, that's a cool feature. And I can still right-click inside of 'em, good. Oh, let's see group stacks by, oh I can change how I group the stacks, and I can drag a stack of items into the trash. Okay. So I can just say like hey, these are just copies of things, oh I'm just gonna drag 'em into the bin. Goodbye. Yes, I'd love to empty my trash. Fantastic. So word on the street is there's more metadata in the Finder even though the Finder could already display a healthy amount of metadata, especially through the Get Info panel or window. So let's say I have a picture of this awesome Orange Krate Sting-ray by Schwinn. Normally I would go command-I and be like, oh there's my metadata, shot on an EOS 60D. Wow, that must've been a while ago 'cause I haven't had a 60D in forever. So yeah, all that stuff is there so I don't really know what's new with that, but I know there is also like the Preview window, like this, I don't see, show more maybe? Maybe that's what's new in the Preview panel, you used to not be able to expand this. I think that's what it is. And I know this stuff down here is new, too, so you could do Markup right from here, you can do rotation right from here. Oh, I can even like bulk create PDFs right from there, customize, I can probably add things to those menus through extensions. Oh cool, trim, create PDF, sweet! Yeah kind of reminded me of those Windows XP features, you know, you had the built-in things right there on the sidebar. Oh, and this mode especially, Gallery Mode. Yeah, this is like real Windows XP-ness. (hand hits table) Tsk. Wow, I shouldn't have said that. This is real Windows XP-esque. (laughs) Oh gosh, why! Oh shit. Oh, there's a bunny! But yeah, I do like this mode, I mean, it is kind of a like a direct ripoff of Windows XP, but yeah, well. We'll just say Microsoft, you made a cool feature. And it'll live on (chuckles) in Mojave. And yeah, having the more metadata there with the quick actions here, too is really cool, plus, overall this just looks really pretty, it almost feels like I'm using a photo application. And I can just, let's see, let's do a rotate. Yeah, right inside of there, wow. I'll make sure I save it that way 'cause that's how it should be rotated. Hmm. I do like that, I'll probably stick to Icon View just because that's what I'm really used to, I like seeing a lot of stuff at once, but if I ever need to really look at stuff I can kinda go into Gallery Mode just like that, and have a ball. And I'm also noticing we're going kind of in a circle here. Earlier, in a past video I said tech trends go in circles. I think they actually go in a spiral because sometimes we come back to our old ways but we're still advancing forward at the same time, so it's a spiral. And one example of that is, Software Update. Looks like it's its own separate thing inside of Settings now. It used to be a whole separate app, then it was integrated with the App Store in the Apple menu and stuff, and now it's just a separate panel inside of the System Preferences which, wait a burger-flippin' second! I'm not on 10.14.1! Well, blow me down! Okay, oh cool, advanced. We have some la carte functionality here. (bell dinging). That must be because the, oh yeah, the automatic download from earlier was downloaded before .1 was released. I'll install .1 just to be sure, and it looks like you know, things are smooth, like you know, we're not having any like, crazy-like (rubbing trackpad) window server lag, like that was a huge issue with the freakin' High Sierra stuff but I think, I'm not an expert but I think that was because the window server was rewritten in Metal and it was just kind of buggy at first, but right now, I mean that's, you know, I'm seeing a perfect 60 FPS there, I'm not seeing any issues with any of this stuff. Well that's fantastic! I'll just start editing in Final Cut Pro and see if shit hits the fan, right? It looks like we have an advertising section in Security and Privacy now, limit ad tracking, huh. Because I know there's-- That's off by default or is it just off for me because I did an upgrade? That's interesting. I'm gonna have to look into that some more but that's cool. Automation, Full Disk Access. I don't remember this being an item in here before but I might just be mistaking. So even though I covered a few features, I know I didn't cover them all, let me know what ones I did miss and what features are your favorite. So far, we're off to a great start, but I'll let you know in a week if things start getting crappy. Also, I did just wanna say one thing here. Whip! Krazy Ken, me, yeah, I'm now on Patreon. So if you wanna help me beat the curse and even have a chance to get your name in the show credits like these awesome guys, (sci-fi typing) please visit the Patreon and throw a pledge my way, and we can all have more fun in this wonderful tech world. I'm calling this a win. Thanks for sticking with me, guys. Catch the crazy and pass it on. (electronica)",
    "transcript_keywords": [
        "Dark Mode",
        "dark",
        "cool",
        "Mode",
        "yeah",
        "High Sierra",
        "macOS Mojave",
        "Mojave",
        "good",
        "features",
        "things",
        "feature",
        "pretty",
        "kind",
        "thing",
        "bit",
        "window",
        "macOS",
        "Sierra",
        "nice"
    ],
    "transcript_entity_values": [
        "the MacBook Air",
        "Metal",
        "Windows XP",
        "two",
        "Quick Look",
        "Mojave",
        "six",
        "Markup",
        "about 10 minutes",
        "iCloud Keychain",
        "Gallery Mode",
        "Gaston",
        "Quick Look",
        "maybe five minutes",
        "four",
        "one",
        "Deep breaths",
        "Markup",
        "macOS",
        "EOS",
        "60D",
        "minutes",
        "UI",
        "CDO",
        "High Sierra",
        "60 FPS",
        "32",
        "years",
        "Apple",
        "10.14.1",
        "12",
        "Brent",
        "Mac",
        "ten nine eight",
        "Gaussian",
        "sci-fi",
        "Mojave",
        "first",
        "36 minutes",
        "E.T.",
        "Microsoft",
        "FaceTime",
        "Berp-pa-durp-pa-derp",
        "iCloud",
        "Get Info",
        "Finder",
        "Icon View",
        "Screenshots",
        "three",
        "zero",
        "macOS Mojave",
        "Notification Center",
        "Snow Leopard",
        "a whole minute",
        "Craig Federighi",
        "Sierra",
        "l--",
        "the last 10 minutes",
        "Patreon",
        "Desktop Stacks",
        "today",
        "Krazy Ken",
        "Final Cut Pro",
        "Shuh",
        "seven",
        "17 minutes",
        "Safari",
        "Steve Jobs",
        "10",
        "iOS 12",
        "Schwinn",
        "a week",
        "52.4",
        "Smosh",
        "10 minutes",
        "60",
        "ETA",
        "30",
        "Preview",
        "Mac",
        "Macintosh",
        "Orange Krate Sting-ray",
        "Mac Pro",
        "the App Store",
        "Yo",
        "PDF",
        "Dark Mode",
        "second"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "LOC",
        "CARDINAL",
        "NORP",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "WORK_OF_ART",
        "TIME",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "LAW",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL"
    ],
    "vector": [
        -0.07002074271440506,
        -0.06542553752660751,
        0.07750420272350311,
        -0.11198821663856506,
        0.046580977737903595,
        -0.006677211727946997,
        0.08078408241271973,
        -0.041431449353694916,
        0.016663020476698875,
        -0.022770458832383156,
        0.020791923627257347,
        -0.014930271543562412,
        0.03396828472614288,
        0.02057426981627941,
        -0.01742583140730858,
        -0.015316955745220184,
        0.12969355285167694,
        -0.02222066931426525,
        -0.00307822460308671,
        0.03832600638270378,
        0.05862481892108917,
        -0.09674812108278275,
        0.04248979315161705,
        -0.007318783551454544,
        -0.030811553820967674,
        0.05704418569803238,
        0.023919712752103806,
        -0.0009390436462126672,
        -0.02872243896126747,
        -0.029035864397883415,
        -0.026176027953624725,
        0.005641795229166746,
        0.001976518426090479,
        -0.04472464323043823,
        0.0631122812628746,
        -0.043890226632356644,
        0.0100734056904912,
        -0.002913202391937375,
        -0.12711374461650848,
        0.02893471159040928,
        -0.058659885078668594,
        0.00022437919687945396,
        0.014029191806912422,
        0.030831405892968178,
        -0.008432016707956791,
        -0.04235950857400894,
        0.07698719203472137,
        -0.14604918658733368,
        0.06596630811691284,
        -0.042055241763591766,
        -0.03743983805179596,
        -0.029834061861038208,
        0.0569128580391407,
        -0.006141883321106434,
        0.02142160013318062,
        0.015386998653411865,
        -0.02150803431868553,
        0.03676566109061241,
        0.09479369223117828,
        -0.039581503719091415,
        0.015369837172329426,
        -0.0458405502140522,
        0.0018215738236904144,
        0.04818356782197952,
        0.06752172112464905,
        -0.03102186694741249,
        0.02534581534564495,
        0.05823734402656555,
        -0.005998790264129639,
        -0.05308854207396507,
        -0.03304373845458031,
        -0.009259396232664585,
        0.04494563490152359,
        0.0683635026216507,
        -0.06610225886106491,
        0.04335292428731918,
        0.0247043427079916,
        -0.10719531774520874,
        -0.012806342914700508,
        -0.04601150006055832,
        0.060383450239896774,
        -0.028250986710190773,
        -0.05803241208195686,
        -0.028050195425748825,
        0.057354461401700974,
        -0.017652830109000206,
        -0.028051448985934258,
        -0.014368011616170406,
        0.02639780566096306,
        0.05145793780684471,
        -0.04634936898946762,
        0.01065817940980196,
        0.05326421558856964,
        -0.024294622242450714,
        0.0019811070524156094,
        -0.037889763712882996,
        0.011712326668202877,
        -0.0297260545194149,
        -0.06806433945894241,
        0.09173434227705002,
        0.013781470246613026,
        -0.021273812279105186,
        0.07984676212072372,
        -0.03589761257171631,
        0.029921187087893486,
        -0.05852614715695381,
        0.006935058627277613,
        0.06494544446468353,
        0.0413004532456398,
        0.036950837820768356,
        -0.041129156947135925,
        -0.005857038777321577,
        0.0256586205214262,
        -0.025019751861691475,
        0.07977335900068283,
        0.09590660780668259,
        -0.06401369720697403,
        0.050334684550762177,
        0.03743031248450279,
        0.006089115049690008,
        0.13934749364852905,
        0.00033766470733098686,
        -0.00925022829324007,
        0.03075786493718624,
        0.09592954814434052,
        0.027034547179937363,
        0.06408365070819855,
        5.5896798803034325e-33,
        0.023236608132719994,
        0.011734758503735065,
        -0.009573856368660927,
        0.0037197545170783997,
        0.04288075119256973,
        -0.07954840362071991,
        -0.055210940539836884,
        0.0329899936914444,
        -0.1326351910829544,
        -0.0073043350130319595,
        -0.0012895287945866585,
        -0.018532391637563705,
        -0.08500204980373383,
        0.010135946795344353,
        0.0008211212698370218,
        0.0013547911075875163,
        -0.04565251246094704,
        -0.026263803243637085,
        -0.029941348358988762,
        0.04724525287747383,
        0.053400542587041855,
        0.0020569644402712584,
        -0.01010890118777752,
        0.017115142196416855,
        -0.07394477725028992,
        0.03464127704501152,
        -0.022466018795967102,
        -0.03558887913823128,
        0.07822009921073914,
        0.04969470202922821,
        -0.15345951914787292,
        -0.010233202017843723,
        0.04262204468250275,
        -0.034316953271627426,
        -0.06160964071750641,
        -0.052979953587055206,
        -0.10173601657152176,
        -0.06558658927679062,
        0.022201688960194588,
        -0.06532266736030579,
        -0.05711119994521141,
        -0.022943539544939995,
        -0.10116725414991379,
        -0.012057185173034668,
        -0.013226468116044998,
        -0.022244354709982872,
        0.08177854865789413,
        0.04714774712920189,
        0.03518073260784149,
        0.0937298834323883,
        -0.0311566349118948,
        -0.04322166368365288,
        0.03627155348658562,
        0.0028309840708971024,
        -0.025848466902971268,
        0.049817729741334915,
        0.0773138701915741,
        -0.09157519042491913,
        0.06617244333028793,
        -0.010154418647289276,
        0.016524530947208405,
        0.07408629357814789,
        0.059826843440532684,
        -0.05090993270277977,
        -0.036007191985845566,
        -0.05881071090698242,
        0.023532306775450706,
        0.04511211812496185,
        -0.0374210886657238,
        0.03586633875966072,
        -0.09902748465538025,
        0.006544177886098623,
        0.026329731568694115,
        -0.08954490721225739,
        0.043860964477062225,
        -0.03371702879667282,
        -0.07684766501188278,
        -0.007993120700120926,
        -0.06459692120552063,
        0.06592542678117752,
        0.028482897207140923,
        -0.04804155230522156,
        -0.0206876453012228,
        0.03168117627501488,
        0.01560196466743946,
        0.03865910321474075,
        0.02789669670164585,
        0.017465250566601753,
        -0.050595320761203766,
        0.04947886988520622,
        -0.004698130302131176,
        -0.07181768119335175,
        -0.0032746128272265196,
        0.016700327396392822,
        -0.03684071823954582,
        -6.139597810795192e-33,
        0.08281765878200531,
        -0.04546104371547699,
        -0.03951752558350563,
        -0.020374244078993797,
        0.013584395870566368,
        0.023979399353265762,
        -0.030199892818927765,
        -0.0209719929844141,
        -0.030106276273727417,
        -0.08551086485385895,
        0.002984486985951662,
        -0.020299596711993217,
        -0.06725660711526871,
        -0.028643537312746048,
        -0.02155146934092045,
        -0.049984611570835114,
        -0.04664590209722519,
        0.08761554956436157,
        -0.023003147915005684,
        -0.0022226530127227306,
        0.05432189255952835,
        -0.035918693989515305,
        -0.04418591782450676,
        -0.009751652367413044,
        0.002303210785612464,
        -0.003482030937448144,
        0.06172170862555504,
        0.12923207879066467,
        -0.018233105540275574,
        0.05648927763104439,
        -0.025104792788624763,
        0.017087114974856377,
        -0.09584691375494003,
        0.015141255222260952,
        0.04611571133136749,
        0.07297906279563904,
        0.05086270347237587,
        0.03841646388173103,
        -0.1112537831068039,
        -0.015455245040357113,
        0.06903500854969025,
        0.08026459068059921,
        -0.053292687982320786,
        -0.013193250633776188,
        -0.06965668499469757,
        0.02875802293419838,
        -0.06529684364795685,
        0.026252472773194313,
        -0.017121300101280212,
        -0.07370845228433609,
        0.00840697344392538,
        0.019827665761113167,
        -0.019262799993157387,
        -0.013275569304823875,
        -0.05094617232680321,
        0.03411242365837097,
        -0.015664223581552505,
        0.11284726858139038,
        0.019741352647542953,
        0.05824728310108185,
        -0.05154553800821304,
        -0.08001533150672913,
        -0.00418809475377202,
        -0.12607330083847046,
        0.04202651232481003,
        0.0017381536308676004,
        0.005611654836684465,
        0.0844513550400734,
        0.022995000705122948,
        0.003673800267279148,
        0.01839325949549675,
        0.020191213116049767,
        0.027471503242850304,
        -0.10061821341514587,
        0.07768117636442184,
        -0.015401577576994896,
        -0.00847186055034399,
        -0.018685564398765564,
        -0.029695061966776848,
        -0.05348466336727142,
        -0.007181400898844004,
        0.0037405546754598618,
        0.05631813779473305,
        0.057807229459285736,
        0.0018124651396647096,
        0.08662190288305283,
        0.009978258982300758,
        0.06987203657627106,
        -0.009790334850549698,
        0.014970806427299976,
        -0.00639196764677763,
        0.027497831732034683,
        0.009641692973673344,
        0.0695621520280838,
        -0.008765911683440208,
        -5.7279756049410935e-08,
        -0.09359057992696762,
        -0.017407018691301346,
        0.0067821042612195015,
        -0.027841513976454735,
        0.11127430945634842,
        -0.01798553206026554,
        -0.03478631749749184,
        -0.006768173072487116,
        0.017867861315608025,
        -0.042609766125679016,
        0.14857858419418335,
        -0.032649215310811996,
        0.0013562868116423488,
        0.044321708381175995,
        0.03018781915307045,
        0.038149502128362656,
        -0.06163913756608963,
        0.12165786325931549,
        -0.02981697767972946,
        -0.030885929241776466,
        -0.010217016562819481,
        0.0017011945601552725,
        0.04455675557255745,
        -0.053288355469703674,
        -0.007433101534843445,
        0.07057227939367294,
        0.03715011104941368,
        0.05450691655278206,
        0.07806023955345154,
        -0.011984946206212044,
        -0.029460294172167778,
        -0.03442149981856346,
        -0.08393029868602753,
        -0.037140876054763794,
        0.013846435584127903,
        -0.057663436979055405,
        -0.11456548422574997,
        0.06943511217832565,
        0.022257588803768158,
        -0.005914365407079458,
        -0.05478741228580475,
        -0.059328895062208176,
        0.01608717441558838,
        0.019071178510785103,
        -0.03770895674824715,
        0.0631612092256546,
        -0.03659167140722275,
        0.016969282180070877,
        0.018396982923150063,
        -0.016394738107919693,
        0.007754381280392408,
        -0.03628147393465042,
        -0.06998123973608017,
        0.05706850066781044,
        0.0640207901597023,
        -0.036494337022304535,
        0.07685810327529907,
        -0.010205427184700966,
        -0.046260733157396317,
        0.02860334701836109,
        0.08052831143140793,
        -0.0505836121737957,
        -0.035110946744680405,
        0.019945940002799034
    ]
}