{
    "id": "ZTSKqPIxC_A",
    "title": "Xperia XZ Screen Repair - Battery Replacement - Complete Teardown",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-01-10T14:00:47Z",
    "video_url": "https://www.youtube.com/watch?v=ZTSKqPIxC_A",
    "category": "Howto & Style",
    "tags": [
        "Xperia XZ",
        "Teardown",
        "XZ disassembly",
        "How to take apart Xperia XZ",
        "Xperia XZ repair guide",
        "Sony Xperia XZ",
        "How to fix xperia XZ",
        "Android",
        "Smartphone",
        "Tech",
        "Assembly",
        "Cell Phone repair",
        "Repair video",
        "XZ",
        "Sony",
        "Xperia",
        "Water Resistant"
    ],
    "views": 1273083,
    "likes": 13868,
    "comments_count": 1426,
    "description": "Get a replacement screen HERE:  Awesome Smart Phone Tool Kit:  Metal phone opening tool:  Green Pry tool:  LET ME KNOW IF THOSE LINKS STOP WORKING!!  No matter how nice you are to your cell phone... accidents happen, warranties expire, and sometimes you have to fix things yourself! Its time for the teardown video of the Sony Xperia XZ. One of the newest android phones from Sony.   Sony has done a FANTASTIC job with the XZ when it comes to screen replacements and battery replacements. Those two things are the first components to be removed from the cell phone after it has been taken apart.   The rest of the components, like the cameras and the charging port are still modular, and can be repairs, but its a little more complicated at that point. Check out the video to find out.   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://bit.ly/2jnXCBm",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "The Xperia XZ was released toward the end of 2016. This water resistant rectangular phone from Sony survived my durability tests and now its time to open it up, see what makes it so strong, and see what can be replaced. Lets get started. [Intro] The screen replacement process for the Xperia XZ is actually really really similar to the Google Pixel. There is a thin band of adhesive around the entire front glass of the phone. Remember that this phone is water resistant so if you are doing a screen or battery replacement, your phone will not be water resistant when you put it back together again. Right now Im taking my heat gun and warming up the edges of the phone until its just barely too hot to touch; this softens the adhesive and makes it more pliable, softer, and easier to work with. I use some business cards or playing cards to cut through the adhesive around the edge. After my super thin metal pry tool does the initial penetration. The LCD panel under the glass panel is very fragile so keep your tools away from that black part especially if you are planning on reusing your screen. There is one ribbon cable attaching it to the motherboard, so Ill remove the bracket holding that in place and then unsnap the connector just like a little Lego. So this is what the screen replacement looks like. Ill include a link in the video description for the replacement screens. You can check that for current pricing since that always does change with time. Luckily Sony screens arent too expensive, even when the phone is new. My screen is still functioning after the removal but that is only because I have done this procedure hundreds of times. If this is your first time removing a glued down screen like this, dont plan on it still functioning after the screen is taken off. It is extremely fragile and a bit harder than it looks on video. This type of design is really brilliant if your screen is already broken. You can replace a broken screen without touching any of the internal components, and I really love that about Sonys. Lets see how the rest of the phone looks. There is one screw holding down the little metal bracket over the battery connector. This needs to be removed and the battery unplugged before doing anything else. Make sure to use a plastic tool to disconnect the battery connector. Metal will cause a short and might ruin your phone. Once the battery is unsnapped and this little copper tape is pulled away, there are 9 more screws holding down the middle metal mid-frame. Make sure you keep all of your screws organized. And here is my second favorite part of this phone. The battery is attached to the mid-frame and completely pulls out away from the phone body; away from all the fragile electronics. On the top of this mid-plate it has the NFC pad on it which is located on the front of the phone right under the screen. The two little gold contact points rest right on the motherboard. Interesting placement, buy hey, if it works it works. And let me tell you why having the battery attached to the mid-frame like this is a good idea. You see these magical pull tabs under the battery? These are supposed to help you remove the battery without a lot of force or prying, but sometimes they do snap, forcing you to attempt the pry of shame. And when the batteries right next to a motherboard, like on any of the iPhones, prying becomes very difficult because you dont want to put any pressure on or damage any of the fragile components. When the battery is adhered to a removable mid-frame like this, you can just pull it away from the phone and theres nothing to damage if youre forced to start prying. Pretty darn smart on Sonys part. Now obviously I should have removed the SIM card tray before starting this repair. I seem to always forget that step, but at least I use my blinker while Im driving. You win some, and you lose some. This little black card pulls out of the SIM tray and it has your phones IMEI and other information. So thats something new. Lets take a look at this charging port. In order to get at the charging port there is one screw holding down a little black plastic bracket. And here is the part that I dont like about Sony phones. There is actually a ton of little plastic brackets inside of this phone. They did this same mumbo jumbo over on the Z5 Premium too. There is a bracket for the charging port, another over the signal wires, one over the motherboard, and another under the camera. Sony was doing such a good job of keeping things simple up until this point. Anyway, back to the charging port. It unplugs from the main board and then there is a signal wire to unplug from the bottom board and then the whole thing will just pull up and away from the base of the phone. There are a couple of interesting things here. First we have that rubber ring around the charging port itself. This will help keep water out of the phone. But the board itself does not have any of the clear glue covering the components like an iPhone or a Samsung sometimes have. So I still recommend not trusting any kind of waterproofing and just keeping your phone dry as much as you can. The little plastic sideboard with its two signal wires can pop out next. And then we can work on the motherboard. Theres yet another black plastic bracket thing up here surrounding the cameras. And this one is actually pretty hard to remove. After its out, the motherboard and its two cameras can pull away from the frame. There is no optical image stabilizing on these cameras. The rear is a 23 megapixel camera and the front is a 13 megapixel camera. They do have electronic stabilization though, so maybe Ill have to do a side by side camera test on this phone. Let me know in the comments which phone you want me to put it up against. Check out the adhesive around this headphone jack. There is no way water is getting in around this port. Maybe Apple can learn a couple things from Sony. The jack itself just has a small plug that snaps into the motherboard. The only bad part about reassembling this phone is that there are so many seemingly pointless plastic brackets to put back into place. Sony is really the only company that does this. Im making sure the motherboard is set in place without blocking any of the ribbon cable connecters. And then I can snap in the extension ribbon, the headphone jack, and then try to get the top black plastic bracket back into place as well as I can. It never fits quite right the second time around. The side plastic goes into place with its little signal wires. Then Ill tuck those into the grooves they came from. And then I can get the charging port pushed back into the little slot. Remember that the phone is no longer water resistant since I took it completely apart. There is a black plastic bracket down here in the corner with its little screw. And Ill get the signal wires plugged in over their circular connections on the board. The little vibration motor is in the very corner of this phone and you can see that here, spinning. The plastic brackets go into place on the right side of the motherboard. And then Ill clip in the charging port extension ribbon and the two little signal wires. Ill add on a couple other random plastic bits and the battery. If I do get a replacement battery it will probably have its own adhesive, but Im just going to reuse the one I have and set it back into place. Then set the middle metal mid-frame down over it. There are a total of 10 screws now that were screwing in. Dont forget the little metal bracket over the battery plug; that is important. And if you kept your screws organized during this entire process it will be pretty easy. Plugging in the new screen is simple enough. Just make sure the plug protector is in place. This helps make sure that the connection wont come loose if your phone is ever dropped. Your replacement screen should come with its own adhesive as well. Ill have to add some of my own since Im just reusing my original screen, but everything is still working. I super appreciate the easy screen replacement and the easy battery replacement since those are the two most common repairs that people will do on this phone. But the rest of the phone is kind of a design nightmare, and thats fine since the average person will never need to get that far inside of the phone. It is interesting to see though. Let me know what phone you want to see tested and torn down next in the comments. I do read the comments and Im always looking for new devices to check out. Come follow me on Instagram and Twitter. Thats where the real partys at. Thanks for watching. Ill see you around.",
    "transcript_keywords": [
        "phone",
        "screen",
        "battery",
        "Ill",
        "plastic",
        "black plastic bracket",
        "charging port",
        "screen replacement",
        "Sony",
        "replacement",
        "motherboard",
        "bracket",
        "plastic bracket",
        "port",
        "place",
        "charging",
        "black plastic",
        "Sony phones",
        "battery replacement",
        "metal"
    ],
    "transcript_entity_values": [
        "iPhone",
        "Sonys",
        "9",
        "the Google Pixel",
        "Lego",
        "Instagram",
        "two",
        "jack",
        "the end of 2016",
        "Sony",
        "a ton",
        "SIM",
        "hundreds",
        "10",
        "23 megapixel",
        "Ill",
        "the Xperia XZ",
        "NFC",
        "iPhones",
        "Apple",
        "the Z5 Premium",
        "first",
        "second",
        "LCD",
        "IMEI",
        "First",
        "Samsung",
        "13 megapixel",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.10844096541404724,
        0.10671953856945038,
        0.07827717065811157,
        -0.0994267463684082,
        0.0606866329908371,
        -0.030911743640899658,
        0.08388537913560867,
        0.06504605710506439,
        -0.026589274406433105,
        0.051816537976264954,
        0.10072727501392365,
        0.008232329040765762,
        -0.014433524571359158,
        0.0718279778957367,
        -0.0008990980568341911,
        -3.49503789038863e-05,
        -0.012293405830860138,
        0.026677407324314117,
        -0.06574045866727829,
        0.1097872406244278,
        0.05236155912280083,
        -0.06280215084552765,
        0.014611839316785336,
        -0.1009650006890297,
        -0.0049211811274290085,
        0.06227198615670204,
        0.0303356796503067,
        0.028004061430692673,
        -0.05006486922502518,
        -0.06675366312265396,
        -0.09005377441644669,
        0.06454406678676605,
        -0.017508577555418015,
        0.04803822934627533,
        0.020958540961146355,
        -0.06166952848434448,
        0.04815627634525299,
        -0.01481868326663971,
        -0.057980552315711975,
        -0.04436244070529938,
        -0.025394637137651443,
        0.03139890730381012,
        -0.031260184943675995,
        -0.029456034302711487,
        0.02021159790456295,
        0.00013151360326446593,
        0.09193151444196701,
        -0.08468858152627945,
        0.016637178137898445,
        0.06376862525939941,
        -0.044059183448553085,
        0.052326980978250504,
        0.03067726269364357,
        0.0538131408393383,
        -0.0590355359017849,
        0.01910570077598095,
        0.0046864161267876625,
        -0.013565562665462494,
        0.041476380079984665,
        0.005740339867770672,
        0.0766654908657074,
        0.05552811548113823,
        -0.035070374608039856,
        0.09132286161184311,
        0.013935643248260021,
        0.006258714012801647,
        0.0377100333571434,
        -0.1060028150677681,
        -0.025133945047855377,
        -0.004720188677310944,
        -0.062196362763643265,
        -0.03635420650243759,
        -0.028551874682307243,
        -0.028103601187467575,
        -0.08082886040210724,
        0.04779685288667679,
        0.05470629408955574,
        -0.07122433930635452,
        -0.059520043432712555,
        0.04696650803089142,
        0.015064910985529423,
        0.012614859268069267,
        -0.076468825340271,
        0.03953581675887108,
        0.06566999852657318,
        0.02425745129585266,
        -0.04124027118086815,
        0.0500994548201561,
        -0.0020589239429682493,
        -0.015382732264697552,
        -0.08958270400762558,
        0.08668382465839386,
        -0.028276536613702774,
        -0.044285859912633896,
        -0.025771016255021095,
        -0.037825070321559906,
        0.021147718653082848,
        -0.06709936261177063,
        -0.014454402960836887,
        0.047690100967884064,
        0.044254496693611145,
        -0.01672240160405636,
        0.09404359012842178,
        -0.058550234884023666,
        -0.017756188288331032,
        -0.06464704871177673,
        -0.08755330741405487,
        0.05022873729467392,
        -0.07006405293941498,
        0.000730647356249392,
        -0.06599805504083633,
        0.0010596360079944134,
        -0.02115410380065441,
        -0.017583537846803665,
        0.03454473242163658,
        0.049275174736976624,
        -0.008316731080412865,
        0.027520619332790375,
        0.086041159927845,
        -0.04916669800877571,
        0.03673233464360237,
        -0.03587907925248146,
        -0.07355187833309174,
        0.008352839387953281,
        0.048047080636024475,
        -0.007480615749955177,
        -0.004012652672827244,
        2.069242725890635e-33,
        -0.005360412411391735,
        0.09959662705659866,
        -0.024319322779774666,
        -0.014986688271164894,
        -0.015346527099609375,
        0.07995956391096115,
        0.11913095414638519,
        0.05650368332862854,
        -0.020280960947275162,
        0.05285320430994034,
        -0.0010801487369462848,
        0.021519260480999947,
        -0.0067413742654025555,
        -0.08936450630426407,
        -0.005061568226665258,
        -0.030424732714891434,
        0.008944939821958542,
        -0.032600514590740204,
        -0.06040278822183609,
        0.038788795471191406,
        0.0007972464081831276,
        -0.023678351193666458,
        -0.004950942937284708,
        0.03787669911980629,
        0.04341469705104828,
        0.06321544945240021,
        0.07998331636190414,
        0.027800600975751877,
        -0.024464070796966553,
        0.005654616747051477,
        -0.04076176509261131,
        0.049837104976177216,
        0.04149623587727547,
        0.042791929095983505,
        0.0023156446404755116,
        -0.0031472179107367992,
        0.014935719780623913,
        -0.06135387346148491,
        0.003516614669933915,
        -0.0881638452410698,
        -0.0874088928103447,
        0.04139616712927818,
        -0.020758599042892456,
        0.01856115274131298,
        0.0318848118185997,
        -0.0309156384319067,
        -0.06604211032390594,
        0.031230119988322258,
        -0.03542798385024071,
        -0.1425628662109375,
        0.025528274476528168,
        -0.05683619901537895,
        0.03592485934495926,
        -0.0242672897875309,
        -0.12426377832889557,
        0.050777774304151535,
        -0.04161546006798744,
        0.019937215372920036,
        -0.01758122816681862,
        0.013720693066716194,
        0.09342942386865616,
        0.0009504914050921798,
        -0.04810234531760216,
        0.052733395248651505,
        0.022307613864541054,
        0.013152924366295338,
        -0.01460794173181057,
        -0.01426242757588625,
        -0.0707930475473404,
        -0.007633538451045752,
        -0.017994388937950134,
        -0.028761060908436775,
        0.04077081009745598,
        -0.022879131138324738,
        -0.00283270631916821,
        0.053406666964292526,
        -0.04962305352091789,
        -0.02273748442530632,
        -0.0065703317523002625,
        0.0035916196648031473,
        0.021576765924692154,
        0.0061903526075184345,
        0.09039364010095596,
        -0.0058831749483942986,
        -0.01937357522547245,
        -0.07493868470191956,
        -0.00101004121825099,
        -0.061879780143499374,
        -0.00047970371088013053,
        -0.012055356986820698,
        0.02093108929693699,
        -0.0667521134018898,
        -0.07421381771564484,
        -0.07023964077234268,
        0.009740498848259449,
        -4.653338018446016e-33,
        0.006094965152442455,
        -0.06696756184101105,
        0.018270544707775116,
        -0.014284631237387657,
        0.05696635693311691,
        -0.04913421347737312,
        -0.00746476836502552,
        0.044737059623003006,
        0.04614603891968727,
        -0.03984176367521286,
        -0.0361202210187912,
        0.0030149612575769424,
        -0.08845965564250946,
        -0.06501089036464691,
        -0.011807144619524479,
        0.026855425909161568,
        0.02246517688035965,
        -0.08886761963367462,
        -0.05543404445052147,
        0.011433320119976997,
        0.03816724941134453,
        0.10078810900449753,
        0.08709171414375305,
        0.05690398067235947,
        -0.005873120855540037,
        -0.012765493243932724,
        0.04821043461561203,
        -0.016781412065029144,
        0.04987126588821411,
        -0.0190731268376112,
        -0.02727128379046917,
        -0.04380066320300102,
        0.014053604565560818,
        0.07173298299312592,
        0.040047161281108856,
        0.051165755838155746,
        0.035940445959568024,
        -0.01520121656358242,
        0.03802478685975075,
        -0.014247632585465908,
        0.00458335317671299,
        0.04550261050462723,
        -0.017140604555606842,
        0.007822053506970406,
        0.03491085022687912,
        -0.01971818320453167,
        0.0005946540040895343,
        -0.016193101182579994,
        -0.027722584083676338,
        0.05775954946875572,
        -0.018320057541131973,
        0.0022319206036627293,
        -0.07231512665748596,
        0.04142327234148979,
        0.011505434289574623,
        0.016580235213041306,
        0.02506423555314541,
        -0.09149162471294403,
        -0.011755210347473621,
        -0.02877308800816536,
        0.08620058745145798,
        0.020817331969738007,
        -0.019272299483418465,
        -0.029525376856327057,
        -0.01366762351244688,
        -0.0869612917304039,
        0.06949607282876968,
        0.04526958987116814,
        -0.024789126589894295,
        -0.014261767268180847,
        0.05073908716440201,
        0.0491807721555233,
        -0.015236645936965942,
        -0.04512745514512062,
        0.040542103350162506,
        0.0246247798204422,
        -0.13398854434490204,
        -0.01619250513613224,
        -0.025391889736056328,
        -0.02485768496990204,
        0.07780668884515762,
        -0.126169815659523,
        0.08004172146320343,
        0.03928842395544052,
        0.087245412170887,
        -0.016502555459737778,
        0.033214859664440155,
        0.08294601738452911,
        -0.049168989062309265,
        -0.08044353127479553,
        -0.07713807374238968,
        -0.014228402636945248,
        -0.0020553646609187126,
        0.08267416805028915,
        -0.030480174347758293,
        -4.672387277082635e-08,
        0.04135661944746971,
        0.02480471320450306,
        -0.04646657407283783,
        -0.039804331958293915,
        0.014060696586966515,
        -0.05436662584543228,
        -0.05677741393446922,
        0.043526746332645416,
        0.1408318430185318,
        -0.06914810091257095,
        -0.02073793299496174,
        -0.018645474687218666,
        0.023381751030683517,
        0.08000084012746811,
        -0.08005677908658981,
        0.08583690971136093,
        -0.03269045799970627,
        0.07047848403453827,
        0.0024530692026019096,
        0.050381459295749664,
        -0.08502236008644104,
        -0.0007523791864514351,
        -0.005327455699443817,
        -0.024016687646508217,
        0.04486493021249771,
        0.022880427539348602,
        -0.14188119769096375,
        0.0048675332218408585,
        0.09981073439121246,
        -0.047135911881923676,
        -0.041443899273872375,
        -0.0190584659576416,
        0.06248125806450844,
        0.009759977459907532,
        -0.018360402435064316,
        -0.0014582781586796045,
        -0.03106444887816906,
        -0.04718989133834839,
        0.03689420968294144,
        -0.033033374696969986,
        0.025154659524559975,
        -0.06630461663007736,
        -0.03497355803847313,
        0.0727778822183609,
        0.002170917112380266,
        -0.04975615069270134,
        0.07476472854614258,
        -0.12821932137012482,
        -0.09771805256605148,
        -0.037192024290561676,
        -0.01527590211480856,
        0.0318625308573246,
        -0.08334247767925262,
        -0.07807470858097076,
        0.02503698132932186,
        -0.013513640500605106,
        0.065595343708992,
        0.017408572137355804,
        -0.005296352319419384,
        0.023134596645832062,
        0.011567194014787674,
        -0.013637783005833626,
        0.005673003848642111,
        0.01723765954375267
    ]
}