{
    "id": "zTZuD4fVutc",
    "title": "I’m tired of winning (and it's awesome) - AMD COMPUTEX 2022",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-05-23T06:32:18Z",
    "video_url": "https://www.youtube.com/watch?v=zTZuD4fVutc",
    "category": "Science & Technology",
    "tags": [
        "amd",
        "ryzen",
        "zen 4",
        "rdna",
        "zen",
        "rdna2",
        "apu",
        "cpu",
        "processor",
        "desktop",
        "am5",
        "lga-1718",
        "DDR5",
        "PCI-E gen 5",
        "PCIe 5.0",
        "PCI Express",
        "RAM",
        "power",
        "energy",
        "3d v-cache",
        "x670",
        "x670 extreme",
        "b650",
        "16 core",
        "chiplet",
        "5nm",
        "6nm",
        "TSMC",
        "announcement",
        "reveal",
        "intel",
        "core i9",
        "12900k",
        "12900ks",
        "5.5ghz",
        "COMPUTEX",
        "COMPUTEX 2022",
        "TAITRA"
    ],
    "views": 1783145,
    "likes": 79956,
    "comments_count": 4262,
    "description": "New Customers Exclusive  Get $50 off your purchase of select AMD CPUs:  Shop Micro Centers New Motherboard and CPU Bundles:     Check out Micro Centers custom PC Builder:  Submit your Build to the Micro Center Build Showcase:   Get 50% off (up to $200) your annual subscription when you sign up with Zoho Desk at:   AMDs on a roll, and while Intel has successfully fired back, theres more on the way. With competition alive and well in the CPU space, its time for a PC gaming renaissance not seen since the 2000s.  Discuss on the forum:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:05 AMD Ryzen 7000 details 2:16 Ryzen 7000 performance 3:57 All APU All Day Long 4:26 Socket AM5 chipset features 5:16 Meet the new chipsets 6:08 AMD changed the industry 7:00 What? AMD laptops are evolving! 8:18 Odds & ends, availability, and conclusion",
    "description_links": [
        "https://micro.center/93a4f6",
        "https://micro.center/460e92",
        "https://micro.center/7eec2c",
        "https://micro.center/332cf8",
        "https://lmg.gg/zohodeskltt",
        "https://linustechtips.com/topic/1432766-i%E2%80%99m-tired-of-winning-and-its-awesome/",
        "https://lttstore.com",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(yawns) - I've got bad news, guys, mm. AMD just announced their plans for Socket AM5, and there's no other way to put this. It represents such a major shift from the incremental generational improvement paradigm that we've enjoyed so much since the first quad-core CPU showed up in 2007 that I'm afraid we as consumers are reaching the point where winning this hard for so long is becoming unbearable. We're back on an upgrade treadmill where a CPU from five years ago, even two or three years ago, is now at a major disadvantage. It's tough to keep up. And I wouldn't have it any other way. And I'm gonna tell you why this announcement is such a big deal right after I tell you about our sponsor. - Zoho Desk. Over 50,000 businesses worldwide trust Zoho's context-aware help desk to improve productivity and ensure their customers are kept happy. Get 50% off your annual subscription with code ZDESK50 at the link below. (\"Supernova\") - AMD always saves the biggest news for last but we're gonna front load it. AMD's Ryzen 7000 and AM5 platform look very promising. Intel's 12th Gen Core did beat AMD to the punch with DDR5 and PCI Express Gen 5 support. But AMD is clapping back with more available PCIe lanes off the CPU, and what appears to be a more mature DDR5 memory controller. That is if the test notes are to be believed. Not content with only that, AMD has come after Intel in terms of core clocks, too. In their demo, at the end of the presentation, they showed off a pre-production 16-core Ryzen 7000 CPU, blazing along at 5.5 gigahertz in \"Ghostwire: Tokyo,\" which matches the Core i9-12900KS' maximum boost clock. That alone is a massive improvement over AMD's current flagship, the 5950X, which manages 4.9 gigahertz max boost. And remember guys, this isn't a game. It's not even single threaded. AMD could have called it a day at that point, but no. They're coming at Intel with core level improvements, too, like AI acceleration instructions, though, exactly what they are and what they do, isn't yet known. What is known is that thanks in part to doubling the Level 2 cache on each core to one megabyte, AMD is claiming a 15% or greater per thread performance improvement in Cinebench R23. So if they can get multi-core clocks to stay high to match those single-core clocks, Intel may have to go completely back to the drawing board. Thankfully, AMD's new LGA-based socket, AM5, supports CPUs with TDPs of up to 170 Watts. So along with the switch to what AMD hints is an optimized version of TSMC's N5P process node, that shouldn't be an unreasonable goal especially with a good cooler. I mean, especially since there's coolers out there that are rated to handle Intel's 12900K, which is rated for 241 Watts. And from our testing, regularly blows right past that figure. Thanks to its extra power draw, the 12900K does manage to beat the 5950X in our testing during short renders, like the kind that AMD showed on stage, but the best we've seen is a 15% lead the other way for AMD in a much longer test. As for AMD's Ryzen 7000 demo, they showed the 16-core Ryzen 7000 chip finishing 31% faster than the Core i9-12900K. This is big. That was in a short test too, right, Anthony? - Oh yeah. - Woo. Interestingly AMD didn't mention anything about 3D V-Cache, their method for adding, well, three dimensional vertical cache for Ryzen 7000 to expand the Level 3 cache already on the die. What that means is, much like with Ryzen 5000, we could see separate, standard and 3D V-Cache, versions of these chips in the future which could potentially improve performance even further. They could also just all have it for all we know, like they all have the new six nanometer I/O dye, complete with RDNA 2 integrated graphics. Integrated graphics were one of Intel's last major differentiators prior to their E-core P-core layout change, because previously this required you to give up some cache and PCI Express bandwidth on Ryzen APUs. Well, now, all desktop Ryzen CPUs will have integrated graphics just like Intel. Can we get rid of the term APU now, then? (tropical music) Great! AMD didn't comment on just how many compute units would be included, but they did say that AM5 motherboards could come with any combination of up to four HDMI 2.1 or DisplayPort 2.0 outputs, likely in the form of USB Type C ports, which AMD will support in force, with up to 14 20 gigabit per second USB ports. By contrast Intel's top NZ690 chipset can only run four of those with the rest of them being 10 or 5 gigabit per second. That chipset's integration of Wi-Fi 6E is also no longer an Intel exclusive advantage, since the new AM5 platform natively supports Wi-Fi 6E with Bluetooth LE 5.2, and all of these features are going to be available across all of the new chipsets. AMD's actually shaken things up a little bit, by the way, with respect to their chipsets. What we might have previously thought of as X670 is now X670 Extreme, and it extends PCI Express Gen 5 to every available slot on the motherboard for ridiculous overall system bandwidth, something that Intel Z690 doesn't do. Vanilla X670, meanwhile, limits Gen 5 operation to just M.2 storage and the graphic slot, connecting those directly to the CPU like Intel does. Finally, there's B650, which defaults to PCI Express Gen 4 for all but the storage slot, which does get the Gen 5 treatment. There's no word on future A-series chipsets but, at least according to AMD's presentation, these are the only major differences between the chipsets that they did announce outside of power delivery, which is really more down to the motherboard manufacturers, anyway. So if that's the case, then, hey, thanks AMD. And even if it's not, I still have to thank AMD for the direction that they have forced the industry to go. Since the release of Ryzen back in 2017. Five short years was all it took to change a stagnant, straight line performance improvement into a very prominent hockey stick, core counts, instructions per clock, cache, PCI Express bandwidth, DDR memory bandwidth. It has all skyrocketed in the last five years. And I have no reason to believe that Intel would've been pushed to participate so quickly if they had been left unchallenged. It's at a point now, where those AMD and Intel CPUs and platforms from five years ago, are really showing their age, something that actually wasn't true of 3rd Gen Core, even as recently as 2020, when it was five generations into its life cycle. You don't need to worry about that with your water bottle from lttstore.com though, that will never be obsolete. Now, if you thought that was all you haven't been paying attention to mobile, either, because AMD has some exciting stuff in the pipeline there too. First up is their Mendocino APU, an up to quad-core Zen 2 chip, with integrated RDNA 2 graphics that AMD is targeting the 399 to 699 price point with, and hopes to see greater than 10 hours of mixed usage battery life from. I mean, gaming Chromebooks anyone? This should seriously improve battery life at the lower end of the scale. I mean, remember Zen 2 cores may not be the latest and the greatest, but they're not that much slower than Zen 3. And paired with RDNA 2 for GPU accelerated video decoding, they should handle most everyday tasks with ease. A lot of new laptop designs were announced too, including a 17 millimeter thick Lenovo with a 101 Watt-hour battery capable of 100 FPS gaming, an Alienware with a 4k 120 Hertz display. Another more different Lenovo with four sensitive W-A-S-D keys for precise movements. And Corsair's first ever, in-house laptop complete with what they call a streaming grade webcam and an integrated 10 key stream deck. No word on whether this laptop also supports other streamer-friendly features like HDMI input. But get subscribed. So you don't miss our upcoming coverage of it. How could we pass through on something like that? - Ha. - AMD says that the AM5 platform will release this fall with Mendocino APUs coming in quarter four. Oh, right, APUs are apparently still here. Darn it. The other announcements were mostly stuff we've already seen, although they did elaborate on their support for direct storage, hinting that their implementation will be more than simply adding GPU-accelerated decompression. So that's another thing we'll have to wait and see about. With the industry in such an upward trajectory, remember, PCI Express Gen 4 was only around on the desktop for like two years before being replaced. It really feels like the good old days, doesn't it? When you could go and buy a computer, knowing that it was going to be obsolete in just a few short years, which sounds bad from an investment standpoint, but what it means for the PC industry is more performance, better graphics, faster video editing. And honestly, it's getting to the point where it's been so long with this new hockey stick shift, I'm starting to feel like it's just the beginning. The beginning of the time to talk about our sponsor. Micro Center is the place to shop for desktops, laptops, computer components, monitor TVs, networking equipment, and whatever-other-tech-itch you might have on yourself. They offer competitive pricing and they have 25 locations around the US. New customers can get $50 off AMD's Ryzen 5 5600X or Ryzen 7 5800X CPUs. The offers in store only. No purchase necessary. Although, you'll probably wanna buy a CPU. And you can combine this coupon with their $20 off selected motherboard and CPU bundles to save $70 in total. That is like two days of gas money, soon to be one day. If you're already a Micro Center customer though, no sweat. There's tons of motherboard and CPU bundles available for you as well. Just check the link below to shop at Micro Center today. Thanks for watching guys. Go check out this older video now, from when AMD first revealed the Ryzen 5000 series that definitively snatched the gaming crown from Intel for the first time. Well, for the first time since the early 2000s anyway, and really kicked off this battle of the giants.",
    "transcript_keywords": [
        "AMD",
        "PCI Express Gen",
        "AMD Ryzen",
        "PCI Express",
        "Intel",
        "Ryzen",
        "Express Gen",
        "CPU",
        "Gen",
        "PCI Express bandwidth",
        "Core",
        "Gen Core",
        "Express",
        "PCI",
        "desktop Ryzen CPUs",
        "Ryzen CPUs",
        "Intel CPUs",
        "CPUs",
        "years",
        "Micro Center"
    ],
    "transcript_entity_values": [
        "one",
        "two years",
        "Gen 5",
        "two days",
        "Zen 2",
        "100",
        "RDNA 2",
        "Ryzen 7000",
        "Level 2",
        "Corsair",
        "Zoho",
        "GPU",
        "annual",
        "120",
        "699",
        "241",
        "2007",
        "the early 2000s",
        "50",
        "FPS",
        "AMD",
        "DisplayPort 2.0",
        "Five short years",
        "three",
        "Anthony",
        "Ryzen",
        "NZ690",
        "this fall",
        "20",
        "17 millimeter",
        "Tokyo",
        "up to 170",
        "2017",
        "Zen 2",
        "B650",
        "first",
        "Supernova",
        "5 gigabit per",
        "LGA",
        "Hertz",
        "APU",
        "First",
        "one day",
        "5600X",
        "Mendocino APU",
        "Mendocino",
        "25",
        "31%",
        "14 20 gigabit",
        "up to four",
        "Bluetooth LE 5.2",
        "5.5 gigahertz",
        "Ryzen",
        "Lenovo",
        "CPU",
        "Ryzen 7",
        "Wi-Fi 6E",
        "50%",
        "TSMC",
        "Micro Center",
        "Intel",
        "5950X",
        "Ryzen 5000",
        "DDR5",
        "four",
        "Over 50,000",
        "12th Gen Core",
        "quarter four",
        "five years ago",
        "70",
        "16",
        "five",
        "Ghostwire",
        "Watts",
        "10",
        "one megabyte",
        "3",
        "the last five years",
        "2.1",
        "15%",
        "DDR",
        "AM5",
        "2020",
        "3rd Gen Core",
        "second",
        "4.9 gigahertz",
        "PCI Express",
        "Ryzen 7000",
        "10 hours",
        "PCI Express Gen 5",
        "today",
        "4k",
        "PCI Express Gen 4",
        "101 Watt-hour",
        "six nanometer",
        "US",
        "Wi-Fi 6E",
        "AMD",
        "2",
        "Alienware",
        "USB",
        "two or three years ago",
        "USB Type C",
        "Core",
        "399"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "DATE",
        "NORP",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "NORP",
        "ORG",
        "ORG",
        "NORP",
        "LOC",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "NORP",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.04280213639140129,
        -0.00856027938425541,
        0.03761626407504082,
        -0.03853444382548332,
        0.0449361689388752,
        -0.007326193153858185,
        -0.015535863116383553,
        0.020554276183247566,
        -0.04118909686803818,
        0.025461243465542793,
        -0.07206407189369202,
        -0.005974344443529844,
        0.032704245299100876,
        -0.037746284157037735,
        -0.014562209136784077,
        0.032758016139268875,
        0.1343168467283249,
        -0.06375256925821304,
        0.011199523694813251,
        -0.025187470018863678,
        -0.048586271703243256,
        -0.031411655247211456,
        -0.013673360459506512,
        0.012691954150795937,
        0.05395912006497383,
        -0.0006834155065007508,
        0.030173365026712418,
        0.0037883298937231302,
        -0.007019266486167908,
        0.037024885416030884,
        0.022159095853567123,
        0.03218711167573929,
        0.04455697163939476,
        -0.0038776870351284742,
        0.046203527599573135,
        0.005552333313971758,
        0.06258182972669601,
        -0.08259323239326477,
        -0.07444809377193451,
        -0.08432379364967346,
        0.004785407800227404,
        -0.023067820817232132,
        0.0009478195570409298,
        0.03319914638996124,
        0.04677848890423775,
        0.011402880772948265,
        0.03703976795077324,
        -0.09951300173997879,
        0.022776708006858826,
        0.013659348711371422,
        -0.044450804591178894,
        -0.15580332279205322,
        0.03988334909081459,
        -0.07074862718582153,
        -0.08246082812547684,
        0.06685223430395126,
        0.024831093847751617,
        -0.045566659420728683,
        0.04583827033638954,
        -0.03454062342643738,
        0.026548977941274643,
        -0.12402599304914474,
        0.018196871504187584,
        0.08451604098081589,
        0.029081393033266068,
        -0.009141150861978531,
        -0.007932144217193127,
        0.06192409619688988,
        -0.006997405551373959,
        -0.022554541006684303,
        0.0586906336247921,
        -0.03632134199142456,
        0.03505433723330498,
        -0.020645396783947945,
        0.008763371966779232,
        0.05260979384183884,
        0.01306325662881136,
        -0.10249464958906174,
        0.08903666585683823,
        0.03981008008122444,
        -0.015329812653362751,
        -0.061106983572244644,
        0.023694049566984177,
        -0.08189595490694046,
        0.022264229133725166,
        0.0014131161151453853,
        0.06549429148435593,
        -0.013495105318725109,
        0.03156035766005516,
        -0.1372242569923401,
        -0.01846161298453808,
        0.0940859243273735,
        0.049635082483291626,
        0.002675717929378152,
        0.03145518898963928,
        0.024307360872626305,
        -0.027643604204058647,
        -0.03963097929954529,
        -0.01480749249458313,
        0.0528411865234375,
        -0.016395434737205505,
        0.08140319585800171,
        0.045566875487565994,
        -0.03098558820784092,
        -0.06813795119524002,
        -0.0028611011803150177,
        -0.048760246485471725,
        0.10050486028194427,
        -0.042629893869161606,
        -0.009986739605665207,
        -0.05744054540991783,
        0.035191524773836136,
        -0.020667627453804016,
        -0.05435886234045029,
        0.06682048738002777,
        0.020242078229784966,
        -0.020706970244646072,
        0.050833117216825485,
        0.09512677043676376,
        0.02147257886826992,
        -0.0426955483853817,
        -0.03245575353503227,
        -0.0471034049987793,
        0.035293661057949066,
        0.06258133053779602,
        0.08019102364778519,
        -0.1263490915298462,
        3.6790732394631344e-33,
        -0.03241196647286415,
        0.04707929864525795,
        -0.04348105937242508,
        0.020358726382255554,
        -0.01138465665280819,
        -0.010979264043271542,
        0.04633588716387749,
        -0.004956316202878952,
        -0.01079996395856142,
        -0.0003226565313525498,
        -0.00823230016976595,
        0.020777758210897446,
        -0.009930816479027271,
        0.06163100153207779,
        0.07543406635522842,
        -0.1297830492258072,
        0.04822326824069023,
        -0.04154963046312332,
        0.014524988830089569,
        -0.011265261098742485,
        0.013843539170920849,
        -0.023259751498699188,
        0.020837729796767235,
        -0.036795105785131454,
        0.06315473467111588,
        -0.03930747136473656,
        -0.040789853781461716,
        -0.05119714513421059,
        0.02688121236860752,
        0.009623296558856964,
        0.0004208439204376191,
        -0.06777061522006989,
        -0.06930398941040039,
        -0.03949224576354027,
        -0.05305667221546173,
        0.051372770220041275,
        -0.06255169212818146,
        -0.06512679159641266,
        0.014438444748520851,
        0.019604191184043884,
        -0.10092626512050629,
        0.07083096355199814,
        -0.07726604491472244,
        -0.12202285975217819,
        -0.000762968382332474,
        0.06514127552509308,
        -0.019924046471714973,
        -0.06311950832605362,
        0.021032163873314857,
        -0.05935518443584442,
        -0.050437793135643005,
        0.059618182480335236,
        -0.013252989389002323,
        -0.00029093693592585623,
        0.030053379014134407,
        -0.09896004945039749,
        0.011551305651664734,
        -0.04543573036789894,
        0.09117697924375534,
        0.13584376871585846,
        -0.03876597806811333,
        -0.0075095952488482,
        -0.0668092891573906,
        0.03114316239953041,
        -0.08821799606084824,
        0.056014034897089005,
        0.0738108903169632,
        0.031340137124061584,
        -0.07012348622083664,
        0.07178302854299545,
        0.03614143654704094,
        -0.05882089212536812,
        0.018991155549883842,
        -0.03312664106488228,
        0.03674676641821861,
        0.03585096821188927,
        -0.05821025371551514,
        -0.1273135095834732,
        -0.011502646841108799,
        -0.06658446043729782,
        0.0321338064968586,
        0.047084588557481766,
        -0.04803097993135452,
        0.031427450478076935,
        0.09550357609987259,
        0.0069616106338799,
        -0.015416942536830902,
        -0.03999952971935272,
        0.0056773084215819836,
        -0.0005708220996893942,
        -0.07249065488576889,
        -0.0739482045173645,
        0.06832212209701538,
        0.09130363166332245,
        -0.06657139956951141,
        -4.968690459335004e-33,
        -0.06124969944357872,
        0.021329160779714584,
        -0.03834257647395134,
        0.07052575796842575,
        0.010016881860792637,
        0.00559247937053442,
        0.09176608920097351,
        -0.037794776260852814,
        0.004578083287924528,
        -0.0569164901971817,
        -0.012407674454152584,
        0.025208329781889915,
        0.002215743763372302,
        0.06639587134122849,
        -0.044693879783153534,
        -0.06706442683935165,
        -0.0003877404669765383,
        -0.060434889048337936,
        0.06326011568307877,
        -0.036937568336725235,
        0.09810580313205719,
        0.03264176845550537,
        -0.02414083667099476,
        -0.00600088108330965,
        0.0243646539747715,
        0.027082040905952454,
        -0.005104318261146545,
        -0.036225851625204086,
        0.030930787324905396,
        0.014031102880835533,
        -0.05530034378170967,
        0.023002559319138527,
        0.007386220619082451,
        0.039047934114933014,
        0.07765420526266098,
        0.04522734880447388,
        0.017359044402837753,
        0.00519518880173564,
        -0.0218503475189209,
        -0.002353463787585497,
        -0.004833226092159748,
        -0.006270984653383493,
        -0.038226086646318436,
        0.01063267420977354,
        0.007469204720109701,
        0.014486391097307205,
        -0.01752351224422455,
        -0.020305495709180832,
        0.04722341150045395,
        -0.026095684617757797,
        -0.09176567196846008,
        -0.08743450790643692,
        0.07896311581134796,
        -0.007431839592754841,
        -0.050027817487716675,
        -0.03161487355828285,
        -0.015683429315686226,
        0.04480688273906708,
        -0.026674499735236168,
        -0.041242774575948715,
        0.026986299082636833,
        -0.008480174466967583,
        0.0020712099503725767,
        -0.0463208332657814,
        0.04875343665480614,
        -0.0002979172277264297,
        0.09100498259067535,
        0.04169474169611931,
        -0.06850683689117432,
        -0.03489244356751442,
        -0.04516773298382759,
        0.001795464544557035,
        -0.07702068984508514,
        -0.05110036954283714,
        -0.09736117720603943,
        0.08453100919723511,
        0.03533095866441727,
        0.03586217761039734,
        0.029317080974578857,
        -0.029802996665239334,
        -0.007039343938231468,
        0.040647611021995544,
        0.03185058757662773,
        -0.035151295363903046,
        0.0626649335026741,
        0.020811298862099648,
        0.036934223026037216,
        -0.07201267778873444,
        -0.03285780921578407,
        -0.1119132786989212,
        -0.03367510810494423,
        -0.0024954616092145443,
        0.008110815659165382,
        0.033809736371040344,
        -0.007227838039398193,
        -6.120465911862993e-08,
        0.03742513805627823,
        -0.055065274238586426,
        0.03955632075667381,
        0.014843390323221684,
        0.07717069238424301,
        -0.0525161437690258,
        0.04973594471812248,
        -0.040892381221055984,
        0.044149551540613174,
        0.051675599068403244,
        0.041317928582429886,
        -0.0700894370675087,
        -0.007159020751714706,
        0.0020964713767170906,
        0.05256309732794762,
        0.07635726034641266,
        -0.06523410230875015,
        0.04318193718791008,
        -0.019083982333540916,
        -0.08462928980588913,
        -0.0321948416531086,
        0.07981200516223907,
        0.048665352165699005,
        -0.038665443658828735,
        -0.07478620857000351,
        -0.0011304909130558372,
        0.04387889802455902,
        0.02379567176103592,
        0.06080179288983345,
        0.03060247004032135,
        -0.07024837285280228,
        -0.018447749316692352,
        0.05804281309247017,
        -0.04509099945425987,
        0.040192510932683945,
        -0.05508948862552643,
        0.02614114060997963,
        0.10386091470718384,
        0.052480533719062805,
        -0.017763592302799225,
        -0.0958218052983284,
        -0.03888671472668648,
        0.06466472148895264,
        -0.01279481966048479,
        0.015404888428747654,
        -0.022644955664873123,
        -0.0949149951338768,
        -0.05316459760069847,
        -0.0049396660178899765,
        0.01388208381831646,
        -0.011510218493640423,
        -0.02091395854949951,
        -0.005032907240092754,
        0.04642711207270622,
        0.053673576563596725,
        -0.001196397701278329,
        -0.060378823429346085,
        0.02046401984989643,
        0.009446163661777973,
        0.05588530749082565,
        0.07393485307693481,
        -0.134373277425766,
        -0.058028362691402435,
        0.033002983778715134
    ]
}