{
    "id": "ZvPzY6MsmCs",
    "title": "3 Features the iPhone 13 Didn't Add!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-09-17T20:04:33Z",
    "video_url": "https://www.youtube.com/watch?v=ZvPzY6MsmCs",
    "category": "Science & Technology",
    "tags": [
        "iPhone 13 features",
        "fast charging",
        "xiaomi",
        "Xiaomi fast charging",
        "Xiaomi charging",
        "MKBHD",
        "invisible selfie camera",
        "selfie camera",
        "hidden selfie camera",
        "hidden camera",
        "100 megapixels",
        "ultra fast charging",
        "Xiaomi 11T Pro",
        "Apple iPhone",
        "iPhone 13",
        "Apple iPhone 13",
        "iPhone charging",
        "iPhone fast charging"
    ],
    "views": 3320692,
    "likes": 122893,
    "comments_count": 8298,
    "description": "These three phones feature bleeding edge features that the newest iPhone doesn't touch.  The iPhone 13:   CreativeLive camera explainer:   MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://youtu.be/C4sAUc_ZGMY",
        "https://youtu.be/BsXIQkhsxEM",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Hey, what's up? MKBHD here and I got a couple of phones, three phones, I want to talk about today. Well, four, if you include the iPhone. But all three of these phones here that I'm holding have one bleeding edge hardware feature that the iPhone has managed to avoid for one more year. So in case you've been living under a rock and somehow missed it, in which case I would love to check out that rock, but there's a new iPhone and the whole iPhone 13 lineup just got announced. It's a relatively minor upgrade, as I've mentioned, but there's a solid checklist of things that are new this year, including ProMotion on the Pro phones. I made an entire video summarizing all in one place, so to get all that info, there's a link right below the like button for you. The iPhone plays it safe with the hardware, notoriously. I mean I think it's more obvious this year than ever. So fresh off the heels of all the people who have just showed up to the channel for the first time, seeing that iPhone, I give you three phones and each one of them has some hardware feature that is so bleeding edge that's actually kind of a bit risky. And there is a reason why each one of these hardware features isn't in the iPhone yet. So I'm gonna go through each of these and if you don't mind, I'm gonna reference the iPhone 13 for each of them, because the difference between what Apple is doing with four new phones per year, versus what some of these other companies do with dozens of new phones per year is kind of massive. So first up, this is Xiaomi's brand new 11 T Pro. Xiaomi makes a ton of phones. It actually just became the number one smartphone manufacturer in the world in terms of sales and a lot of their phones have some pretty crazy hardware. This one definitely comes with a charger in the box. You know why I say that? Because this is the charger, a massive brick that, yes, is going to hit 120 watts at its peak. 120 watt fast charging. It's kind of incredible. Now, that'll take this massive 5,000 milliampere battery from zero dead all the way up to a hundred percent full in less than 20 minutes. It's kind of crazy. Now, before we all go down to the comments to leave your explosion jokes or your fiery hot takes about how this will probably nuke your battery life, I've seen a lot of those on Twitter, and that's been a common concern, but batteries these days are better than ever. And I know it's natural to have the concern that like something that could charge this fast would probably have just awful effects on your battery after a year of use or something like that, but Xiaomi, of course, has considered this. They actually had a slide up during their presentation for this phone that directly addressed that showing they expect about 80% battery health after 800 charge cycles, which they say is actually better than some other flagship phones. Now, I don't know if I buy that it's gonna be better than other flagship phones, but 20% degradation after 800 charges, which for context is about one full charge a day for two years straight, that's actually pretty good. Now this is by no means the first fast charging phone. We've had 45 watt, fast charging, 65 watts. There's a couple 100 watt phones floating out there, but this is the fastest I've seen yet at 120 watts. And for context, the iPhone 13 is still charging at 20 watts. Now it's not for no reason. It's not like Apple could easily bump the iPhone to 120 watts without trade-offs and they just don't want to. For one, this is a split battery cell for faster parallel charging, which technically does shrink the total battery capacity a little bit. And you also do generate quite a bit of heat with this type of voltage, so Xiaomi is doing a lot of cooling and a lot of thermal monitoring to make sure the phone does this as safely as possible. But I do still believe that the top reason why we haven't seen this extraordinarily fast charging in the iPhone yet is still long-term battery health. So my iPhone 12 Pro that I've been using since it roughly came out for about a year, is sitting at 95% battery health, which is pretty good. After two years, that's about 90%. And to Apple, that's a more desirable feature than super fast charging. I mean, this is the company that shipped a five watt charger with the iPhone up to the iPhone 11 and who would rather throttle down your CPU speed and make your phone slower than risk overworking your battery. So it's not something I see them switching up anytime soon and I'm sure if you ran the numbers, most people do most of their charging overnight anyway. But you gotta admit the sheer convenience of fast charging is super important. And to people like me, who've gotten used to it, it's kind of indispensable, it's amazing. Knowing you have to leave in like five minutes and your phone's nearly dead and you just realize you have to charge it up real quick and getting like 30 to 40% just like that is something some people will go a lifetime without knowing about, but because of all the things we've talked about, overall battery capacity, thickness, thermals, long-term battery health, Apple has decided, yeah, 20 watts. So, all right, this is the ZTE Axon 30. This is a $500 Android phone with a Snapdragon 870, 6 to 12 gigs of RAM, pretty huge 6.92 inch 120 hertz display and a solid battery with fast charging. But what could this modest mid-range phone have that the iPhones don't? Well it's that. It's that right there. That is the new second generation under display selfie camera and it is way better than the first one. So I recently did a whole video on the first-generation version of this, and it was pretty rough, not gonna lie. It was still very visible in a lot of situations, especially with the lighter colors and the image quality that came from the camera behind the screen is just bad. It's just foggy and hazy, blurry. Not great, right? This second generation camera here, to my eye, honestly, and the camera gets it pretty well, it's nearly invisible. Like, it's a huge improvement and you can see it looks like they've doubled the pixel count and the rectangular cutout so now objects and sharp text passing through this area are only mildly pixelated this time and they even do a great job with the UI of making sure things typically don't pass through that area anyway, so it rarely catches your eye during any sort of regular use. Also, I believe adding those pixels back also helped with perceived brightness, so it's legitimately really hard to see anything back there. Now, the photos that takes, still pretty trash, and this is the part that I wonder how long it will take to improve, because honestly the hiding it behind the screen part is now functionally perfect, so I wonder how many more generations it's gonna take to make a selfie in perfect lighting not hazy and soft. I mean, it's serviceable, it's fine for an average video call or a basic selfie, but nobody would ever say the quality's really good. So despite the defogging algorithm, there's still blooming and highlights and discoloration and a lack of sharpness, so people who buy this ZTE phone today, or the Xiaomi Mix 4 or the Galaxy Z Fold 3 for that matter, are gonna be people who don't care as much about the highest quality selfies in the world. And that might again be the exact opposite set of priorities as the iPhone, which has had now the largest notch in the entire smartphone world for a couple of years now, because it's got face ID and the selfie cameras upfront. But this is the first year that they have actually shrank the notch on the iPhone. The iPhone 13s compress the same face ID and selfie stuff to be 20% smaller this time, but it looks like that's mainly for moving the earpiece up top and it also looks like you don't really get any more info on that extra screen real estate. I was hoping maybe there'd be like a battery percentage up there, but it looks like same idea as last year. So another year with a notched iPhone and another year with a bleeding edge selfie camera behind the display, but that still definitely has a drawbacks. Maybe the third generation is when it graduates from gimmick status to genuinely something we could see other phones using. But for now it's a little uncommon, a little risky, and a little rare. But all right, last but not least, this is the Infinix Zero X. This is a really competitive budget phone that I haven't talked too much about. It's also pretty new and aside from the pretty squared off sparkling design that reminds me a lot of a Nexus 4 from a couple of years ago, there's not a whole lot striking about this phone, but it does have the numbers on paper going for it and one of those numbers is 108 megapixel main camera. That's right, you've seen it now a bunch, the triple digit megapixel count has made its way all the way down to a sub $300 phone. It means almost nothing about the actual quality of the photos coming out of this phone, but it's still pretty impressive. Now all of the cameras on the iPhone 13 lineup this year did take a leap forward, which is pretty sick. We've got bigger sensors all around, we've got that sensor shift image stabilization on the primary cameras, you've got wider apertures. I mean I am really looking forward to testing these cameras and I talk all about this in the summary video again. If you haven't seen it, check it out, and the reviews should be in the works shortly after. But Apple has stuck with the same 12 megapixel resolution for the rear camera on the iPhone since the iPhone 6S. Now what I'm not saying is that Apple just needs to jump to a 100 megapixel camera, no. I kind of doubt they'll ever do that, actually. But what I am saying is I would really like to see, and I've always been curious what Apple could do, with a bit more resolution. This is something I also wondered about the Pixel for the past couple years, with a couple of 12 megapixel primary cameras in a row, and it looks like we'll finally see what the Pixel 6, jumping to a newer, bigger 50 megapixels sensor. But this isn't just about numbers, this isn't just about getting a higher DxOMark score. I find those as useless as anybody else, but 12 megapixel photos from the iPhone or older Pixels, while they look great while you're looking at the wide, as soon as you zoom in a bit, they start to break down. Like they look fantastic full screen, which is how you look at most photos most of the time, but the second you wanna crop in a little bit at all, there's not much detail information to work with, and it looks worse than something higher resolution. Also with video, if you've ever wondered why the iPhone doesn't do 8K video while some other phones do, 8K video is 33 megapixels per frame, so they can't do 8K video until they jump to at least a 33 megapixel sensor. But the higher resolution cameras is, funny enough, the thing I'm least expecting Apple to do anytime soon, because, if you've noticed, every single one of these super high resolution primary cameras, whether it's this 108 megapixel Infinix phone or this 108 megapixel Xiaomi phone, or this 108 megapixel Samsung phone, they all do what's called binning by default. So every smartphone sensor is subdivided, of course, into a matrix with X amount of total pixels. That's the megapixel count. So the higher your megapixel count, the smaller those individual pixels or photosites have to be. Now, in brightly lit environments, that can be fine, but in lower light, the pixels are so small that not a lot of light hits each individual one and you end up having to really boost ISO sensitivity to make up for it. That introduces noise, graininess, I'm oversimplifying a bit, but that's the general physics of it. So what they do is combine typically groups of photosites, and then without bumping sensitivity, you can take in more light per effective pixel to get more accuracy and thus lower resolution in the final picture. But these also happen to be smaller file sizes too. So this Infinix, for example, does have a 108 megapixels sensor, but by default, when you're taking normal photos, they're all binned down to 12 megapixels every time. Now, if you want the higher detail, but also potentially higher noise shots, you can turn on 108 megapixel mode. And most others also have like a special, separate high resolution mode you have to switch to to shoot the full 108 megapixels. So the iPhone has just stuck with their normal higher individual natural pixel size, 12 megapixels sensors. So there is definitely a marketing advantage to being able to say you have a 100 megapixel sensor, and there is an occasional shot, maybe a landscape, where you will get the most out of having all of those pixels and it's worth it and you can print it on the back of a phone and run commercials talking about it, but is it actually worth it? I guess the real question is how often do you actually go over and switch to the high resolution mode if you actually have it? I hardly do, I'm guessing most other people hardly ever do, and I also think most people, when they realize they're gonna want to crop later, just zoom in or use the telephoto that's on most of these high-end cameras anyway. So yeah, Google didn't budge on this for years, all the way up until Pixel 6 and iPhone is still sticking with it. How long they'll do this, only time will tell. So yeah, those are some big phones with some big numbers and some big, interesting pieces of hardware. I also could talk about foldables, which are obviously another huge hardware risk and that's another thing Apple probably won't jump into for a long time until it's fully ready, but just wanted to show some things that I haven't showed on camera yet, which is these three new phones. But I'm curious if any of these are things that you would want to see in a new iPhone. Is it fast charging? 'Cause I feel like that's the one a lot of people would be most interested in, but let me know in the comment section below which of these features you'd be most interested in seeing in a iPhone 14 or 15 somewhere down the road. Either way, thanks for watching. Catch you in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "iPhone",
        "phones",
        "phone",
        "megapixel",
        "fast charging",
        "year",
        "battery",
        "Apple",
        "megapixel Xiaomi phone",
        "charging",
        "pretty",
        "camera",
        "cameras",
        "fast",
        "lot",
        "people",
        "Xiaomi",
        "megapixel Infinix phone",
        "pixel",
        "pixels"
    ],
    "transcript_entity_values": [
        "Apple",
        "four",
        "108 megapixel",
        "500",
        "like five minutes",
        "6.92 inch",
        "first",
        "at least a",
        "iPhone",
        "a hundred percent",
        "30 to 40%",
        "ZTE",
        "120 hertz",
        "a couple of years ago",
        "ProMotion",
        "a couple of",
        "about a year",
        "Samsung",
        "sub $300",
        "iPhones",
        "20%",
        "800",
        "today",
        "Xiaomi",
        "about 80%",
        "one",
        "108 megapixels",
        "about one",
        "third",
        "DxOMark",
        "UI",
        "Pixel 6",
        "108",
        "65 watts",
        "100 megapixel",
        "33",
        "Twitter",
        "12 megapixel",
        "two years",
        "last year",
        "the past couple years",
        "a couple 100 watt",
        "three",
        "the Galaxy Z Fold 3",
        "11",
        "95%",
        "13",
        "the first year",
        "this year",
        "120 watt",
        "another year",
        "50 megapixels",
        "Android",
        "20 watts",
        "14",
        "less than 20 minutes",
        "second",
        "RAM",
        "dozens",
        "these days",
        "45 watt",
        "a couple of years",
        "years",
        "a year",
        "8",
        "15",
        "12",
        "one more year",
        "33 megapixels",
        "120 watts",
        "zero",
        "Google",
        "Xiaomi",
        "12 megapixels",
        "about 90%",
        "five watt",
        "6",
        "5,000",
        "CPU",
        "30"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "NORP",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.06073109805583954,
        -0.05232731252908707,
        0.07419782876968384,
        -0.10764313489198685,
        0.09119672328233719,
        0.06763117015361786,
        -0.025183815509080887,
        0.032070666551589966,
        0.010925996117293835,
        -0.03214101120829582,
        0.07965414226055145,
        -0.02903755009174347,
        -0.04215317592024803,
        -0.031004762277007103,
        0.04222991317510605,
        -0.024103563278913498,
        0.022053314372897148,
        -0.02732434868812561,
        -0.0775437131524086,
        -0.035327088087797165,
        -0.04540419578552246,
        -0.046269241720438004,
        0.11826298385858536,
        0.0786789283156395,
        0.04272345080971718,
        0.05834028124809265,
        -0.03822927922010422,
        -0.040971025824546814,
        -0.03487183526158333,
        -0.021345224231481552,
        0.04232396185398102,
        0.07309870421886444,
        0.07066274434328079,
        0.021171802654862404,
        0.08392565697431564,
        -0.14958079159259796,
        -0.020063726231455803,
        0.007457380183041096,
        -0.008104624226689339,
        -0.041126836091279984,
        -0.038143839687108994,
        -0.016652094200253487,
        0.004911253694444895,
        0.037623342126607895,
        0.012948744930326939,
        -0.05420984327793121,
        0.034371502697467804,
        -0.02983338013291359,
        -0.05762411281466484,
        0.02300581894814968,
        0.04512294381856918,
        -0.006317778490483761,
        0.004414649214595556,
        0.038292836397886276,
        -0.019842183217406273,
        0.015346263535320759,
        -0.06717085838317871,
        0.007169688120484352,
        0.0989324152469635,
        0.026028651744127274,
        0.06211605295538902,
        -0.008384030312299728,
        -0.016442198306322098,
        0.001209888607263565,
        -0.02776455692946911,
        -0.04583142325282097,
        -0.036589402705430984,
        0.037155911326408386,
        -0.005871956702321768,
        0.041836414486169815,
        -0.037842899560928345,
        0.022242862731218338,
        0.04590751603245735,
        0.0019918049219995737,
        0.024708008393645287,
        0.06727541238069534,
        0.007120227906852961,
        0.01506717223674059,
        -0.1059097945690155,
        -0.05261499062180519,
        0.03868050128221512,
        -0.07079870998859406,
        -0.041608016937971115,
        -0.04892527684569359,
        0.016361303627490997,
        -0.03723268583416939,
        -0.02258211374282837,
        0.020208070054650307,
        -0.11441799998283386,
        -0.03985279053449631,
        -0.06458160281181335,
        0.06663079559803009,
        -0.011537084355950356,
        -0.06913869082927704,
        -0.03077889233827591,
        0.05518479272723198,
        -0.06947527080774307,
        -0.11213001608848572,
        0.028433356434106827,
        0.0448041632771492,
        0.03789660707116127,
        0.013728540390729904,
        0.018459472805261612,
        -0.04265105724334717,
        0.01661803014576435,
        -0.07922138273715973,
        -0.06364193558692932,
        0.020007293671369553,
        0.018518995493650436,
        0.049236834049224854,
        0.017186062410473824,
        -0.008802708238363266,
        -0.02644112892448902,
        -0.025130705907940865,
        0.003137998515740037,
        0.058453164994716644,
        -0.029739586636424065,
        0.09606433659791946,
        0.14292964339256287,
        0.03631935268640518,
        0.005166721064597368,
        -0.0122023094445467,
        0.02129359357059002,
        -0.031070411205291748,
        -0.08885834366083145,
        0.025332631543278694,
        -0.06029900163412094,
        4.462711038309043e-33,
        0.09684637188911438,
        0.03441638499498367,
        -0.056401483714580536,
        0.05734945461153984,
        0.009309870190918446,
        -0.05921268090605736,
        -0.0009057797724381089,
        0.009822333231568336,
        -0.017230551689863205,
        0.023833030834794044,
        -0.011635009199380875,
        -0.02881670370697975,
        -0.0365140326321125,
        -0.005612371955066919,
        0.07103454321622849,
        -0.04974161833524704,
        -0.1256125420331955,
        -0.05472470819950104,
        0.002599279163405299,
        0.007092305459082127,
        -0.018144061788916588,
        -0.02252701111137867,
        -0.0005209398223087192,
        0.027025341987609863,
        0.02538289502263069,
        -0.0036168184597045183,
        0.06304791569709778,
        0.026682378724217415,
        0.01021938119083643,
        -0.005281412973999977,
        -0.08912812173366547,
        0.023859646171331406,
        0.059645846486091614,
        -0.04330582544207573,
        -0.028698371723294258,
        0.08835580199956894,
        -0.0005387426936067641,
        -0.12963129580020905,
        0.10680300742387772,
        -0.06342341005802155,
        -0.01900281012058258,
        -0.01807626336812973,
        -0.10608647018671036,
        -0.027908360585570335,
        0.0421796515583992,
        0.10275279730558395,
        -0.040414318442344666,
        -0.007580493576824665,
        0.004002104979008436,
        0.004536730237305164,
        0.0154019296169281,
        -0.03446517139673233,
        -0.001360214315354824,
        -0.056988827884197235,
        -0.05697816237807274,
        -0.03254270181059837,
        0.011420388706028461,
        -0.02110118232667446,
        0.11431986093521118,
        0.0457901656627655,
        0.030047403648495674,
        -0.004927031230181456,
        -0.08066678047180176,
        0.02850751020014286,
        -0.06667359918355942,
        0.05955418199300766,
        0.046943482011556625,
        0.034223224967718124,
        -0.06198696419596672,
        0.09038513898849487,
        -0.040235601365566254,
        0.01084938831627369,
        -0.036570269614458084,
        -0.0633043721318245,
        0.05681248754262924,
        0.02668699435889721,
        -0.05510862171649933,
        -0.03143521770834923,
        -0.005388177931308746,
        0.01214820146560669,
        -0.0026754571590572596,
        0.039299994707107544,
        0.022915726527571678,
        0.0668192133307457,
        0.006758715957403183,
        -0.05306020379066467,
        -0.04375859349966049,
        -0.04789985716342926,
        0.013312169350683689,
        0.07469119876623154,
        -0.05561399459838867,
        -0.0036967440973967314,
        -0.07231523841619492,
        0.05805179476737976,
        0.014025828801095486,
        -6.174141549004028e-33,
        -0.0031631137244403362,
        0.019722282886505127,
        0.015383674763143063,
        -0.05752655118703842,
        0.03395848721265793,
        -0.05701377987861633,
        0.015709690749645233,
        0.053703926503658295,
        0.023391641676425934,
        -0.0818549394607544,
        0.019284045323729515,
        -0.018396243453025818,
        -0.06397122144699097,
        0.022350264713168144,
        -0.042371757328510284,
        -0.002751363441348076,
        -0.037765808403491974,
        -0.1163020133972168,
        0.06943605095148087,
        0.07703040540218353,
        0.05221547186374664,
        0.030778754502534866,
        -0.06659838557243347,
        0.021580317988991737,
        -0.05954591929912567,
        0.00399774732068181,
        0.022091509774327278,
        0.04147809371352196,
        0.017554709687829018,
        -0.07297001779079437,
        0.04406113550066948,
        -0.10790909826755524,
        -0.02808300405740738,
        -0.03858671709895134,
        0.019934779033064842,
        0.06700385361909866,
        0.03710990771651268,
        -0.056004397571086884,
        -0.02118188887834549,
        -0.013217219151556492,
        0.054411012679338455,
        -0.020676808431744576,
        -0.020044559612870216,
        0.010643495246767998,
        0.04746727645397186,
        0.003055701730772853,
        -0.003798118559643626,
        0.05940241366624832,
        0.019699102267622948,
        0.05362799018621445,
        -0.02931358851492405,
        -0.0012919279979541898,
        -0.005594548769295216,
        0.026267319917678833,
        -0.07141287624835968,
        -0.02024165913462639,
        0.03714228421449661,
        -0.061889126896858215,
        0.03220099210739136,
        0.04604250565171242,
        0.0620601661503315,
        0.06099189817905426,
        -0.008686061948537827,
        -0.10253692418336868,
        -0.12126902490854263,
        -0.015557989478111267,
        0.05991886183619499,
        -0.0720188319683075,
        -0.015738507732748985,
        0.07558944821357727,
        -0.05921657010912895,
        -0.0077217090874910355,
        -0.06450539082288742,
        -0.09273262321949005,
        -0.032566703855991364,
        0.048433564603328705,
        -0.038609858602285385,
        0.0002760329516604543,
        -0.020334919914603233,
        -0.07894744724035263,
        0.01106097549200058,
        0.09029815346002579,
        0.038460951298475266,
        0.015244584530591965,
        0.13553425669670105,
        0.11557737737894058,
        0.04574412852525711,
        -0.028321709483861923,
        -0.018139703199267387,
        0.04231290891766548,
        -0.0034127954859286547,
        0.0010767026105895638,
        -0.0849914476275444,
        0.08715404570102692,
        -0.05537673458456993,
        -5.854277418393394e-08,
        0.05860751494765282,
        -0.009998844005167484,
        -0.01641351915895939,
        -0.037626028060913086,
        0.04226211458444595,
        -0.02922201342880726,
        0.017034247517585754,
        0.028413644060492516,
        0.0980869010090828,
        -0.04811316356062889,
        -0.010685625486075878,
        -0.07120956480503082,
        -0.05073031410574913,
        0.0592876560986042,
        0.0364837683737278,
        0.04728623852133751,
        0.0002533139195293188,
        0.02635940909385681,
        -0.027841294184327126,
        -0.008370463736355305,
        -0.018799789249897003,
        0.07203654199838638,
        0.11017773300409317,
        -0.035121433436870575,
        0.02728606015443802,
        0.014958132058382034,
        -0.045055702328681946,
        -0.00660283537581563,
        0.06420917809009552,
        -0.03566895052790642,
        0.024402642622590065,
        -0.01662917248904705,
        0.027126522734761238,
        -0.06426779925823212,
        0.020250434055924416,
        -0.029358485713601112,
        -0.02262059412896633,
        -0.03901444002985954,
        0.0522860586643219,
        0.006349718663841486,
        0.0017759364563971758,
        -0.029361745342612267,
        -0.025521844625473022,
        0.045104850083589554,
        0.02030770480632782,
        -0.0535128116607666,
        -0.051927559077739716,
        -0.10996357351541519,
        -0.01594163104891777,
        0.023226529359817505,
        -0.08936858922243118,
        -0.08859490603208542,
        -0.0031777811236679554,
        0.05036606267094612,
        0.07402842491865158,
        0.0317344106733799,
        -0.007593154441565275,
        0.055473923683166504,
        -0.02013259567320347,
        0.024258222430944443,
        0.059975191950798035,
        -0.09305544942617416,
        0.037814442068338394,
        0.10736337304115295
    ]
}