{
    "id": "zWzkyg7AbgA",
    "title": "What Happened to VAIO?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-04-10T16:19:52Z",
    "video_url": "https://www.youtube.com/watch?v=zWzkyg7AbgA",
    "category": "Science & Technology",
    "tags": [
        "vaio",
        "vaio sx14",
        "sony",
        "sony vaio",
        "laptop",
        "weird laptops",
        "vaio x505",
        "x505",
        "vaio pcg-505",
        "pcg-505",
        "vaio ux180p",
        "vaio p",
        "computer",
        "windows",
        "retro tech",
        "review",
        "hardware",
        "tech",
        "this is",
        "austin evans"
    ],
    "views": 1193487,
    "likes": 32385,
    "comments_count": 2600,
    "description": "Back in the day, Sony's VAIO line was absolutely incredible. VAIO SX14 on Amazon:  How Airline Travel is Safer than Ever:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/vaiosx14",
        "https://www.youtube.com/watch?v=nRrOzMQFo5c",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys this is Austin. Do you remember Vaio? Back in the nineties and 2000s Sony absolutely cranked out weird but cool designs. Over the last few years though things have been a little bit quiet on and Vaio front ever since they went independent in 2014. That is until today with the brand new Vaio SX14. Take one look at this red and yeah it looks dope however the rest of the build quality sadly does not quite notch up with the looks. Now sure it feels lightweight however it just doesn't have that same premium feel as you would expect when you're paying upwards of $2000 for a brand new laptop. It's sturdy enough but put it side by side with one of my favorite laptops of 2019 so far, the ASUS ZenBook S13, it's really no contest. The only advantage here of the Vaio hardware really is just that lightness but besides that this beats it in pretty much every other aspect. Speaking of the ZenBook they do share a very similar keyboard design. So not only do they have nice chiclet keys but importantly they also have a lifted design so essentially when you close the laptops they go flat. Okay, that's actually not what I thought was gonna happen. (coughs) But when you open it up you get a little bit of an extra lift on the keyboard and this goes a long way in making it feel a lot more comfortable, especially for longer typing sessions. Now I might sound like I'm being a little bit too negative about the Vaio but there are some legitimate strengths, starting with the ports. This has more ports than any other Ultrabook I've ever seen. So on top of three USBs, 3.0 ports there's also not only a USB-C as well as HDMI but there's ethernet and there's even a VGA port on a brand new Ultrabook in 2019. Yeah, that's a Japanese businessman's special. Like I was saying earlier the keyboard does have a nice feel and you also do have a fingerprint sensor on board but what I'm not a huge fan of is the touchpad. Now, yeah, it's nice to have the physical buttons but this is just way smaller than pretty much any modern laptop and it does date these Vaio just a little bit. Now, by default it does come with a fourteen inch 1080p display but this red model is the hiring version with a full 4K panel. Now I'm usually not a huge fan of 4K displays on Ultrabooks 'cause I find they usually have a little too much of a trade-off as far as battery life goes but I will definitely admit this does look nice, super sharp, super crisp. Unfortunately though the battery life is not the strong suit of the Vaio, at all. Paired with a small battery this just feels like a throwback. Now admittedly I do use the computer fairly hard, so I've got the brightness cranked almost all the way up and high performance mode on but even so I'm only getting about three and a half hours on a charge with this guy. Pretty much every other Ultrabook out there, even when you're completely cranking it out, should give you at least five to six hours, so that's something that I'm not super thrilled about. It's just, it's definitely probably, the weakest part of this Vaio, just being totally honest, I mean its fine, it's usable if you're near an outlet but it's just really weird in 2019 to have a laptop with that little battery life. Thankfully performance is modern at least. So not only do you have the latest 8th generation Core i7 on board but this guy's also outfitted with 16 gigs of RAM and a super fast one terabyte PCIe SSD. There's not doubt that this looks dope in red but when you take it as an entire package the SX14 just falls behind. Not only is the battery life poor and there's some weird design decisions but most importantly it is really expensive. This thing starts at 1300 bucks but if you wanna get the maxed out version in red that's going to cost you $2300. Put that side by side with the ZenBook and it's really no comparison. I will take this pretty much any day however that got me thinking. Vaio used to be the undisputed champ when it comes to weird and premium laptops so what exactly happened? So as you might be able to tell some time has passed 'cause we're waiting for some old school Vaios to show up straight from Japan but there's some really, really cool stuff here. So first of all we have the Vaio X505. Now at first glance this could totally be a laptop that's being sold today however it actually came out in 2004. Yes my friends, we're got a Japanese copy of Windows XP loaded up on this bad boy and it's kind of awesome. Considering that this came out four years before the MacBook Air it's actually not that far behind. Now, yeah the 10.4 inch display isn't massive by today's standards but one of the cool things is that you actually get some king of interesting thinness. I mean this is honestly thinner than most laptops you can buy today and this was way before the days of USB-C. I mean, look, this is literally the Wi-Fi antennae or the Wi-Fi card. Now my Japanese skills aren't quite good enough to figure out how to get this thing over to English but it does have a whopping 1.2 gigs of RAM which I think actually someone paid to upgrade. Now as you might imagine, a laptop like this was not exactly cheap, even in Japan back in 2004. I mean what what the actual price on this guy? - [Man] Three thousand - $3000 new, and that was back in 2004. (exhales) Yeah but hey it's okay, you've got a ten gigabyte hard drive, you'll be just fine. Update, I was wrong, 20 gigabyte hard drive, that's where it's at right there. It's also surprisingly light at just about two pounds and a lot of that is just the battery in the back. A big part of that is because it is made out of a composite carbon fiber. Now when you look at this kind of stuff, sure $3000 was a lot back in the day but you were legitimately getting something that was way ahead of its time. Whereas the current day Vaio, I mean it's not a bad laptop but you're still paying a premium price for something that's really not in that same kind of league of wow this looks like it could be made today if you ignore the fact it doesn't have a touchpad and has a little nipple. Now as cool as this is we are just getting started with some of these awesome old Vaio designs. Next up is the PCG-505 from 1998. Now, yeah this looks a bit on the thicker and heavier side compared to stuff that's modern but again this was the late nineties. This was absolutely tiny compared to what most people we're (coughs) carrying around. Now sadly, this model doesn't actually function, although it would be cool if it did but we can take a look at the hardware and see just how far ahead of its time it was. So not only do we have a USB-A port, which, believe it or not, for the late nineties was very impressive. We also have a series of other ports including my favorite, a little modem that kind of pops into the side here. And on top of that if we pop the little side of the screen, we have a good old stylus. Now I know a stylus is not a touchscreen but you could use this in conjunction with the touchpad to write the world's tiniest, little notes. Now if USB and FireWire aren't your thing, you could also get this giant dongle for it. Now this adds a ton of additional ports including you have PS2 you have VGA. Where is this plugged in? Wait, no it doesn't go in there. Oh actually, wait, oh I'm stupid. The cool part about this is that this was very much in an era where laptops were nowhere near as good as desktops for most categories, right? They were way more expensive, they usually had terrible battery life, terrible performance but this was a major step forward toward a super portable laptop that could actually get real work done. It also had a Wi-Fi card on the side. Actually I have one here, don't I? So with this now we are online not even having to use our super cool modem. Probably one of the craziest models that Vaio ever brought out was this the UX180P and no my friends this is not a giant side kit, this is a full fledged Windows XP computer. Now if you wanna talk about ahead of its time this is absolutely it. Now again keep in mind we're talking about 2006 here. We have a touchscreen with a stylus. It has not only Wi-Fi but also built-in cellular. There's even a fingerprint sensor in both a front and rear facing camera on this guy and we're talking about 2006. Now this is not exactly a blazing fast system with a Core Solo Processor and half a gigabyte of RAM but when you consider just the level of spec you're able to get in something this small it's really impressive. I mean seriously, fingerprint sensors are still a good thing to have on laptops, alright. They are by no means ubiquitous in 2019 and especially when you look at stuff like cellular networks again, that's something that is not standard whatsoever yet and yet this weird little computer from 2006 totally had it. I mean that, that's innovation dude, like there's no way of getting around that. This was so far ahead of its time. At least it came pre-loaded with Norton 2006 so I'm sure that'll be very helpful for our ancient Windows XP install. Also fun fact, this was product placement central in movies back in the late 2000s. Not only was it in National Treasure but it was even in Paul Blart: Mall Cop, you know, that famous American movie that everyone is totally in love with, right? So the next item is the Vaio P which came out, for the record, ten years ago in 2009 and I believe it probably shipped with XP or maybe Vista at the time but someone, whoever had this before us, loaded up Windows 10 on it. Man, you're gonna have to use this for a week, you know. - [Man] What? - This is gonna be your new laptop for the next week. It runs Windows 10, it has full up to date security patches and all. What actually is this thing even running? We've got a blistering fast, single core Atom processor, two gigs of RAM as well as a 60 gigabyte hard drive but I mean it does legitimately run Windows 10. I cannot believe someone did this. Like, I mean, that's so, like. It's actually, I will say one thing, a lot of these computers from this era, they shipped with Windows XP and they were Windows Visa compatible because Vista was so much more heavy on the resources but most of the time you can actually load up Windows 10 on a Vista compatible machine and Windows 10 will actually run better. Which is pretty impressive considering that it's like 12 year newer operating system. Oh, we have Wi-Fi, it sees our Wi-Fi network. Dude this thing is so cool. I'm blown away this runs Windows 10. I legitimately thought we were gonna turn this thing on it was gonna have Windows XP. And this thing even has decent ports, you have a pair of USB-As as well as you can pick up a dongle which has VGA as well as ethernet on it and on top of all of that it has a glorious ultra-wide display way before LG ever made it cool. Now when these were all new Vaio was known as a bit of a form over function company. Now Sony had a ton of cash and a ton of interesting ideas and a lot of these were legitimately super unique but they also did have some sacrifices right. But that's okay. Today when you look at laptops they're all so similar, right? I mean you get a slightly tapered design, you get a couple of extra ports. That makes it something unique. However back in the day, I mean something like this just did not exist. Something like this didn't exist. I mean this stuff is so cool and I think that's absolutely something we need today in current PC design. More innovation, more willingness to take risks. I mean that's absolutely good for everyone. Also, this is still my favorite thing ever. (laughs) This runs on just on XP man, how are you gonna complain about that?",
    "transcript_keywords": [
        "Vaio",
        "Windows",
        "thing",
        "cool",
        "laptop",
        "side",
        "laptops",
        "battery life",
        "battery",
        "ports",
        "Back",
        "today",
        "Austin",
        "time",
        "super",
        "bit",
        "runs Windows",
        "yeah",
        "WiFi",
        "RAM"
    ],
    "transcript_entity_values": [
        "12 year",
        "PCIe SSD",
        "about three and a half hours",
        "first",
        "four years",
        "Core Solo Processor",
        "two",
        "the current day",
        "SX14",
        "Japan",
        "one",
        "1300 bucks",
        "a ton",
        "Vista",
        "English",
        "1.2",
        "ASUS ZenBook S13",
        "2300",
        "3.0",
        "FireWire",
        "2000",
        "Core",
        "the day",
        "USB",
        "Austin",
        "2006",
        "LG",
        "Wi-Fi",
        "the MacBook Air",
        "Windows XP",
        "Vaio",
        "16",
        "XP",
        "a week",
        "ZenBook",
        "60 gigabyte",
        "the last few years",
        "today",
        "Windows Visa",
        "Norton",
        "ten years ago",
        "Atom",
        "the next week",
        "1998",
        "2014",
        "2004",
        "just about two pounds",
        "Windows 10",
        "2009",
        "Sony",
        "Three thousand - $3000",
        "Vaio",
        "3000",
        "National Treasure",
        "this era",
        "the days",
        "fourteen inch",
        "at least five",
        "USB-C.",
        "three",
        "2019",
        "the late nineties",
        "Vaio",
        "RAM",
        "half a gigabyte",
        "Paul Blart",
        "the nineties",
        "the late 2000s",
        "20 gigabyte",
        "10.4 inch",
        "4",
        "Today",
        "ten gigabyte",
        "8th",
        "VGA",
        "2000s",
        "Vaios",
        "K",
        "American",
        "Japanese",
        "Ultrabook"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "LANGUAGE",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "MONEY",
        "EVENT",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "FAC",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "NORP",
        "NORP",
        "FAC"
    ],
    "vector": [
        -0.027360238134860992,
        0.002639118116348982,
        0.02944047935307026,
        0.027439923956990242,
        0.012239428237080574,
        0.02761204168200493,
        0.013216359540820122,
        0.09742050617933273,
        -0.017709894105792046,
        -0.018153933808207512,
        0.014644255861639977,
        0.0785236582159996,
        -0.009925005957484245,
        0.025031955912709236,
        0.059222664684057236,
        -0.01523619145154953,
        0.1385599672794342,
        -0.06530748307704926,
        0.009111794643104076,
        0.0062280939891934395,
        -0.011256077326834202,
        -0.011242267675697803,
        -0.02672334760427475,
        0.01166920829564333,
        0.08870167285203934,
        0.060784876346588135,
        0.019972681999206543,
        -0.007133753038942814,
        -0.06924305856227875,
        -0.083969347178936,
        -0.04926326498389244,
        0.035566698759794235,
        0.003550625406205654,
        -0.010106310248374939,
        0.04192706570029259,
        -0.05384598299860954,
        0.043266553431749344,
        -0.02342158555984497,
        0.008386729285120964,
        -0.03362923115491867,
        -0.09021233022212982,
        -0.018533404916524887,
        0.004422207362949848,
        0.01922793686389923,
        -0.03042459860444069,
        -0.06400744616985321,
        0.11959324032068253,
        -0.07675280421972275,
        0.07076654583215714,
        0.023717517033219337,
        0.016861502081155777,
        -0.08294038474559784,
        0.09552006423473358,
        -0.02098740264773369,
        -0.11113039404153824,
        0.014115688391029835,
        -0.026163291186094284,
        0.012330250814557076,
        -0.05653650313615799,
        -0.10495854169130325,
        0.07163796573877335,
        -0.07497003674507141,
        0.01933358982205391,
        0.05023682489991188,
        -0.011452361941337585,
        -0.03879310190677643,
        0.02324081026017666,
        -0.04701823368668556,
        -0.0029540667310357094,
        0.0014197670388966799,
        -0.036562856286764145,
        0.05978817865252495,
        0.025520019233226776,
        0.06575435400009155,
        -0.012147427536547184,
        0.05748714879155159,
        0.06858740001916885,
        -0.021482296288013458,
        0.08872479945421219,
        -0.004578895401209593,
        0.046362072229385376,
        -0.045027658343315125,
        -0.10807514190673828,
        0.011409414932131767,
        0.03321906179189682,
        0.008730887435376644,
        0.052152663469314575,
        0.002316816709935665,
        -0.022407038137316704,
        -0.05390502139925957,
        -0.01455773040652275,
        0.07550831884145737,
        0.03257952630519867,
        -0.0027278889901936054,
        -0.026866333559155464,
        -0.023238718509674072,
        -0.04535452276468277,
        -0.02539958618581295,
        -0.013279958628118038,
        0.034165967255830765,
        0.0427142009139061,
        0.0738142728805542,
        0.12661342322826385,
        0.0031302860006690025,
        -0.029482141137123108,
        0.020215285941958427,
        -0.006012943107634783,
        0.008996021933853626,
        -0.010309111326932907,
        0.00249412190169096,
        -0.11280743032693863,
        0.05178378149867058,
        -0.00025609711883589625,
        -0.035710837692022324,
        -0.026390409097075462,
        0.07148512452840805,
        -0.010232700034976006,
        0.022488731890916824,
        0.014676710590720177,
        0.044090088456869125,
        0.020547524094581604,
        -0.11601877212524414,
        -0.06340311467647552,
        0.034018371254205704,
        0.020260464400053024,
        -0.0379103422164917,
        -0.03166595846414566,
        4.564721540099355e-33,
        0.004180355928838253,
        0.05567530170083046,
        -0.019016481935977936,
        -0.03209318965673447,
        -0.046487655490636826,
        0.025467699393630028,
        0.041359856724739075,
        0.005857913754880428,
        -0.10741610080003738,
        0.039143696427345276,
        -0.07621178030967712,
        -0.041187968105077744,
        -0.03743695095181465,
        0.02377782016992569,
        0.04630979523062706,
        -0.058470264077186584,
        -0.04489132761955261,
        -0.07458076626062393,
        -0.02025177888572216,
        -0.017514631152153015,
        0.0021544808987528086,
        -0.014462513849139214,
        0.027892068028450012,
        -0.009476064704358578,
        -0.01288597658276558,
        -0.001159396255388856,
        0.025591162964701653,
        0.026033272966742516,
        -0.06713611632585526,
        0.04017464071512222,
        -0.08205877989530563,
        -0.002526388503611088,
        -0.0018089707009494305,
        -0.05966176465153694,
        -0.09696810692548752,
        -0.020190898329019547,
        -0.07275558263063431,
        -0.05622326210141182,
        0.06730985641479492,
        -0.08319703489542007,
        -0.014822250232100487,
        0.1583578884601593,
        -0.09687887132167816,
        -0.0001785054337233305,
        0.03128964453935623,
        0.045008234679698944,
        -0.03189199045300484,
        0.006569861900061369,
        0.0010999327059835196,
        -0.03213685005903244,
        -0.10664869099855423,
        0.01474711112678051,
        0.008963392116129398,
        0.01747465319931507,
        0.023440688848495483,
        -0.022460004314780235,
        0.03831811994314194,
        0.05679631605744362,
        0.01363303791731596,
        0.052722129970788956,
        0.11865143477916718,
        0.051528848707675934,
        -0.045372314751148224,
        -0.011004225350916386,
        -0.044840238988399506,
        0.11451788246631622,
        0.08405204117298126,
        0.03960784524679184,
        -0.04689706489443779,
        0.03218608722090721,
        -0.011560182087123394,
        0.027580972760915756,
        -0.06047980114817619,
        -0.08949825167655945,
        -0.03979652002453804,
        -0.0705302506685257,
        -0.06827997416257858,
        -0.09196120500564575,
        0.05890804901719093,
        -0.012259194627404213,
        0.003624205244705081,
        0.02448262833058834,
        0.025994086638092995,
        -0.010701230727136135,
        -0.018856283277273178,
        0.003862500423565507,
        0.02442554198205471,
        -0.025836391374468803,
        -0.05242525786161423,
        -0.0074445875361561775,
        0.0455806739628315,
        -0.020213529467582703,
        0.013452155515551567,
        0.03730078041553497,
        0.030430449172854424,
        -5.4352621669336166e-33,
        0.0075812810100615025,
        0.00047596919466741383,
        0.009523064829409122,
        -0.007090359926223755,
        -0.06714023649692535,
        -0.015329533256590366,
        -0.02987215667963028,
        0.0782209187746048,
        -0.03627926483750343,
        -0.015568844974040985,
        -0.011487794108688831,
        0.043133195489645004,
        -0.005562912207096815,
        -0.002759354654699564,
        0.01722794957458973,
        0.0012131297262385488,
        0.020281091332435608,
        -0.1248636320233345,
        0.04596729576587677,
        -0.09680446982383728,
        0.083933524787426,
        0.09720344096422195,
        -0.03863911330699921,
        -0.0199104193598032,
        -0.09869354218244553,
        -0.039772480726242065,
        -0.05885986611247063,
        0.02226613648235798,
        -0.05063039809465408,
        0.02611190639436245,
        0.0058839451521635056,
        -0.051216233521699905,
        0.07896537333726883,
        0.014545769430696964,
        0.06702937185764313,
        -0.04086034372448921,
        0.02809288538992405,
        0.04827803373336792,
        0.0837303102016449,
        -0.06411510705947876,
        0.05364486202597618,
        0.03264498710632324,
        0.041447289288043976,
        -0.012949462980031967,
        0.051651038229465485,
        -0.014755018055438995,
        -0.0765354111790657,
        -0.05171186849474907,
        0.0138222211971879,
        -0.08561739325523376,
        -0.023016374558210373,
        -0.05501020327210426,
        -0.026466868817806244,
        0.04070640727877617,
        -0.0006334989448077977,
        -0.001420926651917398,
        -0.07735029608011246,
        0.03428810089826584,
        0.0051993075758218765,
        -0.04609891399741173,
        -0.06008952856063843,
        0.022106414660811424,
        -0.02503996342420578,
        -0.016245197504758835,
        0.00710280379280448,
        0.009737377054989338,
        -0.020101254805922508,
        -0.018373601138591766,
        0.0019864372443407774,
        0.0009925764752551913,
        -0.061094731092453,
        -0.03470667079091072,
        -0.06287655234336853,
        0.0565466582775116,
        -0.03316594660282135,
        0.033156488090753555,
        0.007278971839696169,
        -0.00037774923839606345,
        -0.05955452844500542,
        0.012091421522200108,
        -0.003244200721383095,
        -0.01747458055615425,
        -0.023580262437462807,
        -0.003379561472684145,
        0.07250615954399109,
        0.07381970435380936,
        -0.02826101705431938,
        -0.0726616233587265,
        -0.0653671845793724,
        0.051845137029886246,
        0.03328588232398033,
        -0.0178906861692667,
        -0.055342406034469604,
        0.026183536276221275,
        -0.029044758528470993,
        -4.939140652027163e-08,
        -0.024795841425657272,
        -0.028293540701270103,
        0.05875232443213463,
        0.07434713840484619,
        0.04143618419766426,
        -0.028364622965455055,
        0.06585245579481125,
        0.04106203466653824,
        0.131281316280365,
        0.04851340129971504,
        0.006746307015419006,
        -0.04635343328118324,
        0.02430003508925438,
        0.06409315764904022,
        0.006385898217558861,
        0.08421280980110168,
        -0.06781324744224548,
        0.13553345203399658,
        -0.009465651586651802,
        -0.02702062390744686,
        0.010469143278896809,
        -0.00041952659375965595,
        0.12359918653964996,
        -0.016621509566903114,
        0.053943343460559845,
        0.039194654673337936,
        -0.11548957973718643,
        -0.0494905561208725,
        0.06262987852096558,
        -0.006313600577414036,
        -0.08112642914056778,
        -0.026369396597146988,
        0.026154832914471626,
        -0.048373688012361526,
        -0.06747808307409286,
        -0.044040996581315994,
        -0.04274560511112213,
        0.019334938377141953,
        0.02599954605102539,
        -0.02178240194916725,
        0.10311044007539749,
        -0.09148121625185013,
        -0.04830315336585045,
        0.023802049458026886,
        0.12348554283380508,
        0.002089979127049446,
        0.0001804852654458955,
        -0.09311290085315704,
        -0.05076703801751137,
        0.014311516657471657,
        -0.01934277079999447,
        -0.004086325876414776,
        -0.0009726237040013075,
        0.04753642901778221,
        0.01151706837117672,
        0.005550159141421318,
        -0.019027380272746086,
        0.11075138300657272,
        -0.001790398731827736,
        0.042168207466602325,
        0.06613576412200928,
        -0.09938371926546097,
        -0.07040157914161682,
        0.0773288831114769
    ]
}