{
    "id": "zXSskz59btg",
    "title": "What's on my iPhone Xs!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-09-22T19:48:02Z",
    "video_url": "https://www.youtube.com/watch?v=zXSskz59btg",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone xs",
        "what's on my iphone",
        "iphone unboxing",
        "iphone xs review",
        "new iphone xs apps"
    ],
    "views": 1234617,
    "likes": 29261,
    "comments_count": 3143,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. Happy iPhone week. This is the week that a lot of us have been waiting for, and you better believe I basically have been waiting for this week since last year of this week. I've been posting a bunch of fun iPhone videos, if you haven't seen it already, I did an unboxing video, a camera test, and there was a recap from the event. But what you guys are here for is the What's On My iPhone, so I'm gonna be kind of going back and forth between phones. This is not only a What's On My iPhone, but it's What did I forget to install on my new iPhone video. Before we get started, a huge thank you to LastPass for sponsoring this video. I've been such a huge fan of theirs for a really long time, and one of the things that I think is most important about this is, if you are one of those people out there that use the same password for everything, this is a message for you. Please do not do that, and think about your digital security, because it is such an important part of life now. LastPass allows you to store all of your usernames and passwords in one place. In iOS 12 and Android devices, it'll automatically fill in your passwords for you. So you don't have to worry about remembering them. My favorite feature is that it will auto-generate some passwords for you, because trying to come up with different passwords for every single website and everything that you sign up for is extremely difficult. You can generate different passwords for every single account, because one of the most insecure things that you can do is have the same password for every single login that you have on the internet. So if you are one of those people, I, just, I'm pointing this finger at you. So if you wanna check out LastPass, I'll put a link in the description, and a huge thank you again. You guys are amazing. So now, moving on to the What's On My iPhone. (laughs) I'm already stressed out, because I'm seeing apps that I forgot to download. But so far, I've been absolutely just loving this phone. So of course we got LastPass, which we talked about. We've got the Clock, Maps, Notes, App Store, Phone. Okay, so far so good. (laughs) The Apple Music app, Settings, Instagram, Instagram TV, I just, just wanna ask a question. Do you use Instagram TV? What do you think about it? How do you feel about vertical video? I would love to hear what you think. Leave those in the comments below. Twitter, Facebook, Amazon, Prime Now. Not sure if you guys have Prime Now, but Prime Now is incredible because it can basically deliver things within an hour, depending upon where you live. We got the YouTube, the YouTube Studio app, the Activity app, so that connects to your Apple Watch, and that tracks your activity. Snapchat, Starbucks, very very important. Is there anything from that first page that I probably should have? So over here, this is kind of my catch-all folder. Got the Wallet, Books, TV, Stocks, News, iTunes Store, Photos, Reminders, Weather, basically everything that comes pre-installed on the phone. FaceTime, Home, Health, Compass, the Measure app, oh boy. Let's get measuring! (quirky music) I'm gonna, oh, okay, well I guess I'll just measure it to there. Okay, that's cool. Lemme measure my old iPhone. Five and a half. Man, how fun. I'm into the Measure app. Got Keynote, Calculator, iTunes U, Pages, Numbers, Files, the Apple Watch, Find Friends, Podcasts, Find My iPhone, Contacts, Voice Memos, and that's all that's in that folder. Let's look at the Clips app, I'm excited about the new Clips app update. I believe they said in the keynote that they will hopefully have a vertical video update. Because I feel like there's not a good vertical video editor. Not sure if it's, yeah, I don't think it's implemented yet. But that is gonna be something that I'm very excited about. iMovie, DJI Copilot BOSS, This is pretty neat. So, there's a hard drive that you can connect to your phone, but it also has an SD card reader, so you put the SD card into the hard drive, plug it into your phone, and you're able to transfer the files to the drive, also to your phone. TestFlight, this is an app that developers can send you application requests for you to demo their software, Ronin, that's for the Ronin, it's what it is. The Ronin is a steady cam, if you don't know what that is. The Apple Store, On Demand, this is an on-demand yoga app, it's a part of CorePower Yoga, which is right below it. They have studios all over the place, so I'm not sure if they have them where you are, if they do, let me know. PlayMemories app, this connects to my Sony camera, so I'm able to transfer photos and videos over to my phone. Wowie. We need to turn notifications off, because I'm going to, gonna go crazy trying to film this video. AllTrails, this is a hiking app. So, it's kinda cool because it's also user-generated, so if you ever go on a hike somewhere cool, you can add that trail to the database, you can leave comments, and all kinds of things. Okay, well I'm not logged in on this phone, yet. You could download the maps, you can record your trail, you can check-in, you can leave comments about it, and it's pretty cool, because you're getting real feedback from people that've done the hike. Earthmate, this is an app that connects to my Garmin satellite phone, so it connects to the phone, so I can send messages if I'm out in the wilderness and don't have reception. Netflix, I think you guys know what that is. Postmates, basically the only way that I can survive and feed myself. So there's also Siri Shortcuts, so this is kind of cool, because you can create different shortcuts for things. So, if you say, Hey Siri, um, whatever, oh gosh. (Siri beeps) Create shortcuts for anything. So if you have Siri set your alarm for the morning, you can also-- - [Siri] I wish I could help, But you don't seem to be connected to the internet. - That's another phone that's over there, talking to me. (laughs) The next app on here, you guys are probably wondering, why does that say Naked? There's a mirror called the Naked Mirror, and it is a 3-D mirror that you stand on the scale and it rotates your body, and with that you're able to get body mass, you're able to get a lot of different dimensions from your, yourself, other than just weight. It's been very interesting using this to track my fitness progress, because you see real time. You see everything. I'll probably do a follow-up video soon, but if you wanna see the original unboxing video that I did, I'll also put a link in the description and an annotation. Kayak, for booking airlines and hotels, Airtable, it was something that I used to kind of keep my video ideas all in one place. Frame.io, is cool, I use that if I'm uploading a video and someone needs to give me feedback on it. Fortnite, I think you guys know what Fortnite is. Resy, that's for restaurant reservations. Brooke Burke Body, I am a huge Brooke Burke fan, and I've been doing some of her workouts recently, especially when I'm traveling, it's easy 'cause I basically have Brooke on my phone, telling me what to do. HQ Trivia, you can use my code, iJustine. I don't really play as much as I used to, but man, what a fun concept for, just a game show. Cube, that's a period app. Caffeine, it's a live-streaming platform, I'm sure many of you guys have seen that before. DJI GO, I use that to control my drone, Hue Lights, for my lights in my house. Element, oh my gosh, I keep saying it wrong. Elemento, tai, toe, Memrise, I talked about that as well in the unboxing video, it's a language learning app, so it will tell you how to say things in other languages. So let's explore. It thinks it's a camera, but I mean, I guess that's close enough, but like, it's a lens. So sometimes it's not entirely accurate. Night Sky, I also talked about that in the video, Dropbox, where you can store photos, videos, content. Facetune, oh my goodness. Me and Jenna, we did a Facetune challenge, where we Facetuned each other. - You know, - Honestly, I think I'm done. - Uh-uh. - I think I'm done. Oh my gosh, I can add glitter? - There's rainbows coming in. - Shut up. - Oh this looks very real. - So far, that's all I have on my app. I have the bottom here, stored with my texts, my email, Safari, and the camera. Is there anything else that I forgot on here that I might need? Don't think so. Well thank you guys for watching, I hope you enjoyed this video, let me know what your favorite apps are, and if there's any apps that I'm missing that you think I definitely need on my phone, let me know in the comments below, but for now, I'm going to enjoy this very minimalistic app page. And you're probably also wondering why, because now I'm just noticing it, that I don't like to have anything on this bottom row, because I like to have my finger be able to float freely and not touch any apps. It's silly, but now I have more screen real estate on this phone, so that allows me to leave that extra space. So, that's it. Fun story. I'll see you guys in the next video. Bye! (quirky music)",
    "transcript_keywords": [
        "App",
        "video",
        "phone",
        "iPhone",
        "guys",
        "Justine",
        "Happy iPhone week",
        "passwords",
        "store",
        "Apple Music app",
        "apps",
        "Measure app",
        "week",
        "Clips app",
        "Apple",
        "things",
        "cool",
        "Apple Watch",
        "vertical video",
        "kind"
    ],
    "transcript_entity_values": [
        "Safari",
        "Hue Lights",
        "Notes",
        "Five and a half",
        "Clips",
        "The Apple Music",
        "Ronin",
        "one",
        "Amazon",
        "iJustine",
        "Garmin",
        "Elemento",
        "an hour",
        "Siri Shortcuts",
        "Justine",
        "The Apple Store",
        "iTunes U",
        "Fortnite",
        "App Store",
        "Home, Health",
        "Sony",
        "iPhone",
        "Instagram",
        "Measure",
        "iPhone week",
        "the YouTube Studio",
        "Brooke Burke",
        "iOS 12",
        "Twitter",
        "the week",
        "YouTube",
        "FaceTime",
        "Brooke",
        "HQ",
        "TestFlight",
        "Brooke Burke Body",
        "Compass",
        "Contacts",
        "CorePower Yoga",
        "Netflix",
        "Weather",
        "Instagram TV",
        "Siri",
        "Starbucks",
        "the Naked Mirror",
        "Frame.io",
        "Dropbox",
        "3",
        "iPhone",
        "SD",
        "this week",
        "AllTrails",
        "PlayMemories",
        "iPhone",
        "Ronin",
        "Airtable",
        "Snapchat",
        "Clock",
        "Maps",
        "Android",
        "Facebook",
        "tai",
        "Facetune",
        "first",
        "last year of this week",
        "Naked",
        "Apple Watch",
        "Memrise",
        "LastPass",
        "Fortnite",
        "iTunes Store",
        "Jenna",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "EVENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.013444406911730766,
        -0.06772268563508987,
        -0.018254728987812996,
        -0.11508811265230179,
        0.037385243922472,
        0.02207082323729992,
        0.09876352548599243,
        0.03086697682738304,
        0.016699939966201782,
        0.04915677383542061,
        0.04208779335021973,
        -0.007895432412624359,
        0.011082476004958153,
        0.03216462582349777,
        -0.035607922822237015,
        0.05703238397836685,
        0.01941157691180706,
        -0.030679933726787567,
        -0.03333422914147377,
        0.04665075242519379,
        0.010732651688158512,
        -0.03196144104003906,
        0.03371799737215042,
        0.023332713171839714,
        -0.02109239436686039,
        0.09353845566511154,
        0.0020811317954212427,
        -0.006844080984592438,
        -0.0718529149889946,
        -0.05824311450123787,
        -0.026408804580569267,
        0.01936643198132515,
        0.12213274836540222,
        -0.0029649033676832914,
        -0.0011056208750233054,
        -0.05653845891356468,
        0.06577413529157639,
        -0.009995779022574425,
        -0.024626106023788452,
        -0.023633377626538277,
        -0.00463968887925148,
        -0.04018629342317581,
        0.04201461374759674,
        0.02104242332279682,
        -0.07818480581045151,
        -0.0357983335852623,
        0.02535470761358738,
        -0.03727271780371666,
        0.03052816540002823,
        0.05000489950180054,
        -0.042779453098773956,
        0.005257295910269022,
        -0.014772520400583744,
        0.06325414776802063,
        -0.05483245849609375,
        0.008897573687136173,
        -0.10869250446557999,
        0.016282692551612854,
        0.05343504250049591,
        -0.05160548537969589,
        0.007137259468436241,
        0.026008497923612595,
        0.033654071390628815,
        0.09239606559276581,
        -0.04865381121635437,
        -0.0477251261472702,
        -0.044566839933395386,
        0.0013775562401860952,
        -0.014657523483037949,
        -0.011465626768767834,
        -0.09461979568004608,
        0.04430346190929413,
        0.00027274226886220276,
        0.018754884600639343,
        -0.009694824926555157,
        0.06133473664522171,
        0.07543960213661194,
        -0.06567209213972092,
        -0.06529871374368668,
        0.02279958873987198,
        0.021832171827554703,
        -0.01725686527788639,
        -0.031048431992530823,
        -0.00034471775870770216,
        0.03898533806204796,
        0.029158195480704308,
        0.002004908863455057,
        0.01076069287955761,
        -0.048319313675165176,
        -0.06499385088682175,
        -0.09186192601919174,
        0.015225633047521114,
        0.0021896844264119864,
        -0.04473365098237991,
        0.0004276286927051842,
        -0.02220076322555542,
        0.012440545484423637,
        -0.05474921315908432,
        -0.0369872972369194,
        0.04983237013220787,
        0.05582566186785698,
        -0.06977944821119308,
        0.015474348329007626,
        -0.023428896442055702,
        -0.031760748475790024,
        -0.12423919886350632,
        -0.11533664166927338,
        0.010626398958265781,
        -0.012216691859066486,
        0.05928485840559006,
        -0.034317996352910995,
        0.014398992992937565,
        -0.05998805910348892,
        -0.056639231741428375,
        0.042133018374443054,
        0.08820931613445282,
        -0.017049087211489677,
        0.07479836046695709,
        0.03402877599000931,
        -0.013366869650781155,
        -0.02730419486761093,
        -0.066567562520504,
        -0.05671002343297005,
        0.03472242131829262,
        -0.011865188367664814,
        0.017726507037878036,
        -0.08461855351924896,
        1.1428344157790411e-32,
        -0.07416406273841858,
        0.06164064630866051,
        -0.011749290861189365,
        0.0488441027700901,
        -0.03812050446867943,
        -0.05544945225119591,
        0.03399165719747543,
        0.08933501690626144,
        -0.004756010137498379,
        0.06173492968082428,
        0.0005658182199113071,
        0.05077628046274185,
        -0.05430857837200165,
        0.034579623490571976,
        0.03226364776492119,
        -0.01979357749223709,
        -0.018067004159092903,
        -0.0501328781247139,
        -0.05413070693612099,
        -0.005301372613757849,
        0.010017900727689266,
        -0.040221601724624634,
        0.006698502227663994,
        0.07830856740474701,
        0.06689175963401794,
        0.0664348155260086,
        0.08939021825790405,
        0.0013782581081613898,
        0.03723214194178581,
        -0.021112976595759392,
        -0.046903833746910095,
        -0.026214072480797768,
        0.016978181898593903,
        -0.10917230695486069,
        -0.03677517920732498,
        0.045510269701480865,
        -0.031263284385204315,
        0.0026216101832687855,
        0.009987542405724525,
        -0.01635812222957611,
        -0.05539398640394211,
        0.0018165863584727049,
        -0.07014505565166473,
        -0.05481402203440666,
        0.0887661799788475,
        0.05647403374314308,
        0.009765754453837872,
        0.03074442595243454,
        -0.02287321165204048,
        -0.008114620111882687,
        -0.011512160301208496,
        -0.0658544972538948,
        -0.02828744426369667,
        0.008038140833377838,
        -0.010115651413798332,
        -0.04720355197787285,
        -0.043783996254205704,
        0.05800947546958923,
        -0.01675119809806347,
        0.044409848749637604,
        0.012033949606120586,
        -0.03004041127860546,
        -0.03477846086025238,
        -0.028468551114201546,
        -0.08651717007160187,
        0.06864862889051437,
        0.070426344871521,
        -0.07289671897888184,
        0.00885519478470087,
        0.10976485162973404,
        -0.033835723996162415,
        0.01367068663239479,
        0.07125087082386017,
        0.014905111864209175,
        0.059074632823467255,
        0.054250363260507584,
        -0.08285856246948242,
        -0.06607702374458313,
        0.020550554618239403,
        0.024480223655700684,
        -0.09114309400320053,
        0.05489935353398323,
        0.005864170379936695,
        0.11858712881803513,
        0.0011957642855122685,
        -0.09007230401039124,
        0.011605126783251762,
        0.002129096072167158,
        -0.003749873023480177,
        0.06820932775735855,
        -0.03160019591450691,
        0.046635035425424576,
        -0.1175415888428688,
        -0.047139719128608704,
        -0.05688043683767319,
        -1.1512249475184167e-32,
        -0.016495205461978912,
        0.004153733141720295,
        -0.009915193542838097,
        -0.018047893419861794,
        0.05096747353672981,
        -0.02719149924814701,
        0.015201988629996777,
        0.09589433670043945,
        0.04916014149785042,
        -0.0987924188375473,
        0.06247154250741005,
        -0.03127333149313927,
        -0.0931665375828743,
        0.04585515335202217,
        -0.06034962832927704,
        -0.021360518410801888,
        -0.05332871526479721,
        -0.07322949916124344,
        0.027629731222987175,
        -0.004426703788340092,
        0.02098473720252514,
        0.13659435510635376,
        0.09044043719768524,
        0.017046501860022545,
        9.08814326976426e-05,
        -0.0022202921099960804,
        0.049898017197847366,
        0.03587021678686142,
        0.08566822111606598,
        0.010808720253407955,
        -0.02089712582528591,
        -0.0919395387172699,
        -0.008858123794198036,
        -0.009266206994652748,
        0.051323119550943375,
        0.019227653741836548,
        -9.945622878149152e-05,
        0.03604361414909363,
        0.015301886945962906,
        -0.08254653215408325,
        0.007649376522749662,
        0.016352461650967598,
        0.029071711003780365,
        0.002101366175338626,
        0.025257686153054237,
        -0.07009516656398773,
        -0.06393466889858246,
        0.06852291524410248,
        0.0295536071062088,
        0.025967048481106758,
        -0.03331690654158592,
        -0.05063018947839737,
        -0.02443331480026245,
        0.02145983837544918,
        -0.04828659072518349,
        -0.00020508962916210294,
        -0.06041831523180008,
        -0.00462319515645504,
        0.058697015047073364,
        0.01564442738890648,
        0.060848966240882874,
        -0.005528953857719898,
        -0.08487387001514435,
        -0.08389190584421158,
        -0.016836419701576233,
        -0.1126997321844101,
        0.04385935142636299,
        0.0030954747926443815,
        -0.028729766607284546,
        0.03898635879158974,
        -0.002492140978574753,
        0.005398919805884361,
        0.026513120159506798,
        -0.027241351082921028,
        0.03432260826230049,
        -0.00374756776727736,
        -0.10447165369987488,
        -0.010595200583338737,
        0.06248300150036812,
        -0.039852142333984375,
        -0.010178639553487301,
        0.07390258461236954,
        0.07571572065353394,
        0.07409633696079254,
        0.12016277015209198,
        0.14173783361911774,
        0.09804293513298035,
        0.019133610650897026,
        0.006855426821857691,
        0.01195046491920948,
        0.038398370146751404,
        0.04692995920777321,
        0.004060221370309591,
        0.09375989437103271,
        -0.10170776396989822,
        -6.045533496035205e-08,
        0.029905958101153374,
        0.008522344753146172,
        -0.040974777191877365,
        -0.042375028133392334,
        -0.017012134194374084,
        -0.04415906220674515,
        -0.04461854696273804,
        0.0019524446688592434,
        0.10752033442258835,
        -0.059521015733480453,
        0.06717034429311752,
        -0.019136685878038406,
        -0.028495624661445618,
        0.12104182690382004,
        0.024762945249676704,
        -0.022313296794891357,
        -0.07683371752500534,
        0.08171827346086502,
        -0.018900802358984947,
        -0.081822969019413,
        -0.05648774281144142,
        0.07542447745800018,
        0.009313729591667652,
        -0.02822793833911419,
        0.05936773493885994,
        -0.016526367515325546,
        0.010495991446077824,
        -0.034336455166339874,
        0.050680872052907944,
        0.019355488941073418,
        -0.057226333767175674,
        0.010529694147408009,
        0.008044610731303692,
        -0.0012760041281580925,
        -0.03956212103366852,
        -0.024599852040410042,
        -0.07219530642032623,
        -0.040995631366968155,
        0.06733071804046631,
        -0.012620776891708374,
        0.016463104635477066,
        -0.1472393423318863,
        -0.0038647151086479425,
        0.007078277878463268,
        0.0059747458435595036,
        -0.07576127350330353,
        0.04850834980607033,
        -0.10682667791843414,
        -0.005424343980848789,
        -0.028212416917085648,
        -0.04505445063114166,
        -0.007891158573329449,
        0.035233836621046066,
        -0.09617297351360321,
        0.059350136667490005,
        -0.026566343382000923,
        0.04849275201559067,
        0.03733954206109047,
        -0.02190781570971012,
        -0.03279392793774605,
        0.03765225037932396,
        0.0121263787150383,
        -0.03450607508420944,
        0.035782307386398315
    ]
}