{
    "id": "zXXxZmwpPnc",
    "title": "MASSIVE GADGET UNBOXING!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-05-21T17:22:30Z",
    "video_url": "https://www.youtube.com/watch?v=zXXxZmwpPnc",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "unboxing",
        "tech haul"
    ],
    "views": 1002376,
    "likes": 24272,
    "comments_count": 1266,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Oh gosh! This is a massive haul of goodies. Some of these I bought, some people have sent to me. I have been wanting to unbox this stuff for quite a while and I figured okay why not just take all of these goodies and gadgets, and unbox them at the same time. I guess we'll start from the top. So this first thing that I got, this is a compact wireless blood pressure monitor. What, Justine, are you a 500 years old, that you need to monitor your blood pressure? Maybe I am, don't judge me. So recently, I've started getting into health, which is something that I probably should've gotten to a very long time ago. I feel like I go through phases, I think that's something that everyone probably goes through. But, I am going to try my absolute hardest to not make this a phase, and just make it a part of my life. So, step one was to get a scale, which I got. I got one of the Nokia scales, and it was like, K, would you like to, get a blood pressure monitor as well, and I said yeah, of 'course amazon, you know me so well, and then it also said, \"Well since you're buying that, do you wanna get a thermometer with it?\" And I said, okay sure, if I'm invested in my health, and in my future, it's a wise purchase. Let's open up our first one. I guess we'll go with the thermometer. Oups I forgot to get a thumbnail, hold on. Got the shot. Here it is. Says right there, simple tap, pull. Interesting... Anything else in here? Probably directions. Those are gonna be important, although I think this is probably quite simple. The things that look simple end up being the most difficult. Alright, well that's all that's in there. What's great is these both will tie into the entire Nokia health ecosystem, which also will connect to the health app. So all of that data will be all contained inside of one place. So, now, I can take my temperature, my weight, my heart rate, and my blood pressure all in one, and I'll have, a lot of data, for myself. Here it is. I saw these at CES, along with the scale, and I said, I gotta get it. This looks big. I gotta put batteries in it. Does this come with batteries? Don't look like it does. So I look forward to setting these up and testing them out. I'll definitely do a follow up video, because I would love to talk more about my health and fitness journey. I haven't been talking about it, mostly just because, I feel like it's one of those things that if you talk about it too much online, it just takes away from actually doing it. Like just, shut up, don't post about it, just fricking do it. I used to think that accountability was key. So if I would talk about doing something, that you guys would keep me accountable, but that's actually the stupidest thing that I think that I could've ever really thought. Yeah, it is great to have other people be accountable, but honestly, the only person that you can count on is yourself, especially when it comes to doing anything. If you're not accountable for yourself, nobody else is gonna be either. With that being said, let's move on to the next thing. Which is, the complete opposite of health and fitness, it's gaming. I've been a huge Razor fan, for such a long time, and they sent me, and my sister a bunch of goodies. I already opened a few of them, they sent a really beautiful white mouse, and also a pink mouse. I did open those up a while ago because me and my sister both needed a mouse when we were traveling 'cause we've been getting into Fortnite lately. First up. The little ears, for, your headset. I'm just not sure if it looks cute on me. I think I'm unboxing Jenna's things as well. Here's the problem, Yeah, I'm definitely unboxing Jenna's. I should probably save some of these for her. So, going along with the...Oh, here they, Yes! Oh my goodness, I have headphones to match! I wish that I didn't really like the color pink as much because I feel like it's such a stereotypical thing for a girl to like, but guess what. Uh, I don't care. I freaking like the color pink. Get over it. Oh my goodness, this is some really great color pink too. It's not like, too hot pink. It's more like a salmony-ish color. Is there anything else in here? It' always my biggest fear, is when I'm doing unboxings, and I'm just kinda like going through, opening up things, and then I throw something away, and then I have to dig through the trash later to find it. Oh yeah. Who's the fairest of them all? How do these go on now? Okay, so let's try these on. I was poking fun at these earlier. Okay, well they're crooked. You gotta go over here. You've gotta move over. This headset is surprisingly comfortable. And I feel like the cat ear just, instantly make me a better person. Better gamer, probably not. Do I look good? I just wanna look good for ya, good for ya. Me and Jen are definitely going to be fighting over this. She already claimed the white mouse, but this is a dual sided gaming mouse, and it's, beautiful, and white as well. Oups, microphone, in the shot. Let's zoom out a little so we can get a better shot. Like Razor makes really nice things. This is super official. Oh my goodness, this looks so good. Wow! Just... Ow! So when they say dual sided, they have two different textures. So this one is a little bit more smooth, and this one has a little bit more of a textured feel to it. So depending upon your preference, you've got both. This is so nice. It looks like a cutting board. Let's just not tell Jenna that they sent, two of these. I'm like not strong enough to freaking open this. What am I doing wrong? The pink, and gray combination! Oh my god, and these stickers, are holographic, what!? Also dual sided, it's got the pink accent Razor logo right here. This is gonna look so good on my desk. Me and Jenna are definitely gonna have some discussions. I mean, I still can't believe these holographic pink stickers too. This is a huge keyboard though. Wow, this is massive. Oups. It'd be great for streaming. You guys gonna be like Justine? You don't stream. There is something about typing on a mechanical keyboard that is so satisfying. Subscribe to my YouTube channel and don't forget to hit the bell. I actually, hit delete when I spelt something wrong. Believe how fresh it looks! Okay, so we also have this pink one. This looks like it's a little bit smaller. Wow wow wow. Well, I think I'm taking the pink one, whether Jenna likes it or not. Although the white looks so great too. She did already take the white mouse, so I guess it's only fair. So here's the wrist guard, here's the keyboard. As you can see, the size comparison between the white one and the pink. The white is much bigger, and it's magnetic. That's a nice type. Okay, let me show you guys, the all pink set up. I need to have some access on my surface studio. Okay, where's my mouse? Where's my mouse? You can call me basic and I don't even freaking care. There is a slight... No, that's pretty accurate. I was gonna say there's a slight pink inconsistency between the mouse and the keyboard, this looks like it's a little bit more of a pale pink. Very very slight. I need to go put this on my desk immediately. Oh! I have one more thing! This is the final thing, this is actually pretty exciting. So this is a stream deck. I am excited, even though I'm not a huge streamer, I've seen so many other streamers use this so I've definitely wanted to try it, so let's take a peek. Yeah, here it is. So they said to plug it in, and we'll see what happens. So it basically let's you do a bunch of presets pretty easily, so if you're streaming, that's kind of like a very mini little switch board. So you can set up various actions to do. Oh no, I don't have a plug. Oh my gosh! Can you guys see it! It has my logo it! No way! Can you see it, I hope you guys can see it, let me zoom in. Look at that! And it matches everything 'cause it is like the pink and the purple. This is so awesome. Oh my goodness, I love it so much. How cool. Well guys thank you so much for watching. I hope you guys enjoyed this little mini tech call. I guess it wasn't actually that mini. I've had some of these things for a while, so, I was super excited to finally open it and unbox it, and, basically now, I'll do a pink makeover in my office. A stand for this too, looks great. Guess this means I'm gonna have to start streaming now. If you guys are new here, make sure you subscribe, also be sure to hit the like button, and most importantly, hit the bell. That will notify you guys when I post new videos. Also be sure to follow me on Twitter because I also post smaller, cut down videos of all of my YouTube videos there. Spoiler alert. (energetic music)",
    "transcript_keywords": [
        "pink",
        "guys",
        "mouse",
        "thing",
        "things",
        "Jenna",
        "white",
        "blood pressure",
        "health",
        "guess",
        "color pink",
        "great",
        "yeah",
        "white mouse",
        "blood pressure monitor",
        "feel",
        "Wow",
        "good",
        "pressure",
        "blood"
    ],
    "transcript_entity_values": [
        "YouTube",
        "Nokia",
        "Oups",
        "two",
        "Twitter",
        "YouTube",
        "Jen",
        "first",
        "one",
        "Razor",
        "500 years old",
        "Fortnite",
        "the white mouse",
        "Jenna",
        "Justine",
        "amazon",
        "First",
        "CES"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        -0.028330093249678612,
        -0.051870543509721756,
        -0.05657801404595375,
        -0.12001801282167435,
        0.03578585386276245,
        0.02472566068172455,
        0.03200225532054901,
        0.02222817949950695,
        -0.034696757793426514,
        0.05680115893483162,
        0.018906598910689354,
        0.02619914710521698,
        0.002989251632243395,
        -0.01835770159959793,
        -0.01093834638595581,
        0.048266950994729996,
        0.012021096423268318,
        -0.010383224114775658,
        -0.020661653950810432,
        0.0426069013774395,
        -0.03669179975986481,
        -0.06407754123210907,
        0.00010235307854600251,
        -0.008745229803025723,
        -0.029460057616233826,
        0.06855552643537521,
        0.006262370850890875,
        0.021145038306713104,
        -0.09373462945222855,
        -0.09692548215389252,
        -0.006631897296756506,
        0.030680321156978607,
        0.07137499004602432,
        0.016399482265114784,
        0.011231913231313229,
        -0.015505724586546421,
        0.006445013452321291,
        0.006563686300069094,
        -0.034185804426670074,
        -0.03410223871469498,
        0.0014767773682251573,
        -0.026185812428593636,
        0.014415085315704346,
        -0.029484998434782028,
        -0.05558474361896515,
        -0.09755121171474457,
        -0.021954931318759918,
        -0.07640204578638077,
        0.04513011500239372,
        0.02694842964410782,
        -0.043955959379673004,
        -0.024333303794264793,
        0.03386654704809189,
        0.04098886251449585,
        -0.06894674897193909,
        -0.030269797891378403,
        -0.0710710883140564,
        0.005187930539250374,
        0.024509357288479805,
        -0.07959806174039841,
        0.018814416602253914,
        -0.010400493629276752,
        0.01965268887579441,
        0.027937058359384537,
        -0.037690017372369766,
        -0.027244240045547485,
        0.035966359078884125,
        0.025929171591997147,
        0.006728968117386103,
        0.035489145666360855,
        -0.08399229496717453,
        0.05021711066365242,
        -0.042635511606931686,
        0.021126359701156616,
        0.013058895245194435,
        0.01943659596145153,
        -0.010027870535850525,
        -0.03670541197061539,
        0.012247765436768532,
        0.0943375751376152,
        0.03679020702838898,
        -0.03144082427024841,
        -0.06992699950933456,
        -0.024441655725240707,
        0.00960851926356554,
        0.034848324954509735,
        0.0037442659959197044,
        0.04790355637669563,
        -0.050744134932756424,
        -0.07427337765693665,
        -0.09240052849054337,
        0.0005918260430917144,
        0.02124420367181301,
        0.017463011667132378,
        -0.015746166929602623,
        -0.093181312084198,
        -0.048969995230436325,
        -0.058870259672403336,
        -0.062172818928956985,
        0.0570642352104187,
        0.06264692544937134,
        -0.04846632853150368,
        0.024214299395680428,
        -0.0405300073325634,
        -0.010582742281258106,
        -0.11669256538152695,
        -0.0548466332256794,
        0.02015220746397972,
        0.01504484098404646,
        0.005124590825289488,
        -0.08195435255765915,
        0.029894838109612465,
        -0.07170921564102173,
        -0.04142174497246742,
        0.0030889962799847126,
        0.12992867827415466,
        -0.018642552196979523,
        0.08881586045026779,
        0.0014717240119352937,
        0.027167094871401787,
        0.01866953633725643,
        -0.08772100508213043,
        -0.011319804936647415,
        0.024239556863904,
        0.0007807440706528723,
        0.05169810354709625,
        -0.05679726600646973,
        1.2245965130976607e-32,
        -0.020462574437260628,
        0.05928439274430275,
        -0.0069649494253098965,
        0.08805233985185623,
        0.01751828007400036,
        0.002376380143687129,
        -0.021680913865566254,
        0.12052358686923981,
        -0.017629291862249374,
        0.01943056844174862,
        0.01613428071141243,
        0.07171948999166489,
        -0.03618689626455307,
        0.052368730306625366,
        0.04599527269601822,
        -0.08863529562950134,
        -0.018800660967826843,
        -0.029389409348368645,
        -0.04771667718887329,
        -0.033121466636657715,
        -0.0074654147028923035,
        -0.017957160249352455,
        -0.0016079534543678164,
        0.09279341995716095,
        0.10451120138168335,
        0.08891093730926514,
        0.0582134947180748,
        -0.0030555608682334423,
        0.06902818381786346,
        0.004927626810967922,
        -0.031745247542858124,
        -0.07003291696310043,
        -0.007004013285040855,
        -0.05720739811658859,
        -0.013901214115321636,
        -0.0063575515523552895,
        -0.07495450228452682,
        -0.008989585563540459,
        0.013097281567752361,
        -0.014533710666000843,
        -0.0032733434345573187,
        -0.030155332759022713,
        -0.06222112104296684,
        -0.07881041616201401,
        0.07700931280851364,
        0.03465436026453972,
        0.05512996017932892,
        0.07550797611474991,
        -0.05210570991039276,
        -0.014547132886946201,
        0.01498065423220396,
        0.002152221044525504,
        -0.04859963431954384,
        0.0024639477487653494,
        -0.03312257304787636,
        -0.09858570992946625,
        -0.029766174033284187,
        0.044151876121759415,
        0.09440041333436966,
        0.053616348654031754,
        0.014371371828019619,
        -0.023602226749062538,
        -0.008763418532907963,
        -0.02359500713646412,
        -0.06305994093418121,
        0.10622367262840271,
        0.03480536863207817,
        -0.038616932928562164,
        0.026591114699840546,
        0.06261052191257477,
        0.018313825130462646,
        0.011125151067972183,
        0.044154468923807144,
        0.005750015843659639,
        0.04916950687766075,
        0.0737602710723877,
        -0.07652980089187622,
        -0.06265275180339813,
        -0.014826802536845207,
        -0.0180632546544075,
        -0.09951300173997879,
        0.08807727694511414,
        0.00024319668591488153,
        0.08188153058290482,
        -0.01729579083621502,
        -0.07648365199565887,
        0.01795441284775734,
        -0.0318380743265152,
        -0.06416533887386322,
        0.013667857274413109,
        -0.0074011883698403835,
        0.07674293965101242,
        -0.07681196182966232,
        -0.06023469194769859,
        -0.011872578412294388,
        -1.1658525053464615e-32,
        0.03678165003657341,
        0.02455061487853527,
        0.004565129987895489,
        -0.039457280188798904,
        0.09066988527774811,
        -0.02383226342499256,
        0.04966704547405243,
        0.06728950142860413,
        0.05483284220099449,
        -0.06509744375944138,
        0.007630850188434124,
        -0.0667373314499855,
        -0.1041715145111084,
        0.014504488557577133,
        -0.03134666383266449,
        -0.015137067064642906,
        -0.04917715862393379,
        -0.04511336609721184,
        0.06699520349502563,
        -0.020740248262882233,
        0.09037089347839355,
        0.12662746012210846,
        0.09543538838624954,
        0.019929317757487297,
        -0.01717125065624714,
        0.013017970137298107,
        0.0184231698513031,
        0.04756352677941322,
        0.07712861150503159,
        0.07124904543161392,
        -0.003054877510294318,
        -0.06590799987316132,
        -0.023537643253803253,
        0.005990252830088139,
        0.025266515091061592,
        0.06344588100910187,
        0.024009518325328827,
        0.07174625992774963,
        -0.008825389668345451,
        -0.09400418400764465,
        0.0002495887747500092,
        0.011262550950050354,
        -0.03391318395733833,
        0.004127505235373974,
        0.011665363796055317,
        -0.11784590035676956,
        -0.06844866275787354,
        0.04900481551885605,
        0.019635027274489403,
        0.005258938763290644,
        -0.09131185710430145,
        -0.04457016661763191,
        -0.005864071659743786,
        -0.029686754569411278,
        -0.03441758081316948,
        0.01663859933614731,
        -0.0472070537507534,
        -0.027099987491965294,
        0.049963708966970444,
        -0.0005517603131011128,
        0.052994392812252045,
        -0.04027644917368889,
        -0.07949114590883255,
        -0.06977573782205582,
        -0.0023054287303239107,
        -0.07711425423622131,
        0.12286965548992157,
        0.04501904174685478,
        -0.026103459298610687,
        -0.010323898866772652,
        0.003630755702033639,
        0.043623361736536026,
        0.049874309450387955,
        0.004892826080322266,
        0.03718285262584686,
        0.03582911193370819,
        -0.06972728669643402,
        -0.01093437522649765,
        0.10784143954515457,
        -0.05340877175331116,
        -0.049641963094472885,
        -0.02441342920064926,
        0.03945564478635788,
        0.04298432171344757,
        0.07712218910455704,
        0.06564921885728836,
        0.09874098747968674,
        -0.013378440402448177,
        -0.01606656424701214,
        0.04571770876646042,
        0.012394228018820286,
        0.06150748208165169,
        0.0829569473862648,
        0.12088808417320251,
        -0.06611759960651398,
        -6.07645702643822e-08,
        0.04563220962882042,
        0.020273366943001747,
        -0.023624325171113014,
        -0.006009524688124657,
        0.009717492386698723,
        -0.11412126570940018,
        -0.025904027745127678,
        0.05029207468032837,
        0.07560592144727707,
        -0.07798248529434204,
        0.0715094730257988,
        -0.030585970729589462,
        -0.0435340590775013,
        0.11385252326726913,
        0.04861843213438988,
        0.014694779179990292,
        -0.0935625359416008,
        0.08847976475954056,
        -0.04225686192512512,
        -0.0473751537501812,
        -0.04774385318160057,
        0.05525192245841026,
        0.04306720569729805,
        -0.005272536538541317,
        0.029697507619857788,
        0.015876933932304382,
        0.0008365813409909606,
        -0.013989917002618313,
        0.05653252825140953,
        0.01778157614171505,
        -0.07994404435157776,
        -0.009768371470272541,
        0.010568013414740562,
        -0.005858815740793943,
        -0.06672745198011398,
        -0.04906664788722992,
        -0.06879152357578278,
        -0.004323027096688747,
        0.021039489656686783,
        0.0008078179671429098,
        0.03272387757897377,
        -0.15250390768051147,
        -0.051245350390672684,
        -0.009983106516301632,
        -0.0010260336566716433,
        -0.07611633092164993,
        0.030218753963708878,
        -0.08348965644836426,
        -0.041595350950956345,
        0.00016238819807767868,
        -0.024873966351151466,
        0.042022716253995895,
        0.03543628379702568,
        -0.01593303680419922,
        0.08076111972332001,
        -0.008882091380655766,
        0.02192288264632225,
        0.06339382380247116,
        0.01820111833512783,
        -0.00538433063775301,
        -0.008132235147058964,
        0.019654175266623497,
        -0.052123554050922394,
        0.05110367387533188
    ]
}