{
    "id": "zxZpopqhKk8",
    "title": "Free CCNA 200-301 Course: #0 CCNA exam tips and course overview",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-07-22T17:27:32Z",
    "video_url": "https://www.youtube.com/watch?v=zxZpopqhKk8",
    "category": "Science & Technology",
    "tags": [
        "ccna",
        "ccna 200-301",
        "cisco",
        "ccna full course",
        "ccna full course 2020",
        "ccna course",
        "ccna 2020",
        "ccna course for beginners",
        "ccna networking",
        "cisco packet tracer",
        "ipv4",
        "netacad",
        "networking",
        "free ccna",
        "david bombal",
        "ccna exam",
        "new ccna",
        "cisco ccna",
        "ccna training",
        "ccna certification",
        "ccna study",
        "cisco training",
        "ccna fundamentals",
        "ccna 200-301 full",
        "network engineer",
        "best ccna",
        "ccna future",
        "free cisco",
        "200-301",
        "ccent",
        "free training",
        "ccna routing and switching",
        "cisco certification"
    ],
    "views": 359530,
    "likes": 9456,
    "comments_count": 648,
    "description": "FREE CCNA Course 200-301 - complete CCNA course for the new Cisco CCNA exam.  DavidBombal.com: CCNA ($10):  support the mission, join thisisIT:  I am going to be covering all the topics in the exam blueprint in this course. In this first video I discuss the exam and my plans for this course.  I will be covering all the topics in the Cisco CCNA exam. I want to make this content practical and it will include a lots of labs and demonstrations to help you better understand topics on the exam.  The course will contain: - Videos - Labs using Cisco Packet Tracer - Quiz Questions - And more!  Menu: Overview: 0:00 Who is the course for: 1:47 What are you going to do? 2:44 CCNA 200-301 Exam overview: 4:13 CCNA Remote Exam: 7:05  Videos mentioned: CCNA Exam:  CCNP Exam:   thisitIT:   Udemy CCNA Course:   GNS3 CCNA Course: CCNA ($10): bit.ly/gns3ccna10  DavidBombal.com CCNA ($10):   ====================== Special Offers: ====================== Cisco Press: Up to 50% discount Save every day on Cisco Press learning products! Use discount code BOMBAL during checkout to save 35% on print books (plus free shipping in the U.S.), 45% on eBooks, and 50% on video courses and simulator software. Offer expires December 31, 2020. Shop now.  Link: bit.ly/ciscopress50  Boson software: 15% discount Link: bit.ly/boson15 Code: DBAF15P  CCNA Free CCNA 200-301 ccna 200-301 free ccna course   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!    #ccna #ccna200301 #freeccna",
    "description_links": [
        "http://bit.ly/yt999ccna",
        "https://bit.ly/thisisitccna",
        "https://youtu.be/NbT_mdc3uko",
        "https://youtu.be/Ypk77FytrWw",
        "https://bit.ly/thisisitccna",
        "https://bit.ly/ccnafor9dollars",
        "http://bit.ly/yt999ccna"
    ],
    "transcript": "- [Masked Man] Poodle, what are you doing? - [Poodle] Tesco and hacking! - [Masked Man] Tesco, isn't Tesco shopping? Do you mean Cisco? - [Poodle] Sorry, I always forget. - [Masked Man] But Poodle, this is the wrong course. Aren't we starting Cisco, not hacking? - Both. - Both? You want to learn to be a hacker? - [Poodle] Yes. - [Masked Man] What is a router? - [Poodle] I don't know. - [Masked Man] What is a switch? - [Poodle] I think it's what you switch on the light? - [Masked Man] Switch on the light. Yes, that's one type of switch, but you need to learn switching in networking so that you can hack networks. Is hacking fun? - [Poodle] Yes. - [Masked Man] Are you a good or bad poodle? - [Poodle] Very bad. - [Masked Man] Why are you bad? - [Poodle] 'Cause I hack. - [Masked Man] Because you hack. You wrote a very good hacking program there, Poodle. - [Poodle] Yes. - [Masked Man] Are you hacking networks? - [Poodle] Yes, there's a new program much better than this. - [Masked Man] Are you going to break networks once you learn about routers and switches? - [Poodle] Yes. - [Masked Man] Will you pass your CCNA exam, poodle? - [Poodle] Yes! - [Masked Man] And what about everyone else? Do they need to learn to become CCNAs? - [Poodle] Yes! - [Masked Man] Why? - [Poodle] 'Cause they have to. - [Masked Man] They have to? You have to pass your exam. So if Poodle can pause her CCNA exam, so can you, and then you need to learn how to hack. Is that right? - [Poodle] Yes, thumbs up. - [Masked Man] Well done, Poodle. This is your opportunity to change your life. (upbeat electronic music) If you want to learn anything about networking, so you wanna become a network engineer, or perhaps you want to become an ethical hacker, you need to have a solid foundation in networking, and the best way to do that is to get a CCNA. And that's one of the reasons that I'm giving away my CCNA course on YouTube. I wanna help more of you change your lives like I changed my life many, many years ago. This course contains the videos that you need to learn the technologies that are covered in the Cisco CCNA exam, but it also contains the labs, Packet Tracer labs, including Packet Tracer assessment labs where I'm going to assess your knowledge and make sure that you know what you think you know. I'm gonna make sure that you actually understand the technology by testing and verifying your knowledge. It also contains quiz questions. Make sure that you can answer the quiz questions. Make sure that you can get through the Packet Tracer labs before you go and take the real exam. What are you going to do, however? Are you going to put in the time, study and learn and change your life? Are you going to be the same tomorrow as you are today? Or are you going to change your life by learning new technologies? You know, I did that many, many years ago. That's why I'm a strong believer in learning. I'm a strong believer in putting the effort in every day to learn something new, and you will be able to change your life. You can change your life by becoming certified in networking, by getting a CCNA, as an example, by getting other certifications. This is only the beginning of the journey. You are responsible for your life. Don't be the same tomorrow as you are today. Do something today to change your life tomorrow. Put in the effort now, even though it's difficult. You're gonna be learning new technologies. It's hard. It's difficult to understand. Don't worry. We've all been there. In the beginning, I remember trying to climb this mountain to learn this new technology. It was really, really difficult. You'll have the same experience perhaps. Put in the effort, make sure that you learn something new every day, and you can change your life. The world has changed dramatically. It's now possible to learn new technologies for free on YouTube, by watching courses such as this. Go and make the changes that you need in your life. Don't just watch television or stuff that's not gonna help you. Learn something new every day, and change your life. Now let's talk about the CCNA exam 200-301. In a previous video, which I've linked here and below, I spoke about the exam in quite a bit of detail, so I won't do it again here. I just wanna give you a brief overview of the exam. - So we are announcing new Cisco certifications. So the new Cisco certification program has one CCNA. - Oh, wow. - A Cisco Certified Network Associate for people entering the workforce, making sure they have the basics of networking they need to go and work as part of the team, get going on networking. - Big change Cisco made compared to the previous CCNA exam, there are no simulations in this exam. So you don't need to actually type CLI commands into simulations. When I took my exam and from what I've heard, there are still no simulations in the CCNA exam. You have multiple choice, single answer, multiple choice, multiple answers, but you won't be asked questions such as choose all of the best answers. You'll be asked things like choose the two correct answers or three correct answers. So it's not a vague number of answers that are correct. You'll know exactly how many answers to select. So whether it's two answers or three answers, et cetera. There are also drag and drop questions in the exam, so multiple choice, single answer, multiple choice, multiple answers, drag and drop type questions, no simulations. Pass marks vary. They're typically very high on Cisco exams. Here's my exam, which I took on the first day that the CCNA became available. I'll retake the CCNA exam when I'm allowed to because it'll be good to see what's changed. The exam is 120 minutes in length. You typically get 102 questions. That's what most people seem to be getting. So you get just over a minute per question. Make sure that you use your time wisely. Don't spend too much time on one question. You've got 102-odd questions to get through within two hours. Use your time wisely. Don't waste time. The good thing about the exam is because there's so many questions and it covers such a broad range of topics, if you don't know the answer to one question, don't get flustered. Don't get worried. If you don't know the answer, take a guess and move to the next question. And that being said, you can't go backwards. So once you answer a question, that's it. You can't go back and change your answers. You can only go forward, but don't waste time on one question. If you don't know the answer, take your best shot, just a guess, and move to the next question. Don't let one or two questions that stump you or that trick you make you worry. Remember, you've got 102 questions in the exam. So if you don't know the answer to one or two, that's okay. You can make it up on other questions. Another big change, talking about changes, is you now can take the exams remotely. You can take the exam from your home. You can take the exam online, but it's a proctored exam, so someone is watching you. Have a look at this video where I discuss my online exam experience when I did the CCNP Encore exam. I won't repeat that here. Basically, I talk about my experience taking an online exam. It's very different to going to a Pearson Vue testing center. I actually prefer online exams to going into a testing center. It's just easier for me. When I took my CCNP Encore exam, I couldn't go to a testing center anyway because the world was locked down basically. But I personally prefer the online exam experience, but a lot of people have found it to be a very negative experience and have had problems taking an online exam. It's really up to you. Do you prefer going to a testing center, or do you prefer taking it online? The choice is yours these days. Exam information is basically the same, two hours, 102 questions or so. Be careful with your time, big, big tip. And again, if you want to know more details about the topics covered in the exam, have a look at this video where I go through it in a lot of detail. Big changes just in summary, no simulations, multiple choice, single answer, multiple choice, multiple answers. You also get drag and drop questions, no simulations. Most important thing is that you go out there and make a success of your life. Don't let people or circumstances hold you back. Go and make a success of your life. I'm David Bombal, and I wanna wish you all the very best (upbeat electronic music)",
    "transcript_keywords": [
        "exam",
        "CCNA exam",
        "CCNA",
        "learn",
        "questions",
        "life",
        "change",
        "Cisco CCNA exam",
        "Cisco",
        "answers",
        "make",
        "answer",
        "Poodle",
        "change your life",
        "multiple",
        "question",
        "online exam",
        "Packet Tracer",
        "Cisco CCNA",
        "time"
    ],
    "transcript_entity_values": [
        "these days",
        "three",
        "CCNP Encore",
        "many years ago",
        "Cisco Certified Network",
        "Cisco",
        "the first day",
        "Pearson Vue",
        "Poodle] Tesco",
        "120 minutes",
        "two",
        "200-301",
        "two hours",
        "CCNA",
        "tomorrow",
        "Poodle",
        "YouTube",
        "every day",
        "today",
        "Packet Tracer",
        "102-odd",
        "Packet Tracer",
        "one",
        "Tesco",
        "Tracer",
        "Cisco",
        "CCNA",
        "102",
        "CLI",
        "David Bombal"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "NORP",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.06086147204041481,
        -0.031475942581892014,
        0.022002683952450752,
        -0.0173055250197649,
        -0.03465186059474945,
        -0.03317548707127571,
        0.009119882248342037,
        -0.006698274053633213,
        -0.14612239599227905,
        -0.017836332321166992,
        0.01276965718716383,
        -0.06872552633285522,
        -0.02789207547903061,
        0.011704469099640846,
        -0.002367996610701084,
        -0.007009036839008331,
        0.012985442765057087,
        -0.049180008471012115,
        0.009491379372775555,
        -0.018591780215501785,
        0.007859937846660614,
        0.0022347960621118546,
        0.02212047018110752,
        -0.02368539199233055,
        -0.1017707958817482,
        0.04801272973418236,
        0.04578481987118721,
        -0.0331830196082592,
        0.019616395235061646,
        -0.08505973219871521,
        -0.04468664899468422,
        0.053242143243551254,
        0.02580259181559086,
        0.03705499321222305,
        0.007405052427202463,
        -0.04520310088992119,
        -0.027992771938443184,
        0.00812754686921835,
        0.023482633754611015,
        0.01338397990912199,
        -0.022060198709368706,
        0.014658456668257713,
        0.013975217938423157,
        0.024711783975362778,
        0.04242543503642082,
        -0.07874510437250137,
        0.015009177848696709,
        -0.060802772641181946,
        0.054725296795368195,
        -0.03605358675122261,
        -0.004454715643078089,
        -0.03354005888104439,
        -0.052785586565732956,
        0.007582674268633127,
        -0.019412457942962646,
        0.017986813560128212,
        -0.019908670336008072,
        -0.04634217917919159,
        0.02333802916109562,
        -0.03983430191874504,
        -0.047861915081739426,
        -0.04494261369109154,
        -0.05504447594285011,
        0.018488014116883278,
        0.01534354779869318,
        0.020521193742752075,
        0.018057597801089287,
        0.10359549522399902,
        0.06413822621107101,
        -0.02486051246523857,
        -0.1313731074333191,
        0.012648158706724644,
        -0.021568667143583298,
        0.0732296034693718,
        0.0033346794079989195,
        0.03485497087240219,
        0.03829877823591232,
        -0.027514450252056122,
        -0.007072389591485262,
        -0.06605886667966843,
        0.04992363974452019,
        -0.04244290292263031,
        0.007367356680333614,
        0.000378342840122059,
        0.0763954371213913,
        0.04081207886338234,
        -0.008316081948578358,
        0.009361203759908676,
        -0.06641008704900742,
        -0.06596536189317703,
        0.03558993712067604,
        0.032970502972602844,
        -0.0547419972717762,
        0.031199440360069275,
        0.04909335449337959,
        0.020337503403425217,
        0.03862571343779564,
        -0.06442997604608536,
        0.018681073561310768,
        0.04482327401638031,
        0.09070783853530884,
        0.0278277937322855,
        -0.050783026963472366,
        -0.054097406566143036,
        -0.12746605277061462,
        0.031512971967458725,
        0.044195327907800674,
        0.0003978195891249925,
        0.0808415338397026,
        0.03932102024555206,
        -0.0199489314109087,
        0.059260498732328415,
        -0.031558237969875336,
        -0.10371294617652893,
        0.022026749327778816,
        0.06358495354652405,
        -0.020765703171491623,
        0.08446354418992996,
        0.06938763707876205,
        0.05309058353304863,
        -0.0819116085767746,
        -0.004035742022097111,
        -0.028901798650622368,
        -0.018768200650811195,
        0.05159418284893036,
        -0.09464870393276215,
        0.005741526838392019,
        1.0471573306141657e-32,
        -0.030060214921832085,
        0.03624138608574867,
        -0.07935034483671188,
        0.08962450921535492,
        0.09999365359544754,
        0.0014115639496594667,
        0.07890841364860535,
        0.06372176110744476,
        -0.08097540587186813,
        0.041392333805561066,
        0.03452429547905922,
        0.005712781101465225,
        -0.0782947763800621,
        0.002632484771311283,
        -0.028098490089178085,
        -0.036861762404441833,
        -0.0912487581372261,
        -0.07107464224100113,
        -0.04434532672166824,
        -0.011449168436229229,
        -0.013512780889868736,
        0.0006742531550116837,
        0.04268333315849304,
        0.027867931872606277,
        0.09091772139072418,
        0.023643556982278824,
        0.051974616944789886,
        -0.021673312410712242,
        0.0670781210064888,
        0.004924111999571323,
        -0.03986760601401329,
        -0.0036923980806022882,
        -0.07965023070573807,
        0.036624785512685776,
        0.056516602635383606,
        0.046463631093502045,
        -0.02626672387123108,
        -0.02684013731777668,
        -0.025798993185162544,
        -0.029489733278751373,
        -0.052471306174993515,
        -0.03270738944411278,
        -0.05132126435637474,
        -0.03117952309548855,
        -0.06678551435470581,
        -0.06958184391260147,
        0.023999255150556564,
        0.0006687596905976534,
        0.0632118359208107,
        0.013466166332364082,
        -0.02164185792207718,
        -0.02567177452147007,
        -0.08510413765907288,
        -0.09738718718290329,
        -0.004073247313499451,
        -0.0777764692902565,
        0.05008576810359955,
        0.010067097842693329,
        0.0026460124645382166,
        0.08050759136676788,
        0.016004318371415138,
        0.058596618473529816,
        -0.05882784351706505,
        0.05842236056923866,
        -0.045359112322330475,
        0.055664319545030594,
        -0.1589985191822052,
        -0.05234203115105629,
        0.10233785957098007,
        -0.040335070341825485,
        -0.06414598971605301,
        -0.006965679582208395,
        0.07561910897493362,
        -0.03072524443268776,
        0.11155477166175842,
        0.07652172446250916,
        -0.08794604986906052,
        -0.0026746580842882395,
        -0.01046216394752264,
        -0.010178770869970322,
        -0.039574701339006424,
        -0.0057459608651697636,
        0.04736210033297539,
        0.012048783712089062,
        -0.028117094188928604,
        -0.03195004165172577,
        0.05008921027183533,
        -0.06639165431261063,
        -0.03161186724901199,
        0.03514059633016586,
        0.047532517462968826,
        -0.0014989556511864066,
        0.03821731358766556,
        0.055635884404182434,
        0.03693827614188194,
        -9.908229393453584e-33,
        0.015435666777193546,
        0.07519888877868652,
        -0.06929140537977219,
        0.007166941650211811,
        0.024777796119451523,
        -0.07484956085681915,
        0.104808010160923,
        -0.026235245168209076,
        0.053108420222997665,
        -0.055230189114809036,
        0.02271968685090542,
        0.04645044729113579,
        -0.023727159947156906,
        0.02999981865286827,
        0.008690848015248775,
        -0.043055709451436996,
        -0.05495760589838028,
        -0.020437875762581825,
        -0.036679986864328384,
        -0.03269778564572334,
        0.03798094391822815,
        0.09964420646429062,
        -0.11234194040298462,
        -0.021678099408745766,
        -0.019119644537568092,
        0.06140892580151558,
        0.07825736701488495,
        0.028748387470841408,
        0.14506793022155762,
        0.018706275150179863,
        -0.0285059604793787,
        0.032644856721162796,
        0.03598281741142273,
        0.048686735332012177,
        -0.0092001399025321,
        0.05181509256362915,
        0.11869604140520096,
        0.09426384419202805,
        -0.01656465046107769,
        0.0323038250207901,
        0.05408770591020584,
        0.0008568452321924269,
        -0.0676322728395462,
        -0.029650434851646423,
        0.029016217216849327,
        0.020738806575536728,
        0.014061450026929379,
        0.010973386466503143,
        -0.1035906970500946,
        0.044899895787239075,
        0.04614226147532463,
        -0.022572269663214684,
        -0.02457786537706852,
        -0.03481796383857727,
        0.05915386229753494,
        0.10523848235607147,
        0.002731835935264826,
        -0.024457111954689026,
        0.05640461668372154,
        0.010078389197587967,
        0.01931351236999035,
        0.009049042128026485,
        -0.011750343255698681,
        0.051881343126297,
        0.013278408907353878,
        -0.06564509868621826,
        -0.000791272206697613,
        -0.011578857898712158,
        0.002017400925979018,
        0.028232162818312645,
        -0.12029056996107101,
        0.08194896578788757,
        0.015174715779721737,
        -0.12197478860616684,
        0.04945166036486626,
        -0.004055138677358627,
        0.006038486957550049,
        -0.03035072423517704,
        -0.01515283901244402,
        -0.04060894623398781,
        -0.0308311115950346,
        -0.010076072998344898,
        -0.04245719313621521,
        0.12098781764507294,
        0.022993743419647217,
        0.10670536011457443,
        0.0670192688703537,
        0.04018240049481392,
        -0.021240143105387688,
        0.024353254586458206,
        -0.0132815632969141,
        0.011969850398600101,
        0.08148450404405594,
        -0.007545930799096823,
        0.007663845084607601,
        -5.617699372351126e-08,
        -0.0762922614812851,
        0.023804696276783943,
        -0.07381089776754379,
        0.019645022228360176,
        0.02059146575629711,
        0.05211775377392769,
        -0.03442493826150894,
        -0.0074399905279278755,
        -0.0063397884368896484,
        0.017885517328977585,
        0.002785684773698449,
        -0.005221930798143148,
        -0.048950884491205215,
        0.04300420731306076,
        -0.0008917045197449625,
        0.04187489300966263,
        -0.04505795240402222,
        -0.011151913553476334,
        -0.005913312081247568,
        -0.09002673625946045,
        -0.007318221498280764,
        -0.029172953218221664,
        -0.05114743486046791,
        0.06176888942718506,
        -0.08513502776622772,
        0.023515498265624046,
        0.042649418115615845,
        0.08548202365636826,
        0.0061639295890927315,
        -0.05198859050869942,
        -0.035603199154138565,
        -0.030316080898046494,
        0.005891361739486456,
        -0.04900830611586571,
        0.040391337126493454,
        -0.008768487721681595,
        -0.0022450077813118696,
        -0.057611074298620224,
        0.06335946172475815,
        0.04893539100885391,
        -0.08908431231975555,
        -0.08287917077541351,
        -0.0011094608344137669,
        0.029295114800333977,
        0.05460489168763161,
        -0.07867021858692169,
        -0.12077068537473679,
        -0.02747626043856144,
        0.026957828551530838,
        -0.0304236002266407,
        0.0008645498310215771,
        -0.028361817821860313,
        -0.05803194269537926,
        0.0022147332783788443,
        0.08140508085489273,
        0.07465197145938873,
        -0.001459939987398684,
        -0.012457934208214283,
        -0.09144142270088196,
        0.08097897469997406,
        0.02938844822347164,
        0.03687232732772827,
        -0.06483203917741776,
        -0.01649150438606739
    ]
}