{
    "id": "zZR0mycMksU",
    "title": "His new gadget any good at catching rogue devices?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-05-21T14:30:16Z",
    "video_url": "https://www.youtube.com/watch?v=zZR0mycMksU",
    "category": "People & Blogs",
    "tags": [
        "nmap",
        "wifi",
        "hack",
        "hacking",
        "cyber",
        "cybersecurity",
        "threat",
        "threat hunting",
        "wifi analysis",
        "scanner",
        "wifi scanner",
        "hackers",
        "ethical hacker",
        "ethical hacking",
        "hacker",
        "hacking tutorial",
        "learn hacking",
        "how to hack",
        "wifi cracking",
        "nmap switches",
        "netally",
        "cyberscope",
        "netally cyberscope",
        "netally wifi",
        "wifi pentest",
        "wifi nmap",
        "rogue ap",
        "rogue access point",
        "infosec",
        "information security",
        "attack",
        "cyber security",
        "wifi hack",
        "wifi crack",
        "nmap scan",
        "nmap port scan",
        "nmap scripts",
        "nmap vulnerability scan"
    ],
    "views": 48616,
    "likes": 1543,
    "comments_count": 135,
    "description": "What tools and gadgets does Chris Greer use for packet analysis, device discovery and threat hunting? Here's one of his newest tools! What is it and is it any good?  I trust Chris. When Chris tells me he uses a product in the real world, I listen to him.  What do you think? Like this or not? A big thank you to NetAlly for supporting my channel so I can create more free content! Huge thank you to all of you who watch my videos and support me!   Learn more about the CyberScope here:   // Chris SOCIAL // Wireshark course:  Nmap course:  LinkedIn:  YouTube:  Twitter:   // David SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MENU // 00:00 - Kali NetHunter Rogue Access Point 00:25 - Concerns about devices on our networks 01:52 - I trust my friends and allow them to recommend  devices 02:28 - Collaboration via Link-Live 03:10 - Scan the network 04:13 - Automated discovery 05:15 - Nmap (new cool feature) 06:38 - Nmap demo 08:38 - Nmap Scripts 10:02 - Topology Map 12:02 - Rogue Access Points 14:38 - Rogue Switches and devices (Discovery and port scans) 16:40 - Theres only one Chris Greer! (Download his brain) 17:23 - Packet Capture (10 GbE) 20:00 - Closing Thoughts 20:39 - Outro  netally netally cyberscope  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.   #wifi #nmap #cyber",
    "description_links": [
        "https://davidbombal.wiki/netally",
        "https://davidbombal.wiki/chriswireshark",
        "https://davidbombal.wiki/chrisnmap",
        "https://www.linkedin.com/in/cgreer/",
        "https://www.youtube.com/c/ChrisGreer",
        "https://twitter.com/packetpioneer",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- I've got Kali NetHunter running on my Android phone. I can set up a rogue access point using a device like this. Now, while that's great for doing pen testing, the problem is what happens if people actually do that in your real environment? Chris, you've been telling me about this new tool that can do a whole bunch of things including finding devices, but can also help people use Nmap commands. Nmap is a great piece of software, but the switches can be a nightmare. You've gotta tell us about this new tool. - You just hit the nail on the head some concerns that are really out there. What is on our networks? What active devices are actually on our networks? How do I know that I have rogue devices that have been plugged in or wireless access points, rogue access points. Where are they and are they vulnerable? All right, so this tool from NetAlly, this is what I wanna introduce to you, David. It's called the CyberScope, and it's designed to be a handheld portable device that we can walk around, if we're doing wireless or we can actively plug in to a wired port. I have a port here. I can also go to a fiber port and I can have a side port that I can manage this device with if I'd like to remotely, but the point is to make discovery and vulnerability analysis accessible to a common technician. So I'd like to take you on a bit of a tour of this device to show how we can discover active devices, find out if they're vulnerable, and also physically locate them when we do find those devices that shouldn't be there. - It sounds great for real world implementations. Obviously not so much fun, if you're gonna be able to catch me, you know, running my rogue access points. But I mean, on a serious note, companies are getting hacked all the time. Nmap is a skill that all of us in cybersecurity need to learn, but it can be difficult, you know, to remember everything and carry your laptop around. So, I mean, this looks like a great tool, Chris, and you've been telling me a lot about this offline. So take it away, Chris. Show us what this tool can do. - You bet and I'm passionate about this tool because it's one that I actually use. So let me go ahead and get into how to use it. - So disclaimer, before we continue, this is a sponsored video. I'm really hesitant about demonstrating sponsored content and that's why I rely on trusted friends like Chris. Chris, you obviously wouldn't have told me about this product if you didn't believe in it. - Right, exactly. I'm like you, David. I don't like doing commercials, unless they're for products that I actually use. So this company NetAlly, not only do they do great products and they have a history of doing so, but they're also good people. They offer good support. So this is definitely something that is gonna be in my backpack moving forward and it's gonna help me to do my job better as a threat hunter and also a network troubleshooter. So on the left here, you can see on my screen, I've actually VNC'd into this device that I have right here, all right? So what that means is I can drive the screen, I can do so remotely, we can do this from any point, any location I can remote in. And on the right we have, it's actually a cloud-based service called Link-Live. And what it does is it actually allows me to take results from the CyberScope, so test results, I could have someone running around actively running tests. And it can upload those results to Link-Live and then I can interact, and analyze that data from wherever I'm located. So even you David, we could collaborate on troubleshooting or doing threat hunting using the CyberScope. You're there in there in the UK, I'm here in the US and we could collaborate using Link-Live to do so. All right, so first let's just do really the bread and butter of the CyberScope is gonna be the AutoTest. Just gonna come over here, Android-based device, come over to AutoTest. And then from here, I just literally hit start. And what that does is it starts to scan my environment, take a look at what I'm actively connected to. Now this device is wirelessly connected, so the first thing it's gonna do is find the AP that it's connected to and then after that it's gonna do some service testing. So DNS, DHCP, after that it's gonna phone home out to the internet to be able to make sure that I have internet connectivity. And then it also can do an Nmap test on top of that to find out if a specific device that I tell it to scan is vulnerable, if it has certain ports open. So this is just a quick test. If I wanna confirm that connection is up and running, and I can get out to the world, and what ports are open on a certain device. Okay, so that's one test that I can quickly run using the CyberScope. So here I can see this is just a basic network scan. You can see the different channels in the environment. You can see an AP that I'm connected to. We have DHCP, DNS and so on. All right, that's great just to do basic connectivity stuff, but let's go ahead and have a bit more fun. Over here, Discovery is another core piece of the CyberScope. Okay, so just in my local environment this is my little test network here. So here I have devices, so now I've actively scanned through these, but as a part of Discovery, what else I can do, David, is I can do automated Nmap tests against these devices and it can do so with a click of a button. All I do is I tell CyberScope, go, it's gonna actively scan my environment using ARP, it's gonna do a ping scan, it can do SNMP on devices, manage devices like switches and routers. From there I can go to an SNMP MIB on a switch or router and I can find what devices are actively connected to it on what port. What that does is it allows me to say, okay, David is connected to port 10 and he's on this switch, and in addition to that, what ports does he have open that I should be concerned about? Now that's getting into the Nmap component, okay? So this is discovery. So all of this is all built-in just in a single touch of a button, we can go do discovery, but if I go ahead and come back out, come home, this is where the shiny new feature here that's been built into the tool very recently is on the Nmap piece. Now you mentioned at the beginning, one of the difficult things about Nmap is just remembering the switches, it's remembering how to use it. Nmap is a command line tool, right? It's, you know, it does have also a GUI-based product as well. However, the core Nmap is a command line thing. And it can be daunting for new cybersecurity professionals, new SOC analysts, even network engineers to get up and get comfortable with using. I'm sure you've felt that right, David? - Yep, yep. - Yeah, I know I have. This is something that for me just remembering those switches and okay what type of test do I want to run? What is my end game goal? And then when I do get responses back, how do I interpret them? I mean on the Udemy course that you and I collaborated on, that's what a lot of the comments have mentioned. Hey, Nmap could be a little daunting, but learning how to use it well, right? So what this tool did is it integrated Nmap and what it does is it allows us, if I just come over here to Nmap tests, what this does is it allows me to configure tests where I can just have a technician or I can have people that I'm collaborating with just do a one button test where, hey, if I wanna run an intense scan, if I just wanna do the dash A properties, I can just click that button, see the results and then I can do my interpretation. So actually let me show you that. Just gonna go to Nmap and this is where all I do is I just come up, I select the test I wanna run in this case I'm running a fast port scan and I just hit start. And this is gonna be a familiar output because it's basically the output that Nmap usually puts out. What's different here is here, I don't have to remember the command, this is automatically built-in, so I do configure that ahead of time and that will allow me to customize those tests. Then I got my duration, my results, I can see what ports are up, what ports are down, but also you notice that open is red. So this is where when I'm doing my test configuration which let me show you this. If I come back and I just go to Nmap tests, this is where if I come down to fast port scan. So now, this is where I can set up the different features. And what I did down here is I said result must not contain regex either big or small open. And I want, when we do find that word, go ahead and color it according to the error coloring rule which is gonna be red. So now when I come back to that test, if I just have maybe a newer user, someone that's just coming on the team, somebody that isn't fully fluent in Nmap just yet, this allows them to collaborate with me to be able to find vulnerable devices in those open ports and to quickly be able to spot any ports that I should be concerned about. - But if you were working for a big company and you had like a hundred offices, you could get devices like these shipped to someone who isn't quite familiar with Nmap at all, right? Just a basic technician and then that information can be fed back to you centrally to actually analyze what's going on. - Yes, absolutely. And the way that happens is by the service that you see over here on the right of my screen and this is called Link-Live, right? So what Link-Live does is when I run those tests, these results can be uploaded to Link-Live and then I can collaborate with other engineers to be able to do the analysis and go wait a second, hang on, David is running Port 22, why does he have that port open? That's something that could be a vulnerability or something that could be exploited. Now in addition to just the standard Nmap scans, something else that we can do with the Nmap features is we can also run scripts. Now scripting is where Nmap really has a lot of power. We can use vulnerability scripts, we can take a look at HTP scripts, when we find a certain service really comb it, walk it, find what these directories are there, or even something that I use it for, David is when I'm doing tests against secure web servers, what versions of TLS are they running? Go ahead and scrape all of the certificates off these servers to make sure that they're legitimate. So those are all scripts that are built into Nmap. And the nice thing about this tool that's been done with CyberScope is that we can run those scripts as well. All we have to do is just configure the tool, go and run the vuln script for example, and then I can put this tool in the hands of someone and they can go do vulnerability scripting live after discovering the network. So a lot of power in one device, right? Like we can do live as-built active devices that are connected out there. Follow that with Nmap scanning to be able to find what's vulnerable and what ports are open. It doesn't end there either. After that I can configure CyberScope to be pushing this information up to Link-Live. Now let's talk about Link-Live for a second. That's a separate service, right? It receives the analysis or receives the test results from the device. I can have a hundred devices out there, all feeding that information back to Link-Live. From Link-Live is where we see a bit more of the power of the tool. Okay, so if I come over here, David, another really interesting feature of the CyberScope and it's discovery is the ability to build out a topology map. So as discovered, when it goes and does that scanning, it actually can draw this map out for us. And this is pretty sweet. This is where we can just zoom-in for this switch, where are devices located? What ports are they attached to? What's the IP structure? What VLANs do we have out there? Also, I'm sure what's catching your eye right now are these different colors, right? So some of these switches have, they have warning level events, right? So this is something that we can dig in further from here, we can go back into the discovery mechanism and we can do a bit more of a dig on there and find out, okay, why is it yellow? Is it because maybe it's using a default community string with SNMP. Maybe it hasn't responded to some pings. Maybe there's an interface on there that has some FCS errors or some other type of link level issue. But having that as-built topology map is pretty nice. I mean, think about it David, being a network engineer, let's go to our network engineer days. How often did you update documentation? Yeah, next century. Yeah, I know when I work with my clients and I'm going out and trying to help them to resolve network performance and analysis problems, even doing threat hunting and cybersecurity, I ask them for a map of their network and they just they go and they just have to blow off this old documentation or find it on some drive somewhere and the date is five years old. I mean, how much changes in that amount of time? That as well as rogue devices. So now if somebody comes in and connects something that shouldn't be there, that's something that I wanna know about. I wanna know about how to track it down, where it's at, right? So our topology map helps us to do this. This is searchable. We can filter on a device, we can specifically go and find one. Also drawing our eyes to those different error-level events that can help us to see things that maybe we didn't even know were problems, right? So open holes we can find if there's any ports that are open on those devices that shouldn't be open. Hey, you're running a web server on a switch is that something you wanna do? Or that printer over there is using a port that it shouldn't be. Those are things that I want to know about. - So Chris, I mean, coming back to NetHunter or you know, rogue access points, does the tool, I think you said it does, is there a way that it can like discover rogue access points and show me where it is because I could have left this in a building or some user could have just put an access point in the building and you know, how would you find that? - That's a great question, David. Especially, I mean, so much can happen from a wireless device, right? Especially a rogue one. Those are things I want to know about. So what I can do here, let me just come back to the CyberScope and if I come back to the homepage, there's several different built-in WiFi features as well. Wireless discovery and also a great feature called AirMapper. Now with AirMapper what I need to do is I need to give the CyberScope basically a floor plan of the environment that I want to walk, I wanna do a survey for, and once I do that survey, it can draw a heat map for me, but it can also triangulate and figure out where devices are actively located. From there, I can start to find your NetHunter, I can start to find rogue APs and physically be able to pinpoint them. Let me show you that, this is just a demo floor map here for you, okay? So it was run with AirMapper. Now here I can just see the path, so this is the path that was actually walked with physically the CyberScope device. Okay, and then from here, I can see heat map. So in what areas do I have poor signal quality or do I look like I have good coverage? So here, I can see green and blue, that's good. We definitely wanna be in that lower range of dBs or I'm sorry, on this coloring thing I wanna be either green or blue, if possible. And that's gonna show me I have good coverage. Maybe if I have an elevator shaft or some area where I have a lot of concrete, maybe I start to fall into these bad signal strength areas. Those could be areas where I have a lot of spotty connectivity with WiFi. But back to what you were saying, how would I find you? Well, this is a great part of this tool. If I go to AP locations and this is where I can come down and I can look for any APs that could have MAC addresses or IPs or even names that look suspect something that I shouldn't see. So I'm just gonna show you an example here. Here's one that's Verizon, okay, so let me grab that. And you notice how it put the Verizon AP right there on the map. I know physically where it's coming from. So if that's David's office, this is where I can go in and say, \"Hey David, why are we running this rogue AP, what is this device?\" I can even go to the discovery capabilities of the CyberScope and find out even more information about it and what kind of SSIDs it's popping off, what channels it's using. Also its IP and even better yet, wired where it's connected to. But that's gonna help me to triangulate and physically find those APs on my environment or on that format. - Chris, the NetAlly has a whole bunch of tools, right? There's a whole history here. So like I was just thinking while you're mentioning this, could it also discover like a rogue switch, for lack of a better term, but like some user just plugs in some random TPLink switch or something in the network? - Oh yeah, absolutely. So in the discovery as a part of those active discovery tests, it's something that continuously runs. It's not just a one and done thing. You mentioned this is not being a new tool and the fact is, is that this has a little brother called the EtherScope that's been around for a while and that's where the discovery component comes from. What makes the CyberScope unique, and this is just a new bleeding edge tool that just came out. What makes it unique is the Nmap capabilities, all right? So on these buttons that you see over here, WiFi's been here, discovery's been here, AutoTest has been here, but Nmap not just as an isolated tool that I can go in there and I can run, and I can basically make that much more useful for the common person, I can run that, but it also has links to Nmap built into the discovery. So in times past, I would just be able to do a discovery, find active devices and that was it. But with the Nmap feature, now, I can discover devices and then I can run port scans and scripts against those devices. So now I can go, okay, it's not just that David has five devices in his office, one of them shows up some CVE issues that could be exploited by using the vuln script. It's much more powerful from a cybersecurity perspective because now we have that Nmap built-in and it links into both AutoTest and discovery. - I think, it's really cool that you mentioned that it doesn't just discover the devices it also tells you vulnerabilities. - Yeah, exactly. And that's if we're running those scripts, it just makes the Nmap component that much easier to run for the common person, right? So we don't have to just sit here all day on a command line and just hammering, and doing our pen testing, internal pen testing. But this is going to automate that. It's gonna simplify it and then it's going to take those results, and we can upload those to Link-Live where we can save and also collaborate to analyze that data. - I love it, I mean, in the old days, you know, Chris, you and I have been around the block a few times, you know, you had to really like know the nitty gritty about stuff, but I love these kind of tools where you can take someone's knowledge like you. There's only one Chris Greer unfortunately, and you can like write scripts or do stuff on a tool like this and then ship it to me and even perhaps if I don't have that knowledge, I can simply plug it in, right? And then it'll do this and then it uploads it and then you can analyze that information. I think that's a really cool feature. - Oh, absolutely. I mean, if you think about it for me as an independent consultant, I mean, what better to send one of these to my clients, all they gotta do is plug it in and then it can do the rest, maybe hit one test or two and then I can integrate that into Link-Live, and I can start to see results right away. Also, you bring up my favorite little button right here, capture. So you bet David, if I am going to allow a gadget into my office, it's going to have packet capture. So sure enough, this thing can do line rate packet capture. We've talked about this before in your channel just the capture limitations of a laptop and how, you know, my eyes and ears are only as good as the the PCAP, right? So using packet capture, that's something that I can have have somebody run for me. And guess what? I can take that PCAP, pop it right out to Link-Live and boom, it can be a file that I can pull back and here's a file area, right? I can download and I can start working on that PCAP right away. Even if David, you were the one that captured it from the UK. - That's great. So I mean, in other words, you could ship that to me and I plug it in again, captures, it does the PCAP thing. I don't really have to have a whole bunch of technical knowledge and then you can get hold of that, right? - Exactly, and I mean, look at this, it's a touchscreen, right? It's a device, I mean, that part is great, but do you really think I wanna do deep Wireshark analysis on this little screen? Nah, that doesn't make no sense. So, and also, you know, as well as if I think about packet capture with, I don't wanna look around a laptop and have like a dedicated hardware device as well to do that packet capture at line rate 10 gig, instead I can just do it with the CyberScope and I can use that feature as well. - So it's 10 gig, right? - Yeah, 10 gig I can do 10 gig or on the fiber or copper, right? So with these features, what it does is it just brings a whole lot of functionality into one portable tool. What's new about that CyberScope is the Nmap capability that's linked into the discovery and also the AutoTest. So I can configure tests to enable network technicians or SOC analysts, people that I'm working with to discover actively devices, whether I know that they're there or not, scan through those devices and find vulnerabilities reporting them to me. And then I can upload those results to Link-Live so I can collaborate and do that analysis and distribute that amongst other devices. I mean, we think about it, one thing to think about, you know, a lot of times even in a large corporation, you don't have a hundred SOC teams, one for each location. A lot of times a SOC team is located in one or two locations in many cases, right? So what this does is it allows those teams to collaborate on one dataset and to do that analysis in whether we have one, two, or a hundred CyberScope that data can be fed to that central point. That's where we can do the analysis from. - Chris, this is fantastic. You know, I love gadgets. I've only got one question. When do I get mine? - David, I love gadgets too and I think it's time to make that happen. So we'll make sure before the next video that you have one in your hands too. - That'd be great. Chris, as always, thanks so much for sharing your knowledge with all of us. Thanks for creating an Nmap course and you know, combining that with Wireshark. What I really love about what you've shown me here is there's only one Chris Greer, as I said. We can't all be like you, but this gives all of us, mere mortals, if you like, the ability to do the kind of stuff that you would do with a, you know, easy to use GUI. - Yeah, with tools like these, you're gonna be better. So that's my hope for everyone. So if you need to go ahead and check out NetAlly, we have the links in the video description down below. Ask for a demo and see what you think about it. And hopefully this will help you to be better at finding threats, finding devices on your networks that you should know about. - Thanks, Chris.",
    "transcript_keywords": [
        "Nmap",
        "devices",
        "David",
        "device",
        "find",
        "tool",
        "Nmap tests",
        "CyberScope",
        "discovery",
        "Chris",
        "port",
        "test",
        "run",
        "LinkLive",
        "ports",
        "tests",
        "great",
        "back",
        "network",
        "open"
    ],
    "transcript_entity_values": [
        "first",
        "UK",
        "CVE",
        "Verizon",
        "TLS",
        "AirMapper",
        "Nmap",
        "next century",
        "CyberScope",
        "Android",
        "Discovery",
        "a second",
        "a hundred",
        "TPLink",
        "Kali NetHunter",
        "ARP",
        "five",
        "two",
        "Verizon AP",
        "AutoTest",
        "Wireshark",
        "PCAP",
        "HTP",
        "second",
        "SOC",
        "David",
        "Port 22",
        "all day",
        "Chris",
        "IP",
        "EtherScope",
        "Nmap",
        "NetHunter",
        "one",
        "five years old",
        "the old days",
        "MAC",
        "AP",
        "hundred",
        "GUI",
        "CyberScope",
        "SNMP",
        "DNS",
        "AutoTest",
        "NetAlly",
        "Link-Live",
        "FCS",
        "DHCP",
        "Wireshark",
        "APs",
        "US",
        "Chris Greer",
        "10"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "GPE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "FAC",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.09480572491884232,
        -0.007861688733100891,
        -0.04041995108127594,
        -0.10233678668737411,
        0.09371544420719147,
        -0.02649129554629326,
        0.14745855331420898,
        -0.0019619136583060026,
        -0.07817041873931885,
        0.02038741670548916,
        0.005704391747713089,
        0.046663228422403336,
        0.026862917467951775,
        -0.00990033894777298,
        -0.020094137638807297,
        -0.021406017243862152,
        0.07259906828403473,
        -0.07611781358718872,
        0.010991198010742664,
        -0.040745534002780914,
        -0.0864725410938263,
        0.0032725168857723475,
        0.051047127693891525,
        -0.050284381955862045,
        -0.05295666679739952,
        -0.027502473443746567,
        0.028055882081389427,
        -0.013111480511724949,
        -0.06242305040359497,
        -0.053839363157749176,
        -0.011338808573782444,
        0.043530963361263275,
        -0.045971617102622986,
        -0.001959425862878561,
        -0.06621289253234863,
        -0.11042806506156921,
        0.029929552227258682,
        0.05661271885037422,
        -0.08760528266429901,
        -0.046800460666418076,
        0.015673039481043816,
        -0.08067510277032852,
        -0.02450210601091385,
        0.07268377393484116,
        -0.05977506563067436,
        0.0018490789225324988,
        -0.06240684911608696,
        -0.03935374692082405,
        0.06136753410100937,
        -0.05412213131785393,
        -0.04073765128850937,
        -0.0245930515229702,
        0.0603175088763237,
        0.058424487709999084,
        0.018404290080070496,
        -0.019749419763684273,
        -0.029474573209881783,
        -0.03133459389209747,
        0.0356590673327446,
        0.01943042315542698,
        0.018646687269210815,
        -0.05637001246213913,
        -0.028327345848083496,
        0.03056143783032894,
        0.03700049966573715,
        0.03090115264058113,
        -0.018237264826893806,
        0.054138872772455215,
        0.07880347222089767,
        -0.0186779648065567,
        -0.02342735044658184,
        0.025392301380634308,
        0.030954454094171524,
        0.06290986388921738,
        0.06635194271802902,
        0.04723741486668587,
        0.01293949969112873,
        -0.002032970078289509,
        -0.011082434095442295,
        -0.031954482197761536,
        0.07229749113321304,
        0.035677678883075714,
        -0.06655997037887573,
        -0.013101022690534592,
        0.0024507567286491394,
        0.046307522803545,
        -0.03650122508406639,
        -0.04487564042210579,
        -0.010388921946287155,
        0.04950704053044319,
        -0.028087034821510315,
        0.1227293387055397,
        0.015437046065926552,
        -0.04025030508637428,
        0.013882775790989399,
        0.004906411282718182,
        -0.012975096702575684,
        -0.06238614395260811,
        -0.11086323112249374,
        0.09717651456594467,
        -0.051667746156454086,
        0.0013588074361905456,
        -0.030527150258421898,
        -0.10046366602182388,
        -0.03047669306397438,
        -0.007607137318700552,
        0.023468727245926857,
        0.0003870509681291878,
        0.11524952203035355,
        0.06535724550485611,
        -0.03575894981622696,
        -0.008671710267663002,
        -0.10772841423749924,
        -0.06465459614992142,
        0.07105617970228195,
        0.06586126983165741,
        -0.02965097688138485,
        0.12395029515028,
        -0.004067850764840841,
        -0.04402705654501915,
        0.018195435404777527,
        0.06536727398633957,
        0.021123670041561127,
        0.01860467530786991,
        0.018959341570734978,
        0.06820083409547806,
        -0.0363188199698925,
        4.341132596339371e-33,
        0.03324727714061737,
        0.13063162565231323,
        -0.09848584234714508,
        -0.02692624181509018,
        -0.02268853597342968,
        -0.00024583545746281743,
        -0.02709047682583332,
        0.05812666192650795,
        -0.009537464939057827,
        -0.00011266802175669,
        -0.04960145801305771,
        0.029038554057478905,
        -0.037028733640909195,
        0.03205502778291702,
        0.025782780721783638,
        -0.025313295423984528,
        0.004765234887599945,
        0.034991584718227386,
        5.636296555167064e-05,
        -0.013815215788781643,
        0.01650172472000122,
        -0.08430585265159607,
        -0.02241342142224312,
        -0.0021267703268676996,
        0.10137435793876648,
        -0.011855099350214005,
        -0.013409440405666828,
        0.03733604773879051,
        0.15641535818576813,
        0.035700030624866486,
        -0.13717548549175262,
        0.052587684243917465,
        -0.02293112501502037,
        0.00254867784678936,
        0.05469523370265961,
        0.033718291670084,
        -0.1014927476644516,
        -0.07967457920312881,
        0.019278405234217644,
        -0.04188967123627663,
        0.014827333390712738,
        -0.027139201760292053,
        -0.034182656556367874,
        -0.0502685010433197,
        -0.04733063653111458,
        -0.07907567173242569,
        -0.030986227095127106,
        0.02635825052857399,
        -0.020619962364435196,
        -0.036961887031793594,
        -0.0306506659835577,
        -0.028520872816443443,
        0.008638890460133553,
        0.028591886162757874,
        -0.015616877004504204,
        0.044943131506443024,
        0.05108953267335892,
        -0.026347873732447624,
        0.08546557277441025,
        0.01863424852490425,
        0.0653362050652504,
        0.03144945576786995,
        -0.010293455794453621,
        0.015731098130345345,
        -0.0660700872540474,
        -0.004383342806249857,
        0.03270759433507919,
        0.043322354555130005,
        0.0020443645771592855,
        0.08943336457014084,
        -0.07348989695310593,
        0.006690768990665674,
        -0.007777676917612553,
        -0.08046915382146835,
        -0.007388525642454624,
        0.023861853405833244,
        -0.06459233164787292,
        0.05436680465936661,
        -0.004962553735822439,
        0.026303905993700027,
        -0.04003527760505676,
        -0.021881133317947388,
        0.08391472697257996,
        0.028158513829112053,
        -0.07447101920843124,
        -0.07059774547815323,
        -0.030817877501249313,
        -0.049853041768074036,
        -0.007044592406600714,
        0.15119485557079315,
        -0.002934262854978442,
        0.03528809919953346,
        0.0061813476495444775,
        0.056231994181871414,
        -0.0781666710972786,
        -5.010229858299171e-33,
        -0.06449951976537704,
        0.039830535650253296,
        0.04198852553963661,
        0.008517187088727951,
        -0.03156441077589989,
        -0.10541658848524094,
        -0.01052929274737835,
        -0.0043772924691438675,
        0.043284326791763306,
        -0.001086461590602994,
        -0.012048391625285149,
        0.015668904408812523,
        -0.004140520002692938,
        -0.11036276817321777,
        0.0794142484664917,
        -0.03145324066281319,
        0.02188812755048275,
        -0.029488472267985344,
        0.034253064543008804,
        -0.03382647782564163,
        0.05944928526878357,
        0.03906808793544769,
        -0.046826381236314774,
        -0.0795915275812149,
        -0.01864669658243656,
        -0.032538335770368576,
        0.057249654084444046,
        0.04670078679919243,
        -0.018422823399305344,
        -0.03136986121535301,
        0.03286762535572052,
        -0.049470771104097366,
        -0.013981726951897144,
        -0.014562319964170456,
        0.08395867794752121,
        0.09235373884439468,
        0.07376299798488617,
        0.05318644642829895,
        0.007517552934587002,
        -0.10364969819784164,
        0.11147879809141159,
        0.04522310197353363,
        -0.05486368387937546,
        -0.02614716812968254,
        -0.009435607120394707,
        -0.009012419730424881,
        -0.0004040695494040847,
        0.09067044407129288,
        -0.10019425302743912,
        0.00017432439199183136,
        0.061466481536626816,
        0.035306524485349655,
        -0.011257873848080635,
        -0.05661044642329216,
        -0.05124615505337715,
        0.06662631779909134,
        0.045575179159641266,
        0.026699800044298172,
        0.0542619526386261,
        0.03323845937848091,
        0.06541383266448975,
        -0.046248119324445724,
        -0.05302552878856659,
        0.05358433723449707,
        0.0018701456720009446,
        -0.004552499391138554,
        0.09783287346363068,
        0.0023742106277495623,
        0.004243968520313501,
        0.05490976572036743,
        0.0019227360608056188,
        0.006970454007387161,
        -0.013009196147322655,
        -0.06045754998922348,
        0.0011122578289359808,
        0.021886974573135376,
        -0.006615502759814262,
        -0.04085386544466019,
        -0.04843991994857788,
        -0.016483094543218613,
        0.02503877505660057,
        0.018165111541748047,
        -0.0503220409154892,
        -0.022041883319616318,
        0.062200892716646194,
        0.05012406036257744,
        0.03377470001578331,
        0.0119895925745368,
        0.032195527106523514,
        0.030519483610987663,
        -0.05221708118915558,
        -0.02145388163626194,
        -0.11739233136177063,
        0.08439549058675766,
        0.04069717600941658,
        -5.228071131568868e-08,
        -0.0026968384627252817,
        0.0414515882730484,
        0.0029977464582771063,
        0.028076132759451866,
        0.04671941697597504,
        0.016861962154507637,
        -0.05096666142344475,
        -0.049051135778427124,
        -0.01799916662275791,
        0.04601674526929855,
        0.02431679330766201,
        -0.07953694462776184,
        -0.06777144223451614,
        -0.026057273149490356,
        0.07281452417373657,
        -0.05275007337331772,
        -0.03153378888964653,
        -0.019147107377648354,
        -0.08338788151741028,
        0.016022732481360435,
        0.025521161034703255,
        0.04087402671575546,
        -0.02743302658200264,
        0.03951462730765343,
        -0.006035496946424246,
        -0.01975582167506218,
        0.020907992497086525,
        0.04186613857746124,
        0.026575878262519836,
        -0.018061954528093338,
        -0.05468369275331497,
        0.0010983942775055766,
        -0.037592336535453796,
        0.045178599655628204,
        -0.0034902109764516354,
        0.037773195654153824,
        -0.07751060277223587,
        0.024037254974246025,
        0.06360433250665665,
        0.07968020439147949,
        -0.02983645722270012,
        -0.044508226215839386,
        0.0043995436280965805,
        0.0030896326061338186,
        -0.12717050313949585,
        -0.033328860998153687,
        -0.06372155249118805,
        -0.06183233484625816,
        -0.002757797483354807,
        0.03664092347025871,
        0.010520161129534245,
        -0.052077945321798325,
        0.013480224646627903,
        0.016630273312330246,
        0.06011899188160896,
        -0.006965534295886755,
        0.04804036393761635,
        -0.11855795234441757,
        -0.029460202902555466,
        0.033363424241542816,
        -0.020367035642266273,
        -0.043508321046829224,
        -0.04492040351033211,
        0.07708320021629333
    ]
}