{
    "id": "zzzwti5PN_k",
    "title": "Building the Ultimate Mac Mini",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-04-03T16:56:11Z",
    "video_url": "https://www.youtube.com/watch?v=zzzwti5PN_k",
    "category": "Science & Technology",
    "tags": [
        "mac mini",
        "mac",
        "mac mini 2018",
        "2018 mac mini",
        "new mac mini",
        "apple",
        "apple mac mini",
        "mac mini setup",
        "thunderbolt",
        "thunderbolt 3",
        "building the ultimate",
        "mac mini ram",
        "lg 5k",
        "lg ultrawide",
        "logitech craft",
        "logitech",
        "zowie",
        "ec1-a",
        "this is",
        "matt",
        "austin evans"
    ],
    "views": 1765630,
    "likes": 32418,
    "comments_count": 1597,
    "description": "The latest Mac Mini is pretty solid but it's time to give it the Ultimate treatment. Apple Mac Mini on Amazon:  32GB Crucial 32GB DDR4 RAM on Amazon:  LG 5K 32\" 34BK95U-W UltraFine Thunderbolt monitor on Amazon:  Logitech Craft keyboard on Amazon:  BenQ Zowie EC1-A mouse on Amazon:  Pegasus3 R4 Thunderbolt storage on Amazon:  CalDigit Thunderbolt 3 dock on Amazon:  Gigabyte RX 580 Gaming Box on Amazon:    By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/macmini18",
        "http://austin.tech/crucial32gb",
        "http://austin.tech/lgultrawide5k",
        "http://austin.tech/logitechcraft",
        "http://austin.tech/ec1a",
        "http://austin.tech/pegasusr4",
        "http://austin.tech/tb3dock",
        "http://austin.tech/gamingbox",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. A lot of things have changed around here. My facial hair has changed, the vines have changed, but what will never change is our ideas of making really, really dumb things slightly less dumb. So this is a 2018 6-Core Mac mini. Now that part is actually pretty solid. But the rest of the components leave a little bit to be desired. Thankfully though, this is one of the only Mac computers you can buy today that's actually somewhat upgradeable. That is where this comes in. So with the Mac mini, thankfully you still do have SO-DIMMs, but the only issue is that when go order it straight from Apple, as always, it's very expensive. But if we do it ourselves, it's only gonna cost about 200. The only downside, is that ya have to open this up, and I don't think it's as easy as some previous Mac minis. So I've never done this before. I know previously you would just rotate this little guy. Oh that's already a not. I literally have no idea what I'm doing, but I know the old Mac minis this would just rotate. Oh, you just lift it. That's much easier, okay. Oh (laughing), well yeah, before this was pretty much all you had to do. So we have the antenna cover outta the way, now we can see the very small fan, and heatsink. But what I don't see is RAM. Alright, and there is our fan. So we're getting closer, I see our CPU socket, and what looks to be our heatsink. And this looks like the power supply over here. So now comes the part where I actually remove the motherboard, so if I just press it, oh. That's not so bad. So that is pretty much everything we need to do, wait, where's the memory? Oh it's underneath here. I was about to say come on. So we pull out the old eight gigs of memory, we can put in a full 32, and this should be a decent way along the Mac mini ultimate front. Alright, so we now have 32 gigs of RAM in our Mac mini. So with that out of the way, now it's time to upgrade our display game. So this is the giant LG 34 inch UltraWide. Now we took a brief look at this at CES, but what's cool about it is it's actually a 5K by 2160 monitor. So think like UltraWide 4K. The best part of this guy is that it does take advantage of Thunderbolt 3, although I think we've got some slightly more ambitious plans in mind. We drop it on the stand here. We've got a massive display. Now importantly, in addition to Thunderbolt 3, it also does support HDMI as well as DisplayPort. I am excited to give this a try. Gimme some Thunderbolt action, ay, alright. So there we go, we got our 5K display up. But is that enough for the Ultimate Mac mini? Come on. Unfortunately I can't actually log in yet, because I don't have my keyboard. The Logitech Craft, I had that upside down. So this is actually a sort of an interesting keyboard, and it has a little, what do they call this dial? The Creative Input Dial? It's kinda like the, what, the what, the Surface Dial? Except it works on Mac. Okay, we have the keyboard up and running. This is a super nice keyboard. I've actually never seen one of these in person. Not only does it charge via USB-C, but you've got the back lighting. I'm curious about how the dial, oh that just works as a volume by default. But we need a mouse, which is where uh (throat clearing) which is where this comes in. So this is the BenQ Zowie EC1-A. So now that we're into Mac OS, if I pull up about this Mac, we can see that we have our 32 gig showing up, we can see that it is the Core i7 version, but the next issue is storage. Because this only has what, 512 gigs, something like that? I think they do have a two terabyte option, but it's like $1,000. So instead we have this. So this is the Pegasus R4. Now if you guys have been watching the channel for awhile, you know that we actually bought this for a project, oh but it was probably like three years ago or something. So this is actually so old it's still using Thunderbolt 2, with an adapter, we can get an additional fast nine terabytes of storage into our Mac mini. So we plug this into our second Thunderbolt port. It should light up, yes it is, I'll give it a little less slack on that cable. So something I forgot to mention earlier is that this Mac mini does have not only the Core i7 inside, but also importantly has the 10 gig ethernet update. So we've actually switched a lot of our editing PCs over to these Mac minis, and one of the main reason we can do that is because we're working on a 10 gig server, so this is actually one of the main reasons why we have such a small and tiny computer running things, 'cause it's way cheaper than stuff like iMac Pros, or building some giant 10 gig box, when we can use this guy. So we're looking pretty good at this point, but we still have a couple of Thunderbolt ports left, which means that it's time to upgrade to actually one of my personal favorite accessories, the CalDigit Thunderbolt dock. So what I like about this guy is that with a single Thunderbolt cable, I can do stuff like, for example if I had a Thunderbolt powered laptop, power it with up to 85 watts of USB power delivery, there's a ton of USB-A ports, you've got SD cards, you've got a Thunderbolt out, so you go to say a 5K display like this, and then you also get ethernet built in, you've got DisplayPort. This thing is absolutely killer if you have a Thunderbolt enabled computer. So this is actually looking pretty good. But the problem is is that we're still running on an internal GPU, right? I mean nothing against Intel UHD 620 graphics, but well that uh, not gonna quite cut it. So what if we take advantage of our last Thunderbolt port, to install a GPU? That is where this comes in. So this is the GIGABYTE RX 580 Gaming Box. So we've actually done a couple of videos on this. So one of the nice things is is that especially when you're dealing with Macs, this is one of the best GPUs to go with. But on top of that, it should give us a lot of extra power with our Mac mini. If I can find my cable here. Oh, what? Well that was easy. So now we have our 5K display running off of our RX 580. Yeah, so go to about this Mac, we now see that we have the Radeon RX 580 showing up. This, this is looking promising. I like how our resolution is so high. If we try to scale it to 4K, it gives us a low resolution warning (laughing). So, we fire up Unigine here. Okay we're getting 33, 34 fps, that's certainly nothing crazy, when you consider that typically you're running Unigine on a PC, it's a full gaming setup. Right now we're running on a Mac mini with an external Thunderbolt GPU. And that's actually one of my favorite parts about something like the Mac mini. With all these Thunderbolt ports, you actually do have a lot of potential to expand. But what if, what if my friends, we took expansion to a whole new level? - Our friends at GIGABYTE, are fans of the Ultimate Series. - Okay. - And they thought it'd be really cool, (laughing) if we plugged in four of these external GPUs. - So if you look at the back of these gaming boxes, they do have three USB-A ports as well as one quick charge. But okay, let's cut this in for a second, and see if we can even get them to spin. 'Cause we've got one 580, it works fine, it's pegged. So let's see if we can plug in a couple more, if it actually is able to see that or not. Oh, GPU spinning, spinning, spinning. All the lights are on. - [Matt] That is a massively good sign. - Okay, yes, they're all flashing green. Now if we get our monitor up, oh well that-- - That's interesting, but... - Okay well we're just gonna ignore that. - I'll take that. - Uh, yes, okay, monitor leave me alone. I mean they're all spinning uh... What it shows up when, ay, look at that, four RX 580s, right out of the box. - Perfect, yes. - Dude. - Nothing really takes advantage of four GPUs. Even though they all come up. - Shh. - Although, We found one program that did. - Okay, so it sees our Core i7 8700. It sees the 630 inside. But we also see RX 580 one, RX 580 two, number three as well as number four. So this is a bad idea. I'll just be real with you right now. This is a bad idea because the thing is, yes, you do have all of these Thunderbolt ports, but they're all sharing bandwidth. So inside the Mac mini, I believe there's two Thunderbolt controllers, right? - Yeah, it's one and three, two and four. - Yes. - So, in no scenario is all four of these getting the proper amount of bandwidth. - I will say while this benchmark is running, the GPUs are getting a little toasty, I'd say. The Mac mini itself is also very warm. - Yeah, so. - So maybe don't do this. This is a little danger... - On what? - Oh (laughing). - What we got here... - that's for laptops. - Good old laptop charger. - Chiller. - Yes, chiller. - Laptop chiller. - What'd I say? - Charger. - Charger, yeah. That's the cable. So one of the biggest problems with this is not the cost associated with it, the ridiculousness, the bandwidth. It's that in order for external GPUs to work, they need super short cables, and this is pretty much as far away as we can get. - 54,201, that, I don't know, uh... - For record... - Yeah, can you, what's like a 2080 gonna get you? I bet this is not as good as a 2080. - I don't know what a 2080, I can tell you what it did without the GPU. - Okay, sure. - With the internal GPU only, it was 1,982, whatever unit of measurement this is. - So it's 25 times better by adding four GPUs? - Yes. - So in conclusion, should you build the ultimate Mac mini? Probably not. But I will say one thing, this Mac mini is a lot better than a lot of people give it credit for. And if you go maybe a little bit less extreme than what we did here, you can actually get some pretty solid performance. - Yeah, I was looking way weird. (beeping) (laughing)",
    "transcript_keywords": [
        "Mac mini",
        "Mac",
        "Thunderbolt",
        "Ultimate Mac mini",
        "Mac minis",
        "mini",
        "Mac mini ultimate",
        "Ultimate Mac",
        "Thunderbolt ports",
        "GPU",
        "GPUs",
        "previous Mac minis",
        "external Thunderbolt GPU",
        "Thunderbolt GPU",
        "yeah",
        "Austin",
        "pretty",
        "running",
        "lot",
        "ports"
    ],
    "transcript_entity_values": [
        "34",
        "UHD 620",
        "5",
        "The Creative Input Dial",
        "three",
        "iMac Pros",
        "2080",
        "GIGABYTE",
        "2018",
        "USB-C",
        "33",
        "10",
        "RAM",
        "Gaming Box",
        "eight",
        "Core",
        "USB",
        "Austin",
        "RX",
        "25",
        "34 inch",
        "two",
        "Thunderbolt",
        "the Pegasus R4",
        "Apple",
        "Matt",
        "54,201",
        "Thunderbolt 3",
        "four",
        "LG",
        "Thunderbolt",
        "512",
        "CalDigit Thunderbolt",
        "580s",
        "about 200",
        "4",
        "Thunderbolt GPU",
        "Core i7 8700",
        "up to 85 watts",
        "one",
        "580",
        "the Surface Dial",
        "three years ago",
        "second",
        "Unigine",
        "32",
        "1,982",
        "CES",
        "RX 580 one",
        "630",
        "a ton",
        "2160",
        "Intel",
        "DisplayPort",
        "Mac",
        "CPU",
        "SD",
        "Macs",
        "Thunderbolt",
        "Mac",
        "Ultimate Mac",
        "1,000",
        "2080",
        "GPU",
        "today",
        "The Logitech Craft",
        "Radeon",
        "the Ultimate Series",
        "Thunderbolt 2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "EVENT",
        "PRODUCT"
    ],
    "vector": [
        0.05399788171052933,
        -0.02830306999385357,
        0.08441150188446045,
        0.0033625406213104725,
        0.07137604057788849,
        0.005406123120337725,
        -0.03615463525056839,
        0.006435349117964506,
        -0.047578759491443634,
        0.05411838740110397,
        0.04309064894914627,
        0.03186160698533058,
        -0.0046692960895597935,
        -0.050380926579236984,
        -0.019338412210345268,
        0.028180429711937904,
        0.09872539341449738,
        -0.05703526735305786,
        -0.020008521154522896,
        0.05551844835281372,
        -0.03718124330043793,
        -0.05046749487519264,
        -0.054735053330659866,
        0.021968591958284378,
        -0.05852767825126648,
        0.09271062165498734,
        0.017323704436421394,
        -0.01573232375085354,
        -0.04595759138464928,
        -0.062160708010196686,
        -0.03574885055422783,
        0.008002007380127907,
        0.005250365938991308,
        -0.009601032361388206,
        0.03436756506562233,
        -0.02658574841916561,
        0.07767604291439056,
        -0.09552962332963943,
        -0.0786885991692543,
        -0.12981121242046356,
        -0.07092570513486862,
        -0.05267230048775673,
        0.06519746780395508,
        0.08927532285451889,
        0.02848701924085617,
        -0.053956884890794754,
        0.05432438850402832,
        -0.08124516904354095,
        0.05394474044442177,
        -0.01998872682452202,
        0.020693115890026093,
        -0.07675601541996002,
        0.05006280913949013,
        0.035657819360494614,
        0.017449261620640755,
        0.0501047782599926,
        -0.07449604570865631,
        -0.10377538204193115,
        0.1238040179014206,
        0.01718733087182045,
        0.061864085495471954,
        -0.08479852974414825,
        0.023937886580824852,
        0.039154328405857086,
        -0.026344100013375282,
        -0.058141808956861496,
        0.011575853452086449,
        -0.021326035261154175,
        0.033245716243982315,
        -0.010293448343873024,
        0.06190630793571472,
        -0.057272762060165405,
        0.0070095369592309,
        0.06638830900192261,
        0.04637845233082771,
        -0.027329612523317337,
        0.08103636652231216,
        -0.10303950309753418,
        0.03968330845236778,
        0.06781124323606491,
        -0.10934437811374664,
        -0.010987091809511185,
        -0.06557478755712509,
        0.0003665757249109447,
        -0.0137407211586833,
        -0.0497979074716568,
        0.03132694959640503,
        0.008983009494841099,
        -0.03809347003698349,
        -0.02215886302292347,
        0.0023567266762256622,
        0.08847613632678986,
        0.014645727351307869,
        -0.017186366021633148,
        -0.0015099206939339638,
        -0.07805683463811874,
        0.01169570442289114,
        -0.04589135944843292,
        -0.04298809543251991,
        0.05889245867729187,
        0.011806401424109936,
        0.05367399752140045,
        0.12242953479290009,
        -0.030109861865639687,
        0.050918471068143845,
        -0.09187648445367813,
        0.0005757776089012623,
        0.006223084405064583,
        -0.021833511069417,
        0.0025046924129128456,
        0.025289880111813545,
        -0.014793005771934986,
        -0.1152612492442131,
        0.07836655527353287,
        0.07150071859359741,
        -0.017620839178562164,
        -0.004985024221241474,
        -0.025131167843937874,
        0.057392269372940063,
        0.016057176515460014,
        0.060279376804828644,
        0.02852529287338257,
        0.012548509053885937,
        -0.010732091031968594,
        0.039503760635852814,
        0.02712438441812992,
        -0.0821111649274826,
        8.682652371130544e-33,
        -0.016338948160409927,
        0.05424630269408226,
        -0.0567614771425724,
        -0.04424425959587097,
        0.04644614830613136,
        -0.012815478257834911,
        0.04675126448273659,
        0.010923330672085285,
        -0.04521822929382324,
        0.03377767279744148,
        -0.06415149569511414,
        0.010694792494177818,
        -0.08372848480939865,
        0.053004372864961624,
        0.1170690730214119,
        -0.09644269943237305,
        -0.02064546011388302,
        0.029254799708724022,
        -0.000847542192786932,
        0.025685178115963936,
        0.024240342900156975,
        0.01530679315328598,
        0.008646667003631592,
        -0.09356077760457993,
        -0.0030914798844605684,
        -0.01791645959019661,
        0.08997885137796402,
        -0.05961444601416588,
        0.03513500094413757,
        0.039471372961997986,
        -0.11149952560663223,
        -0.014626177959144115,
        0.027483196929097176,
        -0.04810021072626114,
        -0.01866307109594345,
        -0.048471733927726746,
        0.0022303781006485224,
        -0.0664496198296547,
        -0.008266806602478027,
        0.024364687502384186,
        -0.06518352031707764,
        0.023242540657520294,
        -0.052341751754283905,
        -0.058903519064188004,
        0.019242700189352036,
        0.0282998476177454,
        0.06756705790758133,
        0.041271865367889404,
        0.04533960670232773,
        -0.03349187597632408,
        -0.020414484664797783,
        -0.039493709802627563,
        0.07239373028278351,
        0.003108882810920477,
        -0.00800808984786272,
        0.0029640106949955225,
        -0.01566285826265812,
        -0.018493779003620148,
        0.07859056442975998,
        0.051828816533088684,
        -0.012028004974126816,
        0.004534988198429346,
        0.019874868914484978,
        0.010865253396332264,
        -0.0074432529509067535,
        0.0643741562962532,
        0.09971911460161209,
        0.02761821821331978,
        -0.05187799781560898,
        0.02555570751428604,
        -0.06985669583082199,
        -0.006299610249698162,
        0.08978350460529327,
        -0.08519156277179718,
        0.05447008088231087,
        0.028391601517796516,
        -0.052515339106321335,
        0.002792804501950741,
        -0.07157822698354721,
        0.018150247633457184,
        0.04724150151014328,
        0.0628715232014656,
        -0.00479750894010067,
        0.08936818689107895,
        -0.032282065600156784,
        0.06737394630908966,
        0.05008663237094879,
        0.07872480899095535,
        -0.027742842212319374,
        0.0496954582631588,
        -0.005064910743385553,
        -0.032970692962408066,
        0.012655177153646946,
        -0.04842175170779228,
        -0.06765738874673843,
        -8.019441397132486e-33,
        0.008646360598504543,
        -0.11365190148353577,
        -0.003308685263618827,
        0.06386290490627289,
        -0.0341578833758831,
        0.0062224529683589935,
        0.015698514878749847,
        0.020343586802482605,
        -0.026533568277955055,
        -0.06076253205537796,
        0.014572317712008953,
        0.0016156528145074844,
        -0.01448813360184431,
        -0.0890478864312172,
        -0.041894812136888504,
        0.05310766026377678,
        -0.04381723329424858,
        -0.05036725103855133,
        0.06194984167814255,
        -0.07509036362171173,
        0.042129866778850555,
        0.020924363285303116,
        -0.07285469025373459,
        -0.027658775448799133,
        0.011472980491816998,
        -0.004639379680156708,
        0.084501713514328,
        0.004089678172022104,
        -0.024592705070972443,
        -0.03994124382734299,
        -0.07062626630067825,
        0.035740047693252563,
        0.03152582421898842,
        0.022804902866482735,
        0.020180847495794296,
        0.03552905097603798,
        -0.04004722088575363,
        0.03631281852722168,
        0.03328877314925194,
        0.002000880893319845,
        0.037886843085289,
        0.034954365342855453,
        0.015482707880437374,
        -0.015811866149306297,
        0.03558998927474022,
        -0.01852046325802803,
        -0.02545681782066822,
        0.014906673692166805,
        0.009805307723581791,
        -0.004344199784100056,
        -0.014996703714132309,
        -0.07666071504354477,
        -0.0338861420750618,
        -0.0312083400785923,
        -0.02492223121225834,
        -0.08621449023485184,
        -0.001065775053575635,
        0.03552157059311867,
        0.06307100504636765,
        0.0080510713160038,
        -0.04751650616526604,
        -0.06791038811206818,
        0.05287986621260643,
        -0.056734535843133926,
        0.0025083660148084164,
        -0.024477403610944748,
        0.00815635547041893,
        -0.006139859557151794,
        -0.0441407784819603,
        0.03134671226143837,
        0.05762450769543648,
        0.015794700011610985,
        0.03371337428689003,
        -0.08347417414188385,
        0.07351778447628021,
        0.05589866638183594,
        0.06142130866646767,
        -0.03821679577231407,
        0.018635671585798264,
        -0.002909631235525012,
        -0.0029661296866834164,
        0.09056609869003296,
        0.051845792680978775,
        0.020041100680828094,
        0.06520267575979233,
        0.008609293960034847,
        -0.019241200760006905,
        0.07953299582004547,
        -0.003382258815690875,
        0.026891717687249184,
        -0.09060735255479813,
        0.0054511334747076035,
        -0.025284135714173317,
        -0.05784719064831734,
        -0.07777569442987442,
        -5.464560359769166e-08,
        -0.011850898154079914,
        0.005011647939682007,
        -0.04981466010212898,
        0.06602724641561508,
        0.004582806024700403,
        -0.010259447619318962,
        -0.0004135702911298722,
        -0.0017653029644861817,
        0.08575312048196793,
        0.04946078360080719,
        0.0965433418750763,
        -0.07788924872875214,
        -0.04593705013394356,
        -0.003629012033343315,
        -0.002714525442570448,
        0.09110860526561737,
        -0.04480047523975372,
        0.04558578133583069,
        -0.006233299151062965,
        -0.07163774967193604,
        -0.045287955552339554,
        0.071989506483078,
        0.04056859388947487,
        0.015181788243353367,
        -0.014515483751893044,
        -0.0158205758780241,
        -0.013646193780004978,
        0.07359776645898819,
        0.0034862919710576534,
        -0.06337055563926697,
        -0.08715488761663437,
        0.011843792162835598,
        -0.08108586817979813,
        0.021920764818787575,
        -0.00494603393599391,
        -0.08088000863790512,
        -0.1019367203116417,
        0.10522790998220444,
        0.00825415551662445,
        0.019326068460941315,
        -0.044957682490348816,
        -0.14594566822052002,
        -0.08912350982427597,
        -0.06129723787307739,
        -0.03766908496618271,
        -0.004577914252877235,
        -0.10602091997861862,
        -0.021361587569117546,
        -0.07299558818340302,
        0.052880510687828064,
        0.04141055792570114,
        -0.045330215245485306,
        0.027595173567533493,
        0.04706260561943054,
        0.042018912732601166,
        0.045762624591588974,
        0.04500659182667732,
        -0.06820964813232422,
        -0.016965623944997787,
        0.020313333719968796,
        0.06506665050983429,
        -0.02166750840842724,
        -0.013401837088167667,
        0.10848308354616165
    ]
}